{
  "messages": [
    {
      "original": "🚀\nКАБи на Донеччину, Дніпропетровщину!",
      "timestamp": "2025-11-07T18:56:51.089115Z"
    },
    {
      "original": "🚀\nКАБи на схід Харківщини!",
      "timestamp": "2025-11-07T18:56:51.089131Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-07T18:56:51.089137Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу!",
      "timestamp": "2025-11-07T18:56:51.089142Z"
    },
    {
      "original": "🛵\n БпЛА з Брянської обл., рф \n➡️\n на північ Сумщини!",
      "timestamp": "2025-11-07T18:56:51.089148Z"
    },
    {
      "original": "🛵\n БпЛА з Брянської обл., рф \n➡️\n на північ Чернігівщини!",
      "timestamp": "2025-11-07T18:56:51.089153Z"
    },
    {
      "original": "🛵\n Група БпЛА на межі Харківщини та Дніпропетровщини \n➡️\n курсом на Павлоград.\n🛵\n Група БпЛА на межі Дніпропетровської та Запорізької областей \n➡️\n курсом на Тернувате.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Холми.",
      "timestamp": "2025-11-07T18:56:51.089165Z"
    },
    {
      "original": "⚠\nУвага!\n🚀\n Чернігівська та Полтавська областях - ракетна небезпека!",
      "timestamp": "2025-11-07T18:56:51.089171Z"
    },
    {
      "original": "🛵\n БпЛА з Брянської обл., рф \n➡️\n на північ Сумщини та Чернігівщини!",
      "timestamp": "2025-11-07T18:56:51.089177Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n на північ Запорізької області.",
      "timestamp": "2025-11-07T18:56:51.089184Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чорного моря \n➡️\n рухаються у напрямку Одеси!\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Холми. Новгород-Сіверський.\n🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на Шостку.\n🛵\n БпЛА на півночі Запорізької області \n➡️\n курсом на Новомиколаївку, Гуляйполе.",
      "timestamp": "2025-11-07T18:56:51.089199Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Харківщини \n➡️\n рухається в південному напрямку.",
      "timestamp": "2025-11-07T18:56:51.089205Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чорного моря \n➡️\n курсом на Одещину, Миколаївщину.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Холми.\n🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на Вороніж.\n🛵\n БпЛА у центрі Сумщини \n➡️\n курсом на Путивль.\n🛵\n БпЛА на заході Сумщини \n➡️\n курсом на Полтавщину.\n🛵\n БпЛА на сході Сумщини \n➡️\n курсом на південь.\n🛵\n БпЛА на півночі та в центрі Харківщини \n➡️\n курсом на Харків, Богодухів, Бірки, Чугуїв.\n🛵\n БпЛА на півночі Запорізької області \n➡️\n курсом на Малокатеринівку, Гуляйполе.",
      "timestamp": "2025-11-07T18:56:51.089229Z"
    },
    {
      "original": "🛵\n БпЛА на Чорноморське!",
      "timestamp": "2025-11-07T18:56:51.089234Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині в районі Красносілки \n➡️\n курсом на Одесу!\n🛸\n🛵\n БпЛА на сході Сумщини \n➡️\n курсом на південь.\n🛸\n🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на південь.\n🛵\n Група БпЛА на півночі Чорного моря \n➡️\n курсом на Одещину, Миколаївщину.",
      "timestamp": "2025-11-07T18:56:51.089249Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-07T18:56:51.089257Z"
    },
    {
      "original": "🛵\n БпЛА з півночі \n➡️\n курсом на Харків!",
      "timestamp": "2025-11-07T18:56:51.089263Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф \n➡️\n на південь Сумщини, північ Харківщини!",
      "timestamp": "2025-11-07T18:56:51.089268Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-07T18:56:51.089276Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-11-07T18:56:51.089280Z"
    },
    {
      "original": "3 Tu-160 strategic bombers are airborne from Engels-2 Airbase, Saratov Oblast, redeploying to Ukrainka Airbase, Amur Oblast. They will be equipped with Kh-101 cruise missiles and should return to Engels-2 some time next week. \nCurrently, there is the lowest possible number of strategic bombers near Ukraine, with just 1 Tu-160 and 1 Tu-95MS, both currently being used for training purposes.",
      "timestamp": "2025-11-07T18:56:51.708649Z"
    },
    {
      "original": "Also, there are still signs pointing towards a large-scale, combined missile and drone attack taking place soon. Nothing will happen today, but there is an increased threat for this weekend.",
      "timestamp": "2025-11-07T18:56:51.708662Z"
    },
    {
      "original": "Also, there are still signs pointing towards a large-scale, combined missile and drone attack taking place soon. Nothing will happen today, but there is an increased threat for this weekend.",
      "timestamp": "2025-11-07T18:56:51.708666Z"
    },
    {
      "original": "* forgot to mention, any attack would not include Kh-101 cruise missiles launched from strategic bombers.",
      "timestamp": "2025-11-07T18:56:51.708669Z"
    },
    {
      "original": "Dude's just accepted the \"X city holds guy\" title at this point.",
      "timestamp": "2025-11-07T18:56:51.708672Z"
    },
    {
      "original": "Dude's just accepted the \"X city holds guy\" title at this point.",
      "timestamp": "2025-11-07T18:56:51.708675Z"
    },
    {
      "original": "You know what, maybe WarMonitor has some intel we don't have. He always seems to make these posts right before the city falls. \nSomeone inform polymarket betters ASAP",
      "timestamp": "2025-11-07T18:56:51.708679Z"
    },
    {
      "original": "Last night, multiple Ukrainian HIMARS GMLRS struck a large Russian ammunition depot near Donetsk City. As a result, a massive explosion occurred due to secondary detonations. A large fire broke out afterwards.",
      "timestamp": "2025-11-07T18:56:51.708682Z"
    },
    {
      "original": "It turns out that the target of the Ukrainian HIMARS attack on Donetsk yesterday was a complex of storage warehouses for Russian Geran-2 drones at Donetsk International Airport. FP-2 drones were also used, which are seen striking the warehouses in this video. \nAs many as 1,200 drones were stored here, which resulted in massive secondary detonations. The number of destroyed drones is unknown.",
      "timestamp": "2025-11-07T18:56:51.708687Z"
    },
    {
      "original": "Russian forces have captured the village of Uspenivka, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~1,420.\nTotal land area: ~5.42 km².",
      "timestamp": "2025-11-07T18:56:51.708696Z"
    },
    {
      "original": "Russian forces have captured the village of Solodke, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~139.\nTotal land area: ~1.05 km².",
      "timestamp": "2025-11-07T18:56:51.708700Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces have continued their offensive on Vovchansk, making new progress in five different areas.\nIn the west, increased Ukrainian resistance has slowed Russian progress in the forests to a crawl. Russian forces are gradually advancing through the forests, seizing positions one after another, and have managed to enter the outskirts of Prylipka from the east. They also made additional incremental advances northwest of the village of Lyman, while other forces were able to enter the residential part of Synelnykove.\nTo the east, Russian forces continued pushing through southern Vovchansk and have advanced from the three-story buildings to the small industrial zone on the southern edge of the city, capturing most of it. They also continued pushing east through the low-rise residential areas, where they reached the highway and destroyed bridge over the Vovcha River, and advanced beyond the highway into the denser residential areas of southern Vovchansk.\nAs a result of these Russian advances, the remaining Ukrainian units stationed in northern Vovchansk withdrew behind the river to prevent being cut off from the rear, officially ending the 18-month-long battles for this part of the city. The withdrawals took place from two small salients of flattened houses in the southeast and east. \nFurther east, over the past ten days Russian forces have been slowly pushing through the forests east of Tykhe, expanding a buffer zone around the newly recaptured village. They advanced further through the large forest in the north and captured treeline positions to the south. They also established control over some outlying houses of Vovchanski Khutory on the northern bank of the Vovcha River, as well as a nearby forest.\n+ ~5.97 km² in favour of Russia.",
      "timestamp": "2025-11-07T18:56:51.708708Z"
    },
    {
      "original": "As everyone focuses on the final battles taking place for Pokrovsk, think I should highlight the sheer intensity of battles ongoing in Rodynske right now, just north of Pokrovsk.\nUkrainian forces who infiltrated the city around six days ago have entrenched and consolidated in a number of houses and high-rise buildings, and the Russians are doing everything to push them back. Both sides are burning each other's positions to the ground and reducing buildings to rubble in order to win this battle, which is by far the most intense fighting for Rodynske so far.\nDespite some earlier Russian progress against this fortified area, Ukrainian forces have since managed to push back, with some positions changing hands multiple times. Russian FAB glide-bombs are striking Ukrainian forward deployment points west of the city, while Ukrainian FPV drones, artillery, and glide-bombs continue to cover Russian positions within Rodynske. \nThe nature of this fighting makes me suspect elite Ukrainian unit(s) are involved in this battle, but this is just a gut feeling for me as there is no evidence to back this up yet. \nIt seems Ukraine has tried to break through Russian lines here and force them to withdraw from their pincer northwest of Myrnohrad in order to relieve the encircled Ukrainian units, but have since been bogged down due to fierce Russian resistance, while the Russians are taking no chances and are trying to expel them from the city once again.",
      "timestamp": "2025-11-07T18:56:51.708714Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to advance and have made substantial progress in the direction of the Verkhnya Dvurichkova River.\nIn the southeast, after capturing the rest of Kamyanka, Russian forces expanded their zone of control west and northwest of the settlement, capturing new positions in the forests and nearby treelines. They also established control over a new forest further southwest.\nTo the north, the Russians continued pushing south from the international border. They reached the gulley north of Dvorichanske, capturing the forests and treelines there, while other assault groups began bypassing the village from the west, moving down the forested gulley and the treelines west of it. \nTo the northwest, Russian forces advanced on a wide front from Ambarne to the Odradne area. They captured new treeline positions on the tactical heights southeast of Ambarne in the direction of the Verkhnya Dvurichkova River, and pushed further south down the gulley towards Obukhivka. \n+ ~19.21 km² in favour of Russia.",
      "timestamp": "2025-11-07T18:56:51.708721Z"
    },
    {
      "original": "Russian forces have captured the village of Lysivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~799.\nTotal land area: ~2.71 km².\nThe battles for this village lasted for approximately 13 months.",
      "timestamp": "2025-11-07T18:56:51.708726Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, pushing in different areas outside Kupyansk.\nIn the north, Russian forces recaptured positions which were previously in the grey zone after a group of Ukrainian soldiers landed in a forest. They also pushed the Ukrainians out of positions in the forests east of Kindrashivka. Meanwhile, Ukrainian forces attempted to infiltrate Kindrashivka from the west, where a grey zone had now formed due to a lack of Russian consolidation there. \nTo the south, over the last few weeks, Ukrainian forces managed to re-establish control over positions in the forested areas northwest and north of Moskovka. They have since advanced down the forested gulley northeast of Moskovka, and attempted to enter northern Kupyansk from here. They also continued attempts at capturing positions in Radkivka, which is now entirely in the grey zone. Fighting is ongoing, with no clear consolidation yet.\nIn the south, at some point recently, the Ukrainians cleared the forests south of Sobolivka of the remaining Russian DRGs, fully securing the areas north of the highway. Sobolivka itself remains entirely in the grey zone, with both sides entering and clashing in the village. \n+ ~3.75 km² in favour of Ukraine.\n+ ~1.29 km² in favour of Russia.",
      "timestamp": "2025-11-07T18:56:51.708734Z"
    },
    {
      "original": "This is what seems to be the Russian plan in Zaporozhye oblast - to continue cascading the heavily entrenched Ukrainians by outmaneuvering them from the northeast time and time again, from Gulyaypole to the next important supply hub of Omelnyk, supported by the seizure of Pokrovskoye, before a final push to Orekhov.",
      "timestamp": "2025-11-07T18:56:51.708738Z"
    },
    {
      "original": "This is what seems to be the Russian plan in Zaporozhye oblast - to continue cascading the heavily entrenched Ukrainians by outmaneuvering them from the northeast time and time again, from Gulyaypole to the next important supply hub of Omelnyk, supported by…",
      "timestamp": "2025-11-07T18:56:51.708744Z"
    },
    {
      "original": "All the defences here were built east to west. Some new ones are being constructed facing north to south, but I'm not confident they will hold for long due to manpower shortages.",
      "timestamp": "2025-11-07T18:56:51.708747Z"
    },
    {
      "original": "In the Borova direction, Russian forces launched a series of attacks towards the Oskil River and have made important progress.\nIn the south, Russian advanced back through eastern Borivska Andriivka and have recaptured the centre of the village, as well as the treeline to the southeast. They also advanced along the treelines on the tactical heights to the north, while other assault groups began a push along the heights towards Novoplatonivka. \nTo the north, Russian forces advanced further along the tactical heights southeast of Nova Kruhlyakivka, capturing new trench strongholds and positions in the adjacent treelines. They also advanced along the treelines north of the reservoirs towards Nova Kruhlyakivka from the east. \n+ ~8.70 km² in favour of Russia.",
      "timestamp": "2025-11-07T18:56:51.708753Z"
    },
    {
      "original": "On the northwestern flank of Lyman and in the Borova direction, both Russian and Ukrainian forces have advanced, with Russian forces making new progress in several different areas. \nIn the north, the Russians began a new series of attacks aimed at fully securing the eastern bank of the Nitrius River. After withdrawing from the centre and part of eastern Ridkodub, they began attacking west again, capturing the eastern houses and the agricultural buildings, and reaching the centre of the village again. Russian soldiers have not secured the local school due to its proneness to Ukrainian glide-bomb strikes, leaving it in the grey zone. Additionally, they were able to recapture the northeastern part of Karpivka, as well as the surrounding positions in the forest plantations.\nTo the southwest, Russian forces continued their attacks through the Sviati Hory National Park. They advanced further south to the railway line, capturing two train stations and reaching the northwestern outskirts of Yarova. They also marginally advanced to the west towards Sosnove. \nMeanwhile, Ukrainian forces consolidated in the southeastern part of Yarova and pushed the Russians out of the forests to the northeast. In turn, Russian forces have begun attacking towards northern Yarova from the forests southwest of Novoselivka.\nTo the east, after being pushed out for a short period of time, Russian forces re-secured a foothold in the northern part of Stavky and began attacks to the centre of the village. They were able to establish control over the local school and surrounding residential streets and are now pushing towards the southern outskirts.\n+ ~9.12 km² in favour of Russia.\n+ ~3.44 km² in favour of Ukraine.",
      "timestamp": "2025-11-07T18:56:51.708772Z"
    },
    {
      "original": "⚡️\n🇬🇧\n🇸🇾\nReuters:\n Britain has officially removed sanctions on Syrian President Ahmed al-Sharaa and Interior Minister Anas Khattab, following a parallel decision by the UN Security Council.\nThese sanctions were originally imposed in 2014, and included travel bans, asset freezes and arms embargoes linked to ties with al-Qaeda and ISIS. The UN cited a lack of current connections as a reason for lifting the measures.\nThe decision signals a broader shift in Western policy toward Syria, prioritising reconstruction, regional stability and reintegration of Damascus into international frameworks.\n@wfwitness",
      "timestamp": "2025-11-07T18:56:51.708782Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nWhile Myrnohrad is still yet to be physically cut off, movement in and out of the city is not currently happening due to Russian fire control and the activity of DRG units. Russian forces are making progress elsewhere, though.\nThe main news comes from northeastern Pokrovsk, where after some Ukrainian withdrawals took place, Russian forces were able to physically encircle some Ukrainian formations in the high-rise part of the Dinas District. They captured the small industrial zone on the edge of the city and secured the first street in the village of Rivne. Clearing operations continue in Dinas, with Russian forces capturing several more high-rise buildings.\nIn eastern Pokrovsk, the Russians captured the last residential areas there and advanced to the neighbouring warehouses and forested areas. \nAt the bottom of the Myrnohrad pocket, Russian forces finally established full control over Lysivka after around 13 months of battles for the village. They also captured new positions in the treelines and forests to the northwest and began pushing further east, bypassing Sukhyi Yar from the north. Fighting continues in the centre of Sukhyi Yar.\nIn northeastern Myrnohrad, Russian forces captured several more high-rise buildings and advanced further in the low-rise residential area. They are also attempting to reach the southwestern part of the high-rise district, bombing Ukrainian positions ahead of them with FAB glide-bombs.\nIn the Myrnohrad pocket bottleneck, Russian DRGs continue to operate in the grey zone. No consolidation has occurred here yet. \nIn Rodynske, extremely heavy fighting continues. Both sides are attempting to advance, with positions constantly changing hands. Massive amounts of fire power are being concentrated on this area as Ukraine tries to break through to the rear of the northern Russian pincer, while Russia tries to push the Ukrainians back out of Rodynske. \nIn northern Pokrovsk, Russian forces continue their clearing operations and are fighting for the remaining grey zone. Ukrainian assault groups are complicating their consolidation efforts and preventing them from securing the whole city. \nIn the Udachne area, the Russians recaptured positions along the road to the eastern part of the Pokrovsk Coal Mine.",
      "timestamp": "2025-11-07T18:56:51.708793Z"
    },
    {
      "original": "Update from the Pokrovsk direction:  While Myrnohrad is still yet to be physically cut off, movement in and out of the city is not currently happening due to Russian fire control and the activity of DRG units. Russian forces are making progress elsewhere,…",
      "timestamp": "2025-11-07T18:56:51.708796Z"
    },
    {
      "original": "Here's a closer up view of the situation in northeastern Pokrovsk, with the encircled Ukrainian units in the Dinas District and the Myrnohrad Pocket.",
      "timestamp": "2025-11-07T18:56:51.708799Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From November 6, 2025\nOn November 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-07T18:56:52.344434Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From November 6, 2025\nOn November 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-07T18:56:52.344450Z"
    },
    {
      "original": "U.S. To Take Over Air Base Just Few Kilometers Away From Syrian Presidential Palace  \nThe United States is preparing to establish military presence at an air base in the Syrian capital, Damascus, Reuters reported on November 6.\nThe news agency spoke to six sources familiar with preparations at the base, including two Western officials and a Syrian defense official, who confirm the U.S. is planning to use the air base to help monitor a potential security agreement between Israel and Syria.\nWhile Reuters didn’t name the air base, it quotes one Syrian defense official as saying that the U.S. had flown to the base in military C-130 transport aircraft to make sure the runway was usable.\nThis piece of information revealed that the facility is none other than Mezzeh Air Base located right to the southwest of Damascus, just under four kilometers away from the People's Palace.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344460Z"
    },
    {
      "original": "Russian Army Captures Uspenovka As Ukrainian Collapse Continues In Zaporizhia (Videos)\nOn November 7, the Russian military captured Uspenovka as Ukrainian defenses continued to collapse between Zaporizhia And Dnepropetrovsk.\nThe key settlement, which is located along the Yanchur River In Zaporizhia, was captured by the Vostok [East] Group of Forces, according to the Russian Ministry of Defense, which said in a statement that the attack the 127th Motorized Rifle Division of the 5th Guards Combined Arms Army led operations there.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344468Z"
    },
    {
      "original": "Russian Army Captures Uspenovka As Ukrainian Collapse Continues In Zaporizhia (Videos)\nOn November 7, the Russian military captured Uspenovka as Ukrainian defenses continued to collapse between Zaporizhia And Dnepropetrovsk.\nThe key settlement, which is located along the Yanchur River In Zaporizhia, was captured by the Vostok [East] Group of Forces, according to the Russian Ministry of Defense, which said in a statement that the attack the 127th Motorized Rifle Division of the 5th Guards Combined Arms Army led operations there.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344476Z"
    },
    {
      "original": "With Defeat Nearing In Pokrovsk, Ukrainian Troops Are Surrendering Or Attempting To Flee (Videos)\nOn November 7, the Russian military expanded its control in Pokrovsk in Donetsk as Ukrainian troops began making desperate attempts to flee from the key city and nearby Myrnohrad in small groups.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army, a part of the Tsentr [Center] Group of Forces, made gains in the eastern part of the Tsentralny neighborhood and on the territory of the industrial area to the west. It added that Ukrainian troops were cleared from Gnatovka and Rog, with 45 buildings captured in the last 24 hours.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344483Z"
    },
    {
      "original": "With Defeat Nearing In Pokrovsk, Ukrainian Troops Are Surrendering Or Attempting To Flee (Videos)\nOn November 7, the Russian military expanded its control in Pokrovsk in Donetsk as Ukrainian troops began making desperate attempts to flee from the key city and nearby Myrnohrad in small groups.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army, a part of the Tsentr [Center] Group of Forces, made gains in the eastern part of the Tsentralny neighborhood and on the territory of the industrial area to the west. It added that Ukrainian troops were cleared from Gnatovka and Rog, with 45 buildings captured in the last 24 hours.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344491Z"
    },
    {
      "original": "Europe Seeks Military Schengen In Preparation For War Against Russia\nBy creating a military mobility agreement similar to Schengen to facilitate the faster transfer of troops and equipment across Europe, Western countries are preparing for war against Russia. Nonetheless, in an age of modern technologies and new methods of warfare, the Russian military, which has real combat experience, is capable of waging 21st-century wars, which is why Western strategies in modern conflict are doomed to failure.\nThe European Commission, in cooperation with European Union member states and NATO, is developing a comprehensive plan that envisages the use of civilian transport — from freight trains to ferries — for the rapid transfer of military equipment and units in the event of a direct armed conflict with Russia, reported the Financial Times, citing sources familiar with the preparations.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344499Z"
    },
    {
      "original": "Iran Came Close To Killing Israeli Ambassador In Mexico, Used Venezuela As Base \nThe United States and Israel foiled an Iranian plot to kill the latter's ambassador to Mexico, Einat Kranz-Neiger, Axios reported on November 7.\nOfficials from the two countries told the news website that Mexican security services foiled the plot earlier this year. They claim that the Quds Force, the foreign operation branch of the Islamic Revolutionary Guard Corps (IRGC), began planning the assassination last year.\nAccording to Axios, the plot was led by an operative from the Quds Force’s Unit 11000, who spent years at Iran’s embassy in Venezuela recruiting Iranian agents from across Latin America.\nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344508Z"
    },
    {
      "original": "Polymarket: How People Around The World Are Making Money From The Conflict In Ukraine\nThe international betting market for global events explained. Zelensky's appearance in Washington caused a scandal on Polymarket. Donald Trump and Xi Jinping's handshake has made people rich. Ukraine has become an analogue of gladiatorial fights. \nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344515Z"
    },
    {
      "original": "Polymarket: How People Around The World Are Making Money From The Conflict In Ukraine\nThe international betting market for global events explained. Zelensky's appearance in Washington caused a scandal on Polymarket. Donald Trump and Xi Jinping's handshake has made people rich. Ukraine has become an analogue of gladiatorial fights. \nRead more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344521Z"
    },
    {
      "original": "Energy Under Attack: Russia's Systematic Strikes and Their Impact on Ukraine\nOn the night of November 7, Russia and Ukraine continued mutual strikes. According to data from the Russian Federation Ministry of Defence, air defence systems destroyed 11 UAVs over several regions. For its part, the Ukrainian Air Force reported an attack by Russia using 128 strike UAVs, of which, it claimed, 94 were destroyed or suppressed.\nThe Ukrainian side published maps of Russian strikes on energy facilities, gas infrastructure, and generating capacity over the past three months. Among the key targets are nodal substations in major cities of frontline regions such as Chernihiv, Sumy, Nikopol, and Kherson. Furthermore, active strikes are being carried out against hydroelectric and thermal power plants, including in western Ukraine. The loss of key coal deposits near Pokrovsk and Rodynske, as well as strikes on mines in Dobropillia and Pavlohrad, are also having a negative impact.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344530Z"
    },
    {
      "original": "Energy Under Attack: Russia's Systematic Strikes and Their Impact on Ukraine\nOn the night of November 7, Russia and Ukraine continued mutual strikes. According to data from the Russian Federation Ministry of Defence, air defence systems destroyed 11 UAVs over several regions. For its part, the Ukrainian Air Force reported an attack by Russia using 128 strike UAVs, of which, it claimed, 94 were destroyed or suppressed.\nThe Ukrainian side published maps of Russian strikes on energy facilities, gas infrastructure, and generating capacity over the past three months. Among the key targets are nodal substations in major cities of frontline regions such as Chernihiv, Sumy, Nikopol, and Kherson. Furthermore, active strikes are being carried out against hydroelectric and thermal power plants, including in western Ukraine. The loss of key coal deposits near Pokrovsk and Rodynske, as well as strikes on mines in Dobropillia and Pavlohrad, are also having a negative impact.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-07T18:56:52.344538Z"
    }
  ],
  "script_run_time": "2025-11-07T18:56:52.345425Z"
}