{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі ударні БпЛА з Чорного моря \n➡️\n курсом на Одещину!",
      "timestamp": "2025-08-27T14:51:13.321293Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Сумщину.",
      "timestamp": "2025-08-27T14:51:13.321318Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південно-східному та північно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-27T14:51:13.321329Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Чернігівщини, на півночі та сході Сумщини, півночі Харківщини, півночі Донеччини! Дані безпілотники можуть бути навідниками ворожих засобів ураження!\nЗалучено засоби для збиття.",
      "timestamp": "2025-08-27T14:51:13.321336Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 74 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 27 серпня (із 20.30 26 серпня) противник атакував 95-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Міллерово, Орел, Приморсько-Ахтарськ – рф., Чауда - ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 74 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі, півдні та сході країни.\nЗафіксовано влучання 21 БпЛА на 9 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-27T14:51:13.321361Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-27T14:51:13.321369Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північ Сумщини.",
      "timestamp": "2025-08-27T14:51:13.321378Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-27T14:51:13.321386Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-27T14:51:13.321392Z"
    },
    {
      "original": "Ворожий БпЛА з півночі курсом на Чернігів.",
      "timestamp": "2025-08-27T14:51:13.321396Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-27T14:51:13.321402Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південно-східного напрямку!",
      "timestamp": "2025-08-27T14:51:13.321407Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південно-східного напрямку!",
      "timestamp": "2025-08-27T14:51:13.321411Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-08-27T14:51:13.321416Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півдні Миколаївщини. Залучено засоби для його збиття.",
      "timestamp": "2025-08-27T14:51:13.321423Z"
    },
    {
      "original": "🛸\n Ворожий  БпЛА на межі Сумщини та Чернігівщини. \n⚡\n Залучено засоби для його збиття.",
      "timestamp": "2025-08-27T14:51:13.321430Z"
    },
    {
      "original": "🛸\n Ворожий  БпЛА на півночі Сумщини. \n⚡\n Залучено засоби для його збиття.",
      "timestamp": "2025-08-27T14:51:13.321436Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-27T14:51:13.321443Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-27T14:51:13.321447Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-27T14:51:13.321451Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Дніпропетровщини. Залучено засоби для його збиття.",
      "timestamp": "2025-08-27T14:51:13.321458Z"
    },
    {
      "original": "High threat of Iskander launches from Taganrog, Rostov Oblast.",
      "timestamp": "2025-08-27T14:51:14.086957Z"
    },
    {
      "original": "Possible Iskander launch",
      "timestamp": "2025-08-27T14:51:14.086974Z"
    },
    {
      "original": "No Iskanders were detected in Ukrainian airspace.",
      "timestamp": "2025-08-27T14:51:14.086979Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Myrne, northeastern flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~24.\nTotal land area: ~0.62km².\nThis area was cleared of Ukrainian DRGs and assault groups after Russian reserve units from the 51st army were deployed to unblock the Pokrovsk - Kostyantynivka Highway.",
      "timestamp": "2025-08-27T14:51:14.086986Z"
    },
    {
      "original": "Ukrainian news outlet Ukrainska Pravda published a report outlining the number of criminal proceedings that took place for deserters from the Ukrainian Armed Forces. According to their information, citing data from the Unified Register of Crimes, the following figures were recorded:\n2022: 6,988 proceedings\n2023: 17,658 proceedings\n2024: 67,840 proceedings\n2025: 110,511 proceedings (from January - July)\nTotal: 202,997 proceedings\nThey also published the number of proceedings in which charges were filed:\n2022: 3,471 (49.67%)\n2023: 7,883 (44.64%)\n2024: 23,343 (34.41%)\n2025: 15,361 (13.90%) (from January - July) \nTotal: 50,058 (24.66%)\nThis means that this year, on average, 524 criminal proceedings for desertion were opened every single day.",
      "timestamp": "2025-08-27T14:51:14.087000Z"
    },
    {
      "original": "Ukrainian news outlet Ukrainska Pravda published a report outlining the number of criminal proceedings that took place for deserters from the Ukrainian Armed Forces. According to their information, citing data from the Unified Register of Crimes, the following…",
      "timestamp": "2025-08-27T14:51:14.087011Z"
    },
    {
      "original": "Show this to people who think attrition isn't working or is negatively affecting Russia more than Ukraine.",
      "timestamp": "2025-08-27T14:51:14.087015Z"
    },
    {
      "original": "Last night, a large-scale Geran-2 drone attack was carried out on Sumy Oblast. \nAt least 10 impacts were recorded in Sumy city, targeting the 330 kV Sumy substation, an industrial area, and a gas station (media 1, 2 & 4). At least 4 impacts were also recorded in the city of Okhtyrka, targeting industrial buildings (media 3).",
      "timestamp": "2025-08-27T14:51:14.087021Z"
    },
    {
      "original": "Last night, a large-scale Geran-2 drone attack was carried out on Sumy Oblast. \nAt least 10 impacts were recorded in Sumy city, targeting the 330 kV Sumy substation, an industrial area, and a gas station (media 1, 2 & 4). At least 4 impacts were also recorded in the city of Okhtyrka, targeting industrial buildings (media 3).",
      "timestamp": "2025-08-27T14:51:14.087027Z"
    },
    {
      "original": "Last night, at least 20 Russian Geran-2 drones impacted the Dykanka Gas Compressor station in Dykanka, Poltava Oblast. A fire broke out as a result, although there are hardly any details on the attacks with only one image being posted to local channels. \nCoordinates: 49.840128, 34.547780",
      "timestamp": "2025-08-27T14:51:14.087032Z"
    },
    {
      "original": "Last night, at least 20 Russian Geran-2 drones impacted the Dykanka Gas Compressor station in Dykanka, Poltava Oblast. A fire broke out as a result, although there are hardly any details on the attacks with only one image being posted to local channels. \nCoordinates: 49.840128, 34.547780",
      "timestamp": "2025-08-27T14:51:14.087037Z"
    },
    {
      "original": "Since this morning, Russian drones resembling Geran-2s have been attacking the city of Kostyantynivka, Donetsk Oblast. Due to its proximity to the frontline, there is no air defence. Several impacts were recorded in the city centre, as well as in the northern, southwestern, and western suburbs.",
      "timestamp": "2025-08-27T14:51:14.087041Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at an agricultural complex in the village of Vyshneve, Dnipropetrovsk Oblast after it was attacked by multiple Russian Geran-2 drones last night. \nThe Dnipropetrovsk OVA acknowledged the attack and the subsequent fire but claimed it was extinguished and that there were no civilian casualties. \nThe impacts are ~14.3km from the frontline. \nCoordinates: 47.874681, 36.325765",
      "timestamp": "2025-08-27T14:51:14.087048Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at an agricultural complex in the village of Vyshneve, Dnipropetrovsk Oblast after it was attacked by multiple Russian Geran-2 drones last night. \nThe Dnipropetrovsk OVA acknowledged the attack and the subsequent fire but claimed it was extinguished and that there were no civilian casualties. \nThe impacts are ~14.3km from the frontline. \nCoordinates: 47.874681, 36.325765",
      "timestamp": "2025-08-27T14:51:14.087053Z"
    },
    {
      "original": "New footage showing two Russian Geran-2 drone strikes on the village of Novotroitske, Zaporizhzhia Oblast. They reportedly targeted temporary deployment points for soldiers and equipment from the 65th mechanised brigade, as well as drone operators from the \"dragonflies\" drone group (part of the 65th brigade). \nImpact 1: 47.795034, 35.727342\nImpact 2: 47.794994, 35.726744\nDistance from the frontline: 29.4km",
      "timestamp": "2025-08-27T14:51:14.087059Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Novomykhailivka, Borova direction, Donetsk Oblast.\nPre-war population: ~35.\nTotal land area: ~0.47km².",
      "timestamp": "2025-08-27T14:51:14.087064Z"
    },
    {
      "original": "Update from the Gaza Strip - Northern Governorate:\nThe IDF resumed its large-scale clearing and demolition operations in Jabalia al-balad, and have captured additional areas north of Al-Quds Street. \nThey were able to clear a significant portion of the already largely demolished urban areas south of the Jabalia Refugee Camp, and entered the denser and more \"dangerous\" residential areas on approach to Al-Falouja Street. \n+ ~0.36km² in favour of the IDF.",
      "timestamp": "2025-08-27T14:51:14.087070Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:\nThe IDF continued their large-scale offensive on the Al-Zeitoun Neighbourhood of Gaza City and have made further advances towards its centre.\nAfter securing control over the southwestern-most non-flattened part of the neighbourhood, Israeli armoured units continued to advance northwest, clearing additional residential areas and reaching Al-Maslakh Street. \nAdditionally, to the east, Israeli forces built on their progress in the Kuba Neighbourhood and crossed the Salah Al-Deen Highway to the southern-most part of Al-Zeitoun Neighbourhood where they cleared additional dense urban areas, linking up with the Israeil forces in the area of Al-Maslakh Street.\nAs I previously suspected in a post on August 16, the IDF has set up a forward deployment point at the Al-Furqan Primary School in the flattened part of Al-Zeitoun, where demolition equipment and Merkava tanks are stationed. This building was chosen as it is the only structure in the area that hasn't been flattened. I have circled it on the map (coordinates: 31.4887380, 34.4456188). \nMeanwhile, Palestinian armed groups such as the Al-Qassam Brigades (Hamas) and the Saraya Al-Quds Briagdes (PIJ) continued to carry out ambushes against Israeli forces, primarily utilising IEDs and anti-tank missiles, albeit at a lower rate than previously. \n+ ~0.43km² in favour of the IDF.",
      "timestamp": "2025-08-27T14:51:14.087078Z"
    },
    {
      "original": "Update from the Gaza Strip - Khan Younis Governorate:\nAfter a brief pause, the IDF resumed its clearing operations in the centre of Khan Younis city and have made new progress in a western direction.\nIsraeli forces pushed further down Al-Sunneya, Gammal Abdel Nasser, and Salah Al-Deen streets, clearing high-rise residential areas, as well as commercial areas. Demolition operations continued in the already occupied parts of the city to support the newly constructed Magen Oz corridor which runs through the centre of Khan Younis to Israeli-occupied Rafah. Despite these recent advances, a significant amount of Khan Younis city centre is yet to be cleared\nMilitants from various Palestinian armed groups continued their attacks on Israeli forces, primarily employing IEDs and mortars. \n+ ~0.18km² in favour of the IDF.",
      "timestamp": "2025-08-27T14:51:14.087086Z"
    }
  ],
  "script_run_time": "2025-08-27T14:51:14.748431Z"
}