{
  "messages": [
    {
      "original": "⚠\nУвага! Харків!\n🛵\n Ворожі БпЛА у напрямку міста зі сходу.",
      "timestamp": "2025-08-03T20:55:35.152736Z"
    },
    {
      "original": "🛵\n Оновлення інформації щодо руху ворожих ударних БпЛА:\n1. БпЛА на Сумщині та на межі Сумщини і Чернігівщини, курс - південний/південно-західний.\n2. БпЛА на північному заході Харківщини, курс - північно-західний.\n3. БпЛА на півночі та північному сході Полтавщини, курс - західний/південно-західний.",
      "timestamp": "2025-08-03T20:55:35.152754Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-03T20:55:35.152762Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину та Донеччину.",
      "timestamp": "2025-08-03T20:55:35.152767Z"
    },
    {
      "original": "Черкаси! Суми!\n🛵\n У вашому напрямку ворожі БпЛА! Перебувайте у безпечних місцях!",
      "timestamp": "2025-08-03T20:55:35.152772Z"
    },
    {
      "original": "Полтава!\n🛵\n До вас БпЛА з північного сходу!",
      "timestamp": "2025-08-03T20:55:35.152781Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину та Донеччину.",
      "timestamp": "2025-08-03T20:55:35.152785Z"
    },
    {
      "original": "🛵\n Оновлення інформації щодо руху ворожих ударних БпЛА:\n1. БпЛА на південному заході Сумщини, курс - західний/південно-західний.\n2.  БпЛА на північному сході Чернігівщини, курс -південно-західний, на сході та півдні Чернігівщини, курс - західний.\n3. БпЛА на сході Харківщини, курс - західний.\n4. БпЛА на півночі та північному сході Полтавщини, курс - західний/південно-західний.\n5. БпЛА в центральній частині та на півночі Черкащини, курс - західний.",
      "timestamp": "2025-08-03T20:55:35.152793Z"
    },
    {
      "original": "🛵\n Кіровоградська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-03T20:55:35.152797Z"
    },
    {
      "original": "🫡\n Сьогодні, у День Повітряних Сил, одразу троє наших побратимів отримали найвищу державну нагороду — звання Героя України!\nТож щиро вітаємо полковника Євгена Булацика, підполковника Артема Мироненка та майора Дениса Юдіна із заслуженими нагородами!\nРідним іще трьох наших полеглих побратимів — Дмитра Фішера, Павла Іванова, Вадима Мороза, які мужньо та героїчно боролися за Україну, Президент України Володимир Зеленський вручив ордени «Золота Зірка».\n3 серпня 2025 року дві військові частини Повітряних Сил отримали бойові прапори та почесні найменування.\nТакож почесну відзнаку «За мужність та відвагу» вручено:\n▪️\n 225-му зенітному ракетному полку Повітряних Сил;\n▪️\n 19-тій окремій Південнобузькій бригаді радіо- і радіотехнічної розвідки Повітряних Сил;\n▪️\n 14-тій зенітній ракетній Уманській бригаді Повітряних Сил.\nПочесне найменування «Васильківський» отримав 38-й об'єднаний навчальний центр Повітряних Сил.\nКрім того, десятки військовослужбовців Повітряних Сил були відзначені відомчими та державними нагородами, зокрема орденами «За мужність» та «Богдана Хмельницького».\n🇺🇦\n Тримаймо стрій!",
      "timestamp": "2025-08-03T20:55:35.152811Z"
    },
    {
      "original": "🫡\n Сьогодні, у День Повітряних Сил, одразу троє наших побратимів отримали найвищу державну нагороду — звання Героя України!\nТож щиро вітаємо полковника Євгена Булацика, підполковника Артема Мироненка та майора Дениса Юдіна із заслуженими нагородами!\nРідним іще трьох наших полеглих побратимів — Дмитра Фішера, Павла Іванова, Вадима Мороза, які мужньо та героїчно боролися за Україну, Президент України Володимир Зеленський вручив ордени «Золота Зірка».\n3 серпня 2025 року дві військові частини Повітряних Сил отримали бойові прапори та почесні найменування.\nТакож почесну відзнаку «За мужність та відвагу» вручено:\n▪️\n 225-му зенітному ракетному полку Повітряних Сил;\n▪️\n 19-тій окремій Південнобузькій бригаді радіо- і радіотехнічної розвідки Повітряних Сил;\n▪️\n 14-тій зенітній ракетній Уманській бригаді Повітряних Сил.\nПочесне найменування «Васильківський» отримав 38-й об'єднаний навчальний центр Повітряних Сил.\nКрім того, десятки військовослужбовців Повітряних Сил були відзначені відомчими та державними нагородами, зокрема орденами «За мужність» та «Богдана Хмельницького».\n🇺🇦\n Тримаймо стрій!",
      "timestamp": "2025-08-03T20:55:35.152824Z"
    },
    {
      "original": "⚠\nУвага! м.Біла Церква (Київщина)!\n🛵\n У вашому напрямку БпЛА! Перебувайте у безпечних місцях!",
      "timestamp": "2025-08-03T20:55:35.152830Z"
    },
    {
      "original": "Consequences of a Russian Kh-22 cruise missile strike on a residential area of Mykolaiv City. The exact impact site is unknown, but I geolocated one of the photos from the scene to ~46.849868, 32.009283.",
      "timestamp": "2025-08-03T20:55:35.653398Z"
    },
    {
      "original": "Consequences of a Russian Kh-22 cruise missile strike on a residential area of Mykolaiv City. The exact impact site is unknown, but I geolocated one of the photos from the scene to ~46.849868, 32.009283.",
      "timestamp": "2025-08-03T20:55:35.653411Z"
    },
    {
      "original": "A Russian FAB-1500 glide-bomb targeted the Ostrivskyi Bridge in Kherson City. Another FAB-250 was seen impacting a nearby residential area. \nAs seen in the second video, the bridge survived but now has a large hole in the middle. This will complicate supplies to the Ukrainian garrison stationed on Korabelnyi Island, as well as the remaining civilians still living there.",
      "timestamp": "2025-08-03T20:55:35.653416Z"
    },
    {
      "original": "A Russian FAB-1500 glide-bomb targeted the Ostrivskyi Bridge in Kherson City. Another FAB-250 was seen impacting a nearby residential area. \nAs seen in the second video, the bridge survived but now has a large hole in the middle. This will complicate supplies to the Ukrainian garrison stationed on Korabelnyi Island, as well as the remaining civilians still living there.",
      "timestamp": "2025-08-03T20:55:35.653421Z"
    },
    {
      "original": "In the Khotin direction, Ukrainian forces continued to advance and have made further progress towards the international border.\nAfter completing the capture of Kindrativka and securing the surrounding areas, Ukrainian forces resumed their assault operations from Andriivka. They were able to break out of the village, and captured the treeline to the north. Once reinforcements were brought in, a four-vector attack was carried out on the positions on the western approaches to Oleksiivka. Russian forces were pushed back into the village, and back to the forest plantations lining the reservoir to the north. \nAn attack was carried out on the agricultural buildings on the western outskirts of Oleksiivka, which are now in the grey zone. Ukrainian forces also have fire control over the last road out of the village, significantly complicating Russian movement in and out of it. \n+ ~4.48km² in favour of Ukraine.",
      "timestamp": "2025-08-03T20:55:35.653427Z"
    },
    {
      "original": "In the Yunakivka direction, Russian forces resumed their assault operations and have made new progress towards the southern outskirts of Yunakivka.\nRussian forces advanced on a wide front from either side of the village. East of the Loknya River they pushed south, approaching the bridge connecting the main part of the village to its southern edge. West of the river, the Russians advanced further south down four different residential streets and captured the farm buildings to the west.\n+ ~1.49km² in favour of Russia.",
      "timestamp": "2025-08-03T20:55:35.653432Z"
    },
    {
      "original": "In the Siversk direction, over the past 10 days Russian forces have been making steady progress towards the city, and recently captured positions just 600 metres away.\nRussian forces continued their clearing of the forests south of Hryhorivka, recapturing previously lost positions and pushing back along the treeline that runs to Serebryanka. \nIn Serebryanka, Russian forces resumed their assault operations in the village after regrouping and consolidating their positions in the eastern and central streets. They completed the capture of the southeastern streets, establishing control over the adjacent trench strongpoint, while improving their positions in the south of the village. \nA mechanised attack was then carried out with the goal of securing the road from Serebryanka, but this was repelled with significant losses. \nSouth of the Plotka River, Russian forces were able to recapture positions in and around the orchards between the reservoirs and began a general push westward along the treelines. Once a solidified presence was established north of the large reservoir, Russian soldiers stormed the trench networks at the terykon overlooking Siversk. They crossed the ponds and cleared the trenches, establishing a presence on the eastern slope of the terykon.\nTo the south, Russian forces moved back into western Verkhnokamyanske - which was in the grey zone - and cleared the largely empty positions in the basements of the ruins. \n+ ~18.84km² in favour of Russia.",
      "timestamp": "2025-08-03T20:55:35.653440Z"
    },
    {
      "original": "2+ KABs flying to Korobelny District of Kherson City. Likely targeting the bridge there again.",
      "timestamp": "2025-08-03T20:55:35.653443Z"
    },
    {
      "original": "2+ KABs flying to Korobelny District of Kherson City. Likely targeting the bridge there again.",
      "timestamp": "2025-08-03T20:55:35.653447Z"
    },
    {
      "original": "Approaching the city",
      "timestamp": "2025-08-03T20:55:35.653450Z"
    },
    {
      "original": "Approaching the city",
      "timestamp": "2025-08-03T20:55:35.653453Z"
    },
    {
      "original": "4 impacts",
      "timestamp": "2025-08-03T20:55:35.653456Z"
    },
    {
      "original": "4 impacts",
      "timestamp": "2025-08-03T20:55:35.653459Z"
    },
    {
      "original": "More KABS to Kherson",
      "timestamp": "2025-08-03T20:55:35.653462Z"
    },
    {
      "original": "More KABS to Kherson",
      "timestamp": "2025-08-03T20:55:35.653465Z"
    },
    {
      "original": "As many as 4 more impacts in the same area.",
      "timestamp": "2025-08-03T20:55:35.653468Z"
    },
    {
      "original": "The KABS all impacted the area of the bridge that was targeted yesterday.",
      "timestamp": "2025-08-03T20:55:35.653471Z"
    },
    {
      "original": "Scenes from Kherson City. These seem like FAB-500s.",
      "timestamp": "2025-08-03T20:55:35.653474Z"
    },
    {
      "original": "Scenes from Kherson City. These seem like FAB-500s.",
      "timestamp": "2025-08-03T20:55:35.653477Z"
    },
    {
      "original": "Despite the repeated FAB strikes, the Ostrivskyi Bridge is still standing and passage remains possible.",
      "timestamp": "2025-08-03T20:55:35.653480Z"
    },
    {
      "original": "Footage showing 4 of the FAB-500 strikes on the Korobelnyi District of Kherson City. \n2 of the KABs impacted the bridge, and the other two missed with one falling in the river. 4 other KABs are known to have been launched, targeting somewhere else in the Korobelnyi District, although it’s unknown where exactly they impacted. \nTraffic on the bridge has been restricted, although it was mainly used for supplying the AFU garrison on Korobelnyi Island, supplying humanitarian aid for the remaining civilians living on the islands, and movement of civilians to the few shops still open in the city centre.",
      "timestamp": "2025-08-03T20:55:35.653486Z"
    }
  ],
  "script_run_time": "2025-08-03T20:55:36.037680Z"
}