{
  "messages": [
    {
      "original": "🛵\n БпЛА у напрямку Харкова з півдня та півночі.",
      "timestamp": "2026-01-16T19:49:38.193537Z"
    },
    {
      "original": "🛵\n БпЛА над Київським водосховищем, курсом на Вишгород/Київ.",
      "timestamp": "2026-01-16T19:49:38.193553Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К!",
      "timestamp": "2026-01-16T19:49:38.193561Z"
    },
    {
      "original": "🛵\n БпЛА на північних околицях міста Запоріжжя.",
      "timestamp": "2026-01-16T19:49:38.193570Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півночі.",
      "timestamp": "2026-01-16T19:49:38.193574Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К!",
      "timestamp": "2026-01-16T19:49:38.193582Z"
    },
    {
      "original": "🛵\n БпЛА над Запоріжжям.",
      "timestamp": "2026-01-16T19:49:38.193586Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини (між н.п.Городня та Холми), курс на захід та на південь.\n🛵\n БпЛА на півночі Сумщини, на н.п. Ямпіль та Терни.\n🛵\n БпЛА на Кривий Ріг з півночі.",
      "timestamp": "2026-01-16T19:49:38.193594Z"
    },
    {
      "original": "🛵\n БпЛА на сході Кіровоградщині, курс на Кропивницький.",
      "timestamp": "2026-01-16T19:49:38.193598Z"
    },
    {
      "original": "🛵\n БпЛА на Кропивницький.",
      "timestamp": "2026-01-16T19:49:38.193603Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку н.п.Нікополь.",
      "timestamp": "2026-01-16T19:49:38.193607Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2026-01-16T19:49:38.193611Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-16T19:49:38.193619Z"
    },
    {
      "original": "🛸\n Над Запоріжжям розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-16T19:49:38.193625Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину та схід Харківщини.",
      "timestamp": "2026-01-16T19:49:38.193630Z"
    },
    {
      "original": "🛵\n БпЛА на заході Дніпропетровщини, на півночі від н.п.Софіївка, курс на Запоріжжя.",
      "timestamp": "2026-01-16T19:49:38.193634Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс на н.п.Холми із заходу та на н.п.Семенівка зі сходу.",
      "timestamp": "2026-01-16T19:49:38.193639Z"
    },
    {
      "original": "🛵\n БпЛА на півночі від н.п.Тернувате на Запоріжжі, курс на захід. В напрямку н.п. Вільнянськ з південно-східного напрямку.",
      "timestamp": "2026-01-16T19:49:38.193643Z"
    },
    {
      "original": "🛵\n БпЛА на сході Одещини, на півдні від н.п.Любашівка, курс на південний напрямок.",
      "timestamp": "2026-01-16T19:49:38.193647Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з півночі.\n🛵\n БпЛА в напрямку Запоріжжя зі сходу.",
      "timestamp": "2026-01-16T19:49:38.193655Z"
    },
    {
      "original": "Kharkiv City / surroundings is currently under attack from Tornado-S rockets. They seem to be impacting the Pisochyn area, just west of the city. This is where the TEC-5 Combined Heat and Power Plant is.",
      "timestamp": "2026-01-16T19:49:39.009625Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance north of Pokrovsk, capturing new positions towards the rear of Rodynske.\nAfter regaining the initiative once again and recapturing a number of previously lost areas, Russian forces continued pushing north from Pokrovsk. They were able to cross the road to Hryshyne at another point, capturing the second pig farm complex and securing positions in the adjacent treelines. From there, assault groups advanced further north, reaching the former \"Zaporozhskaya\" Mine from the south, which DRGs earlier infiltrated from Rodynske. \nAs a result of these advances, the remaining Ukrainian formations in southwestern Rodynske withdrew to avoid being encircled, allowing the Russians to regain control over those streets and shift the fighting back to the northwestern part of the city. Russian forces also recaptured a number of positions along the highway between Rodynske and Pokrovsk, as well as the ruins of the pig farm complex there. \n+ ~7.80 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009641Z"
    },
    {
      "original": "Kharkiv City / surroundings is currently under attack from Tornado-S rockets. They seem to be impacting the Pisochyn area, just west of the city. This is where the TEC-5 Combined Heat and Power Plant is.",
      "timestamp": "2026-01-16T19:49:39.009649Z"
    },
    {
      "original": "At least six strikes with Tornado-S rockets have been carried out on the TEC-6 Combined Heat and Power Plant in Kharkiv City so far.",
      "timestamp": "2026-01-16T19:49:39.009652Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.  Currently I'm trying to determine some additional info about movements, so I will make a follow up post with…",
      "timestamp": "2026-01-16T19:49:39.009656Z"
    },
    {
      "original": "There are also reports that Russia is preparing to use an Oreshnik IRBM during the weekend. \nIn my opinion, this is being mixed up with a potential threat for Iskander-I launches (Iskander-M with a 1,000 km range).",
      "timestamp": "2026-01-16T19:49:39.009660Z"
    },
    {
      "original": "In the Druzhkivka direction, Russian forces continued to advance northeast of Sofiivka, capturing positions in the direction of a number of Ukrainian stronghold settlements.\nAfter making progress northeast of Sofiivka, Russian forces continued to build on their success, advancing up four parallel treelines and entrenching along a perpendicular treeline further north. Additionally, Russian DRGs managed to cross the Poltavka River and enter the village of Novopavlivka.\n+ ~0.92 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009667Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, making significant progress in developing their offensive.\nFollowing at least a week infiltrations, Russian forces managed to consolidate in the southern part of Illinka and in the forested gulley to the south. This allowed for DRGs to infiltrate even deeper, entering the low-rise residential parts of southwestern Kostyantynivka for the first time, and reaching areas further north in the direction of northwestern Kostyantynivka.\nAdditionally, Russian forces managed to clear out the rest of the pocket northeast of Yablunivka, where they captured a number of strongpoints in the forests there, and also improved their positions in the treelines in the direction of Berestok. This forced most of the remaining Ukrainian formations to withdraw from the forests north of the Kleban-Bykske reservoir, with those last positions now fully in the grey-zone. \n+ ~9.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009674Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\n Footage of the Israeli airstrikes targeting the town of Shamar in western Bekaa.\n@wfwitness",
      "timestamp": "2026-01-16T19:49:39.009682Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\n Footage of the Israeli airstrikes targeting the town of Shamar in western Bekaa.\n@wfwitness",
      "timestamp": "2026-01-16T19:49:39.009689Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.  Currently I'm trying to determine some additional info about movements, so I will make a follow up post with…",
      "timestamp": "2026-01-16T19:49:39.009693Z"
    },
    {
      "original": "There is information about the possibility of an attack tonight, but this seems highly unlikely to me.\nRussian strategic aviation doesn't seem to have completed it's preparations yet, and there isn't any activity on combat frequencies yet. I will continue to monitor and update if anything changes.",
      "timestamp": "2026-01-16T19:49:39.009697Z"
    },
    {
      "original": "On the northern flank of Kostyantynivka, both Russian and Ukrainian forces have advanced.\nIn the southwest, Ukrainian forces continued their attempts at counterattacking south of the tributary of the Bilenka River, and managed to recapture the western part of Virolyubivka. Fighting continues for the central and eastern parts of the village. Additionally, at some point recently, the Ukrainians cleared out the fields and forested areas to the northwest of Virolyubivka from Russian DRGs.\nIn the northeast, Russian forces continued to incrementally advance towards Markove and captured the agricultural buildings on its southern outskirts, as well as a nearby trench fortification. From there they entered the main part of Markove, where fighting is now ongoing.\n+ ~8.77 km² in favour of Ukraine.\n+ ~1.03 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009705Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance, making new progress on a wide front.\nIn the north, Russian forces pushed further west from the treelines west of Siversk, capturing additional positions there and entering the southern part of the gulley that stretches south from Zakitne. Other assault groups cleared the rest of the gulley from the north. From there, attacks were made on the forests to the west where fighting is now ongoing. \nAdditionally, Russian forces captured more treeline positions on the tactical heights north of Riznykivka and secured the neighbouring forested areas. From there, they advanced further west, reaching and capturing another fortified forest, and entering a larger adjacent forest. \nTo the south, the Russians continued improving their positions in Riznykivka and captured the rest of the eastern part of the village. They were also able to begin taking positions west of the gulley stretching south from Riznykivka, where they advanced southwest down a treeline from the southern outskirts of the village. Furthermore, Russian forces crossed the gulley at a second point further south and secured part of the forest plantations there, before infiltrating the eastern part of the nearby forests. \nIn the southwest, the Russians established control over the last parts of the forests northwest of Pazeno and captured additional forested areas in the gulleys to the south. To the south of the Vasyukivka River, they managed to complete the capture of the village of Bondarne, allowing for some soldiers to infiltrate across the river and enter the first houses of Nykyforivka. They also continued advancing southwest through the fields south of Bondarne where more treeline positions were seized.\n+ ~13.43 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009713Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance east and southeast of Lyman, making new progress in 6 different areas.\nIn the northwest, Russian forces resumed their assault operations in the fields east of Lyman, where they advanced north from the forests and captured a number of positions in the treelines there. \nTo the southwest, the Russians were able to clear out the salient that formed south of Lyman, and began their assaults on the southern outskirts of the city. Fierce fighting is now ongoing for the forested areas west of the highway, where a large grey-zone has formed.\nTo the south, following earlier Ukrainian counterattacks, Russian forces resumed their assault operations in Dibrova and recaptured all of their previously lost positions in the main part of the village. \nTo the southeast, Russian forces continued slowly advancing in Ozerne, and established a foothold in the central part of the village. Other assault groups entered its south-eastern houses, taking up new positions there too. \nTo the east. Russian forces managed to take up positions in the forested areas along the western bank of the Siverskyi Donets River opposite Zakitne, which were previously abandoned by the Ukrainians. They also made additional progress in Zakitne itself, capturing the central part of the village, and began the assault on the hills to the south where Ukraine holds their main presence. As a result of these assaults, Russian soldiers managed to gain a foothold in the strongpoints there, with heavy fighting now ongoing for additional areas. \n+ ~5.90 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009722Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance in multiple areas, capturing important positions in the Sviati Hory National Park.\nIn in the northwest, Russian forces continued advancing in the vicinity of Oleksandrivka and captured new positions in the forests to the south in the direction of the Sosnove - Oleksandrivka Road.\nTo the southwest, the Russians advanced south from the railway east of Sosnove, breaking through Ukrainian positions for nearly 2 km and entering the northern outskirts of Svyatohirsk city. They also captured additional positions on the flanks of this spearhead. Meanwhile, Russian DRGs continued infiltrating the eastern part of Svyatohirsk, advancing along the northern bank of the Siverskyi Donets River.\nIn the southeast, Russian forces continued improving their positions in the forests east of Yarova and are approaching the eastern edge of the village.\n+ ~2.87 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009729Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced in Donetsk and Luhansk Oblasts.\nIn the southwest, after consolidating in the area of the school, Russian forces advanced further west and completed the capture of Ridkodub. \nIn the northeast, Russian forces continued to slowly advance in the area of Novojehorivka, and captured the remaining positions in the forest plantations north of the village. \nMeanwhile, Ukrainian forces continued their counterattacks in the Hrekivka area and advanced east of the village, recapturing positions in the treelines there.\n+ ~3.11 km² in favour of Russia.\n+ ~0.42 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009739Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations in the direction of Nova Kruhlyakivka, recapturing previously lost positions there.\nFollowing recent Ukrainian counterattacks, Russian forces began advancing back down three parallel treelines west of Lozova, recapturing two large trench fortifications in the direction of Nova Kruhlyakivka. \n+ ~4.87 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009746Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces continued their assault operations, with Russian forces making new advances in Kupyansk.\nIn the northwest, following repeated assaults, Russian forces managed to consolidate in the northern-most houses of the city, and began attacks to the south down Michurina Street. Other assault groups entered the enterprises in northwestern Kupyansk in the area of the highway, while attacks were also carried out in the direction of Radkivka.  \nTo the southeast, Russian forces managed to recapture most of the northwestern part of the industrial zone, including part of the milk factory. Ukrainian forces are now counterattacking again, attempting to push the Russians back north. Ukrainian clearing operations continued in the central part of Kupyansk. \nMeanwhile, following earlier infiltrations into eastern Podoly, Russian DRGs began infiltrating the southern part of the village, reaching the northeastern outskirts of Kupyansk-Vuzlovyi.\n+ ~0.82 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009753Z"
    },
    {
      "original": "In the Bilyi Kolodyaz and Ternova directions, Russian forces continued their assault operations and have advanced in five different areas. \nIn the east, following a series of unsuccessful Ukrainian counterattacks, Russian forces advanced south from Lyman, capturing positions in the forests outside the village. They also made additional incremental progress through the forests southwest of Lyman, and in the direction of eastern Hrafske.\nTo the northwest, Russian forces captured the western part of Prylipka, as well as the remaining positions in the forests to the south of the village. From there, they began pushing south and southwest in the direction of Hrafske, collapsing most of the remaining Ukrainian defences outside the village. \nIn the west, Russian forces continued incrementally advancing in eastern Startsya, and restarted their assault operations further west. As a result of these new attacks, they managed to gain a foothold in multiple forested areas in the gulleys west of the village.\n+ ~4.88 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009761Z"
    },
    {
      "original": "In the Khotin, Yunakivka, and Myropillya directions, Russian forces continued their assault operations and have advanced in two different areas.\nIn the west, Russsian forces continued advancing south from Andriivka, capturing new positions in the treelines there. Attacks were also carried out on the forest plantations northwest of Mala Morchakivka. \nTo the east, Russian forces restarted their assault operations in the direction of Sadky, and entered the forests north of the village. A grey-zone has formed and fighting is ongoing.\nFurther east, Russian forces restarted their assault operations in the direction of Oleksandriya. Despite an initial failed attack, they were able to recapture a number of positions in the forests just south of the international border. \n+ ~1.58 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009768Z"
    },
    {
      "original": "In the Hlukhiv direction, Russian forces crossed the international border into Sumy Oblast, capturing the village of Komarivka.\nAround three weeks ago, Russian soldiers crossed the Kleven River (which runs along the international border) at multiple points in the direction of Komarivka and Kharkivka. While the attacks on Kharkivka were ultimately repelled, the Russians were able to establish a small bridgehead in Komarivka.\nFrom there, they began to expand the bridgehead to include the rest of the village, and captured parts of the forests to the east and southwest.\n+ ~4.90 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-16T19:49:39.009775Z"
    },
    {
      "original": "Footage showing two strikes on a Ukrainian HIMARS launcher near the village of Svirok, Chernihiv Oblast, with Russian drones of an unknown type, after it carried out launches into Bryansk Oblast.\nCoordinates: 51.73405, 32.65498",
      "timestamp": "2026-01-16T19:49:39.009779Z"
    },
    {
      "original": "Russia Is Equipping Its ‘BM-35’ Suicide Drones With Starlink Terminals (Photos)\nRussia has began to equip its so-called “BM-35” fixed-wing suicide drones with Starlink satellite internet terminal, which significantly expands their operational range.\nUkrainian media on January 15 shared photos showing the remains of one such drone, with what appears to be a Starlink Mini terminal. It is unclear exactly where, or when the photos were taken.\nThe drone, commonly referred to by its Ukrainian intelligence codename “BM-35,” features an aerodynamic fuselage with a delta-shaped wing configuration, constructed from plywood and lightweight composites for stealth and maneuverability. It is propelled by a two-stroke petrol engine.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825927Z"
    },
    {
      "original": "Russia Is Equipping Its ‘BM-35’ Suicide Drones With Starlink Terminals (Photos)\nRussia has began to equip its so-called “BM-35” fixed-wing suicide drones with Starlink satellite internet terminal, which significantly expands their operational range.\nUkrainian media on January 15 shared photos showing the remains of one such drone, with what appears to be a Starlink Mini terminal. It is unclear exactly where, or when the photos were taken.\nThe drone, commonly referred to by its Ukrainian intelligence codename “BM-35,” features an aerodynamic fuselage with a delta-shaped wing configuration, constructed from plywood and lightweight composites for stealth and maneuverability. It is propelled by a two-stroke petrol engine.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825944Z"
    },
    {
      "original": "End Of UAE Allies In Sudan Nears With Emergence Of Saudi-Egyptian-Somali Military Alliance\nSaudi Arabia is finalizing an agreement on a new military coalition with Somalia and Egypt as a part of its ongoing efforts to quell United Arab Emirates’ influence in the region, Bloomberg reported on January 16.\nTwo people with knowledge of the matter told the news outlet that Somalian President Hassan Sheikh Mohamud will travel to Saudi Arabia soon to finalize the deal, which they said “aims to foster more strategic collaboration on Red Sea security as well as deeper military cooperation.”\nA Somali government spokesperson also confirmed to the outlet that an agreement with the kingdom was in the making, without elaborating.\nSpokespeople for the governments of Saudi Arabia and Egypt didn’t reply to questions about the agreement, according to the report.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825955Z"
    },
    {
      "original": "U.S. Begins Large Military Buildup In Middle East Despite Alleged De-Escalation With Iran\nUnited States military assets from air, land and sea are expected to flow into the Middle East in the coming days and weeks to provide President Donald Trump with military options should he decide to attack Iran, Fox News reported on January 16, citing military sources.\nThe report came despite Trump backing down from earlier threats to attack the Islamic Republic over violence against protests there.\nTrump has repeatedly threatened Tehran since the start of the protests. The shift in his stance began on January 14 with him stating that the killing of protesters in Iran had ceased and that the Islamic Republic will not be carrying out executions as feared.\nIt was later reported that Turkey, Saudi Arabia, Egypt, Qatar, Oman and even Israel itself had asked Trump not to attack Iran.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825965Z"
    },
    {
      "original": "U.S. Begins Large Military Buildup In Middle East Despite Alleged De-Escalation With Iran\nUnited States military assets from air, land and sea are expected to flow into the Middle East in the coming days and weeks to provide President Donald Trump with military options should he decide to attack Iran, Fox News reported on January 16, citing military sources.\nThe report came despite Trump backing down from earlier threats to attack the Islamic Republic over violence against protests there.\nTrump has repeatedly threatened Tehran since the start of the protests. The shift in his stance began on January 14 with him stating that the killing of protesters in Iran had ceased and that the Islamic Republic will not be carrying out executions as feared.\nIt was later reported that Turkey, Saudi Arabia, Egypt, Qatar, Oman and even Israel itself had asked Trump not to attack Iran.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825974Z"
    },
    {
      "original": "Military Situation In Ukraine On January 16, 2026 (Maps Update)",
      "timestamp": "2026-01-16T19:49:39.825978Z"
    },
    {
      "original": "Military Situation In Ukraine On January 16, 2026 (Maps Update)",
      "timestamp": "2026-01-16T19:49:39.825982Z"
    },
    {
      "original": "Financial Constraints Make Trump’s “Dream Military” Easier Said Than Done\nUnited States President Donald Trump wants to increase his country’s military budget by 50% by 2027. According to him, $1.5 trillion would be sufficient to strengthen the US armed forces amid geopolitical realignment and destabilizing global security. However, there are questions about whether this can be achieved when the US has a debt of $37.5 trillion.\nWhen Trump announced that the Department of Defense would be renamed the Department of War, many believed it was just a cosmetic change. However, time has shown otherwise. The US military deployment in the Caribbean and the kidnapping of Venezuelan President Nicolás Maduro are the first signs that the US National Security Strategy is not meant to be ignored.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.825991Z"
    },
    {
      "original": "Russian Army Solidifies Control South Of Krasny Liman As It Prepares To Storm City (Videos)\nOn January 16, the Russian military expanded its control to the south of Krasny Liman in Donetsk capturing a settlement from Kiev forces, all while preparing to storm the key city.\nZakotnoye, located some 12 kilometers to the south of Krasny Liman, was captured by the 7th Separate Guards Motorized Rifle Chistyakov Brigade of the Yug [South] Group of Forces, according to a statement by the Russian Ministry of Defense.\n“The brigade's servicemen demonstrated courage and heroism during the offensive. Coordinated actions of reconnaissance units, artillery fire support, and effective operation of drone teams made it possible to block all enemy attempts to hold the settlement,” the statement reads.\nThe attack on Zakotnoye began a few days earlier. Kiev forces didn’t put up much resistance. According to preliminary reports, Russian troops were even able to capture heights to the west of the settlement.\nRead more \nHERE",
      "timestamp": "2026-01-16T19:49:39.826005Z"
    },
    {
      "original": "Russian Army Solidifies Control South Of Krasny Liman As It Prepares To Storm City (Videos)\nOn January 16, the Russian military expanded its control to the south of Krasny Liman in Donetsk capturing a settlement from Kiev forces, all while preparing to storm the key city.\nZakotnoye, located some 12 kilometers to the south of Krasny Liman, was captured by the 7th Separate Guards Motorized Rifle Chistyakov Brigade of the Yug [South] Group of Forces, according to a statement by the Russian Ministry of Defense.\n“The brigade's servicemen demonstrated courage and heroism during the offensive. Coordinated actions of reconnaissance units, artillery fire support, and effective operation of drone teams made it possible to block all enemy attempts to hold the settlement,” the statement reads.\nThe attack on Zakotnoye began a few days earlier. Kiev forces didn’t put up much resistance. According to preliminary reports, Russian troops were even able to capture heights to the west of the settlement.\nRead more \nHERE",
      "timestamp": "2026-01-16T19:49:39.826014Z"
    },
    {
      "original": "Russian Strikes Erode Ukraine's Energy Grid Amid Air Defense Shortfalls\nRussian strikes on Ukraine's energy infrastructure are becoming increasingly effective, while Ukrainian air defense capabilities are being depleted. As noted by retired Austrian Army Colonel Markus Reisner in an interview with Berliner Zeitung, the air defense system cannot cope even with a small fraction of drones and cruise missiles. \n\"One can see an almost complete absence of successful defense,\" the expert states. According to him, Russia is not only increasing the number of attack assets but also improving tactics—using attacks from all directions, maneuvers before the target, and sharp dives—making defense practically impossible.\nThe result has been massive power outages in Odesa, Sumy, Dnipro, Kharkiv, Zhytomyr, Zaporizhzhia, and significant parts of Kyiv. Authorities are draining water from heating systems to avoid pipe bursts, and residents are beginning to leave cities. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.826024Z"
    },
    {
      "original": "Russian Strikes Erode Ukraine's Energy Grid Amid Air Defense Shortfalls\nRussian strikes on Ukraine's energy infrastructure are becoming increasingly effective, while Ukrainian air defense capabilities are being depleted. As noted by retired Austrian Army Colonel Markus Reisner in an interview with Berliner Zeitung, the air defense system cannot cope even with a small fraction of drones and cruise missiles. \n\"One can see an almost complete absence of successful defense,\" the expert states. According to him, Russia is not only increasing the number of attack assets but also improving tactics—using attacks from all directions, maneuvers before the target, and sharp dives—making defense practically impossible.\nThe result has been massive power outages in Odesa, Sumy, Dnipro, Kharkiv, Zhytomyr, Zaporizhzhia, and significant parts of Kyiv. Authorities are draining water from heating systems to avoid pipe bursts, and residents are beginning to leave cities. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-16T19:49:39.826033Z"
    }
  ],
  "script_run_time": "2026-01-16T19:49:39.826787Z"
}