{
  "messages": [
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n в районі Батурина та Ічні.",
      "timestamp": "2025-09-18T17:51:36.084405Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n на Ніжин.",
      "timestamp": "2025-09-18T17:51:36.084425Z"
    },
    {
      "original": "🛵\n Донеччина: БпЛА \n➡️\n курсом на Краматорськ.",
      "timestamp": "2025-09-18T17:51:36.084433Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА в районі Сновська.",
      "timestamp": "2025-09-18T17:51:36.084438Z"
    },
    {
      "original": "🛵\n група БпЛА на півночі Харківщини \n➡️\n курсом на захід.",
      "timestamp": "2025-09-18T17:51:36.084444Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-09-18T17:51:36.084451Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Донеччину!",
      "timestamp": "2025-09-18T17:51:36.084457Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-09-18T17:51:36.084463Z"
    },
    {
      "original": "🛵\n нова група БпЛА на Харківщині \n➡️\n курсом на захід.\n🛵\n група БпЛА на півночі Харківщини \n➡️\n курсом на Полтавщину.",
      "timestamp": "2025-09-18T17:51:36.084472Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Сумщину!",
      "timestamp": "2025-09-18T17:51:36.084478Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Київщину.\n🛵\n нова група БпЛА на півночі Чернігівщини \n➡️\n в південно-західному напрямку.",
      "timestamp": "2025-09-18T17:51:36.084490Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Харківщину!",
      "timestamp": "2025-09-18T17:51:36.084496Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n курсом на Чернігівщину.",
      "timestamp": "2025-09-18T17:51:36.084502Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині \n➡️\n курсом на Миколаївщину.",
      "timestamp": "2025-09-18T17:51:36.084510Z"
    },
    {
      "original": "🛵\n Київ - БпЛА на околицях міста!",
      "timestamp": "2025-09-18T17:51:36.084516Z"
    },
    {
      "original": "🛵\n Миколаївщина: БпЛА \n➡️\n курсом на північний захід.\n🛵\n БпЛА на заході Запоріжжя \n➡️\n курсом на Кривий Ріг.\n🛵\n Сумщиа: група БпЛА \n➡️\n курсом на Потавщину та Чернігівщину.\n🛵\n група БпЛА на Чернігівщині \n➡️\n в напрямку Київщини.\n🛵\n група БпЛА на Полтавщині \n➡️\n курсом на захід.",
      "timestamp": "2025-09-18T17:51:36.084533Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Запоріжжі!",
      "timestamp": "2025-09-18T17:51:36.084538Z"
    },
    {
      "original": "🛵\n група БпЛА на Чернігівщині \n➡️\n в напрямку Полтавщини.\n🛵\n група БпЛА на Полтавщині \n➡️\n курсом на захід.\n🛵\n БпЛА на сході Черкащини \n➡️\n південно-західним курсом.\n🛵\n Київщина: БпЛА \n➡️\n в Бучанському районі курсом на захід.\n🛵\n група БпЛА на Харківщині \n➡️\n курсом на захід.",
      "timestamp": "2025-09-18T17:51:36.084556Z"
    },
    {
      "original": "🛵\n Київ - БпЛА на околицях міста!",
      "timestamp": "2025-09-18T17:51:36.084561Z"
    },
    {
      "original": "🛵\n група БпЛА на Харківщині \n➡️\n в напрямку Полтавщини.\n🛵\n БпЛА на Полтавщині \n➡️\n курсом на захід.\n🛵\n БпЛА на сході Черкащини \n➡️\n курсом на Київщину\n🛵\n Київщина: БпЛА \n➡️\n в напрямку Білої Церкви.",
      "timestamp": "2025-09-18T17:51:36.084574Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-09-18T17:51:36.084580Z"
    },
    {
      "original": "Footage showing a Russian Mi-28 helicopter flying over Bakhmut. The city is beginning to become overgrown now that fighting is moving away.",
      "timestamp": "2025-09-18T17:51:36.539411Z"
    },
    {
      "original": "An explosion was heard from Zaporizhzhia City as a result of an Iskander strike outside the city limits.",
      "timestamp": "2025-09-18T17:51:36.539423Z"
    },
    {
      "original": "An explosion was heard from Zaporizhzhia City as a result of an Iskander strike outside the city limits.",
      "timestamp": "2025-09-18T17:51:36.539426Z"
    },
    {
      "original": "Another explosion was heard",
      "timestamp": "2025-09-18T17:51:36.539429Z"
    },
    {
      "original": "Another explosion was heard",
      "timestamp": "2025-09-18T17:51:36.539432Z"
    },
    {
      "original": "These apparently hit west of the city",
      "timestamp": "2025-09-18T17:51:36.539436Z"
    },
    {
      "original": "Kupyansk. Ukraine is transferring the 3rd Assault Brigade into the city. \nThe transfer has been already ongoing at least since September 13th according to my information, and as a minimum some elements of the Brigade already arrived in the Kupyansk direction.",
      "timestamp": "2025-09-18T17:51:36.539440Z"
    },
    {
      "original": "Kupyansk. Ukraine is transferring the 3rd Assault Brigade into the city.   The transfer has been already ongoing at least since September 13th according to my information, and as a minimum some elements of the Brigade already arrived in the Kupyansk direction.",
      "timestamp": "2025-09-18T17:51:36.539447Z"
    },
    {
      "original": "The Russians are in central Kupyansk as of 2 days ago (confirmed by Deepstate). It's unclear if Azov will try to clear DRGs from Sobolivka, or assault groups inside the city limits. Both options would make sense.",
      "timestamp": "2025-09-18T17:51:36.539451Z"
    },
    {
      "original": "Anti-drone net coverage on the main Kramatorsk - Kostyantynivka supply highway.\nContinuous line represents a finished and in good condition corridor, dotted lines represent an unfinished and/or damaged corridor.\nThe Druzhkivka - Kramatorsk corridor was recently completed.",
      "timestamp": "2025-09-18T17:51:36.539455Z"
    },
    {
      "original": "Anti-drone net coverage on the main Kramatorsk - Kostyantynivka supply highway. Continuous line represents a finished and in good condition corridor, dotted lines represent an unfinished and/or damaged corridor. The Druzhkivka - Kramatorsk corridor was recently…",
      "timestamp": "2025-09-18T17:51:36.539459Z"
    },
    {
      "original": "From a Ukrainian source",
      "timestamp": "2025-09-18T17:51:36.539462Z"
    },
    {
      "original": "🇮🇱\n🇸🇾\n⚡️\n — The Institute for the Study of War released a map of Israel’s proposed security deal in Syria, which includes retaining control of the Golan and Mount Hermon, expanding the Quneitra buffer zone, demilitarizing Daraa, and imposing a no-fly zone over Suwayda along with other areas south of Damascus.\n@TabZLIVE",
      "timestamp": "2025-09-18T17:51:36.539471Z"
    },
    {
      "original": "Soon.....",
      "timestamp": "2025-09-18T17:51:36.539475Z"
    },
    {
      "original": "We did it!",
      "timestamp": "2025-09-18T17:51:36.539478Z"
    },
    {
      "original": "The battle for Yampil is now in full swing, with Russian forces entering the village en masse. After capturing the rest of the Serebryanskyi Forest and beginning the process of consolidation (green), Russian forces began attacking Yampil from multiple directions. \nThe main focus is on the eastern part of the village, where the Russians entered it at three points: \n1. After physically cutting the Dronivka - Yampil Road, they began moving along the road and infiltrating the easternmost houses via the forest (1).\n2. After capturing the Ostrich Farm, Russian forces began entering the eastern streets from the north (2).\n3. After consolidating northwest of the Ostrich Farm, Russian forces entered the railway station, and the houses behind it (3).\nUkrainian forces are heavily shelling all of these points and attempting to counterattack from their positions in the centre of the village towards the eastern streets, where a large grey zone has formed (7). \nIn turn, Russia is shelling the centre and western parts of Yampil and attempting to reach Ukrainian staging grounds in the centre from the railway station. \nFurther west, the Russians are attacking west towards the Yampil - Zarichne Road (4) and the railway crossing (5), where the grey zone has expanded significantly. Ukrainian forces are counterattacking from their forward deployment points in the western part of Yampil, to the area north of the railway crossing (6).",
      "timestamp": "2025-09-18T17:51:36.539486Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-18T17:51:36.539491Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-18T17:51:36.539496Z"
    },
    {
      "original": "Flying to central Israel",
      "timestamp": "2025-09-18T17:51:36.539500Z"
    },
    {
      "original": "2 missiles were launched",
      "timestamp": "2025-09-18T17:51:36.539503Z"
    },
    {
      "original": "Interceptor launches",
      "timestamp": "2025-09-18T17:51:36.539505Z"
    },
    {
      "original": "Additional interceptor launches",
      "timestamp": "2025-09-18T17:51:36.539508Z"
    },
    {
      "original": "Sirens in central Israel",
      "timestamp": "2025-09-18T17:51:36.539511Z"
    },
    {
      "original": "One of the interceptor launches",
      "timestamp": "2025-09-18T17:51:36.539514Z"
    },
    {
      "original": "Both ballistic missiles were intercepted",
      "timestamp": "2025-09-18T17:51:36.539517Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on concentration of Ukrainian manpower from the 95th Separate Air Assault Brigade in a treeline near the city of Druzhkivka, Donetsk Oblast. The missile was equipped with a cluster warhead. \nCoordinates: 48.643307, 37.595839 (only 12 km from the frontline).",
      "timestamp": "2025-09-18T17:51:36.539523Z"
    },
    {
      "original": "Military Situation In Ukraine On September 17, 2025 (Maps Update)",
      "timestamp": "2025-09-18T17:51:37.073403Z"
    },
    {
      "original": "Military Situation In Ukraine On September 17, 2025 (Maps Update)",
      "timestamp": "2025-09-18T17:51:37.073415Z"
    },
    {
      "original": "Iran Executed Alleged Israeli Spy Who Wanted To Fight For Ukraine \nIran has executed a man accused of spying for Israel, state media reported on September 17, identifying him as Babak Shahbazi.\nThe judiciary’s Mizan news agency said that Shahbazi gathered and sold sensitive information about Iranian data centers and security installations to Israeli handlers. It described him as working on “industrial cooling devices” as a contractor for companies that worked on telecommunications, military and security sites.\nIn a plot twist, Iranian opposition activists, including the Oslo-based group Iran Human Rights, alleged that Shahbazi was detained over writing a letter to Ukrainian President Volodymyr Zelenskyy offering to fight against Russia.\nRead more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073426Z"
    },
    {
      "original": "Israel Signals Readiness for New Military Campaigns Against Iran and Yemen  \nIsrael’s Defense Ministry has announced preparations for a new phase of conflict with Iran and Yemen, citing the high costs of intercepting ballistic missiles and the need for accelerated military readiness. To that end, it is forming a Supreme Armaments Council to streamline weapons procurement and strategic planning.\nMaj. Gen. Amir Baram, Director General of the Defense Ministry, stated:\n“Our recent military operation in Iran ended in a decisive Israeli victory, but further phases are imminent. Iran, feeling deeply humiliated, is rapidly investing in its defense capabilities—unlike Israel, where such decisions take longer to implement.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073436Z"
    },
    {
      "original": "ISRAEL SETS GAZA CITY ABLAZE",
      "timestamp": "2025-09-18T17:51:37.073439Z"
    },
    {
      "original": "Europe Caught In Trump's Trap. The US Strikes At Brussels' Weak Spot\nDonald Trump is a recognized master dealmaker. Many believe that his strategy for resolving the Ukrainian conflict is failing. Neither Russia nor Ukraine is prepared to make significant concessions. Since January 20, 2025, there have been no tangible developments in the war, except for the ongoing offensive by the Russian Armed Forces across the entire front line. Yet, the assessment of Trump's strategy as unsuccessful is superficial.\nIn fact, the White House seems to have long since decided to withdraw the United States from a completely hopeless conflict. And all the steps taken by the Republican administration are aimed at creating the necessary backdrop. First and foremost, the US president is interested in the information backdrop. The collapse of the Kiev regime should not resemble Biden's Afghanistan.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073447Z"
    },
    {
      "original": "Kirk Murder Sparks Deep State And Israeli Conspiracy Debates Amid FBI Controversies\nThe murder of Charlie Kirk has intensified suspicion toward the US deep state and raised questions about possible foreign connections. Conflicting evidence, a confusing suspect profile, and doubts over FBI transparency have plunged the case into a spiral of political polarization and radicalization.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073454Z"
    },
    {
      "original": "Moldovan Citizen Linked to Ukraine’s GUR Sentenced to 14 Years for Crimea Terror Plot\nThe Main Intelligence Directorate of the Ministry of Defense of Ukraine (GUR MO) continues to actively recruit citizens of various countries to carry out sabotage and terrorist acts on the territory of Russia. Vulnerable groups, including pensioners, teenagers, and individuals with a criminal past, are also particularly targeted. They are coerced through blackmail or financial promises to participate in subversive activities. One such case involves Evgeny Kurdoglu, a citizen of the Republic of Moldova, who was detained for plotting a terrorist attack in Crimea.\nOn September 17, 2025, the Southern District Military Court of Russia delivered the verdict in the case of Evgeny Kurdoglu. He was found guilty of attempting to commit a terrorist act at a pumping station that provides water supply to over 170,000 people in the Leninsky District of Crimea...\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073462Z"
    },
    {
      "original": "Military Situation In Gaza Strip On September 18, 2025 (Map Update)\nFour Israeli soldiers were killed in an ambush near Rafah amid ongoing Israeli military operations. The Israeli forces have intensified airstrikes across multiple Gaza Strip locations, including \nGaza City, Khan Yunis, Deir al-Balah, Rafah, and Bureij camp\n. These strikes have targeted residential areas, causing widespread destruction and forcing a massive displacement of approximately \n190,000\n Palestinians from Gaza City alone.\nIn the last 24 hours, Israeli airstrikes have killed at least \n79 civilians and wounded 228 more across the Gaza Strip\n. Since the start of the conflict, the Palestinian Ministry of Health reports a devastating toll of over \n65,141\n Palestinians killed and more than \n165,925\n wounded due to Israeli military actions. This relentless campaign has left Gaza's urban centers severely damaged and triggered immense humanitarian suffering amid mass displacement and communication blackouts.",
      "timestamp": "2025-09-18T17:51:37.073472Z"
    },
    {
      "original": "Russian fighters against Ukrainian drones. Direction unknown.",
      "timestamp": "2025-09-18T17:51:37.073476Z"
    },
    {
      "original": "Russian Strikes on Gas Storage Will Force Ukraine to Spend $1 Billion to Avoid Winter Crisis\nThe balance of attacking unmanned aerial vehicles (UAVs) on the night of September 17-18 showed the Russian side’s advantage. According to Russian sources, air defense systems shot down \n43 \nUkrainian UAVs (with 12 more during daytime). Ukrainian sources reported \n75\n Russian “Geran”/”Gerbera” UAVs launched, with 48 claimed shot down or suppressed. \nFormer advisor to the head of the Association of Ukrainian Banks \nAlexei Kushch \nsaid Russia is deliberately targeting four key elements of Ukraine’s gas system, paralyzing gas import and storage. The most significant are strikes on underground storage facilities:\n“The next strikes target underground gas storage. The explosions are so powerful that rumors say minor earthquakes in Poltava region could be linked to the destruction of underground gas storage.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073488Z"
    },
    {
      "original": "Russian Strikes on Gas Storage Will Force Ukraine to Spend $1 Billion to Avoid Winter Crisis\nThe balance of attacking unmanned aerial vehicles (UAVs) on the night of September 17-18 showed the Russian side’s advantage. According to Russian sources, air defense systems shot down \n43 \nUkrainian UAVs (with 12 more during daytime). Ukrainian sources reported \n75\n Russian “Geran”/”Gerbera” UAVs launched, with 48 claimed shot down or suppressed. \nFormer advisor to the head of the Association of Ukrainian Banks \nAlexei Kushch \nsaid Russia is deliberately targeting four key elements of Ukraine’s gas system, paralyzing gas import and storage. The most significant are strikes on underground storage facilities:\n“The next strikes target underground gas storage. The explosions are so powerful that rumors say minor earthquakes in Poltava region could be linked to the destruction of underground gas storage.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-18T17:51:37.073499Z"
    },
    {
      "original": "Military Situation In Ukraine On September 18, 2025 (Maps Update)",
      "timestamp": "2025-09-18T17:51:37.073503Z"
    },
    {
      "original": "Military Situation In Ukraine On September 18, 2025 (Maps Update)",
      "timestamp": "2025-09-18T17:51:37.073507Z"
    }
  ],
  "script_run_time": "2025-09-18T17:51:37.074348Z"
}