{
  "messages": [
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Сумщини! \nЗалучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-04T15:14:01.777986Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T15:14:01.778001Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Херсонщини! \nЗалучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-04T15:14:01.778008Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з півдня \n➡️\n курсом на Запоріжжя.",
      "timestamp": "2025-10-04T15:14:01.778013Z"
    },
    {
      "original": "🚀\nКАБи на північ Запорізької області!",
      "timestamp": "2025-10-04T15:14:01.778018Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T15:14:01.778023Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Київщину.",
      "timestamp": "2025-10-04T15:14:01.778028Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини та Сумщини \n➡️\n курсом на південний схід.",
      "timestamp": "2025-10-04T15:14:01.778034Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному  напрямку зберігається! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-04T15:14:01.778041Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T15:14:01.778049Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-10-04T15:14:01.778057Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Херсонщини, південніше Запоріжжя, на північному сході Харківщини, на сході Дніпропетровщини. на північному заході Донеччини! \nЗалучено засоби для збиття.\nБпЛА можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-04T15:14:01.778063Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Суми з півночі!\n🛵\n \"Шахеди\" у центрі Сумщини \n➡️\n курсом на південь.\n🛵\n Ворожі БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T15:14:01.778073Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-10-04T15:14:01.778080Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-10-04T15:14:01.778085Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщину! Південно-східний напрямок!",
      "timestamp": "2025-10-04T15:14:01.778089Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Суми з півночі! \n🛵\n \"Шахеди\" у центрі Сумщини \n➡️\n курсом на південь. \n🛵\n Ворожі БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T15:14:01.778098Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Шостку.",
      "timestamp": "2025-10-04T15:14:01.778104Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщину! Південно-східний напрямок!",
      "timestamp": "2025-10-04T15:14:01.778107Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-10-04T15:14:01.778112Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в напрямку Шевченкового.",
      "timestamp": "2025-10-04T15:14:01.778118Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-10-04T15:14:01.778122Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину!",
      "timestamp": "2025-10-04T15:14:01.778126Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Короп та Новгород-Сіверський.",
      "timestamp": "2025-10-04T15:14:01.778131Z"
    },
    {
      "original": "A missile has appeared, flying through Kharkiv Oblast. Clarifying.",
      "timestamp": "2025-10-04T15:14:02.477741Z"
    },
    {
      "original": "A missile has appeared, flying through Kharkiv Oblast. Clarifying.",
      "timestamp": "2025-10-04T15:14:02.477752Z"
    },
    {
      "original": "The Iskander impacted the Krasnokuts'k area of Kharkiv Oblast.",
      "timestamp": "2025-10-04T15:14:02.477755Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to steadily advance, while Ukrainian forces have intensified their counterattacks.\nRussian forces advanced in three areas. In the north, a series of assault operations were carried out from the central part of Zarichne, clearing out the last pockets of Ukrainian resistance in the southern streets, and the industrial zone which was previously used as a forward Ukrainian supply hub. Immediately after completing the capture of Zarichne, Russian forces went on to advance west of the village down the gulley leading to the large forests further west. They were able to establish control over the eastern part of the gulley and are now attempting to repel Ukrainian counterattacks. \nUkrainian forces are also attempting to infiltrate the agricultural buildings and surrounding residential areas in the northwestern part of Zarichne from their positions in the forests but have so far been unsuccessful. Additionally, an unsuccessful Ukrainian counterattack involving an APC was made towards the industrial zone, with the goal of preventing Russian consolidation in the southwestern part of Zarichne. At the same time, Ukraine has intensified their FPV drone strikes on Torske, as well as general Russian supply lines.\nFurther south, Russian forces continued to slowly push through the Yampil Forest and have advanced by approximately 700 metres. Ukrainian forces are attempting to counterattack against the southern flank of the Russian positions west of the Yampil - Zarichne Road. \nIn the south, despite the layered and complex situation, Russian forces have managed to consolidate further in Yampil, securing their positions in the area of the railway station in the northern part of the village. They are also continuing their assault operations through the central part of the village towards the western streets and are trying to enter northwestern Yampil from the railway crossing area. \nIn turn, Ukrainian forces are counterattacking towards the railway crossing, nullifying Russian progress. Ukrainian forces are also infiltrating along the northern bank of Tserkovne Lake in southern Yampil, towards the southeastern part of the village, which remains in the grey zone. Russian forces have subsequently intensified their FPV drone strikes on Ukrainian supply lines, forward deployment points, and positions further into the rear. \n+ ~4.57 km² in favour of Russia.",
      "timestamp": "2025-10-04T15:14:02.477765Z"
    },
    {
      "original": "In the Lyman and Borova direction, both Russian and Ukrainian forces have advanced, seizing positions in the low-lying areas.\nRussian forces continued their preparatory assault operations on Drobysheve, and were able to capture the Drobysheve Fish Farm, and entered the adjacent forest. \nMeanwhile, following failed Russian consolidation efforts, Ukrainian forces counterattacked in the village of Novoselivka, pushing Russian forces away from the centre of the settlement, and into the northernmost streets. \nFurther north, the Ukrainians counterattacked in Karpivka, crossing the Nitrius River once again, and securing a bridgehead over the river in the northern part of the village, supporting their position in neighbouring Ridkodub. \n+ ~1.49 km² in favour of Ukraine\n+ ~1.14 km² in favour of Russia",
      "timestamp": "2025-10-04T15:14:02.477772Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations in the area of Boriivska Andriivka, and have reached the outskirts of the settlement.\nRussian forces advanced from their positions on the southern bank of the nearby reservoir, entering and capturing two large trench fortifications, as well as the treeline bisecting them. They were also able to improve their positions in the treelines west of Zelenyi Hai.\n+ ~3.82 km² in favour of Russia.",
      "timestamp": "2025-10-04T15:14:02.477778Z"
    },
    {
      "original": "Iskander threat from Bryansk Oblast. High threat of missile launches.",
      "timestamp": "2025-10-04T15:14:02.477781Z"
    },
    {
      "original": "Iskander threat from Bryansk Oblast. High threat of missile launches.",
      "timestamp": "2025-10-04T15:14:02.477787Z"
    },
    {
      "original": "Possible Iskander launches",
      "timestamp": "2025-10-04T15:14:02.477790Z"
    },
    {
      "original": "Another Iskander launch from Bryansk",
      "timestamp": "2025-10-04T15:14:02.477795Z"
    },
    {
      "original": "The first missile has entered Ukrainian airspace, flying southwest towards Chernihiv Oblast.",
      "timestamp": "2025-10-04T15:14:02.477799Z"
    },
    {
      "original": "The first missile has entered Ukrainian airspace, flying southwest towards Chernihiv Oblast.",
      "timestamp": "2025-10-04T15:14:02.477802Z"
    },
    {
      "original": "Correction: flying southeast towards Shostka, Sumy Oblast.",
      "timestamp": "2025-10-04T15:14:02.477805Z"
    },
    {
      "original": "The first Iskander disappeared. A second is following.",
      "timestamp": "2025-10-04T15:14:02.477808Z"
    },
    {
      "original": "Explosions were heard in Shostka",
      "timestamp": "2025-10-04T15:14:02.477813Z"
    },
    {
      "original": "3rd Iskander launch from Bryansk. Not in Ukrainian airspace yet.",
      "timestamp": "2025-10-04T15:14:02.477816Z"
    },
    {
      "original": "3rd Iskander launch from Bryansk. Not in Ukrainian airspace yet.",
      "timestamp": "2025-10-04T15:14:02.477819Z"
    },
    {
      "original": "Entering Ukrainian airspace, flying south to Shostka. These missiles are being launched from the vicinity of Bryansk City.",
      "timestamp": "2025-10-04T15:14:02.477822Z"
    },
    {
      "original": "Entering Ukrainian airspace, flying south to Shostka. These missiles are being launched from the vicinity of Bryansk City.",
      "timestamp": "2025-10-04T15:14:02.477825Z"
    },
    {
      "original": "Approaching Shostka",
      "timestamp": "2025-10-04T15:14:02.477828Z"
    },
    {
      "original": "Approaching Shostka",
      "timestamp": "2025-10-04T15:14:02.477831Z"
    },
    {
      "original": "Explosions in Shostka",
      "timestamp": "2025-10-04T15:14:02.477834Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued their assault operations south of the Vovcha River, and have recaptured previously lost positions in the western part of Vovchansk.\nAs a result of resumed attacks, Russian forces were able to advance to the Vovchansk Oil Extraction Plant, taking up positions in the buildings west of the railway line, as well as in the adjacent residential areas on and around Zaliznychna Street. From there, soldiers began infiltrating south along the railway line to rear of the main Ukrainian stronghold in the main part of the plant. \n+ ~0.23 km² in favour of Russia.",
      "timestamp": "2025-10-04T15:14:02.477838Z"
    },
    {
      "original": "Russian preparations for the next large-scale combined missile and drone attack on Ukraine are progressing. \n2 Tu-95MS strategic bombers were redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. They were equipped with Kh-101 cruise missiles at Ukrainka, and took part in training exercises over the Pacific near the Kuril Islands where launches of missiles were simulated with electronic warfare\n1 Tu-95MS redeployed from Engels-2 Airbase to Olenya Airbase, Murmansk Oblast. It has already been equipped with missiles.\n2 Tu-95MS and 1 Tu-160 have been carrying out daily training exercises from Engels-2 Airbase for the past 4 days in a row, where launches of Kh-101 missiles were simulated with electronic warfare\nAn An-124-100 \"Ruslan\" cargo plane landed at Engels-2 Airbase, likely carrying dozens of Kh-101 missiles for the 5 Tu-95s and 1 Tu-160 currently stationed there. \nAn IL-76MD cargo plane landed at Baltimore Airbase, Voronezh Oblast, likely carrying more Iskander-M ballistic missiles for OTRK installations in the region. \n1 IL-76MD cargo plane landed at Shaykovka Airbase, Kaluga Oblast. The cargo likely consists of Kh-22 cruise missiles for the Tu-22M3 strategic bombers stationed at Diaghilev Airbase, Ryazan Oblast, but it's possible that the cargo only included Geran-2/3 and Gerbera drones for launch sites in Bryansk and Smolensk Oblasts.\n1 An-26 cargo plane landed at Khalino Airbase, Kursk Oblast. The cargo consists of Geran-2/3 and Gerbera drones for the launch site at Khalino Airbase.\n1 An-26 cargo plane landed at Shatalovo Airbase, Smolensk Oblast. The cargo likely consists of Geran-2/3 and Gerbera drones for the launch site at Shaykovka Airbase, but it could also include Iskander-M ballistic missiles for the OTRK installations in Bryansk Oblast. \nMiG-31Ks are actively carrying out training missions from Savasleika Airbase, Nizhny Novgorod Oblast, without simulating launches of Kinzhal missiles.\nAccumulation of Geran-2/3 and Gerbera drones continues at most launch sites surrounding Ukraine, in addition to the arrival of new drones for future use.\nOverall, there is a high probability of a large-scale missile and drone attack in the next 3 days. 8 Tu-95MS and 1 Tu-160 are stationed at airbases near Ukraine, most/all of which are equipped or being equipped with missiles.",
      "timestamp": "2025-10-04T15:14:02.477849Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Nove Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~191.\nTotal land area: ~0.87km².",
      "timestamp": "2025-10-04T15:14:02.477854Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued their assault operations and have made further progress towards Pokrovske in two areas.\nIn the northeast, Russian forces continued to advance southwest of Sosnivka, and captured new treeline positions on the tactical heights. They then went on to push northwest towards the gulley, securing additional positions on the former Orestopil - Berestove Road.\nTo the southwest, Russian forces continued their assault operations in Verbove, and have established full control over the village. Since then, attacks have been carried out down the road west of the settlement, in the direction of Vyshneve.\n+ ~4.93 km² in favour of Russia.",
      "timestamp": "2025-10-04T15:14:02.477859Z"
    },
    {
      "original": "Russian Army Approaches Seversk From New Direction, Advances In Kupyansk (Videos)\nThe Russian military continues to develop its offensive towards Seversk in the Donetsk direction as of October 3, all while maintaining momentum in the Kharkiv direction.\nThe Yug [South] Group of Forces has renewed its advance to the southwest of Seversk, entering Fedorivka after a successful attack that was likely launched from Sakko i Vantsetti, Rozdolivka and Pereizne. Preliminary reports indicate the settlement has been fully secured by Russian troops. This is yet to be confirmed by the Russian Ministry of Defense, however.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284292Z"
    },
    {
      "original": "Russian Army Approaches Seversk From New Direction, Advances In Kupyansk (Videos)\nThe Russian military continues to develop its offensive towards Seversk in the Donetsk direction as of October 3, all while maintaining momentum in the Kharkiv direction.\nThe Yug [South] Group of Forces has renewed its advance to the southwest of Seversk, entering Fedorivka after a successful attack that was likely launched from Sakko i Vantsetti, Rozdolivka and Pereizne. Preliminary reports indicate the settlement has been fully secured by Russian troops. This is yet to be confirmed by the Russian Ministry of Defense, however.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284307Z"
    },
    {
      "original": "Russian Troops Repel Attack In Dobropillya, Make Gains In Dnepropetrovsk And Zaporozhye (Videos)\nThe Russian military repelled a Ukrainian counterattack in the Dobropillya salient in the Donetsk direction, and made more gains in the directions of Dnepropetrovsk and Zaporozhye by October 3.\nThe Ukrainian counterattack in the Dobropillya salient targeted Dorozhnye. It was spearheaded by two American-made Bradley infantry fighting vehicles. Both were damaged by landmines, then finished off by the Tsentr [Center] Group of Forces with drones.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284315Z"
    },
    {
      "original": "Russian Troops Repel Attack In Dobropillya, Make Gains In Dnepropetrovsk And Zaporozhye (Videos)\nThe Russian military repelled a Ukrainian counterattack in the Dobropillya salient in the Donetsk direction, and made more gains in the directions of Dnepropetrovsk and Zaporozhye by October 3.\nThe Ukrainian counterattack in the Dobropillya salient targeted Dorozhnye. It was spearheaded by two American-made Bradley infantry fighting vehicles. Both were damaged by landmines, then finished off by the Tsentr [Center] Group of Forces with drones.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284322Z"
    },
    {
      "original": "Venezuela Deploys Air Defenses As U.S. Strikes Fourth Drug Boat (Videos)\nUnited States Defense Secretary Pete Hegseth on October 3 announced a fourth “lethal, kinetic strike” on a boat in the Caribbean Sea, accusing the vessel of carrying drugs.\nIn another sign of nearing escalation, Venezuela said on October 2 that it had detected five U.S. fighter jets flying near its Caribbean coast.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284330Z"
    },
    {
      "original": "Venezuela Deploys Air Defenses As U.S. Strikes Fourth Drug Boat (Videos)\nUnited States Defense Secretary Pete Hegseth on October 3 announced a fourth “lethal, kinetic strike” on a boat in the Caribbean Sea, accusing the vessel of carrying drugs.\nIn another sign of nearing escalation, Venezuela said on October 2 that it had detected five U.S. fighter jets flying near its Caribbean coast.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284337Z"
    },
    {
      "original": "TOMAHAWKS FOR UKRAINE: A TECHNICAL BREAKTHROUGH OR A STRATEGIC RISK?",
      "timestamp": "2025-10-04T15:14:03.284341Z"
    },
    {
      "original": "Fighting For Key Defense Hubs: Russian Forces Increase Pressure Near Kupyansk And Seversk\nUkrainian forces are continuing to attempt a counterattack in Kupyansk. Meanwhile, south of Seversk, Russian assault troops have entered the village of Zvanovka. \nAt the same time, Russian sabotage groups are blocking supply routes near Konstantinovka. \nIn addition, mass protests against supplying weapons to Ukraine have taken place in Germany.\nRead more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284348Z"
    },
    {
      "original": "Drone Rain: Summary Of Russian Combat Footage From October 3, 2025\nSeveral videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online on October 3 and prior days.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-10-04T15:14:03.284356Z"
    },
    {
      "original": "Drone Rain: Summary Of Russian Combat Footage From October 3, 2025\nSeveral videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online on October 3 and prior days.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-10-04T15:14:03.284366Z"
    },
    {
      "original": "Trump Targeting Generals, Courting Domestic Turmoil: “War Against Enemies Within”\nQuantico’s historic event revealed a US President confronting his generals, demanding loyalty, and escalating rhetoric against internal “enemies,” fueling concern over domestic stability and US military cohesion.\nOn September 30, 2025, at Marine Corps Base Quantico in Virginia, an unusual scene unfolded — one that may signal the start of a deep military crisis in the United States. President Donald Trump, flanked by Defense Secretary Pete Hegseth, addressed nearly 800 generals, admirals, and senior enlisted advisors — summoned at short notice from global outposts, at considerable taxpayer expense, just as whispers of a government shutdown loomed. What was billed as an unusual military gathering quickly turned into a clash.\nHegseth, in a 45-minute tirade, lambasted “fat generals” and decried the Pentagon’s “decades of decay” under diversity initiatives, vowing an end to “dudes in dresses,”...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284376Z"
    },
    {
      "original": "Israeli Army Halts Gaza City Offensive After Hamas Decision To Accept Trump’s Peace Plan \nThe Israel Defense Forces (IDF) was ordered to halt its offensive to capture Gaza City on October 4, after United States President Donald Trump announced that his peace plan for the Strip was accepted by Hamas.\nTrump said late on October 3 that Hamas was “ready for a lasting PEACE” in the Strip after receiving the group’s positive response.\n“Israel must immediately stop the bombing of Gaza, so that we can get the hostages out safely and quickly!” Trump wrote on Truth Social.\nThe peace plan, announced by Trump on September 29, demands an immediate ceasefire, hostage release within 72 hours, and Hamas’s disarmament, with Israel withdrawing on several stages and Palestinian technocrats taking over under international oversight for up to five years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284385Z"
    },
    {
      "original": "Russian Army Pushes Forward Between Seversk And Liman (Videos)\nThe Russian military continued to advance between Seversk and Liman in the Donetsk direction by October 4, despite facing resistance from Kiev forces.\nVideo footage confirmed that the Yug [South] Group of Forces has taken over Fedorivka, located to the south of Fedorivka, although the capture of the settlement is yet to be officially announced by the Russian Ministry of Defense. Russian troops are likely still working to fully secure their new positions there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284393Z"
    },
    {
      "original": "Russian Army Pushes Forward Between Seversk And Liman (Videos)\nThe Russian military continued to advance between Seversk and Liman in the Donetsk direction by October 4, despite facing resistance from Kiev forces.\nVideo footage confirmed that the Yug [South] Group of Forces has taken over Fedorivka, located to the south of Fedorivka, although the capture of the settlement is yet to be officially announced by the Russian Ministry of Defense. Russian troops are likely still working to fully secure their new positions there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T15:14:03.284400Z"
    }
  ],
  "script_run_time": "2025-10-04T15:14:03.285104Z"
}