{
  "messages": [
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-23T19:22:04.737640Z"
    },
    {
      "original": "🛸\n Активність розвідувальних БпЛА на сході Дніпропетровщини! Залучено засоби для їх збиття.",
      "timestamp": "2025-11-23T19:22:04.737657Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини, повз Дергачі, курс південний.",
      "timestamp": "2025-11-23T19:22:04.737663Z"
    },
    {
      "original": "🛵\n БпЛА південніше Сум, курс південний.",
      "timestamp": "2025-11-23T19:22:04.737667Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, повз Люботин, курс південний.",
      "timestamp": "2025-11-23T19:22:04.737676Z"
    },
    {
      "original": "🛵\n БпЛА на заході Харківщини \n➡️\n курсом на Слобожанське.\n🛵\n БпЛА на сході Харківщини \n➡️\n курсом на Балаклію.\n🛵\n БпЛА на північному сході Полтавщини \n➡️\n курсом на Диканьку, Полтаву.",
      "timestamp": "2025-11-23T19:22:04.737688Z"
    },
    {
      "original": "🛵\n БпЛА на північному та південному сході Дніпропетровщини  \n➡️\n курсом на Павлоград.\n🛵\n Група БпЛА на південному сході Харківщини \n➡️\n курсом на Лозову.\n🛵\n БпЛА на сході Харківщини \n➡️\n курсом на Чугуїв.",
      "timestamp": "2025-11-23T19:22:04.737700Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Харківщини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-11-23T19:22:04.737706Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-23T19:22:04.737711Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпро із заходу!",
      "timestamp": "2025-11-23T19:22:04.737716Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-23T19:22:04.737720Z"
    },
    {
      "original": "🛵\n Група БпЛА на південному сході, в центрі Харківщини \n➡️\n курсом на Лозову.\n🛵\n БпЛА на північному та південному сході Дніпропетровщини  \n➡️\n курсом на Павлоград.\n🛵\n БпЛА з Луганщини \n➡️\n на Харківщину.",
      "timestamp": "2025-11-23T19:22:04.737732Z"
    },
    {
      "original": "⚠\nУВАГА\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-23T19:22:04.737740Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-23T19:22:04.737744Z"
    },
    {
      "original": "⚠\nУВАГА\n🛫\n Активність ворожої тактичної авіації на південно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-23T19:22:04.737752Z"
    },
    {
      "original": "🚀\nКАБи на Запорізьку область!",
      "timestamp": "2025-11-23T19:22:04.737756Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпро зі сходу!",
      "timestamp": "2025-11-23T19:22:04.737760Z"
    },
    {
      "original": "🛵\n БпЛА з Луганщини \n➡️\n на Харківщину.",
      "timestamp": "2025-11-23T19:22:04.737766Z"
    },
    {
      "original": "🛵\n БпЛА з Бєлгородської обл., рф  \n➡️\n на Харківщину.",
      "timestamp": "2025-11-23T19:22:04.737772Z"
    },
    {
      "original": "🛵\n БпЛА з Бєлгородської обл., рф  \n➡️\n на Харківщину.",
      "timestamp": "2025-11-23T19:22:04.737777Z"
    },
    {
      "original": "🛵\n БпЛА на Балаклію, Старий Салтів.",
      "timestamp": "2025-11-23T19:22:04.737782Z"
    },
    {
      "original": "Russian forces have captured the village of Nechaivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~126.\nTotal land area: ~0.62 km².",
      "timestamp": "2025-11-23T19:22:05.296464Z"
    },
    {
      "original": "Russian forces have captured the village of Radisne, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~164.\nTotal land area: ~1.03 km².",
      "timestamp": "2025-11-23T19:22:05.296477Z"
    },
    {
      "original": "Russian forces have captured the village of Nove Zaporizhzhya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~103.\nTotal land area: ~1.00 km².",
      "timestamp": "2025-11-23T19:22:05.296482Z"
    },
    {
      "original": "In the Lyman direction and on the northern flank of Siversk, Russian forces have made significant progress, advancing in important parts of the frontline.\nIn the southeast, after capturing Dronivka, Russian forces advanced to the southwest through the forests to Platonivka, quickly establishing control over the village. They then captured the adjacent treelines and are now trying to advance through the forests and break through the Ukrainian defence at Zakitne. Additionally, the Russians advanced west from their new positions on the northern bank of the Siverskyi Donets River, and captured additional positions in the forests further west.\nTo the northwest, Russian forces advanced further through the forests west of Yampil and reached the Lyman - Siversk Highway. They then broke into the southern houses of Yampil, allowing for the rest of the village to be cleared. Fighting is now taking place for the strongpoints south and southwest of Yampil in the area of the highway. \nFurther northwest, following earlier failed attacks, Russian assault groups once again entered the Masliakivka District of Lyman and consolidated in its eastern half. Clearing operations continue in the western part of the district, and unsuccessful attacks took place on the neighbouring Kommunal'nyy District.\n+ ~24.50 km² in favour of Russia.",
      "timestamp": "2025-11-23T19:22:05.296489Z"
    },
    {
      "original": "Russian forces have captured the village of Zelenyi Hai, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~68.\nTotal land area; ~1.03 km².",
      "timestamp": "2025-11-23T19:22:05.296494Z"
    },
    {
      "original": "Russian forces have captured the village of Vysoke, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~517.\nTotal land area: ~0.89 km².",
      "timestamp": "2025-11-23T19:22:05.296498Z"
    },
    {
      "original": "Russian forces advanced east of Rive (Rovnoye), as the Myrnograd pocket continues to collapse slowly.",
      "timestamp": "2025-11-23T19:22:05.296501Z"
    },
    {
      "original": "In case you haven't realised it yet, the Russian MOD claim that Russia captured Kupyansk is false... just like basically every other claim they make in this direction.",
      "timestamp": "2025-11-23T19:22:05.296505Z"
    },
    {
      "original": "In case you haven't realised it yet, the Russian MOD claim that Russia captured Kupyansk is false... just like basically every other claim they make in this direction.",
      "timestamp": "2025-11-23T19:22:05.296508Z"
    },
    {
      "original": "Pro-Russians criticising people for trusting certain sources while they blindly trust the Russian Ministry of Defence is wild. \nSeveral reliable Russian sources, along with geolocations from the MOD's own video contradict their claims.",
      "timestamp": "2025-11-23T19:22:05.296512Z"
    },
    {
      "original": "Ukraine General staff Pokrovsk map. \nFuck me I hope this isn't being used for anything other than propaganda, you would risk getting into contact 10km before you expect",
      "timestamp": "2025-11-23T19:22:05.296516Z"
    },
    {
      "original": "Russian forces have captured the city of Pokrovsk.\n22.11.25",
      "timestamp": "2025-11-23T19:22:05.296520Z"
    },
    {
      "original": "Russian forces have captured the city of Pokrovsk, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~60,127.\nTotal land area: ~30.60 km².",
      "timestamp": "2025-11-23T19:22:05.296524Z"
    },
    {
      "original": "Pokrovsk direction \n➡️\nDobropillya direction\nDobropillya direction \n➡️\nDruzhkivka direction",
      "timestamp": "2025-11-23T19:22:05.296535Z"
    },
    {
      "original": "\"its a trap\"",
      "timestamp": "2025-11-23T19:22:05.296538Z"
    },
    {
      "original": "Russian forces have captured the village of Ivanopillya, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~1,470.\nTotal land area: ~3.19 km².\nThe fighting for Ivanopillya lasted approximately 23 days.",
      "timestamp": "2025-11-23T19:22:05.296543Z"
    },
    {
      "original": "Russian forces have captured the village of Stavki, Lyman direction, Donetsk Oblast.\nPre-war population: ~803.\nTotal land area: ~1.34 km².\nThe fighting for Stavky lasted approximately 1 month, 9 days.",
      "timestamp": "2025-11-23T19:22:05.296548Z"
    },
    {
      "original": "Russian forces have captured the village of Zvanivka, southern flank of Siversk, Donetsk Oblast.\nPre-war population: ~1,430.\nTotal land area: ~2.65 km².\nThe fighting for Zvanivka lasted approximately 1 month, 8 days.",
      "timestamp": "2025-11-23T19:22:05.296553Z"
    },
    {
      "original": "Russian FAB glide-bombs continue to pound the encircled Ukrainian garrison in the city of Myrnohrad. \nThis video shows a FAB-3000 strike.",
      "timestamp": "2025-11-23T19:22:05.296557Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again targeted the town of Vasylkivka, Dnipropetrovsk Oblast. \nVasylkivka has come under attack from Gerans almost every day for the last two weeks. The town hosts a railway station, and is a key logistical hub for the Prosyana and Pokrovsk'e directions.",
      "timestamp": "2025-11-23T19:22:05.296564Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again targeted the town of Vasylkivka, Dnipropetrovsk Oblast. \nVasylkivka has come under attack from Gerans almost every day for the last two weeks. The town hosts a railway station, and is a key logistical hub for the Prosyana and Pokrovsk'e directions.",
      "timestamp": "2025-11-23T19:22:05.296568Z"
    },
    {
      "original": "Russian Army Advances West Of Pokrovsk, Increases Pressure On Siversk (Videos)\nOn November 22, the Russian military expanded its control to the west and southwest of Pokrovsk in Donetsk as it continued work to secure the city itself.\nThe Russian Ministry of Defense said in its daily briefing that the Tsentr [Center] Group of Forces, mainly the 2nd Army, is working to secure the Tsentralny and Gornyak microdistricts inside Pokrovsk, as well as in the western industrial area. Some Ukrainian troops are still trapped there.\nMeanwhile, a major push by the Tsentr Group of Forces was reported to the west of the city, mainly along the road leading to Myrnohrad, also known as Dimitrov.\nFurther away from Pokrovsk, to the east in Donetsk, the Russian MoD announced that the Yug [South] Group of Forces had captured Zvanovka, right to the south of the city of Siversk.\nRead more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858042Z"
    },
    {
      "original": "Russian Army Advances West Of Pokrovsk, Increases Pressure On Siversk (Videos)\nOn November 22, the Russian military expanded its control to the west and southwest of Pokrovsk in Donetsk as it continued work to secure the city itself.\nThe Russian Ministry of Defense said in its daily briefing that the Tsentr [Center] Group of Forces, mainly the 2nd Army, is working to secure the Tsentralny and Gornyak microdistricts inside Pokrovsk, as well as in the western industrial area. Some Ukrainian troops are still trapped there.\nMeanwhile, a major push by the Tsentr Group of Forces was reported to the west of the city, mainly along the road leading to Myrnohrad, also known as Dimitrov.\nFurther away from Pokrovsk, to the east in Donetsk, the Russian MoD announced that the Yug [South] Group of Forces had captured Zvanovka, right to the south of the city of Siversk.\nRead more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858060Z"
    },
    {
      "original": "TOS Strikes: Summary Of Russian Combat Footage From November 22, 2025\nOn November 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-23T19:22:05.858069Z"
    },
    {
      "original": "TOS Strikes: Summary Of Russian Combat Footage From November 22, 2025\nOn November 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-23T19:22:05.858079Z"
    },
    {
      "original": "Peace Deal at Risk: Kyiv, Backed by Europe, Challenges Washington's Authority\nAnother attempt by Trump to stop the conflict in Ukraine. Russia has agreed to the conditions proposed by the Americans. Zelensky addresses the nation, preparing Ukrainians for 'difficult decisions'.\nSince 21 November, leading Western media outlets have been reporting on new conditions proposed by the White House for Russia and Ukraine. US President Donald Trump is doing his utmost to maintain his image as a peacemaker. For him, freezing the Ukrainian conflict is an important milestone on the road to the Nobel Peace Prize. A 28-point agreement was presented to Ukraine and Russia, which, according to the White House, could end the conflict.\nRussian President Vladimir Putin lifted the veil of high diplomacy with the following statements:\n▫️\nWe are ready for peace talks, but this requires a substantive discussion of all the details of the proposed plan;\n▫️\nMoscow has the text of Trump’s settlement plan...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858092Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 23, 2025 (Map Update)",
      "timestamp": "2025-11-23T19:22:05.858096Z"
    },
    {
      "original": "Russian Troops' Advance on the Zaporizhzhia Front: Assault on Huliaipole Begins\nRussian armed forces report advances and the establishment of control over a number of settlements in Zaporizhzhia and Dnipropetrovsk regions. On the Zaporizhzhia axis, Russian units have captured the localities of Zelenyi Hai and, according to some reports, Vysoke. Information has also emerged about Russian forces reaching the outskirts of the key city of Huliaipole, where assault operations have begun.\nAssault operations in Huliaipole have been initiated from the northeast and southeast, from the directions of Rivnopillia and Marfopil. Furthermore, Russian troops are breaking through defensive strongpoints from the south, near Dorozhnyanka. Effectively, the active phase of the operation for Huliaipole has commenced.\n \nRead more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858104Z"
    },
    {
      "original": "Russian Troops' Advance on the Zaporizhzhia Front: Assault on Huliaipole Begins\nRussian armed forces report advances and the establishment of control over a number of settlements in Zaporizhzhia and Dnipropetrovsk regions. On the Zaporizhzhia axis, Russian units have captured the localities of Zelenyi Hai and, according to some reports, Vysoke. Information has also emerged about Russian forces reaching the outskirts of the key city of Huliaipole, where assault operations have begun.\nAssault operations in Huliaipole have been initiated from the northeast and southeast, from the directions of Rivnopillia and Marfopil. Furthermore, Russian troops are breaking through defensive strongpoints from the south, near Dorozhnyanka. Effectively, the active phase of the operation for Huliaipole has commenced.\n \nRead more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858112Z"
    },
    {
      "original": "Does Turkey Control What Is Happening In Syria?\nThe saga of the \"new Syria\" continues, with the jihadist regime proving every month that they have always been agents of American-Zionist imperialism, and the Turks continuing to naively believe that they are the \"winning\" side after the fall of the Assad government.\nThis time, the criminal Netanyahu spoke of new Zionist \"successes\" in Syria, revealing that “Israel” prevented the Turks from penetrating into the south and even central Syria. This raises the question once again: \"Has Turkey won in Syria?\" Erdogan, aware of the humiliation he suffered at the hands of Netanyahu, is trying to put a good face on a bad game, compensating for his failures through a policy of forced Turkification on Syrians in the Aleppo region and surrounding areas. Erdogan also needs this move to portray the capture of Aleppo by Devlet Bahçeli's pan-Turkists as a \"victory\" domestically. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858121Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-23T19:22:05.858125Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-23T19:22:05.858129Z"
    },
    {
      "original": "Polymarket Bets: Which Cities Could The Russian Army Capture In November And December?\nWhich cities have already had bids placed on Polymarket? Which cities could be captured as early as November? What awaits the Ukrainian market in December?\nBets on the capture of Ukrainian cities on Polymarket have become a popular form of entertainment in many countries. This section is called the Ukrainian Map. To understand the ongoing events, one doesn't need insider information; following our daily reports on the situation in Ukraine is enough. To make analysis easier, we are introducing a new column: \"Polymarket Bets,\" which summarizes information on the most interesting fronts.\nOne of our initial forecasts regarding the capture of Uspenovka was recently confirmed, and the market closed shortly after the article's publication.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858138Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858147Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-23T19:22:05.858156Z"
    }
  ],
  "script_run_time": "2025-11-23T19:22:05.858975Z"
}