{
  "messages": [
    {
      "original": "🛵\n Київщина - група БпЛА курсом на Гостомель.",
      "timestamp": "2025-12-17T04:54:44.933930Z"
    },
    {
      "original": "🚀\nКАБ на  Запоріжжі.",
      "timestamp": "2025-12-17T04:54:44.933948Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині \n➡️\n курсом на Улянівку.",
      "timestamp": "2025-12-17T04:54:44.933955Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщину з Сумщини.",
      "timestamp": "2025-12-17T04:54:44.933960Z"
    },
    {
      "original": "🛵\n БпЛА на межі Полтавщини та Сумщини \n➡️\n курсом на Харківщину.",
      "timestamp": "2025-12-17T04:54:44.933966Z"
    },
    {
      "original": "🛵\n Група БпЛА на Дніпропетровщину з Харківщини.",
      "timestamp": "2025-12-17T04:54:44.933971Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n південним курсом.",
      "timestamp": "2025-12-17T04:54:44.933977Z"
    },
    {
      "original": "🛵\nнова група БпЛА на Сумщині \n➡️\n західним курсом.\n🛵\n БпЛА наПолтавщині \n➡️\n курсом на Черкащину.",
      "timestamp": "2025-12-17T04:54:44.933985Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччину з Харківщини.",
      "timestamp": "2025-12-17T04:54:44.933990Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині \n➡️\n курсом на Полтавщину.\n🛵\n БпЛА на Полтавщині \n➡️\n курсом на південь.\n🛵\n БпЛА на Черкащині \n➡️\n курсом на Кіровоградщину.",
      "timestamp": "2025-12-17T04:54:44.934002Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині \n➡️\n курсом на Полтавщину.\n🛵\n БпЛА на Полтавщині \n➡️\n курсом на південь.\n🛵\n БпЛА на Кіровоградщині \n➡️\n курсом на південь.",
      "timestamp": "2025-12-17T04:54:44.934013Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Південне/Чорноморське з Чорного моря.",
      "timestamp": "2025-12-17T04:54:44.934018Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Миколаїв з півночі.",
      "timestamp": "2025-12-17T04:54:44.934023Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на сході Сумщини курсом на захід та південь.",
      "timestamp": "2025-12-17T04:54:44.934031Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Миколаїв з південного-сходу.",
      "timestamp": "2025-12-17T04:54:44.934037Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/Дніпропетровщину.",
      "timestamp": "2025-12-17T04:54:44.934042Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-17T04:54:44.934046Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщині/Донеччині/Запоріжжі.",
      "timestamp": "2025-12-17T04:54:44.934052Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Запоріжжя зі сходу;\n🛵\n БпЛА у напрямку Затоки/Чорноморська з Чорного моря;\n🛵\nБпЛА на сході Сумщини у напрямку Харківщини.",
      "timestamp": "2025-12-17T04:54:44.934060Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Харкова з північного-сходу.",
      "timestamp": "2025-12-17T04:54:44.934071Z"
    },
    {
      "original": "Odesa Oblast came under attack for the fifth night in a row. \nAt least 15 Geran-2 drones attacked targets in the southern suburbs of Odesa City, in the area of Sarata, and in Zatoka. A significant portion of the drones were shot down, especially over Odesa City, due to the format they were flying in (one after another). \nA large fire was seen burning at an impact site in Zatoka, as seen in the attached video.",
      "timestamp": "2025-12-17T04:54:45.542626Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continue to advance and have made additional progress on the tactical heights.\nIn the east, Russian forces resumed their assault operations east of Oleksiivka, advancing down two treelines along the tactical heights, strengthening their western flank against the stronger Ukrainian defences near Varachyne. Ukrainian forces are trying to counterattack, and have also attempted to enter Oleksiivka, but so far have achieved no successes.\nIn the west, Russian forces continued to slowly advance around Andriivka. As a part of their intensified assault operations, they were able to approach the village from the northwest, capturing the rest of the gulley east of Kindrativka. Other forces then secured the northern outskirts of Andriivka and entered the northern houses of the village but were unable to consolidate and quickly withdrew due to Ukrainian drone and artillery strikes. Ukrainian forces also carried out additional unsuccessful counterattacks in Andriivka. Meanwhile, Russian artillery fire has intensified on both frontline and rear positions, significantly complicating Ukrainian logistics and their efforts at counterattacking. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-12-17T04:54:45.542641Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their assault operations and have made additional progress over the last week.\nIn the southwest, Russian forces continued pushing south through Lyman and reached the southern outskirts of the village. Other forces captured its eastern street, therefore completing the capture of the village. They also made additional progress in the forest to the west and captured new positions in the treelines to the east.\nTo the east, Russian forces continued to push through Vilcha, amid very heavy fighting. They were able to consolidate in the northeastern part of the town following earlier attacks and began a southward push through its eastern streets. As a result, they were able to outflank the town centre, allowing for the stronger Ukrainian positions there to be captured from three directions. From there, the Russians continued pushing towards the southern outskirts, capturing additional positions in the southern and eastern streets. Additionally, Russian forces advanced to the northeast of Vilcha, improving their positions along the highway to Vovchansk and capturing new positions in two different treelines east of the railway line.\nIn the northeast, following earlier attacks, Russian forces managed to cross a tributary of the Vovcha River from the southeastern edge of Vovchansk and entered the neighbouring village of Vovchanski-Khutory. They consolidated in the western houses in the area of Mryu Street and are now engaged in fierce battles for the western approaches to the industrial zone. \n+ ~8.03 km² in favour of Russia.",
      "timestamp": "2025-12-17T04:54:45.542649Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to incrementally advance over the last week and have made additional progress in the direction of Khanje and Ambarne.\nRussian forces advanced from their positions in the forest plantations on the western side of the gulley and captured new positions in the treelines and forest plantations further west, pushing the Ukrainians back to the eastern approaches to Khatnje. They were also able to improve their positions northwest of Ambarne, capturing the rest of the forest plantations on the northern edge of the gulley outside the village.\n+ ~2.44 km² in favour of Russia.",
      "timestamp": "2025-12-17T04:54:45.542654Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces continue to advance on different sides of the Oskil River, making important progress in various areas.\nIn the east, Russian forces consolidated in the northwestern-most houses of Petropavlivka following the Ukrainian withdrawal from the Synkivka area. From there, they began pushing southeast along the southern bank of the Hnylytsya River, capturing additional positions in the forests and reaching the northern outskirts of Kucherivka. Other forces captured the fish farm to the west, securing most of the remaining positions in the forests outside Kupyansk. \nIn the southwest, Ukrainian forces continued advancing in southwestern Kupyansk. They consolidated in additional positions in the low-rise residential area southeast of the Yuvileynyi high-rise micro-district. They also captured the rest of the houses north of Yuvileynyi. Additionally, the Ukrainians began a new push north up the western bank of the Oskil River, reaching the central market from the south. \nTo the north, Ukrainian forces entered the territory of the City Central Hospital, capturing part of it along with the adjacent residential streets. Fierce fighting is ongoing for the main hospital building and the surrounding areas. They also managed to capture the Russian strongpoint at the bread factory and the substation in northwestern Kupyansk, as well as additional residential areas to the southeast. Additionally, the Ukrainians began advancing south down the eastern bank of the Oskil River in northern Kupyansk, capturing new positions in the low-rise residential streets there, while other assault groups pushed further south through the city centre in the direction of School No. 4. \nFurther north, Ukrainian forces managed to clear Russian positions in most of the forests southeast and northeast of Radkivka, including the pipeline exit point that the Russians previously used to infiltrate the city and bring in supplies. They also advanced west from Kindrashivka, recapturing positions in the treelines and forested areas there.\n+ ~6.26 km² in favour of Russia. \n+ ~3.01 km² in favour of Ukraine.",
      "timestamp": "2025-12-17T04:54:45.542662Z"
    },
    {
      "original": "A Tu-22m3 strategic bomber is airborne from Diaghilev Airbase, Ryazan Oblast, flying towards its launch lines in the Black Sea.",
      "timestamp": "2025-12-17T04:54:45.542666Z"
    },
    {
      "original": "A Tu-22m3 strategic bomber is airborne from Diaghilev Airbase, Ryazan Oblast, flying towards its launch lines in the Black Sea.",
      "timestamp": "2025-12-17T04:54:45.542670Z"
    },
    {
      "original": "A second Tu-22m3 is airborne. Both are flying towards the Sea of Azov.",
      "timestamp": "2025-12-17T04:54:45.542673Z"
    },
    {
      "original": "A second Tu-22m3 is airborne. Both are flying towards the Sea of Azov.",
      "timestamp": "2025-12-17T04:54:45.542676Z"
    },
    {
      "original": "Its possible that they are flying to Mozdok Airbase, North Ossetia to be equipped with Kh-22/32 cruise missiles.",
      "timestamp": "2025-12-17T04:54:45.542680Z"
    },
    {
      "original": "Correction: 4 Tu-22m3s are now airborne.",
      "timestamp": "2025-12-17T04:54:45.542683Z"
    },
    {
      "original": "A MiG-31K is airborne over the eastern Black Sea. \nIt is likely carrying out a training mission with the 4 Tu-22m3 bombers. \nNo threat to Ukraine.",
      "timestamp": "2025-12-17T04:54:45.542689Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their assault operations and are advancing at an accelerated pace.\nIn the south, Russian forces have been carrying out a series of assault operations over the past week aimed at eliminating the Ukrainian salient south of Hulyaipole. They were able to advance north from the area of Dorozhnyanka, capturing positions in 7 different treelines on the tactical heights that have held for more than 3.5 years.\nTo the north, Russian forces continued advancing in eastern Hulyaipole and captured the local university and additional positions in the low-rise residential streets. They also improved their positions to the southeast, capturing additional treeline positions. From there, the Russians broke through Ukrainian positions in the southernmost part of the city, capturing an agricultural complex and nearby streets, and reaching Hoholya Street, where they established control over multiple low-rise residential blocks. \nTo the northwest, following earlier infiltrations, Russian soldiers managed to consolidate their bridgehead over the Haichur River on Travnya Street in northwestern Hulyaipole. They also captured additional positions in the treelines and orchards to the north, reaching the southern outskirts of Varvarivka.\n+ ~15.35 km² in favour of Russia.",
      "timestamp": "2025-12-17T04:54:45.542695Z"
    },
    {
      "original": "Google search trends for Kupyansk, Hulyaipole, and Myrnohrad over the last 90 days.\nThis speaks numbers...\nEdit: apparently I misclicked and didn’t select Myrnohrad as a search term, which skewed the results.",
      "timestamp": "2025-12-17T04:54:45.542701Z"
    },
    {
      "original": "Google search trends for Kupyansk, Hulyaipole, and Myrnohrad over the last 90 days.  This speaks numbers...  Edit: apparently I misclicked and didn’t select Myrnohrad as a search term, which skewed the results.",
      "timestamp": "2025-12-17T04:54:45.542704Z"
    },
    {
      "original": "The fact that no one cares about the hundreds of Ukrainian soldiers abandoned by the Ukrainian command in Myrnohrad is just depressing, and goes to show how effective Ukraine's information effort has been.",
      "timestamp": "2025-12-17T04:54:45.542711Z"
    },
    {
      "original": "The next large-scale, combined Russian missile and drone attack will probably take place tomorrow morning, between 00:00 and 08:00 Kyiv time.   It won't be anything special - just another normal-sized attack involving strategic bombers, ballistic missiles…",
      "timestamp": "2025-12-17T04:54:45.542715Z"
    },
    {
      "original": "There will be no missile attack tonight as satellite imagery reveals that the 3 Tu-160s did not in fact redeploy to Belaya Airbase and instead carried out a training mission. \nPreparations are ongoing, but are almost complete. There will likely be something in the next couple of days.",
      "timestamp": "2025-12-17T04:54:45.542719Z"
    },
    {
      "original": "A MiG-31K is airborne over the eastern Black Sea.   It is likely carrying out a training mission with the 4 Tu-22m3 bombers.   No threat to Ukraine.",
      "timestamp": "2025-12-17T04:54:45.542722Z"
    },
    {
      "original": "Footage published by the Russian MOD of yesterday's long-range training carried out by Tu-22m3 strategic bombers shows that at least one of them is equipped with a Kh-32 cruise missile. \nThe training was carried out by 4 Tu-22m3 bombers, 1 MiG-31K fighter, 1 IL-78M tanker, and Su-35S + Su-27 fighters.",
      "timestamp": "2025-12-17T04:54:45.542726Z"
    },
    {
      "original": "Footage published by the Russian MOD of yesterday's long-range training carried out by Tu-22m3 strategic bombers shows that at least one of them is equipped with a Kh-32 cruise missile. \nThe training was carried out by 4 Tu-22m3 bombers, 1 MiG-31K fighter, 1 IL-78M tanker, and Su-35S + Su-27 fighters.",
      "timestamp": "2025-12-17T04:54:45.542732Z"
    },
    {
      "original": "High-quality satellite imagery from Novorossiysk Naval Base shows that the Ukrainian underwater drone missed the Varshavyanka-class Submarine, detonating against the pier. Any damage to the vessel is likely minimal.",
      "timestamp": "2025-12-17T04:54:45.542736Z"
    },
    {
      "original": "Last night, around 20 Russian Geran-2 drones attacked a warehouse complex in the village of Novi Petrivtsi, Kyiv Oblast.\nCoordinates: 50.61762, 30.43356",
      "timestamp": "2025-12-17T04:54:45.542740Z"
    },
    {
      "original": "Last night, around 20 Russian Geran-2 drones attacked a warehouse complex in the village of Novi Petrivtsi, Kyiv Oblast.\nCoordinates: 50.61762, 30.43356",
      "timestamp": "2025-12-17T04:54:45.542744Z"
    },
    {
      "original": "Mobilization In Ukraine: Growing Resistance And The Chasm Between Rhetoric And Reality\nDespite repeated official denials dismissing viral videos of forced mobilization as fakes, evidence of popular resistance in Ukraine is becoming increasingly widespread and radical. This is manifested in a growing number of incidents where desperate individuals resort to physically attacking TRC employees. For example, in the Lviv region, a man assaulted a recruitment officer with a hatchet, leaving the victim hospitalized.\nA recent high-profile event was the killing of a TRC employee in Mykolaiv. Reportedly, residents lured him out of his home and shot him. Such acts of revenge have begun to occur on a larger scale, though typically covertly, without witnesses, and authorities try not to publicize them.\nIn Poltava, after TRC officers pursued a man into a side street, they walked into a pre-arranged ambush. The attack reportedly resulted in three recruiters killed...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137267Z"
    },
    {
      "original": "Mobilization In Ukraine: Growing Resistance And The Chasm Between Rhetoric And Reality\nDespite repeated official denials dismissing viral videos of forced mobilization as fakes, evidence of popular resistance in Ukraine is becoming increasingly widespread and radical. This is manifested in a growing number of incidents where desperate individuals resort to physically attacking TRC employees. For example, in the Lviv region, a man assaulted a recruitment officer with a hatchet, leaving the victim hospitalized.\nA recent high-profile event was the killing of a TRC employee in Mykolaiv. Reportedly, residents lured him out of his home and shot him. Such acts of revenge have begun to occur on a larger scale, though typically covertly, without witnesses, and authorities try not to publicize them.\nIn Poltava, after TRC officers pursued a man into a side street, they walked into a pre-arranged ambush. The attack reportedly resulted in three recruiters killed...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137289Z"
    },
    {
      "original": "U.S. Accepted Israeli Red Lines On Syria\nUnited States envoy to Syria Tom Barrack and Israeli Prime Minister Benjamin Netanyahu reached several understandings with regard to Syria during a meeting on December 15, the Jerusalem Post reported.\nNetanyahu met Barrack in his Jerusalem office alongside Foreign Minister Gideon Sa’ar, acting National Security Adviser Gil Reich, Military Secretary Maj. Gen. Roman Gofman, and Ambassador to Washington Yechiel Leiter.\nThe talks were not limited to Syria. The situation in Lebanon, Turkey’s influence in the region and normalization with Saudi Arabia were also discussed.\nAccording to the Jerusalem Post, Barrack and Netanyahu agreed during the meeting on Israel’s \"freedom of operation\" in Syria, while also continuing efforts to reach a \"security deal\" with the country’s Islamist-led Interim Government.\nRead more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137300Z"
    },
    {
      "original": "Military Situation In Ukraine On December 16, 2025 (Maps Update)",
      "timestamp": "2025-12-17T04:54:46.137304Z"
    },
    {
      "original": "Military Situation In Ukraine On December 16, 2025 (Maps Update)",
      "timestamp": "2025-12-17T04:54:46.137308Z"
    },
    {
      "original": "Russian Army Approaches Borova, Makes Gains Around Vovchansk (Videos)\nOn December 16, the Russian military moved closer to Borova by capturing an important settlement nearby, all while expanding its control around Vovchansk to the north in Kharkiv.\nThe capture of Novoplatonovka, located right to the north of Borova, by the Zapad [West] Group of Forces was announced by the Russian Ministry of Defense.\nTo the north in Kharkiv, the Sever [North] Group of Forces expanded its control around Vovchansk in three different directions.\nRead more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137317Z"
    },
    {
      "original": "Russian Army Approaches Borova, Makes Gains Around Vovchansk (Videos)\nOn December 16, the Russian military moved closer to Borova by capturing an important settlement nearby, all while expanding its control around Vovchansk to the north in Kharkiv.\nThe capture of Novoplatonovka, located right to the north of Borova, by the Zapad [West] Group of Forces was announced by the Russian Ministry of Defense.\nTo the north in Kharkiv, the Sever [North] Group of Forces expanded its control around Vovchansk in three different directions.\nRead more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137325Z"
    },
    {
      "original": "A DECISIVE MOMENT: THE BATTLES THAT COULD DEFINE THE NEXT PHASE OF THE CONFLICT IN UKRAINE",
      "timestamp": "2025-12-17T04:54:46.137329Z"
    },
    {
      "original": "Systematic Russian Offensive In Kharkiv: Ukraine Loses Ground Near Melovoye And Vilcha\nIn the Siversk area, Russian forces have begun clearing the northern flank, which includes Mine No. 6. In the Kharkiv sector, the Russian army has made substantial advances in the Melovoye and Vilcha areas. In the Konstantynivka area, Russian forces have reached the outskirts of Stepanivka. \nThe U.S. has given Kyiv a tight deadline to accept the proposed security guarantees.\nRead more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137337Z"
    },
    {
      "original": "Systematic Russian Offensive In Kharkiv: Ukraine Loses Ground Near Melovoye And Vilcha\nIn the Siversk area, Russian forces have begun clearing the northern flank, which includes Mine No. 6. In the Kharkiv sector, the Russian army has made substantial advances in the Melovoye and Vilcha areas. In the Konstantynivka area, Russian forces have reached the outskirts of Stepanivka. \nThe U.S. has given Kyiv a tight deadline to accept the proposed security guarantees.\nRead more \nHERE",
      "timestamp": "2025-12-17T04:54:46.137344Z"
    }
  ],
  "script_run_time": "2025-12-17T04:54:46.138503Z"
}