{
  "messages": [
    {
      "original": "🛵\n Ворожі БпЛА із Запоріжжя на Дніпропетровщину, вектор руху Дніпро/Павлоград.",
      "timestamp": "2026-01-18T19:38:28.675295Z"
    },
    {
      "original": "🛵\n🛸\n Чернігівщина, ворожі БпЛА в р-ні. Сновська/Корюківки, ймовірно, розвідувальні.",
      "timestamp": "2026-01-18T19:38:28.675313Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Вільнянськ (Запоріжжя).",
      "timestamp": "2026-01-18T19:38:28.675318Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/схід Дніпропетровщини.",
      "timestamp": "2026-01-18T19:38:28.675323Z"
    },
    {
      "original": "🛵\n🛸\n Харківщина: БпЛА на Барвінкове з півдня.",
      "timestamp": "2026-01-18T19:38:28.675328Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Вільнянськ (Запоріжжя) з північного заходу.",
      "timestamp": "2026-01-18T19:38:28.675332Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-18T19:38:28.675337Z"
    },
    {
      "original": "🛵\n🛸\n Чернігівщина: БпЛА на заході від н.п.Холми, курс - західний.",
      "timestamp": "2026-01-18T19:38:28.675345Z"
    },
    {
      "original": "🛸\n Північ Чернігівщини (н.п. Городня) - розвідувальний БпЛА, курс південний.",
      "timestamp": "2026-01-18T19:38:28.675350Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Сум з північного сходу.",
      "timestamp": "2026-01-18T19:38:28.675356Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Миколаївщині на заході від Снігурівки, курс - північно-західний.\n   Залучено засоби для збиття.",
      "timestamp": "2026-01-18T19:38:28.675363Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-18T19:38:28.675371Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/схід Дніпропетровщини.",
      "timestamp": "2026-01-18T19:38:28.675375Z"
    },
    {
      "original": "⚠\n Увага! \n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-18T19:38:28.675382Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2026-01-18T19:38:28.675387Z"
    },
    {
      "original": "🛵\n🛸\n Чернігівщина: \n- БпЛА в напрямку н.п.Новгород-Сіверський з півночі, курс - південний,\n- БпЛА в напрямку н.п.Холми із заходу\n- розвідувальний БпЛА на північному заході від н.п.Городня, курс - південно-західний;\n🛵\n🛸\n Сумщина:\n- БпЛА в напрямку н.п.Вороніж/Шостка з південного сходу,\n- БпЛА в напрямку н.п.Краснопілля з півдня.",
      "timestamp": "2026-01-18T19:38:28.675398Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на півночі Запорізької області, курс - західний/південно-західний;\n🛵\n🛸\n БпЛА на Дніпропетровщині в напрямку н.п.Кам'янське з південного заходу.",
      "timestamp": "2026-01-18T19:38:28.675408Z"
    },
    {
      "original": "🚀\nШвидкісна ціль в напрямку Харкова з півночі.",
      "timestamp": "2026-01-18T19:38:28.675414Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-18T19:38:28.675419Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Сум з півночі.",
      "timestamp": "2026-01-18T19:38:28.675424Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного напрямку.",
      "timestamp": "2026-01-18T19:38:28.675428Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continue to advance on a wide front from Sviato-Pokrovske to Markove, further developing their offensive. \nIn the northeast, Russian forces fully secured the western face of the gulley that leads southwest from Riznykivka, capturing positions in the forest plantations there, and consolidated in the eastern part of the large forest to the southwest. They also captured additional positions on the tactical heights overlooking the forest.\nTo the southwest, following earlier infiltrations, Russian forces consolidated in the first houses of Nykyforivka. Attacks are continuing, aimed at expanding their foothold. \nFurther southwest, the Russians captured the central and northeastern parts of Minkivka and improved their positions the southern and southwestern parts, while other forces secured new treeline positions to the south and advanced further northwest up the windbreaks on either side of the Siverskyi Donets Canal. Additionally, they captured further treeline positions southwest of Novomarkove and entered the eastern part of Markove which is now practically entirely in the grey-zone. \n+ ~8.63 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T19:38:29.287172Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on an enterprise near Starokostyantyniv, Khmelnytskyi Oblast. \nOvernight, additional strikes were also carried out in the vicinity of Khmelnytskyi city, as well as on energy infrastructure in Vinnytsia Oblast.",
      "timestamp": "2026-01-18T19:38:29.287184Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on an enterprise near Starokostyantyniv, Khmelnytskyi Oblast. \nOvernight, additional strikes were also carried out in the vicinity of Khmelnytskyi city, as well as on energy infrastructure in Vinnytsia Oblast.",
      "timestamp": "2026-01-18T19:38:29.287189Z"
    },
    {
      "original": "⚡\n🇸🇾\n🇸🇾\n Here is the approximate situation in Syria this morning. Through the night the Syrian Army has established several bridgeheads over the Euphrates. While advances were modest in the region of Raqqa, the situation in Deir ez-Zor changed dramatically. \nThe lightning advance of the Syrian Army and local uprising make it difficult to assess the reality on the ground. This map aims to stay conservative.\n@wfwitness",
      "timestamp": "2026-01-18T19:38:29.287199Z"
    },
    {
      "original": "⚡️\n🇸🇾\n🇸🇾\n🇸🇾\n Bedouin tribes supported by the Damascus government forces are arriving at the outskirts of Raqqa city from the western side.\nThe Bedouin tribes and the Damascus government have also controled the Mashlab checkpoint east of Raqqa city.\nThe forces have started their initial entry into Raqqa city from the eastern side.\n@wfwitness",
      "timestamp": "2026-01-18T19:38:29.287209Z"
    },
    {
      "original": "Raqqa city witnessed clashes between SDF and tribal militants. \n@KurdishFrontNews",
      "timestamp": "2026-01-18T19:38:29.287213Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance along the southern bank of the Siverskyi Donets River.\nAfter securing the central part of Zakitne, Russian forces began the assault on the western part of the village. They were able to capture additional positions in the houses up to the church and carried out infiltrations into the grey-zone beyond that. \nUkrainian forces, who have received new reinforcements, deployed into the western streets, where both Russian and Ukrainian positions are now mixed and overlapping. Ukrainian assault groups are also carrying out counterattacks on the Russian foothold on the tactical heights south of Zakitne, trying to dislodge them from a strongpoint there.\n+ ~0.39 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T19:38:29.287221Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks and have made new progress in three different areas.\nIn the southeast, Ukrainian forces recaptured the trench strongpoints at the destroyed highway overpass southwest of Stepova Novosilka, as well as additional trenches down the highway to the southeast.\nTo the northwest, the Ukrainians cleared out the southern part of Podoly from Russian DRGs and pushed the Russians out of the eastern part of the village. \nClearing operations also continued in central Kupyansk, with Ukrainian forces establishing control over the Kupyansk City-District Employment Centre and a number of other enterprises west of the highway.  Ukrainian counterattacks are also being carried out in the area of Radkivka, northwest of Kupyansk. \n+ ~7.68 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T19:38:29.287228Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their offensive down the eastern bank of the Siverskyi Donets River and have made progress in two different areas.\nIn the west, Russian forces cleared the remaining positions in the forests northeast of Hrafske and began the assault on the village. Other assault groups advanced from the area of the Hrafske - Lyman Road, capturing positions in the forests east of Hrafske and scattering infantry throughout the village, which now lies mostly in the grey-zone. \nIn the east, Russian forces continued their renewed assault operations southwest of Vilcha and captured the rest of the forests southeast of Lyman. From there, they were able to entrench in the northeastern houses of Symynivka and began infiltrating further south. Other assault groups improved their positions in the forests south of Lyman and entrenched in the northwestern houses of Symynivka, from which they are also infiltrating further south.\n+ ~3.15 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T19:38:29.287235Z"
    },
    {
      "original": "In the Myropillya direction, Russian forces continued their assault operations in the area of the international border and have advanced in two different areas.\nIn the northwest, Russian forces restarted their assault operations from the east through the forests in the direction of Sadky, in conjunction with previous attacks carried out from the north. As a result, Russian forces captured a large forest and have entered additional forested areas further west. \nTo the south, Russian forces began attacking across the international border in the direction of Mohrytsya and captured positions in the forest plantations there. \nIn the southeast, Russian forces continued their assault operations in the direction of Oleksandriya, however these attacks were repelled. They also carried out attacks across the international border from Kucherov in the direction of the nearby gulley, infiltrating the forest plantations there. \n+ ~6.56 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T19:38:29.287243Z"
    },
    {
      "original": "The Syrian Government and the SDF have reached an agreement to end hostilities, amid the lightning STG government offensive. \n- A ceasefire will be implemented across all fronts, effective immediately.\n- Syrian government will gain full military and civil control over Deir ez-zor and Raqqa.\n- All civilian institutions in Al-Hasakah will be integrated into the Syrian state administrative structures, and a governor will be appointed for the region.\n- Control of all border crossings, ISIS prisons/camps, oil fields and gas fields will be transferred to the Syrian governoment. \n- A full integration of all SDF military and security personnel into the Syrian Government will take place, except for those who previously served in the SAA under Assad.\n- The Syrian Ministry of Interior will form a local security and police force to replace heavy military presence in Ain al-Arab (Kobani).\n- SDF-nominated candidates will be adopted by the Syrian Government for senior military, security and civil posts.\n- Kurdish cultural and linguistic rights will be recognised.\n- All non-Syrian PKK members will be removed from Syrian territory.\n- The Syrian government will continue operations against ISIS with the help of the U.S. and the International Coalition.\n- Work will take place aimed at allowing the safe return of residents to former SDF-controlled parts of Aleppo.",
      "timestamp": "2026-01-18T19:38:29.287254Z"
    },
    {
      "original": "The Syrian Government and the SDF have reached an agreement to end hostilities, amid the lightning STG government offensive.   - A ceasefire will be implemented across all fronts, effective immediately.  - Syrian government will gain full military and civil…",
      "timestamp": "2026-01-18T19:38:29.287262Z"
    },
    {
      "original": "With the issue of northeastern Syria seemingly solved, all eyes are now on Suweida Governorate in southern Syria, most of which is still controlled by the Druze group \"Suweida Military Council\" (SMC). \nThere's a strong possibility of a new STG offensive on the region and city, similar to that of July 2025.",
      "timestamp": "2026-01-18T19:38:29.287266Z"
    },
    {
      "original": "New high-resolution satellite imagery of Donetsk International Airport shows continued expansion of Russia's Geran-2 drone launch point there.\n3 new static launch pads have been installed in the last month, bringing the total number of launchers there to 7. \nThe number of open garages for storing drones remains unchanged at 93, 81 of which have a capacity of 2 drones and 12 of which have a capacity of 1 drone. This means that the total number of drones that can be stored, not including larger storage facilities, is 174.\nAdditionally, one of the newly installed launch pads is capable of launching Geran-4 and Geran-5 jet drones, which have already been used to attack targets near Kryvyi Rih, Dnipropetrovsk Oblast. \nImage credit: \n@StrategicaviationT\n.",
      "timestamp": "2026-01-18T19:38:29.287274Z"
    },
    {
      "original": "New high-resolution satellite imagery of Donetsk International Airport shows continued expansion of Russia's Geran-2 drone launch point there.\n3 new static launch pads have been installed in the last month, bringing the total number of launchers there to 7. \nThe number of open garages for storing drones remains unchanged at 93, 81 of which have a capacity of 2 drones and 12 of which have a capacity of 1 drone. This means that the total number of drones that can be stored, not including larger storage facilities, is 174.\nAdditionally, one of the newly installed launch pads is capable of launching Geran-4 and Geran-5 jet drones, which have already been used to attack targets near Kryvyi Rih, Dnipropetrovsk Oblast. \nImage credit: \n@StrategicaviationT\n.",
      "timestamp": "2026-01-18T19:38:29.287281Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. I also have Signal if you prefer that.",
      "timestamp": "2026-01-18T19:38:29.287287Z"
    },
    {
      "original": "⚡️\n🇸🇾\n🇸🇾\n🏴\n🇸🇾\n🌟\n A mixture of ISIS and tribal forces attempted to infiltrate the town of Doma in Eastern Swaida Governorate.\nSwaida's National Guard successfully repelled the attack thanks to surveillance equipment which detected the fighters approaching.\n@wfwitness",
      "timestamp": "2026-01-18T19:38:29.287298Z"
    },
    {
      "original": "🇸🇾\n📞\n🇮🇱\n \n— General Commander of the YPG Sipan Hamo: \nIsrael is a powerful state in the region, and we hope that the stance it has taken to protect the Druze will also be extended to include the Kurds.",
      "timestamp": "2026-01-18T19:38:29.287306Z"
    },
    {
      "original": "🇸🇾\n📞\n🇮🇱\n — General Commander of the YPG Sipan Hamo:  Israel is a powerful state in the region, and we hope that the stance it has taken to protect the Druze will also be extended to include the Kurds.",
      "timestamp": "2026-01-18T19:38:29.287313Z"
    },
    {
      "original": "Who could've seen that coming \n😁",
      "timestamp": "2026-01-18T19:38:29.287317Z"
    },
    {
      "original": "The U.S. is getting a lot of wins in the Middle East right now...\n- They abandoned the SDF in favour of a stronger, more stable STG, who can now control and administer oil and gas fields, and further counter Iranian influence in the region.\n- Because of this agreement with the SDF, the STG will likely go after Druze factions in Suweida next, namely the SMC, which will prevent the STG from normalising ties with Israel, providing Israel with \"justification\" to keep expanding their \"buffer zone\", further strengthening their influence and weakening STG potential.\n- The more \"extreme\" Kurdish groups opposed to the agreement with the STG may also turn to Israel, seeking SMC-like relations and support, providing Israel with additional \"justification\" to stay at odds with the STG, thereby preventing them from getting too strong and keeping them loyal to the US.\n- And all the while, the U.S. can continue their efforts at dismantling the Iranian regime, which could end through additional military operations. \nEssentially, a more complex and proxy-based version of \"divide and rule\". The next few months will be very interesting.",
      "timestamp": "2026-01-18T19:38:29.287324Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936195Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936213Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-18T19:38:29.936221Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-18T19:38:29.936228Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936237Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936246Z"
    },
    {
      "original": "NATO's Greenland Theatrics And Arctic Expansionism\nA perceived \"fight\" between NATO allies would shift attention and allow further militarization without officially focusing on Russia and China. Thus, there's certainly a possibility that the entire Greenland \"fight\" between the US and EU/NATO is nothing more than an elaborate (albeit crawling) scheme to improve the political West's strategic position in the ongoing race for the Arctic.\nThe Trump administration's threat to \"take Greenland\" (in effect, to invade Denmark, a fellow NATO member state) came as a total shock, especially to those who refuse to acknowledge that the strength of the political West is slowly degenerating into a mere shadow of its former self. Speaking of which, several EU/NATO armies proved that point, as well as the fact that they simply cannot survive without US assistance. And yet, on January 15, several European NATO member states sent their troops to Greenland, all in \"support of Denmark\". Numerous media outlets reported that a Danish US-made C-130 military transport aircraft landed overnight in Nuuk, Greenland's capital, carrying Danish and French soldiers.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936255Z"
    },
    {
      "original": "Family Over Flag: Ukrainian Soldier on Motives for Surrender\nPrivate Alexander Sotnikov of the 25th Airborne Brigade\n of the Ukrainian Armed Forces was captured after his group—relying on faulty intelligence—entered a house near Dimitrov (Mirnograd) occupied by Russian troops. In an interview following his capture, he described his forcible mobilization despite a documented deferment, and the grueling six-day march to the front. His remarks underscore challenges in forced conscription: a lack of personal motivation and a sense that the state has failed its citizens. For him, family comes first—not flags or ideologies.\n\"The problem is we don't want to be mobilized. If I were a contract soldier or some great patriot, that would be different. I'm a patriot of my family, not of anyone else. Yes, I'm a citizen of Ukraine, but it gave me nothing. What flag... I slaved away 12 hours a day at the furnace.\"",
      "timestamp": "2026-01-18T19:38:29.936261Z"
    },
    {
      "original": "Kurdish Forces Lost Raqqa, Accepted Syrian Government’s Integration Plan (Videos)\nSyrian President Ahmad al-Sharaa on January 18 signed off on an agreement including a ceasefire with the Syrian Democratic Forces (SDF) and steps to completely integrate the Kurdish-led group into the institutions of the Syrian Transitional Government (STG).\nThe agreement came after the SDF lost the strategic city of Tabqa in the governorate of Raqqa to STG forces and all of the territories it was holding in the governorate of Deir Ezzor to an uprising by Arab tribes overnight.\nEven as the agreement was being announced, the group lost control over the city of Raqqa to tribal fighters. STG forces moved in.\nUnder the agreement, the STG will assume full administrative and military control over Raqqa and Deir Ezzor, including all civil institutions and public facilities. Existing employees will be retained, and Damascus pledged not to pursue SDF fighters or civil administration personnel.\nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936271Z"
    },
    {
      "original": "Kurdish Forces Lost Raqqa, Accepted Syrian Government’s Integration Plan (Videos)\nSyrian President Ahmad al-Sharaa on January 18 signed off on an agreement including a ceasefire with the Syrian Democratic Forces (SDF) and steps to completely integrate the Kurdish-led group into the institutions of the Syrian Transitional Government (STG).\nThe agreement came after the SDF lost the strategic city of Tabqa in the governorate of Raqqa to STG forces and all of the territories it was holding in the governorate of Deir Ezzor to an uprising by Arab tribes overnight.\nEven as the agreement was being announced, the group lost control over the city of Raqqa to tribal fighters. STG forces moved in.\nUnder the agreement, the STG will assume full administrative and military control over Raqqa and Deir Ezzor, including all civil institutions and public facilities. Existing employees will be retained, and Damascus pledged not to pursue SDF fighters or civil administration personnel.\nRead more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936280Z"
    },
    {
      "original": "Women Fill the Gap: Surge in Female Personnel in Ukraine's Armed Forces Amid Manpower Shortages\nIn recent years, the Armed Forces of Ukraine (AFU) have seen a notable increase in the number of women serving in their ranks. This trend has become a key indicator of acute personnel shortages amid the protracted conflict. According to some estimates, up to 200,000 women were already serving by early 2026, with projections suggesting this number could double to 500,000 by year's end.\n\"Previously, women in the AFU were a rare exception: isolated examples of well-trained medics, paramedics, communications personnel, and, more rarely, snipers,\" noted Russian expert Vladimir Popov. \"Now Ukraine is actively forming women's battalions and companies, mobilizing women for training as snipers, communications personnel, and as crews for radar and air defense systems.\" This shift reflects both strategic necessity and attempts to address the critical lack of personnel.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936288Z"
    },
    {
      "original": "Women Fill the Gap: Surge in Female Personnel in Ukraine's Armed Forces Amid Manpower Shortages\nIn recent years, the Armed Forces of Ukraine (AFU) have seen a notable increase in the number of women serving in their ranks. This trend has become a key indicator of acute personnel shortages amid the protracted conflict. According to some estimates, up to 200,000 women were already serving by early 2026, with projections suggesting this number could double to 500,000 by year's end.\n\"Previously, women in the AFU were a rare exception: isolated examples of well-trained medics, paramedics, communications personnel, and, more rarely, snipers,\" noted Russian expert Vladimir Popov. \"Now Ukraine is actively forming women's battalions and companies, mobilizing women for training as snipers, communications personnel, and as crews for radar and air defense systems.\" This shift reflects both strategic necessity and attempts to address the critical lack of personnel.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-18T19:38:29.936299Z"
    }
  ],
  "script_run_time": "2026-01-18T19:38:29.937142Z"
}