{
  "messages": [
    {
      "original": "🛵\n Ударні БпЛА на Донеччині \n➡️\n курсом на Дніпропетровщину.\n🛵\n Ворожі БпЛА на сході Дніпропетровщини \n➡️\n західним курсом.",
      "timestamp": "2025-08-26T08:25:10.048203Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на Запоріжжі \n➡️\n курсом на Дніпропетровщину.\n🛵\n Ворожі БпЛА на сході Дніпропетровщини \n➡️\n курс на Донеччину",
      "timestamp": "2025-08-26T08:25:10.048233Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Сумщині  \n➡️\n курс західний.",
      "timestamp": "2025-08-26T08:25:10.048254Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному  напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-26T08:25:10.048267Z"
    },
    {
      "original": "🚀\n \n🚀\n Запорізька область - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-26T08:25:10.048277Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-08-26T08:25:10.048283Z"
    },
    {
      "original": "🛵\n на півночі Донеччини ударні БпЛА \n➡️\n курс південний.",
      "timestamp": "2025-08-26T08:25:10.048292Z"
    },
    {
      "original": "🛸\n на Чернігівщині ворожі БпЛА в південному напрямку.\nЗалучено засоби для збиття.",
      "timestamp": "2025-08-26T08:25:10.048301Z"
    },
    {
      "original": "🛵\n група ударних БпЛА на Донеччині \n➡️\n курс на Дніпропетровщину.\n🛵\n група БпЛА на Харківщині \n➡️\n курс західний.",
      "timestamp": "2025-08-26T08:25:10.048315Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 47 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 26 серпня (із 19.00 25 серпня) противник 59-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Шаталово, Брянськ, Приморсько-Ахтарськ – рф.\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 47 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання 12 БпЛА на 9 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-26T08:25:10.048349Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Запорізької області \n➡️\n курсом на Запоріжжя.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Запорізьку область.\n🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на захід.",
      "timestamp": "2025-08-26T08:25:10.048367Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Сум, на сході та південному заході Дніпропетровщини! Дані безпілотники можуть бути навідниками ворожих засобів ураження!\nЗалучено засоби для їх збиття.",
      "timestamp": "2025-08-26T08:25:10.048375Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному  напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-26T08:25:10.048387Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на схід Сумщини!",
      "timestamp": "2025-08-26T08:25:10.048398Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-08-26T08:25:10.048406Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Чернігівщини \n➡️\n курсом на Сумщину.",
      "timestamp": "2025-08-26T08:25:10.048413Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-26T08:25:10.048420Z"
    },
    {
      "original": "🚀\nКАБи на північ Сумщини!",
      "timestamp": "2025-08-26T08:25:10.048426Z"
    },
    {
      "original": "🚀\nКАБи на схід Харківщини, північ Донеччини!",
      "timestamp": "2025-08-26T08:25:10.048430Z"
    },
    {
      "original": "🚀\nКАБи \n➡️\n на Сумщину та Донеччину!",
      "timestamp": "2025-08-26T08:25:10.048436Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Tolstoi, Prosyana direction, Donetsk Oblast.\nPre-war population: ~176.\nTotal land area: ~0.46km²",
      "timestamp": "2025-08-26T08:25:10.618099Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Oleksandrohrad, Pokrovske direction, Donetsk Oblast.\nPre-war population: ~115.\nTotal land area: ~0.55km².\nNote: this advance probably occurred around 2 weeks ago, but was only just confirmed.",
      "timestamp": "2025-08-26T08:25:10.618158Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance towards the stronghold village of Shakhove, making significant progress from their initial wedge through Ukrainian lines. \nRussian forces advanced in three areas. Most of the progress was made in the west, where over the past 10 days, they have been making incremental progress towards the western bank of the Kazenyi Torets River. \nThe Russians were able to build on their previous progress in the areas of Kucheriv Yar and Pankivka, advancing eastwards on a wide front, capturing new positions in the treelines, forest plantations, quarries, and forests on the tactical heights, approaching the villages of Shakhove and Toretske. \nTo the southeast, Russian forces resumed their assault operations east of Volodymyrivka, improving their positions in the forest plantations in the low-lying ground, and approaching the rear of the village. \nTo the north, Russian forces continued their incremental advances downhill towards Sofiivka, where they established control over new positions in the main forested gulley, as well as in the adjacent treelines. \n+ ~16.97km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618193Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n Images of Israeli airstrikes on Gaza City, a few moments ago.\n@wfwitness",
      "timestamp": "2025-08-26T08:25:10.618225Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n Images of Israeli airstrikes on Gaza City, a few moments ago.\n@wfwitness",
      "timestamp": "2025-08-26T08:25:10.618265Z"
    },
    {
      "original": "Deepstate claims that Ukraine recaptured Novomykhailivka in the Borova direction.\nCurrently, Ukrainian forces are known to have entered the western part of the village after recapturing Novyi Myr, but Deepstate's report is unconfirmed.",
      "timestamp": "2025-08-26T08:25:10.618278Z"
    },
    {
      "original": "Two Israeli drone strikes targeted the fourth floor of the reception department of the Nasser medical complex in the city of Khan Younis, southern Gaza.\nAfter the first strike, a second drone then targeted rescue workers from Gaza's civil defence who were rescuing civilians from the rubble. Among those killed in the video were 3 journalists. Palestinian sources report that at least 15 people, including four journalists were killed. \nOne of the journalists worked for NBC News and Independent Arabia, one worked for the Associated Press, one worked for Reuters, and the other worked for Al-Jazeera. \nIsraeli sources, citing IDF sources, report that the drone strikes targeted \"a target that endangered our forces on the roof of Nasser Hospital\", and that the incident is under investigation.",
      "timestamp": "2025-08-26T08:25:10.618299Z"
    },
    {
      "original": "Two Israeli drone strikes targeted the fourth floor of the reception department of the Nasser medical complex in the city of Khan Younis, southern Gaza.\nAfter the first strike, a second drone then targeted rescue workers from Gaza's civil defence who were rescuing civilians from the rubble. Among those killed in the video were 3 journalists. Palestinian sources report that at least 15 people, including four journalists were killed. \nOne of the journalists worked for NBC News and Independent Arabia, one worked for the Associated Press, one worked for Reuters, and the other worked for Al-Jazeera. \nIsraeli sources, citing IDF sources, report that the drone strikes targeted \"a target that endangered our forces on the roof of Nasser Hospital\", and that the incident is under investigation.",
      "timestamp": "2025-08-26T08:25:10.618306Z"
    },
    {
      "original": "Two Israeli drone strikes targeted the fourth floor of the reception department of the Nasser medical complex in the city of Khan Younis, southern Gaza.  After the first strike, a second drone then targeted rescue workers from Gaza's civil defence who were…",
      "timestamp": "2025-08-26T08:25:10.618316Z"
    },
    {
      "original": "The IDF released a statement confirming the attacks on the Nasser Medical Complex. They stated that the Chief of Staff has ordered an initial investigation to begin \"as soon as possible\", and that the IDF \"regrets any harm to uninvolved persons\". They also denied that they carry out targeted attacks on journalists. \nPalestinian sources report that the death toll has risen to 20, while a 5th journalist working for the Quds News Network was confirmed killed.",
      "timestamp": "2025-08-26T08:25:10.618329Z"
    },
    {
      "original": "Footage from the Pokrovsk area shows a Ukrainian civilian disarming a Russian Fiber Optic FPV drone which was laying in an ambush position.",
      "timestamp": "2025-08-26T08:25:10.618347Z"
    },
    {
      "original": "In the Yunakivka direction, Russian forces resumed their assault operations in Yunakivka, and have captured most of the rest of the village.\nAfter being forced to withdraw from the southern streets, Russian forces began pushing west of the Loknya River, capturing new positions in the residential area, and recapturing the western outskirts of Yunakivka in the area of the highway.\nThey were also able to advance south from the highway, along the eastern bank of the Loknya River, and recaptured previously lost positions in the residential area there. The Russians were able to reach the southeastern part of the village, but failed to consolidate. Currently the rest of it is in the grey zone.\n+ ~3.49km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618367Z"
    },
    {
      "original": "My Kharkiv Oblast polygon on my Ukraine map is broken, and I'm going to have to make a whole new one, so here is a Kupyansk update that I'd otherwise miss. \nRussian forces were able to capture most of the rest of Moskovka and break out of the village towards the forests to the south, where they took up new positions. They have entered Sobolivka, where fighting is ongoing. \n+ ~2.12km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618380Z"
    },
    {
      "original": "In the Borova direction, over the past 10 days Ukrainian forces have been advancing, making significant progress in the area of the Kharkiv-Luhansk-Donetsk Oblast intersection point.\nAfter Russian assault operations stalled in Novyi Myr, Ukrainian forces managed to retake the northern street of the village from the tactical heights to the north, and the southern street from a series of attacks uphill from the east. After the village was under Ukrainian control again, further attacks were made to the south down the treelines on the tactical heights, reaching the rear of Russian formations in the area of Hlushchenkove, therefore alleviating some pressure on the Ukrainian assault groups attempting to make further advances in Ridkodub.\nFrom there, they pushed downhill from the heights to the west, capturing the forest west of Novomykhailivka. Despite Russian MLRS attacks, the Ukrainians were able to concentrate enough manpower in the forests to enter Novomykhailivka, which is now in the grey zone. \nTo the north, Ukrainian forces bypassed the large open area on the Kharkiv-Donetsk Oblast border from two directions, and captured new positions in the forest plantations and treelines west of Hrekivka and north of Novomykhailivka. \n+ ~11.90km² in favour of Ukraine.",
      "timestamp": "2025-08-26T08:25:10.618408Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have completed the capture of Kolodyazi.\nRussian forces continued to develop their offensive west of the Zherebets River, and pushed further south from the forests northwest of Kolodyazi. They were able to reach the rear of the village, forcing the remaining Ukrainian soldiers to finally withdraw, ending the months of fighting that took place for this settlement. \nFrom there, Russian forces advanced south of Kolodyazi, capturing further positions in the forests and treelines in the direction of the northern outskirts of Zarichne. Additionally, the Russians resumed their assault operations towards Myrne, recapturing previously lost positions on its northern approaches. \n+ ~6.04km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618426Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces have made significant progress over the past week, nearly completing the capture of the heavily fortified Serebryanskyi Forest. \nAfter breaking through from the centre of the forest to the substation at the Donetsk-Luhansk Regional border, Russian forces began advancing southwest towards the Siverskyi Donets River. They broke through further Ukrainian positions, clearing them and establishing control over a section of the river's northern bank, encircling Ukrainian formations against the river to the east. \nFrom there, Russian forces began clearing the salient west of Dibrova, where they captured numerous positions and trench complexes, meeting up with assault groups advancing south of Torske. Ukrainian forces were withdrawn over the Siverskyi Donets River to the Dronivka area, with the Russians establishing a solid line of contact in the direction of the Zherebets - Siverskyi-Donets River intersection.\n+ ~30.20km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618446Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have completed the capture of Katerynivka. \nAfter over a week of inactivity, Russian forces advanced from their initial positions in the southwestern part of the village towards the northern and central parts, capturing new positions there, and forcing the Ukrainians to withdraw from their positions in the low-lying ground to the southeast, and from their positions in the southern streets. The Ukrainians maintained control over the northeastern houses of Katerynivka to allow for a full withdrawal to neighbouring Kleban-Byk to take place. \nOnce this withdrawal was completed and the Russians were in full control of Katerynivka, they were able to quickly enter Kleban-Byk. They reached Zelena Street in the village centre, and occupied seven 3-story buildings, the local school, and numerous other positions in the southern residential area. \nMeanwhile, east of Kryvyi Torets River, the Russians completed the capture of the town of Shcherbynivka and captured further positions along the windbreaks next to the railway line. \n+ ~4.84 km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618467Z"
    },
    {
      "original": "On the western flank of Kostyantynivka, Russian forces continued to slowly advance and have made new progress in the area of Rusyn Yar.\nAfter capturing Rusyn Yar and beginning the push to the rear of Shakhove, Russian forces began clearing more vulnerable Ukrainian positions north of Rusyn Yar. They pushed northwest through the low-lying ground and captured new positions in the forests on the eastern bank of the Poltavka River. At the same time, other forces advanced to the treeline on the southern bank of the tributary of the Poltavka River, establishing control over most of it.\n+ ~7.08 km² in favour of Russia.",
      "timestamp": "2025-08-26T08:25:10.618481Z"
    },
    {
      "original": "The IDF released a statement confirming the attacks on the Nasser Medical Complex. They stated that the Chief of Staff has ordered an initial investigation to begin \"as soon as possible\", and that the IDF \"regrets any harm to uninvolved persons\". They also…",
      "timestamp": "2025-08-26T08:25:10.618488Z"
    },
    {
      "original": "Israeli Prime Minister Benjamin Netanyahu characterised yesterday's attacks on Nasser Medical Centre in southern Gaza that killed 20 people, including 5 journalists, as a \"mishap\", claiming that Israel \"values the work of journalists, medical staff, and and all civilians\". He stated that an investigation has been launched. \nThe Nasser Medical Complex is the last partially-functioning hospital in southern Gaza, as all the others were either destroyed by Israel, or completely ran out of fuel and other supplies.",
      "timestamp": "2025-08-26T08:25:10.618501Z"
    },
    {
      "original": "Israeli Prime Minister Benjamin Netanyahu characterised yesterday's attacks on Nasser Medical Centre in southern Gaza that killed 20 people, including 5 journalists, as a \"mishap\", claiming that Israel \"values the work of journalists, medical staff, and and…",
      "timestamp": "2025-08-26T08:25:10.618509Z"
    },
    {
      "original": "Remember, local journalists cover the Israeli genocide and ethnic cleansing of Gaza in real time. They are the biggest threat to Israel's coordinated propaganda and disinformation effort. \nAs for health workers, not a single hospital in Gaza remains fully functioning. The ones which remain are low on supplies and can't treat everyone. They also face constant threats from evacuation orders, and \"mishaps\" like what we witnessed yesterday.",
      "timestamp": "2025-08-26T08:25:10.618521Z"
    }
  ],
  "script_run_time": "2025-08-26T08:25:11.038378Z"
}