{
  "messages": [
    {
      "original": "🚀\n КАБи на Сумщину.",
      "timestamp": "2025-07-22T04:44:37.108115Z"
    },
    {
      "original": "🚀\n \n🚀\nДонецька та Харківська  області  - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-22T04:44:37.108132Z"
    },
    {
      "original": "🚀\n \n🚀\nЗапорізька  область  - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-22T04:44:37.108139Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-07-22T04:44:37.108143Z"
    },
    {
      "original": "🛵\n Херсонська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-22T04:44:37.108148Z"
    },
    {
      "original": "🛵\n Запорізька  область- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-22T04:44:37.108152Z"
    },
    {
      "original": "🛵\n Дніпропетровська область - загроза застосування ударних БпЛА з півдня!",
      "timestamp": "2025-07-22T04:44:37.108156Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\nкурсом на Нікополь",
      "timestamp": "2025-07-22T04:44:37.108161Z"
    },
    {
      "original": "⚠\n Увага! м. Нікополь (Дніпропетровщина)! \nПеребувайте в укриттях!\n🛵\n Ворожі ударні БпЛА над містом!",
      "timestamp": "2025-07-22T04:44:37.108171Z"
    },
    {
      "original": "🛵\n Дніпропетровська область (Синельниківський р-н) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-07-22T04:44:37.108176Z"
    },
    {
      "original": "🛵\n Донецька, Харківська, Дніпропетровська (Павлоградський, Дніпровський, Камянський, Криворізький  райони) області - загроза застосування ударних БпЛА",
      "timestamp": "2025-07-22T04:44:37.108180Z"
    },
    {
      "original": "🛵\nБпЛА на сході Дніпропетровщини, курс - на Павлоград.",
      "timestamp": "2025-07-22T04:44:37.108185Z"
    },
    {
      "original": "🛵\n Дніпропетровська область (Самарівський  р-н) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-07-22T04:44:37.108189Z"
    },
    {
      "original": "🛵\n Полтавська  область - загроза застосування ударних БпЛА з півдня!",
      "timestamp": "2025-07-22T04:44:37.108194Z"
    },
    {
      "original": "🛵\nБпЛА на межі Дніпропетровщини та Полтавщини, курс Харківщина",
      "timestamp": "2025-07-22T04:44:37.108200Z"
    },
    {
      "original": "🛵\nБпЛА на  Дніпропетровщині , курс південно-східний/південний",
      "timestamp": "2025-07-22T04:44:37.108204Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА із акваторії Чорного моря \n➡️\n у напрямку Миколаївської, Одеської областей.",
      "timestamp": "2025-07-22T04:44:37.108211Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщиніи, курс північно-західний",
      "timestamp": "2025-07-22T04:44:37.108215Z"
    },
    {
      "original": "🛵\n В акваторії Чорного моря поблизу Одеси група ударних БпЛА. Перебувайте в укриттях! Працює ППО!",
      "timestamp": "2025-07-22T04:44:37.108219Z"
    },
    {
      "original": "🚀\n \n🚀\nДонецька та Сумська  області  - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-22T04:44:37.108225Z"
    },
    {
      "original": "Footage showing some of the Geran-2 drone strikes on Kyiv.",
      "timestamp": "2025-07-22T04:44:37.851187Z"
    },
    {
      "original": "Footage showing some of the Geran-2 drone strikes on Kyiv.",
      "timestamp": "2025-07-22T04:44:37.851204Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-22T04:44:37.851209Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-22T04:44:37.851212Z"
    },
    {
      "original": "2 MiG-31Ks just conducted launch maneuvers",
      "timestamp": "2025-07-22T04:44:37.851215Z"
    },
    {
      "original": "2 MiG-31Ks just conducted launch maneuvers",
      "timestamp": "2025-07-22T04:44:37.851219Z"
    },
    {
      "original": "Kinzhals to Zhytomyr Oblast",
      "timestamp": "2025-07-22T04:44:37.851222Z"
    },
    {
      "original": "Kinzhals to Zhytomyr Oblast",
      "timestamp": "2025-07-22T04:44:37.851228Z"
    },
    {
      "original": "Flying to Starokostyantyniv, Khmelnytskyi Oblast.",
      "timestamp": "2025-07-22T04:44:37.851232Z"
    },
    {
      "original": "Flying to Starokostyantyniv, Khmelnytskyi Oblast.",
      "timestamp": "2025-07-22T04:44:37.851235Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-22T04:44:37.851238Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-22T04:44:37.851244Z"
    },
    {
      "original": "2 impacts to the same target that the Kh-101s and Kalibrs hit earlier.",
      "timestamp": "2025-07-22T04:44:37.851247Z"
    },
    {
      "original": "I think one thing that a lot of people underestimate is how many civilians remain in the Pokrovsk area. Pokrovsk alone has thousands of residents still holding out, while Myrnohrad, Rodynske and Hryshyne's residents combined also number in the thousands. I'd estimate over 5,000 in total remain across the 4 settlements. \nThe last shops and convenience stores closed in Rodynske last week, giving away all of their stock to civilians, but only after the Russians broke through towards the city's eastern outskirts. As of roughly two months ago, a few local shops in Pokrovsk City Centre were still selling basic supplies including food, water, antibiotics, and other medicines, although it's possible that these have since finally closed considering the deteriorating situation on the flanks and intensified Russian bombardment. \nOn average, 1 civilian in Pokrovsk is killed daily from the Russian artillery, MLRS, drone and FAB bombardment. This is despite its population still numbering in the thousands, its proximity to the frontline, the heavy Ukrainian presence in the city, and its strategic importance to the Russians.\nPokrovsk - as far as I know - was more Anti-Russia than most cities in the Donbas, especially Kramatorsk, Slovyansk, Bakhmut and Donetsk City. Nevertheless, people choose to stay behind, usually because they are waiting for \"liberation\" or because they have grown up there and lived in the city for their whole lives. It's all they have ever known, so it makes it more difficult to leave to cities further west. \nAdditionally, many residents who were evacuated from cities such as Avdiivka moved to Pokrovsk and Myrnohrad, yet less than a year later these cities were practically on the frontlines and under heavy Russian bombardment. Many people, especially elderly, do not want to have to go through the struggle or uprooting their lives and relocating once, let alone twice within a year. \nToday, a large portion of Pokrovsk, Myrnohrad, Rodynske and Hryshyne's populations are elderly, although many are middle-aged or younger. Most men between the ages of 18 and 60 either escaped or were mobilised. Localised mobilisation efforts were still ongoing in Pokrovsk-Myrnohrad up until 1-2 weeks ago, which had previously been ramped up when extra police and TCC units from other regions were sent to bolster Donetsk's police and TCC force, although I expect these efforts have since halted considering recent events.",
      "timestamp": "2025-07-22T04:44:37.851254Z"
    },
    {
      "original": "The Lukyanovskaya Metro Station in Kyiv was damaged during last night's Geran-2 drone strikes on the city. The Artem Defence plant was the target here, as it is across the road from the metro station.",
      "timestamp": "2025-07-22T04:44:37.851260Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-22T04:44:37.851263Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T04:44:37.851266Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T04:44:37.851271Z"
    },
    {
      "original": "Additional FIRMS data shows that a fire is burning from Geran impacts at the Kharkiv State Aircraft Manufacturing Company in the north of the city.",
      "timestamp": "2025-07-22T04:44:37.851276Z"
    },
    {
      "original": "I'd like to make this clear now as I see people talking about this quite a bit - the monitoring channels I use to help track Russian missiles and aircraft movements live are almost always unaffiliated with the Ukrainian government. There are ways to get extremely specific intel through OSINT and insider information. You have to remember, this war has been ongoing for over 3 years, and Russian air tactics remain largely the same. This allows for significant development in knowledge and ability to produce reliable reports as you don't have to account for many other variables. I will probably make a post on this in the near future outlining some channels and how I personally think they gather their data.",
      "timestamp": "2025-07-22T04:44:37.851279Z"
    },
    {
      "original": "An Iskander-M ballistic missile just impacted Kropyvnytskyi City, Kirovohrad Oblast.",
      "timestamp": "2025-07-22T04:44:37.851282Z"
    },
    {
      "original": "Russian forces have captured the village of Varachyne, Yunakivka direction, Sumy Oblast.\nPre-war population: ~62.\nTotal land area: ~0.30km².",
      "timestamp": "2025-07-22T04:44:37.851287Z"
    },
    {
      "original": "Russian forces have captured the village of Bila Hora, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~78.\nTotal land area: ~1.53km².",
      "timestamp": "2025-07-22T04:44:37.851291Z"
    },
    {
      "original": "Ukrainian forces have captured the village of Mykolaivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~364. \nTotal land area: ~0.56km²",
      "timestamp": "2025-07-22T04:44:37.851297Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-22T04:44:38.597415Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-22T04:44:38.597430Z"
    },
    {
      "original": "Military Situation In Syria On July 21, 2025 (Map Update)\nMilitary Situation In Yemen On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T04:44:38.597436Z"
    },
    {
      "original": "Military Situation In Syria On July 21, 2025 (Map Update)\nMilitary Situation In Yemen On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T04:44:38.597441Z"
    },
    {
      "original": "Ukrainian Ex-Official Found Dead Near Russian Defector Pilot’s Killing Site In Spain\nA high-ranking former Ukrainian Interior Ministry official, Igor Grushevsky, was found dead under suspicious circumstances in the same Spanish residential complex where Russian defector pilot Maxim Kuzminov was assassinated last year. The latest incident adds another layer of intrigue to a series of mysterious deaths involving figures linked to the Ukraine conflict...\nRead more: \nHERE",
      "timestamp": "2025-07-22T04:44:38.597447Z"
    },
    {
      "original": "Israeli Drones Attack Key Port In Yemen, Houthis Hit Back\nIsraeli drones struck on July 21 Yemen’s al-Hodeida port, which is held by the Houthis (Ansar Allah), in response to the group’s recent attacks.\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes destroyed “military infrastructure of the Houthi terror regime” at the Red Sea port, after attempts were made by the Houthis to repair areas previously targeted by Israel in response to missile and drone attacks.\nThe targets hit in al-Hodeida included “engineering equipment working to restore port infrastructure, fuel tanks, and vessels used for military activity and [attacks] against the State of Israel and ships in the maritime area near the port,” the military added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T04:44:38.597457Z"
    },
    {
      "original": "Military Situation In Ukraine On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T04:44:38.597461Z"
    },
    {
      "original": "Military Situation In Ukraine On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T04:44:38.597466Z"
    },
    {
      "original": "SYRIA SLIDES TOWARDS SECTARIAN WAR",
      "timestamp": "2025-07-22T04:44:38.597470Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T04:44:38.597480Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T04:44:38.597490Z"
    }
  ],
  "script_run_time": "2025-07-22T04:44:38.598595Z"
}