{
  "messages": [
    {
      "original": "🛵\n Група БпЛА в центрі Дніпропетровщини.",
      "timestamp": "2026-01-07T19:50:24.174283Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-07T19:50:24.174300Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Кривий Ріг з півдня.",
      "timestamp": "2026-01-07T19:50:24.174306Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Дніпро з півдня.",
      "timestamp": "2026-01-07T19:50:24.174310Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Запоріжжя з півдня.",
      "timestamp": "2026-01-07T19:50:24.174315Z"
    },
    {
      "original": "🛸\n Розвідувальний БпЛА противника на півдні Миколаївщини. Залучено засоби для його збиття.",
      "timestamp": "2026-01-07T19:50:24.174320Z"
    },
    {
      "original": "🛵\n БпЛА на м.Запоріжжя, м.Дніпро та м.Кривий Ріг. Перебувайте в укриттях.",
      "timestamp": "2026-01-07T19:50:24.174325Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини курсом на Полтавщину.",
      "timestamp": "2026-01-07T19:50:24.174329Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174333Z"
    },
    {
      "original": "🛵\n БпЛА з півдня курсом на Дніпро.",
      "timestamp": "2026-01-07T19:50:24.174338Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174342Z"
    },
    {
      "original": "🛵\n БпЛА з півдняі курсом на м.Запоріжжя.",
      "timestamp": "2026-01-07T19:50:24.174347Z"
    },
    {
      "original": "🛸\n Розвідувальний БпЛА противника на півдні Миколаївщини. Залучено засоби для його збиття.",
      "timestamp": "2026-01-07T19:50:24.174351Z"
    },
    {
      "original": "🛵\n БпЛА з південно-східного напрямку курсом на Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174355Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Краматорськ",
      "timestamp": "2026-01-07T19:50:24.174360Z"
    },
    {
      "original": "🛵\n Група БпЛА з ТОТ Херсонщини, курс північно-західний.",
      "timestamp": "2026-01-07T19:50:24.174364Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині, курс північний, вектор м.Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174369Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, повз Хотінь.",
      "timestamp": "2026-01-07T19:50:24.174373Z"
    },
    {
      "original": "🛵\n БпЛА з півдня на Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174377Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу на Кривий Ріг.",
      "timestamp": "2026-01-07T19:50:24.174382Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T19:50:24.735397Z"
    },
    {
      "original": "I keep seeing a lot of so-called \"American patriots\" criticising liberals for being against the U.S. invasion of Venezuela and their attempt at overthrowing the Venezuelan government, by arguing that Venezuelans did not like Maduro and that they are now celebrating his downfall. Ironically, these \"patriots\" are the same people who called for no more foreign wars prior to this, but that's a whole other story. \nAnd yes, while Maduro may not have been popular among Venezuelans, and a large amount of people may be happy that he's gone, the U.S. attacks are bigger than just this. \nAnyone who knows a bit about the very lengthy history of the U.S. carrying out regime changes will understand how this is not a good thing, no matter how happy Venezuelans are that Maduro is gone. This is bigger than just Venezuela. The U.S. is a great power furthering its own interests, as it has done for the last century. It recognises the difficult and worsening situation it is in with the current multipolar state of the world, and this is just one action of a larger interconnected web of geostrategic moves.",
      "timestamp": "2026-01-07T19:50:24.735411Z"
    },
    {
      "original": "I’d like to add that the US is, of course, looking to extend their influence over Venezuela’s large oil reserves",
      "timestamp": "2026-01-07T19:50:24.735419Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T19:50:24.735427Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T19:50:24.735434Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-07T19:50:24.735437Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-07T19:50:24.735441Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-07T19:50:24.735446Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-07T19:50:24.735449Z"
    },
    {
      "original": "Explosions in Kryvyi Rih",
      "timestamp": "2026-01-07T19:50:24.735452Z"
    },
    {
      "original": "An IL-76MD cargo plane landed at Savasleika Airbase, Nizhny Novgorod Oblast. The cargo consists of Kinzhal missiles for the MiG-31K fighters stationed there.",
      "timestamp": "2026-01-07T19:50:24.735455Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-07T19:50:24.735464Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-07T19:50:24.735471Z"
    },
    {
      "original": "Nick just cannot keep the \"America First\" narrative consistent, and the invasion of Venezuela is showing this to everyone with functioning memories. \nHis reliance on the assumption that he is automatically right, and that anyone else saying anything different must be wrong, is showing more and more. More proof that intelligence isn't the only thing you need to make logical, consistent arguments. \nAlso, it's so funny seeing him getting ratio'd on his own channel \n🤣",
      "timestamp": "2026-01-07T19:50:24.735477Z"
    },
    {
      "original": "People will say “he got the call” or some shit but really he was just using that niche, antisemitic, anti authoritarian, counterculture young male angst to propel him into the next strata.\nOnce he got there he did the only thing he could to make him more successful.\nSo goes the world unfortunately.",
      "timestamp": "2026-01-07T19:50:24.735482Z"
    },
    {
      "original": "The Ukrainian 108th Territorial Defence Brigade acknowledged recent claims of mistreatment of soldiers, stating that \"some soldiers have been sent for additional training\".\nDeepstate has also said that they have received many messages from relatives of soldiers fighting in \"one of the battalions of the 108th\" (probably referring to 100th Territorial Defence Battalion) regarding problems with middle-level commanders. \nThe 108th Brigade is currently defending the area of the village of Bilohirya - a previously quiet section of the front recently reactivated after Russian forces managed to capture almost all of the village. Russian forces are currently attempting to exploit their successes for additional gains in the area. It is known that the 100th battalion of the 108th brigade carried out multiple unsuccessful counterattacks during the fighting for Bilohirya towards the end of December, so it's possible that this is what these complaints are referring to.",
      "timestamp": "2026-01-07T19:50:24.735487Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to advance through Prymorske, and are coming closer to establishing full control over the village.\nFollowing earlier deep infiltrations by DRGs, Russian forces managed to enter and capture the central part of Prymorske, allowing for them to begin attacking the eastern part of the village from two directions. The eastern streets were subsequently brought under full Russian control, along with the nearby forested areas. \nMeanwhile, DRGs continued to penetrate to the northern outskirts of Prymorske, which looks to have been mostly abandoned by Ukraine. It's likely that Ukrainian forces are attempting to turn northern Prymorske into a kill zone with drones to prevent Russian consolidation and accumulation for future attacks. \n+ ~3.27 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T19:50:24.735494Z"
    },
    {
      "original": "HIMARS launches from Chuhuiv, Kharkiv Oblast, in the direction of Vovchansk and then Belgorod Oblast.",
      "timestamp": "2026-01-07T19:50:24.735497Z"
    },
    {
      "original": "Repeated HIMARS launches. \nThey are being launched from northeast of Pechenihy, and are flying past Vovchansk in the direction of Shebekino, Belgorod Oblast.",
      "timestamp": "2026-01-07T19:50:24.735501Z"
    },
    {
      "original": "Hezbollah Handed Over Secret Syrian Cruise Missiles To Lebanese Army (Photos)\nHezbollah has handed over a number of land-attack cruise missiles developed and supplied by Syria to the Lebanese military.\nPhotos showing the missiles, at least three, were shared by Lebanon’s Al Jadeed TV late on January 6. The photos, reportedly taken at a Hezbollah facility between the towns of Kafra and Seddiqin in southern Lebanon, were likely leaked by the Lebanese military, which is currently facing immense pressure from both Israel and the United States to disarm the group.\nThe land-attack cruise missiles are a deeply modified version of the Soviet-era Tu-143 “Reys” jet-powered reconnaissance drone.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313793Z"
    },
    {
      "original": "Hezbollah Handed Over Secret Syrian Cruise Missiles To Lebanese Army (Photos)\nHezbollah has handed over a number of land-attack cruise missiles developed and supplied by Syria to the Lebanese military.\nPhotos showing the missiles, at least three, were shared by Lebanon’s Al Jadeed TV late on January 6. The photos, reportedly taken at a Hezbollah facility between the towns of Kafra and Seddiqin in southern Lebanon, were likely leaked by the Lebanese military, which is currently facing immense pressure from both Israel and the United States to disarm the group.\nThe land-attack cruise missiles are a deeply modified version of the Soviet-era Tu-143 “Reys” jet-powered reconnaissance drone.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313811Z"
    },
    {
      "original": "Military Situation In Ukraine On January 7, 2026 (Maps Update)",
      "timestamp": "2026-01-07T19:50:25.313816Z"
    },
    {
      "original": "Military Situation In Ukraine On January 7, 2026 (Maps Update)",
      "timestamp": "2026-01-07T19:50:25.313821Z"
    },
    {
      "original": "Syrian Government Forces Are About To Storm Kurdish Neighborhoods In Aleppo City (Videos)\nClashes have renewed in the northern Syrian city of Aleppo between the forces of the Islamist-led Interim Government and fighters affiliated with the Syrian Democratic Forces (SDF), with reports indicating that Damascus had made the decision to go to war against the Kurdish-led group.\nTensions between the Interim Government and the SDF have been building up for months over the failure to implement the integration agreement signed last March.\nThe end of the year deadline passed with no progress, and direct talks held in Damascus on January 4 failed to produce any meaningful understanding.\nThe clashes broke out around the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh on January 6, with each side accusing the other of attacking first.\nMultiple attempts to de-escalate failed, and by the end of the day it became clear that government forces are preparing an operation to capture the neighborhoods.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313830Z"
    },
    {
      "original": "Syrian Government Forces Are About To Storm Kurdish Neighborhoods In Aleppo City (Videos)\nClashes have renewed in the northern Syrian city of Aleppo between the forces of the Islamist-led Interim Government and fighters affiliated with the Syrian Democratic Forces (SDF), with reports indicating that Damascus had made the decision to go to war against the Kurdish-led group.\nTensions between the Interim Government and the SDF have been building up for months over the failure to implement the integration agreement signed last March.\nThe end of the year deadline passed with no progress, and direct talks held in Damascus on January 4 failed to produce any meaningful understanding.\nThe clashes broke out around the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh on January 6, with each side accusing the other of attacking first.\nMultiple attempts to de-escalate failed, and by the end of the day it became clear that government forces are preparing an operation to capture the neighborhoods.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313840Z"
    },
    {
      "original": "Military Situation In Northern Palestine On January 7, 2026 (Map Update)",
      "timestamp": "2026-01-07T19:50:25.313843Z"
    },
    {
      "original": "U.S. Seizes Russian Tanker Linked To Venezuela In Major Escalation (Photos, Video)\nThe United States military on January 7 seized the Russian-flagged oil tanker Marinera in the North Atlantic, after pursuing it all the way from the Caribbean Sea.\nIn a statement, the U.S. European Command stated that the tanker was seized in coordination with the Justice Department and the Department of Homeland Security.\nThe tanker, previously named the “Bella 1,” first came to attention last month when the U.S. Coast Guard attempted to seize it as it approached Venezuela. The crew declined to let the Americans on board at the time, and headed for the Atlantic. During the pursuit, the vessel changed its name and switched to the Russian flag.\nU.S. Secretary of State Marco Rubio revealed after the seizure that the U.S. is “about to execute on a deal” to take tens of millions of barrels of Venezuela’s oil and “sell it in the marketplace at market rates.”\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313852Z"
    },
    {
      "original": "U.S. Seizes Russian Tanker Linked To Venezuela In Major Escalation (Photos, Video)\nThe United States military on January 7 seized the Russian-flagged oil tanker Marinera in the North Atlantic, after pursuing it all the way from the Caribbean Sea.\nIn a statement, the U.S. European Command stated that the tanker was seized in coordination with the Justice Department and the Department of Homeland Security.\nThe tanker, previously named the “Bella 1,” first came to attention last month when the U.S. Coast Guard attempted to seize it as it approached Venezuela. The crew declined to let the Americans on board at the time, and headed for the Atlantic. During the pursuit, the vessel changed its name and switched to the Russian flag.\nU.S. Secretary of State Marco Rubio revealed after the seizure that the U.S. is “about to execute on a deal” to take tens of millions of barrels of Venezuela’s oil and “sell it in the marketplace at market rates.”\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313861Z"
    },
    {
      "original": "A Coalition of Hesitation: The Hollow Core of Europe's New Ukraine Initiative\nThis is a new attempt to draw Europe into a proxy war with Russia. The \"Coalition of the Willing\" has adopted a document that could further provoke Moscow and contribute to the escalation of the conflict. The support that European leaders have shown for Ukrainian President Volodymyr Zelensky is not as clear-cut as it seems. Washington continues to take a wait-and-see approach. Meanwhile, Paris and London have announced their intention to deploy troops to Ukraine. How will Moscow respond?\nOn January 6, the “Coalition of the Willing” held a meeting in Paris. This association consists of more than 30 countries, primarily European, which are considering participating in a potential peacekeeping mission in Ukraine. France and the United Kingdom play a coordinating role in the coalition. British Prime Minister Keir Starmer announced the coalition's formation in early March 2025. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313870Z"
    },
    {
      "original": "A Coalition of Hesitation: The Hollow Core of Europe's New Ukraine Initiative\nThis is a new attempt to draw Europe into a proxy war with Russia. The \"Coalition of the Willing\" has adopted a document that could further provoke Moscow and contribute to the escalation of the conflict. The support that European leaders have shown for Ukrainian President Volodymyr Zelensky is not as clear-cut as it seems. Washington continues to take a wait-and-see approach. Meanwhile, Paris and London have announced their intention to deploy troops to Ukraine. How will Moscow respond?\nOn January 6, the “Coalition of the Willing” held a meeting in Paris. This association consists of more than 30 countries, primarily European, which are considering participating in a potential peacekeeping mission in Ukraine. France and the United Kingdom play a coordinating role in the coalition. British Prime Minister Keir Starmer announced the coalition's formation in early March 2025. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313878Z"
    },
    {
      "original": "Cuba Shares Details Of 32 Officers Killed In Venezuela, U.S. Admits Seven Delta Troops Were Wounded \nThe Cuban government on January 6 shared the names, ranks and ages of 32 of its military personnel who were killed during the capture of Venezuelan President Nicolás Maduro by United States special forces three days earlier.\nThe personnel, ranging in age from 26 to 60, belonged to the Revolutionary Armed Forces and the Ministry of the Interior. They included colonels, lieutenants, majors and captains, as well as a number of reserve soldiers. Headshots of each one of them were released by state media.\nHavana was quick to acknowledge the deaths of the personnel who were deployed in Caracas under an agreement with the Venezuelan government.\nThe operation in Caracas was carried out by the U.S. military’s elite Delta Force. President Donald Trump said right after that “a couple of guys were hit,” but a Pentagon official told MS Now on January 7 that the number of wounded was in fact seven.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313887Z"
    },
    {
      "original": "Cuba Shares Details Of 32 Officers Killed In Venezuela, U.S. Admits Seven Delta Troops Were Wounded \nThe Cuban government on January 6 shared the names, ranks and ages of 32 of its military personnel who were killed during the capture of Venezuelan President Nicolás Maduro by United States special forces three days earlier.\nThe personnel, ranging in age from 26 to 60, belonged to the Revolutionary Armed Forces and the Ministry of the Interior. They included colonels, lieutenants, majors and captains, as well as a number of reserve soldiers. Headshots of each one of them were released by state media.\nHavana was quick to acknowledge the deaths of the personnel who were deployed in Caracas under an agreement with the Venezuelan government.\nThe operation in Caracas was carried out by the U.S. military’s elite Delta Force. President Donald Trump said right after that “a couple of guys were hit,” but a Pentagon official told MS Now on January 7 that the number of wounded was in fact seven.\nRead more \nHERE",
      "timestamp": "2026-01-07T19:50:25.313896Z"
    }
  ],
  "script_run_time": "2026-01-07T19:50:25.314738Z"
}