{
  "messages": [
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-10-29T18:43:47.734447Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-10-29T18:43:47.734464Z"
    },
    {
      "original": "Павлоградський р-н теж.",
      "timestamp": "2025-10-29T18:43:47.734468Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА, ймовірно, розвідувальний, в напрямку Харкова з північного сходу.",
      "timestamp": "2025-10-29T18:43:47.734473Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-29T18:43:47.734483Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-29T18:43:47.734488Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-10-29T18:43:47.734493Z"
    },
    {
      "original": "Швидкісна ціль на схід Дніпропетровщини та південь Донеччини.",
      "timestamp": "2025-10-29T18:43:47.734497Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА на півночі Сумщини та північному сході Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-10-29T18:43:47.734501Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північ Харківщини.",
      "timestamp": "2025-10-29T18:43:47.734506Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини, рухаються в  південно-західному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734510Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-29T18:43:47.734514Z"
    },
    {
      "original": "🛵\nДекілька груп БпЛА в центральній частині Чернігівщини, рухаються в  західному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734523Z"
    },
    {
      "original": "🛵\n Групи БпЛА на сході Дніпропетровщини, рухаються в  західному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734527Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину",
      "timestamp": "2025-10-29T18:43:47.734533Z"
    },
    {
      "original": "🛵\n БпЛА в центральній частині Чернігівщини, рухається в  південному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734537Z"
    },
    {
      "original": "🛵\n  БпЛА на  Дніпропетровщині, рухаються в  західному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734541Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА на півночі Сумщини, курс - південно-західний.",
      "timestamp": "2025-10-29T18:43:47.734546Z"
    },
    {
      "original": "🛵\n Група БпЛА на межі Чернігівської та Сумської областей, рухається в  південному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734550Z"
    },
    {
      "original": "🛵\n БпЛА в центральній частині Чернігівщини, рухається в  західному напрямку.",
      "timestamp": "2025-10-29T18:43:47.734554Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Харківщини, курс - південно-західний.",
      "timestamp": "2025-10-29T18:43:47.734557Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations and have made new progress to east of the city. \nIn the northwest, Russian forces advanced further through the forests along the railway line and reached the eastern edge of Lyman. DRGs then infiltrated the city and have since been operating in the area of the freight terminals. They also established control over new parts of the forests and infiltrated further into the Masliakivka District. \nTo the southeast, Russian forces continued to slowly advance in Yampil. They were able to advance out of the village centre and capture some new positions in the southwestern streets. Ukrainian forces are gradually being pushed back to the southwestern edge of the settlement. \n+ ~3.70 km² in favour of Russia.",
      "timestamp": "2025-10-29T18:43:48.420355Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to expand their zone of control west of Zarichne, and have eliminated the salient recently formed there.\nAfter outflanking Ukrainian strongpoints west of Zarichne from the north, Ukrainian forces began withdrawing to the west to prevent being encircled. The Russians have since captured the agricultural complex that served as one of Ukraine's main forward deployment points in this sector, and secured the rest of the surrounding forests, levelling the frontline to the west. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-10-29T18:43:48.420370Z"
    },
    {
      "original": "Following reports of Hamas fighters opening fire on Israeli soldiers in Rafah and firing an anti-tank missile, the IDF has begun a series of airstrikes on targets across Gaza City and Rafah. \nExplosions are currently sounding across the strip from the artillery shelling and airstrikes focusing on Gaza City. One airstrike targeted the courtyard of Al-Shifa Hospital in Gaza City; however no casualties were reported.",
      "timestamp": "2025-10-29T18:43:48.420374Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it. \nIt's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions and movements in Gaza).\nI honestly think the goal was to make a peace plan that was borderline acceptable for Hamas, but just slightly too far outside of what they could feasibly agree too, in order to portray them as unwilling to end the war and rebuild some justification for the IDF to continue their operations. \nHamas actually accepting the deal surprised the US and Israel, so now they are relying on ceasefire violations to slowly swing back to a fighting stance.",
      "timestamp": "2025-10-29T18:43:48.420380Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it.   It's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions…",
      "timestamp": "2025-10-29T18:43:48.420384Z"
    },
    {
      "original": "This new round of attacks could only be temporary, but long-term the trend is obvious.",
      "timestamp": "2025-10-29T18:43:48.420387Z"
    },
    {
      "original": "Today, in preparation for the next large-scale missile strike, 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to western Russia. 1 landed at Olenya Airbase, Murmansk Oblast, and 3 landed at Engels-2 Airbase, Saratov Oblast.\nCurrently, there are 10 strategic bombers stationed near Ukraine - 13 if you include Diaghilev Airbase (Ryazan Oblast).",
      "timestamp": "2025-10-29T18:43:48.420391Z"
    },
    {
      "original": "Today, in preparation for the next large-scale missile strike, 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to western Russia. 1 landed at Olenya Airbase, Murmansk Oblast, and 3 landed at Engels-2 Airbase, Saratov Oblast.  Currently…",
      "timestamp": "2025-10-29T18:43:48.420395Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers have departed from Engels-2 Airbase and are redeploying to Olenya Airbase. They have been equipped with Kh-101 cruise missiles and will take part in the next missile attack from Olenya.",
      "timestamp": "2025-10-29T18:43:48.420398Z"
    },
    {
      "original": "Russian forces have captured the village of Dronivka, northern flank of Siversk, Donetsk Oblast.\nPre-war population: ~613.\nTotal land area: ~0.98 km².",
      "timestamp": "2025-10-29T18:43:48.420403Z"
    },
    {
      "original": "Following reports of Hamas fighters opening fire on Israeli soldiers in Rafah and firing an anti-tank missile, the IDF has begun a series of airstrikes on targets across Gaza City and Rafah.   Explosions are currently sounding across the strip from the artillery…",
      "timestamp": "2025-10-29T18:43:48.420406Z"
    },
    {
      "original": "Hamas denied responsibility for the attack on IDF soldiers in Rafah, southern Gaza, and emphasised its commitment to the ceasefire.",
      "timestamp": "2025-10-29T18:43:48.420409Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers have departed from Engels-2 Airbase and are redeploying to Olenya Airbase. They have been equipped with Kh-101 cruise missiles and will take part in the next missile attack from Olenya.",
      "timestamp": "2025-10-29T18:43:48.420412Z"
    },
    {
      "original": "4 Tu-95MS strategic bombers landed at Olenya Airbase. They are all equipped with Kh-101 cruise missiles. \nMutliple vessels of the Black Sea Fleet stationed at Novorossiysk Naval base, Krasnodar Krai, are equipped with Kalibr cruise missiles. \nMultiple OTRK installations have Iskander-M ballistic missiles ready to launch, especially from the north and northeastern directions. \n2 MiG-31Ks are equipped with Kinzhal hypersonic aeroballistic missiles at Savasleika Airbase, Nizhny Novgorod Oblast. Their usage in the next attack is likely, but not certain.\nAt least 4 Tu-22m3 strategic bombers stationed at Diaghilev Airbase, Ryazan Oblast, are equipped with Kh-22 cruise missiles. It is unclear if they will be used in the next attack.\n1 Tu-95MS and 3 Tu-160s remain stationed at Engels-2 Airbase. Not all are equipped with missiles. \nThe next large-scale, combined missile attack on Ukraine is likely to take place tomorrow night. I will provide additional updates closer to the time.",
      "timestamp": "2025-10-29T18:43:48.420419Z"
    },
    {
      "original": "I think we may be seeing the last days of the battle for Pokrovsk.",
      "timestamp": "2025-10-29T18:43:48.420423Z"
    },
    {
      "original": "Get ready",
      "timestamp": "2025-10-29T18:43:48.420425Z"
    },
    {
      "original": "Tonight, there is a high probability of a large-scale, combined Russian missile and drone attack being carried out on Ukraine. Here's what we know so far:\nThere are currently 7 Tu-95MS stationed at Olenya Airbase, Murmansk Oblast. 6-7 of these are equipped with Kh-101 cruise missiles and are expected to take part in any combat sorties.\nAt Engels-2 Airbase, Murmansk Oblast, there are 2-3 Tu-160 strategic bombers equipped with Kh-101s. They are likely to take part in any combat sorties. The Tu-95MS and 1 other Tu-160 stationed there are there for training purposes.\n1 frigate of the \"Admiral Makarov\" type, 1 frigate of the \"Admiral Essen\" type, and 1 submarine of the \"Varshavyanka\" type are equipped with Kalibr cruise missiles, and stationed at Novorossiysk Naval Base, Krasnodar Krai. They are likely going to take part in any missile attacks. \n3-4 MiG-31Ks stationed at Savasleika Airbase, Nizhny Novgorod Oblast, are equipped with Kinzhal hypersonic aeroballistic missiles. They may take part in any combat sorties. The 2 other MiG-31Ks equipped with missiles stationed at Akhtubinsk Airbase, Astrakhan Oblast, are not expected to take part. \nAt least four Iskander OTRK installations have received deliveries of Iskander-M ballistic missiles and/or Iskander-K cruise missiles. These are in Bryansk Oblast, Kursk Oblast, Voronezh Oblast, and Rostov Oblast. Their usage tonight is possible but not confirmed. \nAfter weeks of accumulation, there are over 500 Geran-2, Geran-3, and Gerbera drones ready to launch from 10-11 different directions surrounding Ukraine. \nThe chances of a missile attack taking place tonight is not 100%, but it is likely (~75%).",
      "timestamp": "2025-10-29T18:43:48.420433Z"
    },
    {
      "original": "So far, launches of Geran-2 drones have been recorded from:\nPrimorsko-Akhtarsk Airbase, Krasnodar Krai.\nTsumbulova Test Site, Oryol Oblast (x2).\nKhalino Airbase, Kursk Oblast.\nNavlya Test Site, Bryansk Oblast. \nThe first drones are entering Ukrainian airspace via Sumy, Chernihiv, and Dnipropetrovsk Oblasts.",
      "timestamp": "2025-10-29T18:43:48.420439Z"
    },
    {
      "original": "General movements of Russian Geran-2 drones. Currently, ~9 drones are detected in Ukrainian airspace.",
      "timestamp": "2025-10-29T18:43:48.420442Z"
    },
    {
      "original": "The situation in the Pokrovsk direction has reached a catastrophic point for Ukraine. Ukrainian formations in Myrnohrad, eastern Pokrovsk, and the surrounding villages are now operationally encircled. \nRussian troops broke through to the northern outskirts of Pokrovsk, leaving only a 2km-wide corridor of open fields to escape encirclement. The coming days will be decisive.",
      "timestamp": "2025-10-29T18:43:48.420446Z"
    },
    {
      "original": "A Russian flag was raised over the Pokrovsk plaque on the northwestern outskirts of the city. This is the same plaque that Zelensky visited around a year ago.",
      "timestamp": "2025-10-29T18:43:48.420449Z"
    },
    {
      "original": "Activity on Russian combat-related strategic aviation frequencies is recorded. We will likely see departures of Tu-95MS bombers from Olenya Airbase to launch missiles in the near future.",
      "timestamp": "2025-10-29T18:43:48.420452Z"
    },
    {
      "original": "Activity on Russian combat-related strategic aviation frequencies is recorded. We will likely see departures of Tu-95MS bombers from Olenya Airbase to launch missiles in the near future.",
      "timestamp": "2025-10-29T18:43:48.420455Z"
    },
    {
      "original": "Combat-related radio activity has resumed after a brief pause.",
      "timestamp": "2025-10-29T18:43:48.420457Z"
    },
    {
      "original": "Update on Geran launches:\nSo far, 8 launches of Geran-2 drones have been recorded. These are from:\nPrimorsko-Akhtarsk Airbase, Krasnodar Krai.\nTsumbulova Test Site, Oryol Oblast (x2).\nKhalino Airbase, Kursk Oblast (x2).\nNavlya Test Site, Bryansk Oblast. \nKacha Airbase, Crimea.\nCape Chauda, Crimea.",
      "timestamp": "2025-10-29T18:43:48.420464Z"
    },
    {
      "original": "Kiev Forces Are Nearing Defeat In Vovchansk And Kupyansk (Videos)\nOn October 29, the Russian military advanced on all key fronts in the direction of Kharkiv, bringing Kiev forces closer to defeat in both Vovchansk and Kupyansk.\nThe Sever [North] Group of Forces is reported to be now in control of most of Vovchansk. The settlement’s southwestern part has been completely secured by Russian troops. Kiev forces are currently attempting to defend their last positions in the southeastern part of the settlement.\nMeanwhile in Kupyansk, the Zapad [West] Group of Forces is also reported to be advancing. Russian troops begin clearing the residential areas to the south of Kharkivska Vulytsya street in the center of the city. \nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140822Z"
    },
    {
      "original": "Kiev Forces Are Nearing Defeat In Vovchansk And Kupyansk (Videos)\nOn October 29, the Russian military advanced on all key fronts in the direction of Kharkiv, bringing Kiev forces closer to defeat in both Vovchansk and Kupyansk.\nThe Sever [North] Group of Forces is reported to be now in control of most of Vovchansk. The settlement’s southwestern part has been completely secured by Russian troops. Kiev forces are currently attempting to defend their last positions in the southeastern part of the settlement.\nMeanwhile in Kupyansk, the Zapad [West] Group of Forces is also reported to be advancing. Russian troops begin clearing the residential areas to the south of Kharkivska Vulytsya street in the center of the city. \nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140838Z"
    },
    {
      "original": "Military Situation In Gaza Strip On October 29, 2025 (Map Update)",
      "timestamp": "2025-10-29T18:43:49.140842Z"
    },
    {
      "original": "Where Have the \"Gray Geese\" Gone? The Fate of Foreign Mercenaries in Ukraine.\nThe prospect of easy money continues to draw foreign mercenaries to Ukraine. For those who decided that fighting the Russian army would be easy, the reality is an unenviable fate. But what happens to most of the soldiers of fortune who join the Ukrainian Armed Forces?\nWestern social networks and media outlets have launched a large-scale campaign to recruit ‘volunteers’ for Ukraine. Positions are most often offered far behind the front lines. The promise of high pay and good living conditions has generated significant interest among residents of developing countries.\nThe image of the Russian army as weak, stupid, and poorly organized has been widely promoted by Western media. This reinforces the mercenaries’ belief that earning money will be easy. A lack of awareness in the Western Hemisphere, particularly in Latin America, of the true intensity of the conflict in Ukraine also plays into the recruiters’ hands.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140850Z"
    },
    {
      "original": "Where Have the \"Gray Geese\" Gone? The Fate of Foreign Mercenaries in Ukraine.\nThe prospect of easy money continues to draw foreign mercenaries to Ukraine. For those who decided that fighting the Russian army would be easy, the reality is an unenviable fate. But what happens to most of the soldiers of fortune who join the Ukrainian Armed Forces?\nWestern social networks and media outlets have launched a large-scale campaign to recruit ‘volunteers’ for Ukraine. Positions are most often offered far behind the front lines. The promise of high pay and good living conditions has generated significant interest among residents of developing countries.\nThe image of the Russian army as weak, stupid, and poorly organized has been widely promoted by Western media. This reinforces the mercenaries’ belief that earning money will be easy. A lack of awareness in the Western Hemisphere, particularly in Latin America, of the true intensity of the conflict in Ukraine also plays into the recruiters’ hands.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140859Z"
    },
    {
      "original": "Military Situation In Ukraine On October 29, 2025 (Maps Update)",
      "timestamp": "2025-10-29T18:43:49.140863Z"
    },
    {
      "original": "Military Situation In Ukraine On October 29, 2025 (Maps Update)",
      "timestamp": "2025-10-29T18:43:49.140866Z"
    },
    {
      "original": "Sudanese Government Says 2,000 Civilians Were Killed By Rapid Support Forces In El-Fasher (18+ Videos)\nThousands of Sudanese civilians have been reportedly killed by the Rapid Support Forces (RSF) in el-Fashe after the withdrawal of the Sudanese Armed Forces (SAF) from the city in western Sudan.\nHorrific videos purported to show RSF militants rounding up and executing civilians near el-Fasher began to surface online right after the fall of the city on October 26.\nDuring a press conference in the city of Port Sudan on October 29, Mona Nour Al-Daem, Sudan's Deputy Commissioner of Humanitarian Aid, said that at least 2,000 civilians were killed by the RSF in el-Fasher, describing what happened as \"genocide against unarmed civilians.\"\nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140874Z"
    },
    {
      "original": "Sudanese Government Says 2,000 Civilians Were Killed By Rapid Support Forces In El-Fasher (18+ Videos)\nThousands of Sudanese civilians have been reportedly killed by the Rapid Support Forces (RSF) in el-Fashe after the withdrawal of the Sudanese Armed Forces (SAF) from the city in western Sudan.\nHorrific videos purported to show RSF militants rounding up and executing civilians near el-Fasher began to surface online right after the fall of the city on October 26.\nDuring a press conference in the city of Port Sudan on October 29, Mona Nour Al-Daem, Sudan's Deputy Commissioner of Humanitarian Aid, said that at least 2,000 civilians were killed by the RSF in el-Fasher, describing what happened as \"genocide against unarmed civilians.\"\nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140882Z"
    },
    {
      "original": "Over 130 Killed In Deadliest Police Raid In History Of Brazil (Videos)\nOver 130 people, including several police officers, died in a massive raid by Brazilian security forces aimed at organized crime in Rio de Janeiro on October 28.\nRio de Janeiro State Governor Cláudio Castro told reporters at a press conference that police confiscated a “large quantity of drugs” in the raid, according to Reuters. Authorities also claimed on social media that 81 people were arrested and at least 42 rifles were seized during the operation.\nCastro went on to pronounce the raid “the biggest operation in the history of Rio de Janeiro” in a post to the X social network.\nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140894Z"
    },
    {
      "original": "Over 130 Killed In Deadliest Police Raid In History Of Brazil (Videos)\nOver 130 people, including several police officers, died in a massive raid by Brazilian security forces aimed at organized crime in Rio de Janeiro on October 28.\nRio de Janeiro State Governor Cláudio Castro told reporters at a press conference that police confiscated a “large quantity of drugs” in the raid, according to Reuters. Authorities also claimed on social media that 81 people were arrested and at least 42 rifles were seized during the operation.\nCastro went on to pronounce the raid “the biggest operation in the history of Rio de Janeiro” in a post to the X social network.\nRead more \nHERE",
      "timestamp": "2025-10-29T18:43:49.140901Z"
    }
  ],
  "script_run_time": "2025-10-29T18:43:49.141621Z"
}