{
  "messages": [
    {
      "original": "Ворожий БпЛА на Чернігівщині у південно-західному напрямку (Ніжин).",
      "timestamp": "2025-08-23T19:51:26.882980Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 36 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 23 серпня (із 22.40 22 серпня) противник атакував 49 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Курськ, Міллерово, Приморсько-Ахтарськ – рф.\nПовітряний напад відбивали підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.30, протиповітряною обороною збито/подавлено 36 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі, сході та в центрі країни.\nЗафіксовано влучання 13 БпЛА у 7 локаціях на Донеччині, Дніпропетровщині та Сумщині.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-23T19:51:26.883014Z"
    },
    {
      "original": "🛸\n  ворожі БпЛА в центрі Чернігівщини та на північному сході Київщини, курс південно-західний! \n⚡\n Залучено засоби для їх збиття! \n🚨\n Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-23T19:51:26.883023Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-23T19:51:26.883031Z"
    },
    {
      "original": "🛸\n  Ворожий БпЛА в центрі Чернігівщини! \n⚡\n Залучено засоби для його збиття! \n🚨\n Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-23T19:51:26.883038Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-23T19:51:26.883045Z"
    },
    {
      "original": "🛸\n  Ворожі БпЛА в центральній, північно-східній частині Чернігівщини та на північному заході Сумщини.! \n⚡\n Залучено засоби для їх збиття! \n🚨\n Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-23T19:51:26.883052Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-23T19:51:26.883056Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-23T19:51:26.883062Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Чернігівщини заходить у Броварський р-н., Київської області.",
      "timestamp": "2025-08-23T19:51:26.883066Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА на північному сході та сході Чернігівської області, курс південно-західний.",
      "timestamp": "2025-08-23T19:51:26.883073Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА в центрі Чернігівської області, курс південний;\n🛵\n Ворожі ударні БпЛА в Синельниківському районі Дніпропетровської області, курс північно-західний.",
      "timestamp": "2025-08-23T19:51:26.883080Z"
    },
    {
      "original": "📢\n Відбій загрози для Київської та Чернігівської областей.",
      "timestamp": "2025-08-23T19:51:26.883084Z"
    },
    {
      "original": "🛸\n  Ворожий БпЛА в центральній частині Чернігівщини! \n⚡\n Залучено засоби для його збиття!",
      "timestamp": "2025-08-23T19:51:26.883090Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Дніпропетровщини через Харківщину у напрямку Полтавщини.",
      "timestamp": "2025-08-23T19:51:26.883094Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-23T19:51:26.883101Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-23T19:51:26.883108Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-08-23T19:51:26.883112Z"
    },
    {
      "original": "🛵\n Нові групи ударних ворожих БпЛА на Донеччині у напрямку Дніпропетровщини, курсом на Павлоград.",
      "timestamp": "2025-08-23T19:51:26.883116Z"
    },
    {
      "original": "🛵\n ударні БаЛА на Харківщину зі сходу, курс південно-західний.",
      "timestamp": "2025-08-23T19:51:26.883120Z"
    },
    {
      "original": "Russian forces have captured the village of Maliivka, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~163.\nTotal land area: ~1.27km².",
      "timestamp": "2025-08-23T19:51:27.385393Z"
    },
    {
      "original": "Some general updates that I think are important to mention:\nKucheriv Yar (Dobropillya direction) remains under Russian control and has been used for new advances in multiple directions. The newest attacks have been taking place to the rear of the stronghold village of Shakhove, which Russia is trying to cut off by reaching Toretske. A strong push is also being made from Poltavka.\nAs for the Russian soldiers who were encircled last week, I wanted to wait a little to confirm this, but roughly 20 POWs were taken, around 15 of which surrendered near the small road north of Zolotyi Kolodyaz. The other ~5 were caught in the forests to the southeast. Everyone else was either killed or managed to escape back to the Kucheriv Yar area.\nRussia has now regained the initiative in the Dobropillya direction and is making significant progress. I will post more on that later, though.",
      "timestamp": "2025-08-23T19:51:27.385406Z"
    },
    {
      "original": "In the Bilopillya direction, Russian forces resumed their assault operations and managed to complete the capture of Bezsalivka.\nAfter weeks of positional battles, with Ukraine holding no permanent presence in the village, Russian forces began attacking towards the western houses, which were subsequently captured. They were also able to improve their positions in the forested area to the north and secured another section of the forests along the international border.\n+ ~1.13km² in favour of Russia.",
      "timestamp": "2025-08-23T19:51:27.385412Z"
    },
    {
      "original": "Israeli defence Minister Israel Katz stated that the Knesset has approved the IDF ground operation aimed at occupying all of Gaza City. \nHe stated that this operation will take place through \"heavy fire, civilian evacuation, and ground maneuver,\" and threatened to flatten the city if Hamas doesn't accept Israel's terms, including freeing all hostages and completely disarming.",
      "timestamp": "2025-08-23T19:51:27.385416Z"
    },
    {
      "original": "Our boy is out here doing side quests...",
      "timestamp": "2025-08-23T19:51:27.385419Z"
    },
    {
      "original": "Our boy is out here doing side quests...",
      "timestamp": "2025-08-23T19:51:27.385422Z"
    },
    {
      "original": "I thought it was AI generated at first \n🤣",
      "timestamp": "2025-08-23T19:51:27.385427Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now. \nAt least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit. \nMore KABs are flying in their direction.",
      "timestamp": "2025-08-23T19:51:27.385432Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now. \nAt least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit. \nMore KABs are flying in their direction.",
      "timestamp": "2025-08-23T19:51:27.385437Z"
    },
    {
      "original": "A UAV launched by the Houthis in Yemen was intercepted by the Israeli Airforce after it flew over the Egyptian border towards the Gaza envelope. Sirens sounded in multiple Israeli settlements.",
      "timestamp": "2025-08-23T19:51:27.385441Z"
    },
    {
      "original": "Another drone from Yemen flew in from the southwest and began flying parallel with the Gaza border. Multiple interceptors were used, all of which failed to intercept it, reportedly resulting in fighter jets being scrambled. A helicopter was eventually able to shoot it down.  \nAs for the reports on supposed rocket launches from the Gaza Strip coinciding with the drone flight, I haven’t seen any information to suggest this actually occurred yet.",
      "timestamp": "2025-08-23T19:51:27.385448Z"
    },
    {
      "original": "This is a treeline recently recaptured by Ukraine, east of Dobropillya. 12 FABs were then dropped on it (11 hits). \nCredit: \n@tom_bike",
      "timestamp": "2025-08-23T19:51:27.385454Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now.   At least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit.   More KABs are…",
      "timestamp": "2025-08-23T19:51:27.385458Z"
    },
    {
      "original": "Footage was published showing attacks on one of the targets from yesterday's massive attack on Kramatorsk, Donetsk Oblast.\n2 MLRS rockets and 7 Geran-2 drones were used here, reportedly targeting a deployment point of two battalions of the 156th mechanised brigade of the AFU, as well as the brigade command post and warehouses storing equipment. \nAdditional strikes were carried out on various other parts in and around Kramatorsk for most of the rest of the day, up until around 10pm. Over the course of the day, at least 60 KAB glide-bombs, 12 Geran-2 drones, 2 Iskander-M ballistic missiles, as well as repeated MLRS and long-range artillery strikes, targeted the area. We will likely get more footage later on.\nCoordinates for the video: 48.76239, 37.48414",
      "timestamp": "2025-08-23T19:51:27.385463Z"
    },
    {
      "original": "The Ukrainian Air Force announced that a Ukrainian MiG-29 crashed while landing, after completing a combat mission. The pilot, a 45–46-year-old, was killed.",
      "timestamp": "2025-08-23T19:51:27.385466Z"
    },
    {
      "original": "Russian forces have captured the village of Kolodyazi, Lyman direction, Donetsk Oblast.\nPre-war population: ~340.\nTotal land area: ~1.40 km².",
      "timestamp": "2025-08-23T19:51:27.385472Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Novyi Myr, Borova direction, Kharkiv Oblast.\nPre-war population: ~81.\nTotal land area: ~0.52km².",
      "timestamp": "2025-08-23T19:51:27.385477Z"
    },
    {
      "original": "In the Pokrovske direction, over the past week and a half, Russian forces have been continuing to make significant progress in Zaporizhzhia, Dnipropetrovsk, and Donetsk Oblasts.\nIn the south, Russian forces began assault operations in a section of the front that has remained largely quiet for years. They pushed west from the area of Levadne, and advanced down several treelines on the tactical heights, as well as down the northern bank of the Solona River in the direction of Olhivske. \nTo the north, they expanded their wedge in Zaporizhzhia Oblast from Novodarivka, pushing southwest and uphill to the tactical heights, as well as west - further down the forest plantations in the low-lying ground. They also improved their positions on the tactical heights to the north, by attacking southwest from the Temyrivka - Zelene Pole road.\nFurther north, after capturing Temryivka, Russian forces advanced uphill and northwest towards Zaporizke, capturing new treeline positions and approaching its outskirts from two directions. They also spearheaded north along the Dnipropetrovsk side of the regional border to Novoheorhiivka, quickly establishing control over the village and forcing a Ukrainian withdrawal from the adjacent positions. \nAdvances were also made between the Vorona River and a tributary of the Vorona River in Donetsk Oblast, where they were able to push downhill towards Komyshuvakha, while further improving their positions southwest and west of Shevchenko. \nIn the north, Russian forces continued to bypass the rest of Maliivka from the north, moving along the heights, and capturing the agricultural buildings as well as the western part of the village, reaching the low-lying ground south of Sichneve. \n+ ~54.9km² in favour of Russia.",
      "timestamp": "2025-08-23T19:51:27.385484Z"
    },
    {
      "original": "In the Prosyana-Novopavlivka direction, both Ukrainian and Russian forces have advanced, with Ukrainian forces making significant progress over the past week in a new series of counterattacks.\nAfter containing the Russian advance in Andrivika-Klevtosve, Ukrainian forces retook all their previously lost positions in the village and began pushing west and south against the poorly consolidated Russian positions. They were able to clear the eastern bank of the Vovcha River south of Andriivka-Klevtsove of a Russian presence and began advancing towards Piddubne. \nThey were able to make a deep 6.5km penetration through Russian lines along the highway and turned north to clear the orchards and surrounding treelines. From there, Ukrainian forces entered western Tolstoi and established control over part of the village. Additional forces were also able to secure their rear, capturing numerous treeline positions southwest and south of Zelenyi Hai.\nAdditionally, after the Russians failed to capture the positions along the southern bank of the Vovcha River south of Ivanivka, Ukrainian forces began attacking southwest towards Zelenyi Hai. After fierce back-and-forth fighting, they were able to seize the agricultural buildings and surrounding treelines on the outskirts of Zelenyi Hai, before entering and capturing the northern part of the settlement. \nMeanwhile, Russian forces advanced north from the Yalta - Novokhatske Line, reaching the southern bank of the Vovcha River and taking up new positions in the forest plantations there. \n+ ~32.10km² in favour of Ukraine.\n+ ~4.23km² in favour of Russia.",
      "timestamp": "2025-08-23T19:51:27.385491Z"
    },
    {
      "original": "On the western flank of Pokrovsk, both Russian and Ukrainian forces have advanced, capturing positions on the Donetsk side of the regional border.\nUkrainian forces advanced from their concrete fortification northwest of Novoserhiivka, crossing the Solona River, and infiltrating northeastern Novomykolaivka. After entrenching in positions there, attempts were made to further expand their zone of control to the centre of the village. It's unclear if these succeeded, however the grey zone has expanded. \nRussian forces continued their slow, grinding advance through Udachne. They were able to capture new positions in the town centre, north of the railway line, which was previously turned into a kill-zone by Ukraine to prevent the Russians from reaching their remaining positions in the area of the school in the northwestern part of the town. \n+ ~0.95km² in favour of Ukraine.\n+ ~0.47km² in favour of Russia.",
      "timestamp": "2025-08-23T19:51:27.385497Z"
    }
  ],
  "script_run_time": "2025-08-23T19:51:27.766969Z"
}