{
  "messages": [
    {
      "original": "🛵\n БпЛА на північно-західному напрямку Донеччини\n➡️\n   курсом на захід.\n🛵\n БпЛА на східному напрямку Харківщини\n➡️\n   курсом на захід.\n🛵\n БпЛА на заході Сумщини \n➡️\n   курсом на Чернігівщину.",
      "timestamp": "2025-09-09T20:59:50.238267Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-09-09T20:59:50.238282Z"
    },
    {
      "original": "🛵\n Дніпропетровщина у Лозівському, Павлоградському та Синельниківському районах - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238287Z"
    },
    {
      "original": "🛵\n Полтавщина - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238295Z"
    },
    {
      "original": "🛵\n Золотоніський, Черкаський райони Черкаська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238299Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини \n➡️\n   курсом на Запоріжжя.",
      "timestamp": "2025-09-09T20:59:50.238305Z"
    },
    {
      "original": "🛵\n Південь Дніпропетровщини - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238309Z"
    },
    {
      "original": "🛵\n Броварський район Київська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238313Z"
    },
    {
      "original": "🛵\n Вишгородський район Київська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238319Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі.",
      "timestamp": "2025-09-09T20:59:50.238324Z"
    },
    {
      "original": "🛵\n Бучанський район Київська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238328Z"
    },
    {
      "original": "🛵\n Житомирщина - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238332Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.\n🛵\n Чернігів - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238338Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Харківщини, на півночі Дніпропетровщини\n➡️\n   курсом на захід.\n🛵\n БпЛА на південно-східному напрямку Кіровоградщини \n➡️\n   курсом на захід.\n🛵\n БпЛА на Сумщині \n➡️\n   курсом на Чернігівщину.\n \n🛵\n БпЛА по всій території Чернігівщини \n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на півночі Київщини\n➡️\n   курсом на Житомирщину.\n🛵\n БпЛА на Житомирщині\n➡️\n   курсом на захід.",
      "timestamp": "2025-09-09T20:59:50.238357Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-09T20:59:50.238362Z"
    },
    {
      "original": "🛵\n Київ та Рівненщина - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238366Z"
    },
    {
      "original": "🛵\n Бориспільський  район Київська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238372Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Харківщини, на сході Полтавщини\n➡️\n   курсом на захід.\n🛵\n БпЛА на заході Дніпропетровщини та сході Кіровоградщини\n➡️\n   курсом на захід.\n🛵\n БпЛА на півночі Сумщини\n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на Полтавщині\n➡️\n   курсом на південно-західний напрямок.\n \n🛵\n БпЛА по всій території Чернігівщини \n➡️\n   курсом на південно-західний напрямок, на Київщину.\n🛵\n БпЛА на півночі Київщини\n➡️\n   курсом на Житомирщину.\n🛵\n БпЛА на заході Житомирщини та сході Рівненщини\n➡️\n   курсом на захід.",
      "timestamp": "2025-09-09T20:59:50.238394Z"
    },
    {
      "original": "🛵\n Київ - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T20:59:50.238400Z"
    },
    {
      "original": "🛵\n БпЛА на сході Волині\n➡️\n   курсом на захід, Луцьк!",
      "timestamp": "2025-09-09T20:59:50.238407Z"
    },
    {
      "original": "The death toll from the shooting attack in Jerusalem has increased to 6 after another civilian succumbed to their injuries. Israeli Minister of National Security Itamar Ben-Gvir has arrived at the site.   Meanwhile, Israeli forces are reportedly arriving the…",
      "timestamp": "2025-09-09T20:59:50.832388Z"
    },
    {
      "original": "The Al-Qassam Brigades (Hamas) claimed responsibility for the shooting attack on a civilian bus in Jerusalem which killed 6 Israelis.",
      "timestamp": "2025-09-09T20:59:50.832399Z"
    },
    {
      "original": "The explosion in Slovyansk was likely from an Iskander strike. It could be heard from Kramatorsk.",
      "timestamp": "2025-09-09T20:59:50.832403Z"
    },
    {
      "original": "Repeated explosions in Slovyansk. This time from KAB glide-bomb strikes.",
      "timestamp": "2025-09-09T20:59:50.832406Z"
    },
    {
      "original": "The IDF confirmed that four Israeli soldiers were killed in the ambush on an Israeli tank in Jabalia, Northern Gaza, yesterday.",
      "timestamp": "2025-09-09T20:59:50.832410Z"
    },
    {
      "original": "The Al-Qassam Brigades (Hamas) has claimed responsibility for yesterday's attack on an Israeli Merkava Tank in Jabalia, Northern Gaza, that killed four Israeli soldiers.\nThey stated that fighters stormed an IDF outpost in the centre of Jabalia, climbed on top of a tank and threw a \"Baraq\" Explosively Formed Penetrator into the open commander's hatch.\nJabalia is home to Hamas' heavily degraded Jabalia Battalion - part of the Northern Brigade. Israel previously claimed to have fully dismantled this brigade and have largely cleared Jabalia three times in the past. Nevertheless, the city's close proximity to Gaza City allows for Palestinian militants to re-enter and reconstruct each time the IDF withdraws.",
      "timestamp": "2025-09-09T20:59:50.832415Z"
    },
    {
      "original": "The explosion in Slovyansk was likely from an Iskander strike. It could be heard from Kramatorsk.",
      "timestamp": "2025-09-09T20:59:50.832419Z"
    },
    {
      "original": "The Iskander strike on Slovyansk seems to have targeted this building. Possibly a temporary deployment point or command post. \nCoordinates: 48.849488, 37.575231",
      "timestamp": "2025-09-09T20:59:50.832423Z"
    },
    {
      "original": "The Iskander strike on Slovyansk seems to have targeted this building. Possibly a temporary deployment point or command post. \nCoordinates: 48.849488, 37.575231",
      "timestamp": "2025-09-09T20:59:50.832428Z"
    },
    {
      "original": "The Iskander strike on Slovyansk seems to have targeted this building. Possibly a temporary deployment point or command post.   Coordinates: 48.849488, 37.575231",
      "timestamp": "2025-09-09T20:59:50.832431Z"
    },
    {
      "original": "The target was a concentration of manpower and equipment from the 3rd separate assault brigade \"Azov\". We will likely get a video of this from a Russian recon drone later.",
      "timestamp": "2025-09-09T20:59:50.832434Z"
    },
    {
      "original": "The target was a concentration of manpower and equipment from the 3rd separate assault brigade \"Azov\". We will likely get a video of this from a Russian recon drone later.",
      "timestamp": "2025-09-09T20:59:50.832437Z"
    },
    {
      "original": "You may remember that 2 Iskanders \ntargeted\n a temporary deployment for Azov in Slovyansk on August 18. It seems that the Russians are specifically searching for them now.",
      "timestamp": "2025-09-09T20:59:50.832444Z"
    },
    {
      "original": "An unknown perpetrator opened fire on an Israeli soldier in Sderot, near the border with the Gaza Strip. Israeli media is suggesting that this could be an infiltration from Gaza. \nIsraeli soldiers have been deployed to search for the suspect. \nMore to come.",
      "timestamp": "2025-09-09T20:59:50.832449Z"
    },
    {
      "original": "An unknown perpetrator opened fire on an Israeli soldier in Sderot, near the border with the Gaza Strip. Israeli media is suggesting that this could be an infiltration from Gaza.   Israeli soldiers have been deployed to search for the suspect.   More to come.",
      "timestamp": "2025-09-09T20:59:50.832452Z"
    },
    {
      "original": "The gunfire was heard in the area of Yad Mordekhay Junction, around 3.7 km from the border with Gaza. However, it seems that this may have been criminal, and unrelated to Gaza.",
      "timestamp": "2025-09-09T20:59:50.832455Z"
    },
    {
      "original": "Activity on frequencies used by Tu-22M3 strategic bombers suggests that launches of Kh-22 cruise missiles could take place tonight, although it is currently unclear if the activity is training-related. \nEarlier, six Tu-22M3s redeployed from Engels-2 Airbase, Saratov Oblast, to Diaghilev Airbase, Ryazan Oblast.",
      "timestamp": "2025-09-09T20:59:50.832459Z"
    },
    {
      "original": "⚡️\n🇶🇦\n🇮🇱\n🇵🇸\n Qatar says it will continue its mediation efforts in the Gaza negotiations despite the Israeli strike.\n@wfwitness",
      "timestamp": "2025-09-09T20:59:50.832467Z"
    },
    {
      "original": "Activity on frequencies used by Tu-22M3 strategic bombers suggests that launches of Kh-22 cruise missiles could take place tonight, although it is currently unclear if the activity is training-related.   Earlier, six Tu-22M3s redeployed from Engels-2 Airbase…",
      "timestamp": "2025-09-09T20:59:50.832471Z"
    },
    {
      "original": "Additional activity is being recorded on the 4389㎑ frequencies, which has been used by Tu-95MS strategic bombers from Olenya Airbase in the past, although a different frequency was used in the most recent attack.",
      "timestamp": "2025-09-09T20:59:50.832474Z"
    },
    {
      "original": "Activity on combat frequencies related to Tu-95MS and Tu-160 strategic bombers at Engels-2 Airbase, Saratov Oblast, has also been recorded. Departures will probably take place in the near future.",
      "timestamp": "2025-09-09T20:59:50.832479Z"
    },
    {
      "original": "Large numbers of Geran-2 drones are being launched / entering Ukrainian airspace. 40+ are flying through Chernihiv Oblast, likely to the western regions of Ukraine. \nSo far, launches have been reported from:\nKhalino Airbase, Kursk Oblast.\nMillerovo Airbase, Rostov Oblast (x2).\nNavlya Testing Ground, Bryansk Oblast (x2).\nShatalovo Airbase, Smolensk Oblast. \nTsumbulova Test Site, Oryol Oblast. \nCape Chauda, Crimea.\nAt least 70 Gerans are currently recorded in Ukrainian airspace.",
      "timestamp": "2025-09-09T20:59:50.832488Z"
    },
    {
      "original": "4 Kalibr carriers are operating off the coast of Anapa, Krasnodar Krai, in the eastern Black Sea, including 3 Buyan-M class corvettes, and 1 submarine of the \"Varshavyanka\" project. \nTotal possible salvo up 30 Kalibr cruise missiles.",
      "timestamp": "2025-09-09T20:59:50.832492Z"
    },
    {
      "original": "The airspace surrounding Diaghilev Airbase, Ryazan Oblast has been closed from midnight on September 10, to 11:59pm. As many as 6 Tu-22M3s may launch Kh-22 cruise missiles at Ukraine during the attack tonight.",
      "timestamp": "2025-09-09T20:59:50.832495Z"
    },
    {
      "original": "Possible departures of 1 Tu-160 and 1 Tu-95MS from Engels-2 Airbase, Saratov Oblast. \nClarifying.",
      "timestamp": "2025-09-09T20:59:50.832499Z"
    },
    {
      "original": "Sections of airspace in the area of the launch zones for MiG-31Ks in Tambov and Lipetsk Oblasts have been closed. There is a possibility of launches of Kinzhal hypersonic Aeroballistic missiles tonight, but this is not definite.",
      "timestamp": "2025-09-09T20:59:50.832502Z"
    },
    {
      "original": "Possible departures of 1 Tu-160 and 1 Tu-95MS from Engels-2 Airbase, Saratov Oblast.   Clarifying.",
      "timestamp": "2025-09-09T20:59:50.832505Z"
    },
    {
      "original": "So far, 2 Tu-95s are confirmed to have taken off from Engel-2 Airbase.",
      "timestamp": "2025-09-09T20:59:50.832508Z"
    },
    {
      "original": "A third Tu-95MS has departed from Engels-2 Airbase.",
      "timestamp": "2025-09-09T20:59:50.832511Z"
    }
  ],
  "script_run_time": "2025-09-09T20:59:51.414989Z"
}