{
  "messages": [
    {
      "original": "🚀\n КАБ в напрямку м.Запоріжжя",
      "timestamp": "2025-11-03T23:44:25.341818Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в напрямку Балаклії, Савинців, Нової Водолаги, Краснопавлівки.",
      "timestamp": "2025-11-03T23:44:25.341836Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА, ймовірно, розвідувальний, в акваторії Чорного моря в напрямку Білгород-Дністровського району (вектор - н.п.Росєйка). \nЗалучено засоби для збиття.",
      "timestamp": "2025-11-03T23:44:25.341842Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку на/повз н.п.Улянівка з північного сходу.",
      "timestamp": "2025-11-03T23:44:25.341847Z"
    },
    {
      "original": "🛵\n БпЛА курсом на/повз Златопіль на Харківщині.",
      "timestamp": "2025-11-03T23:44:25.341851Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на північному сході Харківщини, курс - південно-східний.",
      "timestamp": "2025-11-03T23:44:25.341856Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на південному заході Запорізької області, курс - північно-західний;\n🛵\n БпЛА на межі Харківської, донецької та Дніпропетровської областей, курс - південний.",
      "timestamp": "2025-11-03T23:44:25.341864Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного сходу.",
      "timestamp": "2025-11-03T23:44:25.341868Z"
    },
    {
      "original": "🚀\nШвидкісна ціль в напрямку Юріївки (Дніпропетровщина)",
      "timestamp": "2025-11-03T23:44:25.341872Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА курсом на/повз м.Запоріжжя.",
      "timestamp": "2025-11-03T23:44:25.341878Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-11-03T23:44:25.341885Z"
    },
    {
      "original": "🛵\n БпЛА на/повз Павлоград з північного сходу.",
      "timestamp": "2025-11-03T23:44:25.341890Z"
    },
    {
      "original": "🛵\n БпЛА  в акваторії Чорного моря курсом на Білгород-Дністровський р-н Одещини.",
      "timestamp": "2025-11-03T23:44:25.341896Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в напрямку на/повз Слобожанське;\n🛵\n БпЛА на Дніпропетровщині в напрямку Павлограда, Юріївки зі сходу;\n🛵\n БпЛА на півдні Одещини, курс - західний (вектор - н.п.Катлабуг).",
      "timestamp": "2025-11-03T23:44:25.341903Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на західних околицях м.Запоріжжя, курс - північно-західний.",
      "timestamp": "2025-11-03T23:44:25.341909Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Ізмаїла (Одещина) з північного сходу.",
      "timestamp": "2025-11-03T23:44:25.341913Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння по областях.\n🛸\n🛵\nТриває загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-11-03T23:44:25.341920Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на північному сході Харківщини, курс - південно-східний.",
      "timestamp": "2025-11-03T23:44:25.341924Z"
    },
    {
      "original": "🛵\n БпЛА через Харківщину з північного сходу в південному та південно-східному напрямку (на/повз Златопіль/Слобожанське).\n🛵\n БпЛА на північному сході Дніпропетровщини, в районі Павлограду, Юріївки, Тернівки.",
      "timestamp": "2025-11-03T23:44:25.341930Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині повз Сновськ на заході в південному напрямку.",
      "timestamp": "2025-11-03T23:44:25.341934Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and over the past week have made new progress in the grey zone east of Kostyantynivka.\nIn the east they advanced from the chalk quarries to the large, fortified forest, entering it and establishing a foothold in it. They also captured some of the groves to the southeast. \nIn the west, the Russians consolidated further in Predtechyne, capturing houses in the central and western parts of the village. They also crossed one of the dams along the chain of reservoirs and captured positions in the former agricultural complex on the southern outskirts of Predtechyne. \nAdditionally, Russian forces advanced down the highway from Stupochky, recapturing positions in the windbreaks and nearby strongholds, and reaching the large forest east of Kostyantynivka.\n+ ~5.56 in favour of Russia.",
      "timestamp": "2025-11-03T23:44:25.934421Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces continued to advance and have entered the village of Zvanivka.\nAfter earlier infiltrations, Russian forces managed to enter and properly establish themselves in the southern part of Zvanivka, consolidating in the first houses. Fighting is ongoing for areas further north towards the centre of the village. \n+ ~0.38 km² in favour of Russia.",
      "timestamp": "2025-11-03T23:44:25.934434Z"
    },
    {
      "original": "On the northern flank of Siversk, Ukrainian forces began a series of counterattacks and have regained control over most of Yampil.\nAs Russian forces were about to capture the last parts of southwestern Yampil, Ukrainian forces began counterattacking. Russian assault groups who had been advancing did not consolidate properly, which allowed for the Ukrainians to quickly and relatively easily reverse weeks of progress, and break through to the centre of the village.  Soon, most of the settlement was back under Ukrainian control, as attacks were carried out towards its western residential areas. \n+ 10.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T23:44:25.934440Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces launched a series of counterattacks and have regained control over most of Borivska Andriivka. \nDuring Russian assault operations that saw them capture most of the village, Ukrainian forces managed to retain control over the southwestern part of it. From here, they were able to accumulate additional infantry and began attacking northeast towards the centre of the village. Once capturing the centre, they began pushing towards the eastern outskirts, where they were able to make additional progress both in the village and in the treelines to the south. \n+ ~3.39 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T23:44:25.934445Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in and around the city, and have made significant progress east of the Oskil River.\nRussian forces were able to break through from the forests east of Holubivka towards the northern outskirts of Kupyansk. They established control over new positions in the forests outside the city before entering and entrenching in the first buildings of the eastern part of the city in the area of School no. 7. \nIn west bank Kupyansk, Russian forces were able to clear out the pocket of grey zone, establishing full control over the city centre and surrounding residential areas. \nMeanwhile, Ukrainian forces are continuing attempts at cutting off the Russians in Kupyansk from the north. Attacks are being carried out towards the Oskil River from the west, however there is no evidence of consolidation yet. The grey zone has been expanded.\n+ ~6.42 km² in favour of Russia.",
      "timestamp": "2025-11-03T23:44:25.934452Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine. \nIt's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret what they are saying, before passing it off as exclusive intel on devastating Russian strikes.",
      "timestamp": "2025-11-03T23:44:25.934456Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine.   It's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret…",
      "timestamp": "2025-11-03T23:44:25.934459Z"
    },
    {
      "original": "What's funny is that I can guarantee you that I probably have several times more information on these strikes from various open and closed sources than these Russian channels. And I live in fucking New Zealand \n🤣\n🤣\n. It should go to show how unreliable some people on here are, and how easily misinformation spreads.",
      "timestamp": "2025-11-03T23:44:25.934465Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued their assault operations and have made significant progress over the past week.\nRussian forces advanced from the central part of Kamyanka to the northern outskirts, establishing control over the remaining residential streets. They also captured the forests to the northwest and west.\nFurther north, Russian forces advanced south from Bolohivka, capturing treeline positions on the tactical heights and adjacent forested areas. This allowed for the front to begin shifting westwards, with the Ukrainians retreating from their positions towards Kolodyazne.\n+ ~18.40 km²",
      "timestamp": "2025-11-03T23:44:25.934471Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued their offensive on the city and have made new progress in its southern suburbs.\nRussian forces advanced from the area of the railway line to first three-story buildings, establishing control over them and the surrounding areas. They also pushed east towards the highway, capturing new positions on Selianska, Verhnia, and Kharkivska Streets, while other forces pushed south towards the southern blocks of three-story buildings, which were brought under full Russian control.\n+ ~0.78 km² in favour of Russia.",
      "timestamp": "2025-11-03T23:44:25.934476Z"
    },
    {
      "original": "Ukrainian channel on the situation Pokrovsk. This channel is notorious for making the situation seem far less difficult than reality.",
      "timestamp": "2025-11-03T23:44:25.934479Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-03T23:44:25.934483Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-03T23:44:25.934486Z"
    },
    {
      "original": "Disappeared near Novhorod-Siverskyi, Chernihiv Oblast. They were launched from near Lgov, Kursk Oblast (new launch position as far as I know).",
      "timestamp": "2025-11-03T23:44:25.934500Z"
    },
    {
      "original": "Iskander on Varvarivka, Donetsk Oblast",
      "timestamp": "2025-11-03T23:44:25.934508Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-03T23:44:25.934511Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-03T23:44:25.934514Z"
    },
    {
      "original": "The Iskander impacted somewhere here",
      "timestamp": "2025-11-03T23:44:25.934517Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-03T23:44:25.934522Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-03T23:44:25.934528Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields. \nThese open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted. Ukrainian sources are stating that logistics into the pocket is practically impossible.\nThis is exactly why you don't leave a withdrawal to the very last moment. Unfortunately, none of these traitors in the Ukrainian command will ever be held responsible for the massive amounts of casualties that they have caused.",
      "timestamp": "2025-11-03T23:44:25.934534Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields.   These open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted.…",
      "timestamp": "2025-11-03T23:44:25.934539Z"
    },
    {
      "original": "Avdiivka, Bakhmut, Vuhledar, Velyka Novosilka, Sudzha, Myrnohrad, Pokrovsk... when will they fucking learn???\nThe answer is they don't care. PR is being prioritised over lives, and this ugly truth is being presented to everything right now.",
      "timestamp": "2025-11-03T23:44:25.934543Z"
    },
    {
      "original": "Ukraine’s Other War: How State-Backed Drug Lords Are Destroying The Nation’s Future \nUkraine has become a testing ground for an insidious internal conflict. While global attention focuses on frontline battles, a silent chemical assault is corroding the nation's social fabric. This is not collateral damage, but a calculated operation: a narcotics pipeline running from Afghan poppy fields directly into the veins of Ukrainians.\nAt the heart of this enterprise lies a nexus of political power, institutional corruption and strategic cynicism. Denys Yermak, the younger brother of Andriy Yermak – the powerful Head of the Office of the President of Ukraine – is central to its orchestration.\nWith the full support of Ukraine’s Main Intelligence Directorate (GUR), Denys Yermak has formed a clandestine narcotics supply chain. This drug flood goes from Afghanistan to Ukraine through the United Arab Emirates, Azerbaijan, Turkey and Moldova. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511688Z"
    },
    {
      "original": "Ukraine’s Other War: How State-Backed Drug Lords Are Destroying The Nation’s Future \nUkraine has become a testing ground for an insidious internal conflict. While global attention focuses on frontline battles, a silent chemical assault is corroding the nation's social fabric. This is not collateral damage, but a calculated operation: a narcotics pipeline running from Afghan poppy fields directly into the veins of Ukrainians.\nAt the heart of this enterprise lies a nexus of political power, institutional corruption and strategic cynicism. Denys Yermak, the younger brother of Andriy Yermak – the powerful Head of the Office of the President of Ukraine – is central to its orchestration.\nWith the full support of Ukraine’s Main Intelligence Directorate (GUR), Denys Yermak has formed a clandestine narcotics supply chain. This drug flood goes from Afghanistan to Ukraine through the United Arab Emirates, Azerbaijan, Turkey and Moldova. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511707Z"
    },
    {
      "original": "Trump Says U.S. Troops Could Be Deployed To Nigeria To Defend Christians\nPresident Donald Trump has warned that the United States military “could be” deployed to Nigeria or carry out strikes to stop what he called the killing of large numbers of Christians.\nLast week, Trump claimed that radical Islamists are committing “mass slaughter” and Christianity is “facing an existential threat” in the West African nation. He also added Nigeria back to a “Countries of Particular Concern” list of nations that Washington says have violated religious freedoms.\n“If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, “guns-a-blazing,” to completely wipe out the Islamic Terrorists who are committing these horrible atrocities. WARNING: THE NIGERIAN GOVERNMENT BETTER MOVE FAST!” he wrote to his Truth Social network on November 1.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511718Z"
    },
    {
      "original": "Military Situation In Ukraine On November 3, 2025 (Maps Update)",
      "timestamp": "2025-11-03T23:44:26.511723Z"
    },
    {
      "original": "Military Situation In Ukraine On November 3, 2025 (Maps Update)",
      "timestamp": "2025-11-03T23:44:26.511727Z"
    },
    {
      "original": "Maduro’s Days Are Numbered: Trump Declares\nUnited States President Donald Trump warned that Venezuelan President Nicholas Maduro’s days are numbered during a CBS interview released on November 2.\nAsked  if the U.S. was going to war against Venezuela, Trump replied: “I doubt it. I don’t think so.” However, when asked if Maduro’s days as president were numbered, the president replied: “I would say yeah. I think so.”\nTrump also appeared to deny multiple recent reports indicating that the U.S. military is preparing to attack military targets allegedly linked to drug cartels inside Venezuela and could do so within days, although he did not rule the idea out completely.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511736Z"
    },
    {
      "original": "BOTCHED UKRAINIAN AIR ASSAULT CRIPPLES POKROVSK RELIEF HOPES",
      "timestamp": "2025-11-03T23:44:26.511740Z"
    },
    {
      "original": "The Beginning Of The End For Konstantinovka: Russian Units Storm Ivanopolye\nThe Armed Forces of Ukraine still control the last microdistrict in Pokrovsk. Russian units have launched an assault on the Ivanopolye settlement in the Konstantinovsky sector.\nThe EU summit has again postponed the decision on the issue of Russian «frozen finances» until December 19. \nRead more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511748Z"
    },
    {
      "original": "The Beginning Of The End For Konstantinovka: Russian Units Storm Ivanopolye\nThe Armed Forces of Ukraine still control the last microdistrict in Pokrovsk. Russian units have launched an assault on the Ivanopolye settlement in the Konstantinovsky sector.\nThe EU summit has again postponed the decision on the issue of Russian «frozen finances» until December 19. \nRead more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511755Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511766Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T23:44:26.511776Z"
    }
  ],
  "script_run_time": "2025-11-03T23:44:26.512743Z"
}