{
  "messages": [
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Білоцерківського району.",
      "timestamp": "2025-11-12T14:51:44.383514Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на Харківщині в районі н.п. Слобожанське та Краснопавлівка, на південно-східний напрямок.",
      "timestamp": "2025-11-12T14:51:44.383530Z"
    },
    {
      "original": "🛵\n Безпілотник на заході від н.п. Звенигородка на Черкащині, курсом на південь.",
      "timestamp": "2025-11-12T14:51:44.383537Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-12T14:51:44.383546Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-11-12T14:51:44.383550Z"
    },
    {
      "original": "🛵\n Група БпЛА в напрямку Одеси з акваторії Чорного моря.",
      "timestamp": "2025-11-12T14:51:44.383555Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-12T14:51:44.383562Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини курсом на Полтавщину.",
      "timestamp": "2025-11-12T14:51:44.383567Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину.",
      "timestamp": "2025-11-12T14:51:44.383571Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Чорноморськ",
      "timestamp": "2025-11-12T14:51:44.383575Z"
    },
    {
      "original": "🛵\n БпЛА з Полтавщини курсом на Харківщину (Берестинський район)",
      "timestamp": "2025-11-12T14:51:44.383579Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Дніпропетровщини ,курсом на Павлоград.",
      "timestamp": "2025-11-12T14:51:44.383584Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-11-12T14:51:44.383588Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Херсона зі сходу.",
      "timestamp": "2025-11-12T14:51:44.383592Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2025-11-12T14:51:44.383600Z"
    },
    {
      "original": "🛵\n Безпілотник на Харків з півночі.",
      "timestamp": "2025-11-12T14:51:44.383604Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-11-12T14:51:44.383608Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на н.п. Лозова на Харківщині з півночі.",
      "timestamp": "2025-11-12T14:51:44.383612Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на південь Миколаївщини з Херсонської області.",
      "timestamp": "2025-11-12T14:51:44.383616Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині:\n- з півночі на н.п. Коломак;\n- на схід від н.п. Златопіль, курсом на південь;\n- на півдні, курсом на Дніпропетровщину.",
      "timestamp": "2025-11-12T14:51:44.383621Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 1):   Over the past few days, Russian forces have made substantial progress on the tactical heights west of Pokrovsk, while the last streets of the city begin to come under Russian control.  North of Udachne, Russian…",
      "timestamp": "2025-11-12T14:51:45.071789Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 2): \nIn Rodynske, extremely heavy fighting continues. The Ukrainians are attempting to exploit poorly consolidated Russian positions in the city centre to reach the southeastern high-rise micro-district, while Russian forces continue attempts to counterattack from the flanks. Both sides are using extensive heavy weaponry to strike each other's positions. Ukraine is using MiG-29s and F-16s to launch glide-bombs at Russian positions in the city, while Russia continues to strike the Ukrainian positions in the city along with its main supply line with FAB glide-bombs.",
      "timestamp": "2025-11-12T14:51:45.071808Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-12T14:51:45.071811Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-12T14:51:45.071815Z"
    },
    {
      "original": "Do you guys think Zelensky is aware of his curse?",
      "timestamp": "2025-11-12T14:51:45.071818Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-12T14:51:45.071824Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-12T14:51:45.071828Z"
    },
    {
      "original": "Despite the fierce battles, St. Michael's Church in Pokrovsk city centre has been left practically untouched.",
      "timestamp": "2025-11-12T14:51:45.071832Z"
    },
    {
      "original": "The surrounded Ukrainian units in Myrnohrad continue to be pounded by Russian FAB glide-bombs. \nThis video shows a FAB-3000 strike on high-rise buildings in the southern part of the city.",
      "timestamp": "2025-11-12T14:51:45.071836Z"
    },
    {
      "original": "Last night, Russia carried out a larger than usual Geran-2 drone attack on Ukraine. Approximately 200 Gerans and Gerberas were recorded in Ukrainian airspace, attacking targets in the areas of the following locations:\nKramatorsk, Donetsk Oblast (energy infrastructure).\nBohuslav, Kyiv Oblast (energy infrastructure).\nVinnytsia City, Vinnytsia Oblast.\nLadyzhyn, Vinnytsia Oblast (Thermal Power Plant).\nLozova, Kharkiv Oblast (Railway station).\nPavlohrad, Dnipropetrovsk Oblast.\nVasylkivka, Dnipropetrovsk Oblast (railway infrastructure).\nPetropavlivka, Dnipropetrovsk Oblast.\nChaplyne, Dnipropetrovsk Oblast (railway infrastructure).\nBerezivka, Odesa Oblast (energy infrastructure).\nDolynska, Kirovohrad Oblast.\nKropyvnytskyi, Kirovohrad Oblast.\nOdesa City, Odesa Oblast.",
      "timestamp": "2025-11-12T14:51:45.071849Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked the cities of Slovyansk and Kramatorsk in Donetsk Oblast. \nAt least 4 drones struck energy infrastructure in Kramatorsk, while 2 drones impacted an unknown target in Slovyansk. \nVideos are both from Kramatorsk.",
      "timestamp": "2025-11-12T14:51:45.071854Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked the cities of Slovyansk and Kramatorsk in Donetsk Oblast. \nAt least 4 drones struck energy infrastructure in Kramatorsk, while 2 drones impacted an unknown target in Slovyansk. \nVideos are both from Kramatorsk.",
      "timestamp": "2025-11-12T14:51:45.071858Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-12T14:51:45.071861Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-12T14:51:45.071866Z"
    },
    {
      "original": "Over the last week, local Palestinian armed groups affiliated with the Palestinian Islamic Jihad's Saraya Al-Quds Brigades claimed responsibility for two attacks in the West Bank.\nOn November 4, the \"Tulkarm Brigade\" stated that their fighters fired on a newly established Israeli outpost with small arms near the border with Israel west of the city of Tulkarm. This is the first recorded presence of Palestinian militants in the area of Tulkarm City in some time. IDF troops effectively occupy the city, which previously served as a stronghold for multiple armed groups.\nOn November 11, the \"Nablus Brigade\" stated that their fighters fired on an Israeli military vehicle with small arms near the \"Alon Moreh\" settlement east of Nablus. An increase in insurgent activity has been recorded in the Nablus area over the past month, which has seen very little activity recently due to frequent and sustained IDF raids.\nNo Israeli casualties were reported in either of these incidents.\nAdditionally, the Saraya Al-Quds Brigades announced the death of a fighter from the local armed group \"Tubas Battalion\" after he was killed by IDF troops in the Al-Fara'a Refugee Camp.",
      "timestamp": "2025-11-12T14:51:45.071871Z"
    },
    {
      "original": "I'm having issues with my computer, so I won't be able to post map updates from Ukraine today. All updates are live on my interactive map as usual, and I will try to make long-form posts about them as soon as possible.\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=48.38420505740439%2C37.273749674799895&z=12",
      "timestamp": "2025-11-12T14:51:45.071875Z"
    },
    {
      "original": "🇺🇦\n⚡️\n — Ukraine has suspended Justice Minister German Galushchenko amid an energy-sector corruption investigation. \n➡️\n His duties have been taken over by Deputy Minister for European Integration Lyudmyla Sugak. \n➡️\n Galushchenko, who served as energy minister for four years, is accused of receiving “personal benefits” from Timur Mindich in exchange for influence over energy-sector funds.\n@TabZLIVE",
      "timestamp": "2025-11-12T14:51:45.071885Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-12T14:51:45.071888Z"
    },
    {
      "original": "Consequences of the morning Russian Geran-2 drone strikes on a warehouse facility in Kharkiv City.",
      "timestamp": "2025-11-12T14:51:45.071892Z"
    },
    {
      "original": "I’m seeing a lot of “Pro-Ukraine” accounts calling for mass mobilisation of more Ukrainian men today. \nTo those people advocating for this, think for a second - would you go and volunteer yourself? Would you go and fight alongside the country you claim to support so much? \nOr are you happy with just sitting at home in your comfortable, peaceful country advocating for the killing of hundreds of thousands. Because that’s what it would mean - mass mobilisation of additional Ukrainians would be condemning a significant portion of them to their deaths. They will die for a war that cannot be won. \nAll the while you have the audacity to claim that this is a good idea, while not being prepared to do anything yourself other than lie on Twitter for money and engagement. \nPeople like this are some of the most fucking vile, disgusting humans on this planet, and I truly hope that their statements will come back to haunt them once this war is over. \nYou do not support Ukraine. You are only anti-Russia. You have blood on your hands.",
      "timestamp": "2025-11-12T14:51:45.071899Z"
    },
    {
      "original": "Assault On Vovchansk: Ukrainian Forces Amass Reserves To Hold Last Districts\nThe Russian army has taken control of the Novouspenivske settlement in the Zaporizhzhia region. Twenty-five Ukrainian naval infantry servicemen surrendered in Myrnohrad. \nThe US is demanding a revision of the upcoming anti-Russian UN General Assembly resolution on Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702483Z"
    },
    {
      "original": "Assault On Vovchansk: Ukrainian Forces Amass Reserves To Hold Last Districts\nThe Russian army has taken control of the Novouspenivske settlement in the Zaporizhzhia region. Twenty-five Ukrainian naval infantry servicemen surrendered in Myrnohrad. \nThe US is demanding a revision of the upcoming anti-Russian UN General Assembly resolution on Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702506Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 11, 2025\nOn November 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-12T14:51:45.702514Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 11, 2025\nOn November 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-12T14:51:45.702521Z"
    },
    {
      "original": "U.S. Largest Carrier Arrives In Latin America As Venezuela Holds More Military Drills (Videos)\nAircraft carrier USS Gerald R. Ford has begun operating in the United States Southern Command (SOUTHCOM) area of responsibility.\nThe Pentagon confirmed the arrival, which was first reported by Reuters news agency, saying in a statement on November 11 that it would help \"disrupt narcotics trafficking and degrade and dismantle Transnational Criminal Organizations.\"\nThe U.S. military has already carried out 19 strikes against boats allegedly carrying drugs in the Caribbean Sea and the eastern Pacific Ocean, killing 75 people.\nVenezuela has bracing for an attack by the U.S. The country’s military continues to conduct exercises with a focus on quick evacuation, and decentralized operations.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702529Z"
    },
    {
      "original": "U.S. Largest Carrier Arrives In Latin America As Venezuela Holds More Military Drills (Videos)\nAircraft carrier USS Gerald R. Ford has begun operating in the United States Southern Command (SOUTHCOM) area of responsibility.\nThe Pentagon confirmed the arrival, which was first reported by Reuters news agency, saying in a statement on November 11 that it would help \"disrupt narcotics trafficking and degrade and dismantle Transnational Criminal Organizations.\"\nThe U.S. military has already carried out 19 strikes against boats allegedly carrying drugs in the Caribbean Sea and the eastern Pacific Ocean, killing 75 people.\nVenezuela has bracing for an attack by the U.S. The country’s military continues to conduct exercises with a focus on quick evacuation, and decentralized operations.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702541Z"
    },
    {
      "original": "Polish Citizens Demand To Stop Social Support For Ukrainian Refugees\nEuropean fatigue with Ukraine is growing and beginning to affect migrants and refugees who have left the country to escape the war. In Poland, a neighboring country and ally of Ukraine, where millions of Ukrainian citizens live, support for welcoming foreigners is reducing – with strong social pressure to cancel benefits for Ukrainians and, in some cases, even repatriate them to Ukraine.\nA recent survey showed that about half of the Polish population is against the policy of aid to Ukrainian refugees. They consider these foreigners a problem for Polish social and economic stability and demand that the government cut all or some of the social benefits given to Ukrainians.\nCurrently, Ukrainian refugees in Poland have access to various social benefits guaranteed by special public policies for the integration of foreigners. These benefits include housing assistance, help in finding jobs, access to healthcare...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702550Z"
    },
    {
      "original": "Hezbollah Is Rearming, Syria Is Easing Security On Border With Lebanon And Israel Is Furious\nIsrael has once again accused Hezbollah of rearming amid reports suggesting that Syria was easing security on the border with Lebanon.\nOn November 11, the Israeli Defense Forces (IDF) claimed that Hezbollah is working to rebuild its combat abilities in southern Lebanon to the point of threatening Israel’s security and undoing last year’s ceasefire agreement which was brokered by the United States.\nLt. Col. Nadav Shoshani, a spokesman for the IDF, told a news briefing that the group was operating south of the Litani River in violation of the ceasefire agreement and that Israeli forces were conducting strikes on Hezbollah targets in that area.\nA report published by I24 News on the same day accused Syrian President Ahmad al-Sharaa of easing security on the border with Lebanon. According to the report, this allowed Hezbollah to smuggle more weapons, specifically missiles, through Syria.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702558Z"
    },
    {
      "original": "Hezbollah Is Rearming, Syria Is Easing Security On Border With Lebanon And Israel Is Furious\nIsrael has once again accused Hezbollah of rearming amid reports suggesting that Syria was easing security on the border with Lebanon.\nOn November 11, the Israeli Defense Forces (IDF) claimed that Hezbollah is working to rebuild its combat abilities in southern Lebanon to the point of threatening Israel’s security and undoing last year’s ceasefire agreement which was brokered by the United States.\nLt. Col. Nadav Shoshani, a spokesman for the IDF, told a news briefing that the group was operating south of the Litani River in violation of the ceasefire agreement and that Israeli forces were conducting strikes on Hezbollah targets in that area.\nA report published by I24 News on the same day accused Syrian President Ahmad al-Sharaa of easing security on the border with Lebanon. According to the report, this allowed Hezbollah to smuggle more weapons, specifically missiles, through Syria.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702568Z"
    },
    {
      "original": "Russian Army Is Squeezing Ukrainian Troops Out Of Pokrovsk (Videos)\nOn November 12, the Russian military captured a settlement near Pokrovsk in Donetsk, mounting more pressure on remaining Ukrainian troops in the city and nearby areas.\nThe capture of Sukhoy Yar was confirmed by the Russian Ministry of Defense, which said in a brief statement that the Tsentr [Center] Group of Forces “completed mopping up Ukrainian militants” in the settlement, which is located right to the south of Pokrovsk.\nLater in its daily briefing, the ministry said that the 2nd Army of the Tsentr Group of Forces “engaged in resolute offensive actions” in the western part of Pokrovsk, as well as in the northwestern and eastern neighborhoods of the Tsentralny district, and in the western industrial area.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702576Z"
    },
    {
      "original": "Russian Army Is Squeezing Ukrainian Troops Out Of Pokrovsk (Videos)\nOn November 12, the Russian military captured a settlement near Pokrovsk in Donetsk, mounting more pressure on remaining Ukrainian troops in the city and nearby areas.\nThe capture of Sukhoy Yar was confirmed by the Russian Ministry of Defense, which said in a brief statement that the Tsentr [Center] Group of Forces “completed mopping up Ukrainian militants” in the settlement, which is located right to the south of Pokrovsk.\nLater in its daily briefing, the ministry said that the 2nd Army of the Tsentr Group of Forces “engaged in resolute offensive actions” in the western part of Pokrovsk, as well as in the northwestern and eastern neighborhoods of the Tsentralny district, and in the western industrial area.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702583Z"
    },
    {
      "original": "Russian Troops Advance In Western Kupyansk (Videos)\nOn November 12, the Russian military’s Zapad [West] Group of Forces expanded its control in the western part of the city of Kupyansk amid Ukrainian attempts to counter attack.\nIn a statement published by the Russian Ministry of Defense, a commander, who gave his call sign as “Lavrik” and identified himself as being in charge of the 121st Motor Rifle Division’s assault detachment, detailed recent progress in the western part of Kupyansk.\n“We mopped up AFU (Armed Forces of Ukraine) militants in 1st Zapadnaya, Zodchikh, and Verbitskogo streets,” Lavrik said.\nLater in its daily briefing, the Russian MoD announced that the Zapad Group of Forces repelled a counterattack by Ukraine’s 1st National Guard Brigade near Petrovka, close to Kupyansk. It also provided more details on recent Ukrainian losses near the city.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702592Z"
    },
    {
      "original": "Russian Troops Advance In Western Kupyansk (Videos)\nOn November 12, the Russian military’s Zapad [West] Group of Forces expanded its control in the western part of the city of Kupyansk amid Ukrainian attempts to counter attack.\nIn a statement published by the Russian Ministry of Defense, a commander, who gave his call sign as “Lavrik” and identified himself as being in charge of the 121st Motor Rifle Division’s assault detachment, detailed recent progress in the western part of Kupyansk.\n“We mopped up AFU (Armed Forces of Ukraine) militants in 1st Zapadnaya, Zodchikh, and Verbitskogo streets,” Lavrik said.\nLater in its daily briefing, the Russian MoD announced that the Zapad Group of Forces repelled a counterattack by Ukraine’s 1st National Guard Brigade near Petrovka, close to Kupyansk. It also provided more details on recent Ukrainian losses near the city.\nRead more \nHERE",
      "timestamp": "2025-11-12T14:51:45.702600Z"
    }
  ],
  "script_run_time": "2025-11-12T14:51:45.703455Z"
}