{
  "messages": [
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Дніпропетровської області (Синельниківський р-н).",
      "timestamp": "2025-08-15T05:17:59.722266Z"
    },
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Сумської та Полтавської областей.",
      "timestamp": "2025-08-15T05:17:59.722287Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння по областях.",
      "timestamp": "2025-08-15T05:17:59.722294Z"
    },
    {
      "original": "🛵\n Щодо руху ворожих ударних БпЛА:\n1. БпЛА на північному сході Чернігівщини (межа із Сумщиною) курс західний;\n2. Нові групи БпЛА на сході Сумщини, курс західний та південний.",
      "timestamp": "2025-08-15T05:17:59.722304Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-15T05:17:59.722311Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T05:17:59.722321Z"
    },
    {
      "original": "🛵\n Оновлення щодо руху ворожих ударних БпЛА:\n1.  БпЛА на північному сході Чернігівщини, рухаються у напрямку Прилук та у напрямку Полтавщини (Пирятин);\n2. БпЛА на півдні Сумщини, курс західний та південно-західний;\n3. БпЛА на північному заході Харківщини, курс західний;\n4. БпЛа на межі Донецької та Дніпропетровської областей, курс західний.",
      "timestamp": "2025-08-15T05:17:59.722331Z"
    },
    {
      "original": "🛵\n Оновлення щодо руху ворожих ударних БпЛА:\n1. БпЛА на Полтавщині в районі Пирятину, курс західний та південно-західний;\n2. Групи БпЛА на південному сході Дніпропетровщини, курсом на північ та у напрямку Павлограду;\n3. Декілька груп БпЛА на півдні Донеччини, курс північний.",
      "timestamp": "2025-08-15T05:17:59.722341Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу в областях де оголошено повітряну тривогу!",
      "timestamp": "2025-08-15T05:17:59.722348Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Чернігівщину через Сумщину",
      "timestamp": "2025-08-15T05:17:59.722354Z"
    },
    {
      "original": "🛵\n Нові групи ворожих ударних БпЛА на сході та південному сході Сумщини, курс на південь.",
      "timestamp": "2025-08-15T05:17:59.722360Z"
    },
    {
      "original": "📢\n Відбій ракетної небезпеки по областях.\n🛵\n На Сумщині зберігається загроза ударних ворожих БпЛА.",
      "timestamp": "2025-08-15T05:17:59.722430Z"
    },
    {
      "original": "☄️\n Харківська область загроза застосування балістичного озброєння.",
      "timestamp": "2025-08-15T05:17:59.722438Z"
    },
    {
      "original": "⚡\n Запорізька область  - активність  ворожих БпЛА, залучено засоби для їх збиття!",
      "timestamp": "2025-08-15T05:17:59.722444Z"
    },
    {
      "original": "📢\n Відбій загрози для Харківської області.",
      "timestamp": "2025-08-15T05:17:59.722449Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T05:17:59.722458Z"
    },
    {
      "original": "🛵\n Сумська область - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-08-15T05:17:59.722466Z"
    },
    {
      "original": "📢\n Відбій загрози для Сумської області.",
      "timestamp": "2025-08-15T05:17:59.722471Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T05:17:59.722481Z"
    },
    {
      "original": "🛵\n Чернігівська область - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-08-15T05:17:59.722486Z"
    },
    {
      "original": "The IDF reports that the ballistic missile was intercepted.",
      "timestamp": "2025-08-15T05:18:00.303033Z"
    },
    {
      "original": "The IDF just chose not to wake people up by triggering the sirens. They knew the result",
      "timestamp": "2025-08-15T05:18:00.303047Z"
    },
    {
      "original": "The IDF just chose not to wake people up by triggering the sirens. They knew the result",
      "timestamp": "2025-08-15T05:18:00.303051Z"
    },
    {
      "original": "Well that's new",
      "timestamp": "2025-08-15T05:18:00.303055Z"
    },
    {
      "original": "Regarding the situation with the Russian breakthrough at Dobropillya-Bilozerske:\nAfter over a week of deep infiltrations, the frontline has largely stabilised following the arrival of reinforcements from both sides.\nNewly arrived Ukrainian units, including the  93rd Mechanized Brigade, 12th \"Azov\" Brigade of the NGU, 4th \"Rubizh\" Brigade of the NGU, 1st \"Da Vinci\" assault battalion and the 25th Assault Battalion, have begun digging in and counterattacking.\nRussian DRGs have largely been cleared from the approaches of Dobropillya and Bilozerske, and Ukrainian counterattacks took place in two main directions. After re-securing the section of the Dobropillya - Kramatorsk Highway, the 1st \"Da Vinci\" assault battalion attempted to enter Zolotyi Kolodyaz, but were repelled by the newly reinforced Russian garrison (which may include special forces) after heavy fighting. The 2nd mechanised battalion of the 93rd brigade counterattacked in the direction of the heights south of Kucheriv Yar. The outcome of this is currently unknown.\nThe 12th \"Azov\" brigade of the NGU has begun digging in around Rubizhne and Novyi Donbas. Rubizhne is contested, but mostly under Ukrainian control. Novyi Donbas is under full Ukrainian control after the DRGs were cleared from around Dobropillya. It's unclear what Ukrainian unit is holding Stepy (possibly the Rubizh Brigade?), which lies between Rubizhne and Novyi Donbas. Additionally, the Russians have accumulated manpower in Nove Shakhove, and now have a strong presence there.\nIn the Dorozhnje area, Ukrainian forces - after withdrawing behind the village - managed to hold a defence in the treelines on the tactical heights there.\nIn the Vesele - Hruzke area, Russian forces were able to capture most of Vesele. There is no information from Hruzke, but the main Ukrainian presence is held in the gulleys to the southeast of the village, suggesting it could be in the grey zone.\nIn Shakhove - Volodomyrivka, Ukrainian forces hold a strong defence in Shakhove, while drones (probably from the \"Typhoon\" company of the NGU) are preventing the Russians from capturing the rest of Volodymyrivka. No new information from Pankivka, which remains under Russian control.\nOverall, the situation has significantly improved for Ukraine here, but at the cost of other sectors of the frontline being significantly weakened - notably the Kostyantynivka direction. This breakthrough will undoubtably be used by Russia in the future for further gains, as it has completely destabilised a section of Ukraine's main defensive line.",
      "timestamp": "2025-08-15T05:18:00.303071Z"
    },
    {
      "original": "Azov has made their first claim on Russian personnel losses in the Dobropillya direction from the actions of the 12th brigade, but has not commented on any counterattacks carried out by their forces.\nCurrently its known that the 1st \"Da Vinci\" Assault battalion and the 2nd battalion of the 93rd mechanised brigade have been counterattacking. No progress has been confirmed, and the attacks by the \"Da Vinci\" battalion on Zolotyi Kolodyaz yesterday were repelled.",
      "timestamp": "2025-08-15T05:18:00.303077Z"
    },
    {
      "original": "Azov has made their first claim on Russian personnel losses in the Dobropillya direction from the actions of the 12th brigade, but has not commented on any counterattacks carried out by their forces.  Currently its known that the 1st \"Da Vinci\" Assault battalion…",
      "timestamp": "2025-08-15T05:18:00.303082Z"
    },
    {
      "original": "This confirms that so far, Azov's efforts have been largely confined to entrenching in new positions to contain the Russian advance, and mopping up DRGs - contrary to those claiming that Azov had cut the Russian spearhead in half.",
      "timestamp": "2025-08-15T05:18:00.303086Z"
    },
    {
      "original": "FSB says in 2024 it uncovered Ukraine’s work on the Sapsan Tactical Ballistic Missile Complex (500–750 km range), mapping production facilities, underground assembly sites, supply routes, and leadership tied to German handlers.\nThe Russian military struck these facilities in Dnipropetrovsk, Zhytomyr, and Sumy, hitting both ground and underground targets, and dealing a major blow to Ukraine’s efforts to build a domestically-produced long-range missile program.",
      "timestamp": "2025-08-15T05:18:00.303092Z"
    },
    {
      "original": "A Russian channel reports that a Ukrainian \"DARTS\" drone hit the Belgorod Oblast Administrative Building just now.",
      "timestamp": "2025-08-15T05:18:00.303096Z"
    },
    {
      "original": "Possible Kh-59 cruise missile in Kharkiv Oblast.",
      "timestamp": "2025-08-15T05:18:00.303100Z"
    },
    {
      "original": "Possible Kh-59 cruise missile in Kharkiv Oblast.",
      "timestamp": "2025-08-15T05:18:00.303104Z"
    },
    {
      "original": "Disappeared. Misidentification",
      "timestamp": "2025-08-15T05:18:00.303108Z"
    },
    {
      "original": "Disappeared. Misidentification",
      "timestamp": "2025-08-15T05:18:00.303112Z"
    },
    {
      "original": "This is an S-400 air defence missile targeting Ukrainian aircraft near Stary Saltiv, Kharkiv Oblast.",
      "timestamp": "2025-08-15T05:18:00.303115Z"
    },
    {
      "original": "Average AMK Mapping twitter comment section. \nSee, this is actually a 10,000 IQ play on my part, where I'm secretly supporting both sides. More sides I support = more followers.\n😱\n😱\n😱",
      "timestamp": "2025-08-15T05:18:00.303127Z"
    },
    {
      "original": "Regarding the situation with the Russian breakthrough at Dobropillya-Bilozerske:  After over a week of deep infiltrations, the frontline has largely stabilised following the arrival of reinforcements from both sides.  Newly arrived Ukrainian units, including…",
      "timestamp": "2025-08-15T05:18:00.303131Z"
    },
    {
      "original": "Ok, we have a critical update from the Zolotyi Kolodyaz breakthrough. This could be the defining moment for Pokrovsk.\n👌\n👌\n👌",
      "timestamp": "2025-08-15T05:18:00.303141Z"
    },
    {
      "original": "Russian forces have captured the village of Andriivka-Klevtsove, Prosyana direction, Donetsk Oblast.\nPre-war population: ~777.\nTotal land area: ~3.49km²",
      "timestamp": "2025-08-15T05:18:00.303147Z"
    },
    {
      "original": "An IL-96-300PU carrying Putin is currently airborne, flying to Anchorage Airport, Alaska, for the meeting with Trump tomorrow.",
      "timestamp": "2025-08-15T05:18:00.303151Z"
    },
    {
      "original": "An IL-96-300PU carrying Putin is currently airborne, flying to Anchorage Airport, Alaska, for the meeting with Trump tomorrow.",
      "timestamp": "2025-08-15T05:18:00.303154Z"
    },
    {
      "original": "The talks are set to take place at 11:30am local time on Friday.",
      "timestamp": "2025-08-15T05:18:00.303157Z"
    },
    {
      "original": "An IL-96-300PU carrying Putin is currently airborne, flying to Anchorage Airport, Alaska, for the meeting with Trump tomorrow.",
      "timestamp": "2025-08-15T05:18:00.303161Z"
    },
    {
      "original": "Correction: the plane is carrying journalists and people to set up the meeting. Putin has not left Russia yet.",
      "timestamp": "2025-08-15T05:18:00.303164Z"
    },
    {
      "original": "A Russian Su-30SM fighter crashed southeast of Snake Island in the Black Sea yesterday, likely while trying to shoot down Ukrainian UAVs flying to Crimea. \nIt belonged to the 43rd Separate Marine Assault Aviation Regiment based at Saki Airbase, Crimea. The Ukrainian Navy reported that search and rescue operations are underway to retrieve the pilots, while Russian sources report that they were killed.",
      "timestamp": "2025-08-15T05:18:00.303173Z"
    },
    {
      "original": "I tried to set up through private messages a public nuanced chat,\nHe's gone and made these public, fine I couldn't care less... \nWhy doesn't David use all the combat experience he talks about to go and actually fight ....?\nVery convenient to crop out my private message inviting him to an open and uncut interview.\nhttps://x.com/secretsqrl123/status/1956173289090359382?t=TJiQhhaUQCpcXUKLCET4AQ&s=19",
      "timestamp": "2025-08-15T05:18:00.303181Z"
    },
    {
      "original": "David D is - for some reason - using me as a reason for why he doesn't view WillyOAM as a reliable source, and why he won't join him for a podcast. \nIt's been over a year since the David-Ayden debate (which is where this whole thing started between him and me) and yet he still sees me as this boogey man in the corner. \nI'm living rent-free in his head, and its so funny. \nThese posts below are some of his from just from the last 2 days...",
      "timestamp": "2025-08-15T05:18:00.303188Z"
    }
  ],
  "script_run_time": "2025-08-15T05:18:00.806744Z"
}