{
  "messages": [
    {
      "original": "🛵\n Нові БпЛА на межі Харківщини і Сумщини в напрямку Полтавщини.",
      "timestamp": "2025-09-24T07:58:31.103018Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на Харківщині курсом на Чугуїв з південного сходу.",
      "timestamp": "2025-09-24T07:58:31.103037Z"
    },
    {
      "original": "🛸\n \n🛸\n Ворожі БпЛА, ймовірно, розвідувальні, з акваторії Чорного моря курсом на Білгород-Дністровський р-н Одещини.",
      "timestamp": "2025-09-24T07:58:31.103043Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході від Сум, курс - південно-західний.",
      "timestamp": "2025-09-24T07:58:31.103048Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини і північному сході Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-09-24T07:58:31.103053Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині курсом на Миргород;\n🛵\n БпЛА на півночі  Чернігівщини, курс - південно-західний.\n🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-24T07:58:31.103061Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-24T07:58:31.103068Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-24T07:58:31.103076Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Полтаву.",
      "timestamp": "2025-09-24T07:58:31.103080Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північний схід Харківщини.",
      "timestamp": "2025-09-24T07:58:31.103085Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Київ зі сходу.",
      "timestamp": "2025-09-24T07:58:31.103090Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на  Харківщину зі сходу.",
      "timestamp": "2025-09-24T07:58:31.103095Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині курсом на Миколаївщину.",
      "timestamp": "2025-09-24T07:58:31.103099Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-24T07:58:31.103104Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на межі Сумщини і Чернігівщини курсом на н.п.Прилуки",
      "timestamp": "2025-09-24T07:58:31.103110Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння в областях, де оголошено повітряну тривогу.",
      "timestamp": "2025-09-24T07:58:31.103116Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-09-24T07:58:31.103120Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 126 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 24 вересня (із 18.00 23 вересня) противник атакував 152-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллєрово, Шаталово, Приморсько-Ахтарськ – рф., Гвардійське - ТОТ Криму, близько 80 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 126 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 26 ударних БпЛА на 7 локаціях, а також падіння збитих (уламки) на 2 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n  Разом – до перемоги!",
      "timestamp": "2025-09-24T07:58:31.103141Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-09-24T07:58:31.103147Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА неподалік Дніпра. Працює ППО!",
      "timestamp": "2025-09-24T07:58:31.103162Z"
    },
    {
      "original": "Explosions in Pavlohrad",
      "timestamp": "2025-09-24T07:58:31.657172Z"
    },
    {
      "original": "Another Iskander launch from Voronezh Oblast",
      "timestamp": "2025-09-24T07:58:31.657183Z"
    },
    {
      "original": "Two separate security incidents have occurred in Northern Gaza / Gaza City. \nIsraeli media reports that a \"Namer\" APC was hit by a Russian-made 9M133 Kornet ATGM, resulting in 5 IDF soldiers being wounded, with one in critical condition but with no threat to his life.  \nAdditionally, small-arms clashes injured one IDF soldier in a separate incident.",
      "timestamp": "2025-09-24T07:58:31.657189Z"
    },
    {
      "original": "Another Iskander launch from Voronezh Oblast",
      "timestamp": "2025-09-24T07:58:31.657193Z"
    },
    {
      "original": "Flying to Pavlohrad, Dnipropetrovsk Oblast.",
      "timestamp": "2025-09-24T07:58:31.657196Z"
    },
    {
      "original": "Flying to Pavlohrad, Dnipropetrovsk Oblast.",
      "timestamp": "2025-09-24T07:58:31.657199Z"
    },
    {
      "original": "The Iskander disappeared",
      "timestamp": "2025-09-24T07:58:31.657202Z"
    },
    {
      "original": "The southern suburbs of Zaporizhzhia City are currently under heavy Russian MLRS fire. The attacks on Zaporizhzhia have increased massively over the past two days.",
      "timestamp": "2025-09-24T07:58:31.657209Z"
    },
    {
      "original": "The southern suburbs of Zaporizhzhia City are currently under heavy Russian MLRS fire. The attacks on Zaporizhzhia have increased massively over the past two days.",
      "timestamp": "2025-09-24T07:58:31.657213Z"
    },
    {
      "original": "Overnight, Zaporizhzhia City came under continued attacks by MLRS and KABs. At least 7 more KAB glide-bombs hit targets in the city limits, and on the outskirts, while MLRS shelling targeted the southern suburbs. Geran-2 drones also flew over the city but did not strike anything as they were transiting north. \nStrengthened Ukrainian air defence in Zaporizhzhia is showing its effects. At least four Gerans have been shot down, along with two glide-bombs. \nAdditionally, targets from the previous attacks were identified. The auto-repair shop at 47.82259, 35.14838 was hit, along with the Motor Sich Plant in multiple places. However, electronic warfare seems to be affecting the accuracy of these bombs, as one that intended to hit the auto-repair shop missed by around 40 metres, and another aimed at the Motor Sich plant hit houses around 60 metres away across the street (47.83129, 35.19627).",
      "timestamp": "2025-09-24T07:58:31.657219Z"
    },
    {
      "original": "Overnight, Zaporizhzhia City came under continued attacks by MLRS and KABs. At least 7 more KAB glide-bombs hit targets in the city limits, and on the outskirts, while MLRS shelling targeted the southern suburbs. Geran-2 drones also flew over the city but did not strike anything as they were transiting north. \nStrengthened Ukrainian air defence in Zaporizhzhia is showing its effects. At least four Gerans have been shot down, along with two glide-bombs. \nAdditionally, targets from the previous attacks were identified. The auto-repair shop at 47.82259, 35.14838 was hit, along with the Motor Sich Plant in multiple places. However, electronic warfare seems to be affecting the accuracy of these bombs, as one that intended to hit the auto-repair shop missed by around 40 metres, and another aimed at the Motor Sich plant hit houses around 60 metres away across the street (47.83129, 35.19627).",
      "timestamp": "2025-09-24T07:58:31.657224Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continue to advance and have captured the village of Shandryholove.\nRussian forces advaced in three areas. In the north, they continued to improve their positions north of Serednje, capturing positions in the grey zone and securing their logistics into the village from the north. They also reached the nearby orchards and captured positions in the adjacent treeline. \nTo the south, Russian forces crossed the gulley from Serednje, and captured the small forest and nearby treelines there. From here, they crossed the Nitrius River to the eastern bank, capturing the northern part of Shandryholove. This, plus advances from the north and east allowed for the Russians to establish control over the local school which previously served as Ukraine's main defensive node. Other forces who crossed over the river from southern Shandryholove then helped clear the rest of the village. \nA few hours later, Ukrainian forces re-infiltrated the western part of the village, and after a series of clashes, were pushed back across the river. Additionally, after a series of attempts, Russian forces secured a bridgehead on the western bank of the Nitrius river southwest of Shandryholove, and captured the agricultural complex and nearby treelines.\nIn the south, Russian forces continued their assault on Derylove. They were able to marginally advance down the road west of the village, allowing for the western houses to be captured. They also secured the rest of the forested areas north of the gulley that runs along the northern edge of the settlement.\n+ ~10.96 km² in favour of Russia.",
      "timestamp": "2025-09-24T07:58:31.657232Z"
    },
    {
      "original": "On the northern flank of Siversk and in the Lyman direction, Russian forces continued their offensive operations and have advanced on a wide front.\nRussian forces continued to push west through the Yampil forests and have captured positions within 600 metres of the Zarichne - Yampil Road. They are also continuing to bypass the clearings southwest of Torske and are continuing to infiltrate the northern streets of Yampil near the railway station.\nIn eastern Yampil, Russian forces were finally able to consolidate after attacks were carried out from the forest to the east and the area of the Ostrich Farm to the northeast. Fighting is now ongoing for the rest of the eastern streets and the centre of the village, which are mostly in the grey zone. \nTo the east, Russian forces advanced from the area of the Sererbryanskyi Forest, securing new positions in the forests on the Donetsk side of the regional border. They also crossed the Siverskyi Donets River, establishing control over positions in and around the holiday houses on the Donetsk-Luhansk regional border. \n+ ~6.70 km² in favour of Russia.",
      "timestamp": "2025-09-24T07:58:31.657239Z"
    },
    {
      "original": "🇸🇩\n🇷🇺\n⚡\n- The very unusual Rapid Support Forces + Wagner development continues:\nRapid Support Forces, RSF, have withdrawn from over 50km of the Sudan - Central African Republic, CAR, border in the South Darfur direction.\nThe Wagner Group operating in CAR 'entered' RSF-controlled Darfur region a few days ago, taking control of at least 5 towns, and penetrating up to 35-40km into Sudan. The reason for the operation is still unknown as Wagner withdrew its open support of RSF in 2021 to provide Moscow the opportunity to establish ties with the Iran-backed Sudanese government.\nThe area of Wagner's operation are also critical to RSF, in that a large volume of military aid flows from UAE cargo planes landing at Birao Air Port, CAR (at \n10.23706, 22.71983\n), and then using route RN8 to enter Sudanese territory. The route is vital for the Battle of al-Fashir, as it supplies two key RSF airbases, Durri (at \n12.95862, 23.62721\n) and Zalingei (at \n12.94501, 23.56407\n).",
      "timestamp": "2025-09-24T07:58:31.657250Z"
    },
    {
      "original": "\"Trump has done a full 180 in his view on Ukraine\".\n\"Trump has received intelligence that changed his mind about how this war can end\".\nThese are the things that are being spread all across the \"Pro-Ukraine\" information space over the past few hours, and all of this is only going to turn out to be another \"fell for it again award\" moment. \nMany of these people commenting SHOULD be old enough to recognise how politicians operate. Trump has consistently lied about so much for over 10 years - including Ukraine. Remember his claim that he will personally end the war in 24 hours? That's been memory-holed by all those who advocated for his presidency last year. \nDon't blindly trust anything that politicians say... especially if its Trump. Everything they say is being said for a reason, and when it comes to an aging empire like the U.S., there is much more of an incentive to say things purely for informational effect.\nSo that being said, I think these are the two most plausible outcomes that could come from this:\n1. Trump is going to increase aid to Ukraine and greenlight a lot of new weapons in order to prolong this war and buy more time to focus on more important threats to dying U.S. hegemony. This would also fuel a diminishing false sense of hope in Ukrainian society. \n2. Trump is lying again and will do little to nothing to change his current policy on Ukraine, and all this is for informational effect to fuel a diminishing false sense of hope in Ukrainian society.\nNotice a pattern here? The U.S. has a vested interest in keeping this war going with both of these options, but the purpose is largely the same - prolong the war, keep Ukraine in the fight a little longer, and hurt Russia a little more. \nDo you see what I mean when I've consistently said that Trump doesn't want peace in Ukraine?",
      "timestamp": "2025-09-24T07:58:31.657260Z"
    },
    {
      "original": "Overnight, Zaporizhzhia City came under continued attacks by MLRS and KABs. At least 7 more KAB glide-bombs hit targets in the city limits, and on the outskirts, while MLRS shelling targeted the southern suburbs. Geran-2 drones also flew over the city but…",
      "timestamp": "2025-09-24T07:58:31.657263Z"
    },
    {
      "original": "Day 4 of intensified strikes on Zaporizhzhia City:\nAt least 13 KAB glide-bombs, multiple rounds of MLRS, and long-range artillery struck targets in the southern outskirts of the city and surrounding villages. \nAdditionally, MLRS and at least 2 KABs struck targets in southern Zaporizhzhia City. 6 Geran-2 drones also impacted within the city limits, while Ukrainian air defence shot down the rest.",
      "timestamp": "2025-09-24T07:58:31.657268Z"
    },
    {
      "original": "Day 4 of intensified strikes on Zaporizhzhia City:\nAt least 13 KAB glide-bombs, multiple rounds of MLRS, and long-range artillery struck targets in the southern outskirts of the city and surrounding villages. \nAdditionally, MLRS and at least 2 KABs struck targets in southern Zaporizhzhia City. 6 Geran-2 drones also impacted within the city limits, while Ukrainian air defence shot down the rest.",
      "timestamp": "2025-09-24T07:58:31.657273Z"
    },
    {
      "original": "Russian Su-34s are flying over Crimea towards Kherson Oblast, probably for KAB launches.",
      "timestamp": "2025-09-24T07:58:31.657276Z"
    },
    {
      "original": "Russian Su-34s are flying over Crimea towards Kherson Oblast, probably for KAB launches.",
      "timestamp": "2025-09-24T07:58:31.657279Z"
    },
    {
      "original": "They were circling in the area of Rozdolne, Crimea, but are now flying towards the launch lines in Kherson Oblast.",
      "timestamp": "2025-09-24T07:58:31.657282Z"
    },
    {
      "original": "They were circling in the area of Rozdolne, Crimea, but are now flying towards the launch lines in Kherson Oblast.",
      "timestamp": "2025-09-24T07:58:31.657286Z"
    },
    {
      "original": "Still circling...",
      "timestamp": "2025-09-24T07:58:31.657289Z"
    },
    {
      "original": "Still circling...",
      "timestamp": "2025-09-24T07:58:31.657294Z"
    },
    {
      "original": "This appears to be a single Su-27. It's now flown south towards Sevastopol. No other aircraft are covering it.",
      "timestamp": "2025-09-24T07:58:31.657297Z"
    },
    {
      "original": "Possible Iskander launch from Voronezh Oblast",
      "timestamp": "2025-09-24T07:58:31.657300Z"
    },
    {
      "original": "Possible Iskander launch from Voronezh Oblast",
      "timestamp": "2025-09-24T07:58:31.657303Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace.",
      "timestamp": "2025-09-24T07:58:31.657306Z"
    }
  ],
  "script_run_time": "2025-09-24T07:58:32.103301Z"
}