{
  "messages": [
    {
      "original": "🛵\n БпЛА на межі Донеччини і Дніпропетровщини, курс - північний.",
      "timestamp": "2025-10-27T09:52:52.327586Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-27T09:52:52.327604Z"
    },
    {
      "original": "🛵\n БпЛА на Харків зі сходу.",
      "timestamp": "2025-10-27T09:52:52.327610Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Харківщини, курс - північний;\n🛵\n БпЛА на межі Сумщини і Чернігівщини, постійно змінюють напрямок руху.\n🛵\n БпЛА на Харків з південного сходу.",
      "timestamp": "2025-10-27T09:52:52.327620Z"
    },
    {
      "original": "🛵\n БпЛА  на Дніпропетровщині в напрямку Самара з південного сходу.",
      "timestamp": "2025-10-27T09:52:52.327625Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-27T09:52:52.327630Z"
    },
    {
      "original": "🛵\n БпЛА на межі Сумщини і Чернігівщини, курс - на/повз Конотоп;\n🛵\n БпЛА на Чернігівщині, курс на Мену з північного сходу.",
      "timestamp": "2025-10-27T09:52:52.327636Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на півночі Сумщини, курс - південно-західний.",
      "timestamp": "2025-10-27T09:52:52.327641Z"
    },
    {
      "original": "Швидкісна ціль на прикордоння Сумщини.",
      "timestamp": "2025-10-27T09:52:52.327645Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку Корюківки з півночі та Новгород-Сіверського з півдня;\n🛵\n БпЛА на північному сході Дніпропетровщини курсом на Харківщину.",
      "timestamp": "2025-10-27T09:52:52.327651Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-27T09:52:52.327659Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-27T09:52:52.327665Z"
    },
    {
      "original": "🛵\n🛸\n На Сумщині (в районі н.п.Конотоп) БпЛА противника, ймовірно, розвідувальний, який може бути навідником ворожих засобів ураження. Залучено засоби для збиття.",
      "timestamp": "2025-10-27T09:52:52.327670Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 66 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 27 жовтня (з 18:30 26 жовтня) противник атакував 100 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Приморсько-Ахтарськ – рф, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 66 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 26 ударних БпЛА на 9 локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-27T09:52:52.327689Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-27T09:52:52.327693Z"
    },
    {
      "original": "🛵\n🛸\n Ворожий БпЛА з півночі курсом на Суми.",
      "timestamp": "2025-10-27T09:52:52.327698Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину.",
      "timestamp": "2025-10-27T09:52:52.327702Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-27T09:52:52.327706Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-10-27T09:52:52.327711Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-10-27T09:52:52.327715Z"
    },
    {
      "original": "After over two and a half years of siege, the Sudanese city of Al-Fashir has fallen to the rebel Rapid Support Forces. \nIt was the last stronghold of the Sudanese Armed Forces in the west of the country, and its capture will free up significant numbers of RSF fighters to be redeployed to fight SAF-backed rebels and reinforce the current lines in the Kordofan region of central Sudan.\nThe battle and siege of Al-Fashir is one of the longest continuous battles in human history, outlasting almost all the longest battles in Ukraine.",
      "timestamp": "2025-10-27T09:52:53.072018Z"
    },
    {
      "original": "After over two and a half years of siege, the Sudanese city of Al-Fashir has fallen to the rebel Rapid Support Forces. \nIt was the last stronghold of the Sudanese Armed Forces in the west of the country, and its capture will free up significant numbers of RSF fighters to be redeployed to fight SAF-backed rebels and reinforce the current lines in the Kordofan region of central Sudan.\nThe battle and siege of Al-Fashir is one of the longest continuous battles in human history, outlasting almost all the longest battles in Ukraine.",
      "timestamp": "2025-10-27T09:52:53.072035Z"
    },
    {
      "original": "A Russian Italmas drone struck the roof of a high-rise residential building in Sumy City today. \nBased on the video, and the speed it gained as it approached the building, the drone was not under the influence of electronic warfare and was specifically targeting this building. \nPhotos posted afterwards showed damage to the roof of the building. Due to the location of the impact, no civilians were killed or injured.\nApproximate coordinates: 50.91055, 34.83250",
      "timestamp": "2025-10-27T09:52:53.072043Z"
    },
    {
      "original": "A Russian Italmas drone struck the roof of a high-rise residential building in Sumy City today. \nBased on the video, and the speed it gained as it approached the building, the drone was not under the influence of electronic warfare and was specifically targeting this building. \nPhotos posted afterwards showed damage to the roof of the building. Due to the location of the impact, no civilians were killed or injured.\nApproximate coordinates: 50.91055, 34.83250",
      "timestamp": "2025-10-27T09:52:53.072048Z"
    },
    {
      "original": "Russia has begun using fiber-optic Molniya drones in the Kherson direction more frequently. This one was shot down over the Dniprovskyi District of Kherson City by a mobile fire crew, and had a spool containing coil that could stretch for 24-25 km. \nFiber optic drones, especially ones of the Molniya type, are known to be able to fly much further than 25 km, but even this length would allow for it to reach Mykolaiv Oblast in some places.",
      "timestamp": "2025-10-27T09:52:53.072052Z"
    },
    {
      "original": "Ukrainian UAVs are attempting to attack Moscow for the second day in a row. Not a single drone has impacted the region so far. Certain airports have closed again due to the threat of drone strikes.",
      "timestamp": "2025-10-27T09:52:53.072055Z"
    },
    {
      "original": "Additional explosions in the area of the dam. HIMARS have now hit it. More drones are flying in its direction.",
      "timestamp": "2025-10-27T09:52:53.072058Z"
    },
    {
      "original": "After Ukrainian HIMARS rockets and Darts drones struck the Belgorod Reservoir Dam, the spillway has begun letting water out of the reservoir, leading to a significant reduction in the water level.",
      "timestamp": "2025-10-27T09:52:53.072063Z"
    },
    {
      "original": "After Ukrainian HIMARS rockets and Darts drones struck the Belgorod Reservoir Dam, the spillway has begun letting water out of the reservoir, leading to a significant reduction in the water level.",
      "timestamp": "2025-10-27T09:52:53.072066Z"
    },
    {
      "original": "Russian forces have recaptured the village of Novoselivka, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~295.\nTotal land area: ~0.92 km².",
      "timestamp": "2025-10-27T09:52:53.072071Z"
    },
    {
      "original": "Russia has now added thunderstorms to their arsenal of weapons, and is using lightning to strike Ukrainian energy infrastructure in Kryvyi Rih.",
      "timestamp": "2025-10-27T09:52:53.072074Z"
    },
    {
      "original": "For those wondering, there are no standard signs of a missile attack tonight. Gerans will just do their usual thing.",
      "timestamp": "2025-10-27T09:52:53.072077Z"
    },
    {
      "original": "It seems the Russians have once again changed tactics when preparing their attacks - at least for now. This, plus the possible usage of Tu-22m3s in the next attack makes predicting it a bit more complicated.\nAlso, it's worth noting, on November 1 Russia will switch to their winter frequencies for combat operations involving Tu-95MS and Tu-160 strategic bombers, although hopefully this shouldn't impact the ability to track movements too much.",
      "timestamp": "2025-10-27T09:52:53.072081Z"
    },
    {
      "original": "Mobile fire crews have been deployed to the Kremlin due to the threat of UAVs for Moscow.",
      "timestamp": "2025-10-27T09:52:53.072084Z"
    },
    {
      "original": "All airports in Moscow have been temporarily closed due to the threat of UAVs. Su-34, Su-35, MiG-29, Tu-160, and Tu-95MS aircraft have been evacuated and are currently airborne, waiting for the threat to be over.",
      "timestamp": "2025-10-27T09:52:53.072087Z"
    },
    {
      "original": "Tu-95MS and Tu-160s are now being evacuated from Engels-2 Airbase, Saratov Oblast, due to the threat of UAVs for the region.",
      "timestamp": "2025-10-27T09:52:53.072090Z"
    },
    {
      "original": "After Ukrainian HIMARS rockets and Darts drones struck the Belgorod Reservoir Dam, the spillway has begun letting water out of the reservoir, leading to a significant reduction in the water level.",
      "timestamp": "2025-10-27T09:52:53.072092Z"
    },
    {
      "original": "Water continues to rush from the Belgorod Reservoir Dam following the Ukrainian strikes, and is flooding the surrounding areas.",
      "timestamp": "2025-10-27T09:52:53.072097Z"
    },
    {
      "original": "Large numbers of Ukrainian UAVs continue to be shot down across western Russia, including in Moscow Oblast. It seems Russia was ready for this attack due to yesterday's attempts to strike the capital. \nThere are still no confirmed impacts. The fire seen burning in Moscow is from a forest fire caused by downed drone debris and the small fire at the oil depot is unrelated to the attack. The explosions heard over Moscow have been from air defence operations.",
      "timestamp": "2025-10-27T09:52:53.072101Z"
    },
    {
      "original": "Information from the ground.\nRussian forces are operating in the Freight terminals in Lyman\nEdit* 'This has effectively cut off the loop around the town'",
      "timestamp": "2025-10-27T09:52:53.072105Z"
    },
    {
      "original": "Large numbers of Ukrainian UAVs continue to be shot down across western Russia, including in Moscow Oblast. It seems Russia was ready for this attack due to yesterday's attempts to strike the capital.   There are still no confirmed impacts. The fire seen burning…",
      "timestamp": "2025-10-27T09:52:53.072108Z"
    },
    {
      "original": "These are the approximate flight routes of the hundreds of Ukrainian UAVs that have attacked/are attacking Russia tonight. \nUAVs were launched from Dnipropetrovsk, Poltava, Donetsk, Sumy, Kharkiv, Chernihiv, and Kyiv Oblasts. There are still no confirmed impacts, despite the massive numbers of drones used.",
      "timestamp": "2025-10-27T09:52:53.072111Z"
    },
    {
      "original": "These are the approximate flight routes of the hundreds of Ukrainian UAVs that have attacked/are attacking Russia tonight.   UAVs were launched from Dnipropetrovsk, Poltava, Donetsk, Sumy, Kharkiv, Chernihiv, and Kyiv Oblasts. There are still no confirmed…",
      "timestamp": "2025-10-27T09:52:53.072114Z"
    },
    {
      "original": "There are also unconfirmed reports of Ukrainian Flamingo cruise missiles being shot down over Oryol Oblast, but take that with a grain of salt for now.",
      "timestamp": "2025-10-27T09:52:53.072119Z"
    },
    {
      "original": "AUKUS Reloaded: Trump’s Billion-Dollar Push Turning Australia Into America’s Indo-Pacific Arsenal Against China\nIn the busy Indo-Pacific, where over 60 percent of global sea trade flows, the US, UK, and Australia are deepening their strategic alignment. This week, during Australian Prime Minister Anthony Albanese’s White House visit, President Donald Trump endorsed next phase of the AUKUS’ pact, reaffirming Canberra’s purchase of at least three Virginia-class nuclear submarines, with deliveries expected in the early 2030s.\nThis move is closely tied to an $8.5 billion rare-earth minerals deal now under discussion, channeling billions into Australia’s mining and processing sector. The initiative aims to reduce Western reliance on China, which currently refines about 90 percent of global rare earths. In essence, both frameworks are about Beijing.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783027Z"
    },
    {
      "original": "Career Growth of \"Butchers\" in the AFU: The Cost of Command Ambitions at the Expense of Ukrainian Soldiers' Lives\nA perspective prevalent in the public statements of Ukrainian servicemen and public figures holds that a system has developed within the Armed Forces of Ukraine (AFU) which encourages the career advancement of commanders who neglect the preservation of their personnel's lives. Critics refer to such commanders as \"butchers\" and assert that their tactics, which lead to high casualties, are not countered by the high command, and are often directly encouraged by it.\nThe idea of a systemic problem was publicly voiced by former Ukrainian MP and later a platoon commander in the AFU's 72nd Brigade, Tatiana Chernovol. She claims that careers in the army are built precisely by “butchers” — commanders who do not spare their soldiers and perceive them as expendable. Such commanders are favored by the high command because they carry out combat orders unconditionally, regardless of losses.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783045Z"
    },
    {
      "original": "Career Growth of \"Butchers\" in the AFU: The Cost of Command Ambitions at the Expense of Ukrainian Soldiers' Lives\nA perspective prevalent in the public statements of Ukrainian servicemen and public figures holds that a system has developed within the Armed Forces of Ukraine (AFU) which encourages the career advancement of commanders who neglect the preservation of their personnel's lives. Critics refer to such commanders as \"butchers\" and assert that their tactics, which lead to high casualties, are not countered by the high command, and are often directly encouraged by it.\nThe idea of a systemic problem was publicly voiced by former Ukrainian MP and later a platoon commander in the AFU's 72nd Brigade, Tatiana Chernovol. She claims that careers in the army are built precisely by “butchers” — commanders who do not spare their soldiers and perceive them as expendable. Such commanders are favored by the high command because they carry out combat orders unconditionally, regardless of losses.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783054Z"
    },
    {
      "original": "Military Situation In Northern Palestine On October 26, 2025 (Map Update)",
      "timestamp": "2025-10-27T09:52:53.783057Z"
    },
    {
      "original": "The Battle For Kherson: What Choices Will The Ukrainian Command Make\nReasons for the Russian garrison’s Withdrawal from Kherson in November 2022: How the city’s assault was prepared. Factors influencing the success of Ukrainian defense units. The difficulties the Russian Armed Forces might face in an offensive on Kherson.\nThe city of Kherson, located on the Dnipro River, acquired key strategic importance during military operations in southern Ukraine. Following the withdrawal of Russian troops from the right bank of the Kherson region in November 2022, the area was thrust back into the spotlight in autumn 2025. Russian troops strengthened their positions on the left bank and subsequently gained a foothold on Quarantine Island.\nFighting for Kherson began on 24 February 2022, the first day of Russia’s full-scale offensive in Ukraine. By 2 March 2022, the city had been captured by Russian military forces, making it the only regional center in Ukraine...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783066Z"
    },
    {
      "original": "The Battle For Kherson: What Choices Will The Ukrainian Command Make\nReasons for the Russian garrison’s Withdrawal from Kherson in November 2022: How the city’s assault was prepared. Factors influencing the success of Ukrainian defense units. The difficulties the Russian Armed Forces might face in an offensive on Kherson.\nThe city of Kherson, located on the Dnipro River, acquired key strategic importance during military operations in southern Ukraine. Following the withdrawal of Russian troops from the right bank of the Kherson region in November 2022, the area was thrust back into the spotlight in autumn 2025. Russian troops strengthened their positions on the left bank and subsequently gained a foothold on Quarantine Island.\nFighting for Kherson began on 24 February 2022, the first day of Russia’s full-scale offensive in Ukraine. By 2 March 2022, the city had been captured by Russian military forces, making it the only regional center in Ukraine...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783074Z"
    },
    {
      "original": "Military Situation In Ukraine On October 26, 2025 (Maps Update)",
      "timestamp": "2025-10-27T09:52:53.783077Z"
    },
    {
      "original": "Military Situation In Ukraine On October 26, 2025 (Maps Update)",
      "timestamp": "2025-10-27T09:52:53.783084Z"
    },
    {
      "original": "Strategic Game Changer: Russia’s Successful Test Of New Generation Winged Missile\nThe concept of 'missile flight time' is becoming obsolete. Could the US Golden Dome missile and air defence system be obsolete even before it is completed? The world's first missile to be powered by a nuclear reactor represents a significant technological breakthrough that will transform the field of aerospace engineering.\nFor more than half a century, the strategic nuclear forces of the world's leading powers have prevented global conflict. The nine countries with nuclear weapons are the United States, Russia, China, the United Kingdom, France, North Korea, India, Pakistan and possibly Israel. The first three of these countries have the most advanced nuclear deterrence systems. These consist of three components: land-based launch silos or mobile complexes; airborne strategic bombers; and sea-based submarines with nuclear missiles. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783092Z"
    },
    {
      "original": "Strategic Game Changer: Russia’s Successful Test Of New Generation Winged Missile\nThe concept of 'missile flight time' is becoming obsolete. Could the US Golden Dome missile and air defence system be obsolete even before it is completed? The world's first missile to be powered by a nuclear reactor represents a significant technological breakthrough that will transform the field of aerospace engineering.\nFor more than half a century, the strategic nuclear forces of the world's leading powers have prevented global conflict. The nine countries with nuclear weapons are the United States, Russia, China, the United Kingdom, France, North Korea, India, Pakistan and possibly Israel. The first three of these countries have the most advanced nuclear deterrence systems. These consist of three components: land-based launch silos or mobile complexes; airborne strategic bombers; and sea-based submarines with nuclear missiles. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783100Z"
    },
    {
      "original": "Pokrovsk Surrounded: Ukrainian Forces Attempt To Lift The Blockade\nAmid reports that Pokrovsk is surrounded, with Ukrainian forces attempting to lift the blockade, intense fighting continues across the front. Ukrainian forces have launched renewed counterattacks in the Dobropillya area, while Russian troops have taken control of the Serebryanka and Rudnik settlements in the Siversk sector. Simultaneously, Russian forces are continuing to clear Karantynnyy Island near Kherson, potentially solidifying a new bridgehead. On the diplomatic front, Polish Prime Minister Donald Tusk has suggested that the conflict in Ukraine could last another two to three years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783107Z"
    },
    {
      "original": "Pokrovsk Surrounded: Ukrainian Forces Attempt To Lift The Blockade\nAmid reports that Pokrovsk is surrounded, with Ukrainian forces attempting to lift the blockade, intense fighting continues across the front. Ukrainian forces have launched renewed counterattacks in the Dobropillya area, while Russian troops have taken control of the Serebryanka and Rudnik settlements in the Siversk sector. Simultaneously, Russian forces are continuing to clear Karantynnyy Island near Kherson, potentially solidifying a new bridgehead. On the diplomatic front, Polish Prime Minister Donald Tusk has suggested that the conflict in Ukraine could last another two to three years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T09:52:53.783114Z"
    }
  ],
  "script_run_time": "2025-10-27T09:52:53.783847Z"
}