{
  "messages": [
    {
      "original": "🛵\n Декілька груп ударних БпЛА на межі Донеччини та Дніпропетровщини.",
      "timestamp": "2025-08-23T11:12:16.960148Z"
    },
    {
      "original": "🛵\n Рух ударних БпЛА:\n1. Група БпЛА на сході Дніпропетровщини курсом на захід (Павлоград).\n2. Декілька груп БпЛА з Дніпропетровщини на Донеччину.\n3. Декілька груп БпЛА на Донеччині (Покровський район).",
      "timestamp": "2025-08-23T11:12:16.960169Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-08-23T11:12:16.960176Z"
    },
    {
      "original": "🛵\n Сумщина - загроза ударних БпЛА.",
      "timestamp": "2025-08-23T11:12:16.960182Z"
    },
    {
      "original": "🛵\n Рух ударних БпЛА:\n1. Група БпЛА на півночі Чернігівщини.\n2. Декілька груп БпЛА на Сумщині у південно-західному напрямку.\n3. Група БпЛА на Донеччині (Покровський район).",
      "timestamp": "2025-08-23T11:12:16.960190Z"
    },
    {
      "original": "🛵\n Група БпЛА на Чернігівщині у південно-західному напрямку.",
      "timestamp": "2025-08-23T11:12:16.960196Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-23T11:12:16.960200Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-23T11:12:16.960205Z"
    },
    {
      "original": "🛸\n БпЛА з Чернігівщини на Київщину (Броварський район).",
      "timestamp": "2025-08-23T11:12:16.960210Z"
    },
    {
      "original": "Ворожий БпЛА повз Бровари у напрямку Києва!",
      "timestamp": "2025-08-23T11:12:16.960214Z"
    },
    {
      "original": "Другий БпЛА на Київщині курсом на Вишеньки.",
      "timestamp": "2025-08-23T11:12:16.960218Z"
    },
    {
      "original": "Ворожий БпЛА повз Бровари у напрямку Києва!",
      "timestamp": "2025-08-23T11:12:16.960222Z"
    },
    {
      "original": "БпЛА курсом на Васильків.",
      "timestamp": "2025-08-23T11:12:16.960225Z"
    },
    {
      "original": "БпЛА курсом на Васильків.",
      "timestamp": "2025-08-23T11:12:16.960234Z"
    },
    {
      "original": "БпЛА курсом на Фастів.",
      "timestamp": "2025-08-23T11:12:16.960237Z"
    },
    {
      "original": "БпЛА курсом на Білу Церкву.",
      "timestamp": "2025-08-23T11:12:16.960241Z"
    },
    {
      "original": "❗️\nУночі 23 серпня 2025 року, після виконання бойового завдання при заході на посадку, загинув пілот винищувача МіГ-29 майор Бондарь Сергій Вікторович, 1979 р.н.\nПричини та обставини катастрофи встановлюються.\nВисловлюємо співчуття рідним та близьким...",
      "timestamp": "2025-08-23T11:12:16.960247Z"
    },
    {
      "original": "Ворожий БпЛА на Чернігівщині у південно-західному напрямку (Ніжин).",
      "timestamp": "2025-08-23T11:12:16.960253Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 36 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 23 серпня (із 22.40 22 серпня) противник атакував 49 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Курськ, Міллерово, Приморсько-Ахтарськ – рф.\nПовітряний напад відбивали підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.30, протиповітряною обороною збито/подавлено 36 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі, сході та в центрі країни.\nЗафіксовано влучання 13 БпЛА у 7 локаціях на Донеччині, Дніпропетровщині та Сумщині.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-23T11:12:16.960273Z"
    },
    {
      "original": "🛸\n  ворожі БпЛА в центрі Чернігівщини та на північному сході Київщини, курс південно-західний! \n⚡\n Залучено засоби для їх збиття! \n🚨\n Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-23T11:12:16.960281Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-23T11:12:16.960288Z"
    },
    {
      "original": "🛸\n  Ворожий БпЛА в центрі Чернігівщини! \n⚡\n Залучено засоби для його збиття! \n🚨\n Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-23T11:12:16.960295Z"
    },
    {
      "original": "Russian forces have captured the town of Shcherbynivka, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~3,266.\nTotal land area: ~5.92km².",
      "timestamp": "2025-08-23T11:12:17.576167Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Andriivka-Klevtsove, Prosyana direction, Donetsk Oblast.\nPre-war population: ~777.\nTotal land area: ~3.66km².",
      "timestamp": "2025-08-23T11:12:17.576186Z"
    },
    {
      "original": "Russian forces have captured the village of Novoheorhiivka, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~34.\nTotal land area: ~0.25km²",
      "timestamp": "2025-08-23T11:12:17.576193Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. I also have Signal if you prefer that.",
      "timestamp": "2025-08-23T11:12:17.576200Z"
    },
    {
      "original": "AMK Mapping\n pinned «\nIf you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks.   You…\n»",
      "timestamp": "2025-08-23T11:12:17.576206Z"
    },
    {
      "original": "Russian forces have captured the village of Maliivka, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~163.\nTotal land area: ~1.27km².",
      "timestamp": "2025-08-23T11:12:17.576213Z"
    },
    {
      "original": "Some general updates that I think are important to mention:\nKucheriv Yar (Dobropillya direction) remains under Russian control and has been used for new advances in multiple directions. The newest attacks have been taking place to the rear of the stronghold village of Shakhove, which Russia is trying to cut off by reaching Toretske. A strong push is also being made from Poltavka.\nAs for the Russian soldiers who were encircled last week, I wanted to wait a little to confirm this, but roughly 20 POWs were taken, around 15 of which surrendered near the small road north of Zolotyi Kolodyaz. The other ~5 were caught in the forests to the southeast. Everyone else was either killed or managed to escape back to the Kucheriv Yar area.\nRussia has now regained the initiative in the Dobropillya direction and is making significant progress. I will post more on that later, though.",
      "timestamp": "2025-08-23T11:12:17.576220Z"
    },
    {
      "original": "In the Bilopillya direction, Russian forces resumed their assault operations and managed to complete the capture of Bezsalivka.\nAfter weeks of positional battles, with Ukraine holding no permanent presence in the village, Russian forces began attacking towards the western houses, which were subsequently captured. They were also able to improve their positions in the forested area to the north and secured another section of the forests along the international border.\n+ ~1.13km² in favour of Russia.",
      "timestamp": "2025-08-23T11:12:17.576225Z"
    },
    {
      "original": "Israeli defence Minister Israel Katz stated that the Knesset has approved the IDF ground operation aimed at occupying all of Gaza City. \nHe stated that this operation will take place through \"heavy fire, civilian evacuation, and ground maneuver,\" and threatened to flatten the city if Hamas doesn't accept Israel's terms, including freeing all hostages and completely disarming.",
      "timestamp": "2025-08-23T11:12:17.576229Z"
    },
    {
      "original": "Our boy is out here doing side quests...",
      "timestamp": "2025-08-23T11:12:17.576233Z"
    },
    {
      "original": "Our boy is out here doing side quests...",
      "timestamp": "2025-08-23T11:12:17.576236Z"
    },
    {
      "original": "I thought it was AI generated at first \n🤣",
      "timestamp": "2025-08-23T11:12:17.576241Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now. \nAt least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit. \nMore KABs are flying in their direction.",
      "timestamp": "2025-08-23T11:12:17.576246Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now. \nAt least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit. \nMore KABs are flying in their direction.",
      "timestamp": "2025-08-23T11:12:17.576251Z"
    },
    {
      "original": "A UAV launched by the Houthis in Yemen was intercepted by the Israeli Airforce after it flew over the Egyptian border towards the Gaza envelope. Sirens sounded in multiple Israeli settlements.",
      "timestamp": "2025-08-23T11:12:17.576255Z"
    },
    {
      "original": "Another drone from Yemen flew in from the southwest and began flying parallel with the Gaza border. Multiple interceptors were used, all of which failed to intercept it, reportedly resulting in fighter jets being scrambled. A helicopter was eventually able to shoot it down.  \nAs for the reports on supposed rocket launches from the Gaza Strip coinciding with the drone flight, I haven’t seen any information to suggest this actually occurred yet.",
      "timestamp": "2025-08-23T11:12:17.576259Z"
    },
    {
      "original": "This is a treeline recently recaptured by Ukraine, east of Dobropillya. 12 FABs were then dropped on it (11 hits). \nCredit: \n@tom_bike",
      "timestamp": "2025-08-23T11:12:17.576264Z"
    },
    {
      "original": "Major attack on Slovyansk and Kramatorsk, Donetsk Oblast just now.   At least two Iskander-M ballistic missiles, several KAB glide-bombs and as many as 10 Geran-2 drones hit the cities, with Kramatorsk appearing to have taken the main hit.   More KABs are…",
      "timestamp": "2025-08-23T11:12:17.576267Z"
    },
    {
      "original": "Footage was published showing attacks on one of the targets from yesterday's massive attack on Kramatorsk, Donetsk Oblast.\n2 MLRS rockets and 7 Geran-2 drones were used here, reportedly targeting a deployment point of two battalions of the 156th mechanised brigade of the AFU, as well as the brigade command post and warehouses storing equipment. \nAdditional strikes were carried out on various other parts in and around Kramatorsk for most of the rest of the day, up until around 10pm. Over the course of the day, at least 60 KAB glide-bombs, 12 Geran-2 drones, 2 Iskander-M ballistic missiles, as well as repeated MLRS and long-range artillery strikes, targeted the area. We will likely get more footage later on.\nCoordinates for the video: 48.76239, 37.48414",
      "timestamp": "2025-08-23T11:12:17.576277Z"
    },
    {
      "original": "The Ukrainian Air Force announced that a Ukrainian MiG-29 crashed while landing, after completing a combat mission. The pilot, a 45–46-year-old, was killed.",
      "timestamp": "2025-08-23T11:12:17.576280Z"
    }
  ],
  "script_run_time": "2025-08-23T11:12:18.074449Z"
}