{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T16:35:05.594771Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-25T16:35:05.594788Z"
    },
    {
      "original": "🛵\n БпЛА на межі Чернігівщини та Сумщини, курс південний.",
      "timestamp": "2025-10-25T16:35:05.594793Z"
    },
    {
      "original": "🛵\n БпЛА на  Харківщині, курсом на Дніпропетровщину.",
      "timestamp": "2025-10-25T16:35:05.594798Z"
    },
    {
      "original": "💥\n📹\nНа відео бойова робота у зоні відповідальності \nПовітряного командування \"Схід\"\n.\n🇺🇦\n Продовжуємо нашу боротьбу!",
      "timestamp": "2025-10-25T16:35:05.594806Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-10-25T16:35:05.594811Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-10-25T16:35:05.594815Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-10-25T16:35:05.594819Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, продовжують рух на північ Київщини.",
      "timestamp": "2025-10-25T16:35:05.594823Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-10-25T16:35:05.594828Z"
    },
    {
      "original": "🚀\n КАБ у напрямку Дніпровського р-н.",
      "timestamp": "2025-10-25T16:35:05.594832Z"
    },
    {
      "original": "🚀\n КАБ у напрямку Дніпровського р-н.",
      "timestamp": "2025-10-25T16:35:05.594836Z"
    },
    {
      "original": "🚀\n КАБ на Дніпропетровщині в напрямку м.Кам'янське!",
      "timestamp": "2025-10-25T16:35:05.594844Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курсом на південь.\n🛵\n група БпЛА на Чернігівщині, курсом на південь та північ.\n🛵\n БпЛА на півночі Київщини, курсом на південь.",
      "timestamp": "2025-10-25T16:35:05.594851Z"
    },
    {
      "original": "🛵\n нова група БпЛА на межі Чернігівщини та Сумщини, курс південний.",
      "timestamp": "2025-10-25T16:35:05.594856Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-10-25T16:35:05.594860Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини!",
      "timestamp": "2025-10-25T16:35:05.594864Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину",
      "timestamp": "2025-10-25T16:35:05.594869Z"
    },
    {
      "original": "🚀\n КАБ на Донеччину",
      "timestamp": "2025-10-25T16:35:05.594873Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півночі.",
      "timestamp": "2025-10-25T16:35:05.594879Z"
    },
    {
      "original": "🛵\n нова група БпЛА на півночі Сумщини та Чернігівщини, курсом на південний захід.",
      "timestamp": "2025-10-25T16:35:05.594887Z"
    },
    {
      "original": "On the northwestern flank of Lyman, and in the Borova direction, both Russian and Ukrainian forces have advanced, with Russian forces making significant progress towards the city of Svyatohirsk. \nRussian forces continued advancing through the Novoselivka forest and reached its northwestern edge. They were also able to establish control over the treelines on the tactical heights beyond it, before other forces began new attacks into the Sviati Hory National Park. The Russians were able to capture the Svyatohirsk Water Treatment Facility and gained a foothold in the forests of the national park. Due to a critical lack of manpower in this direction, Ukrainian forces put up limited resistance as the Russians advanced through the forests on multiple axes. \nRussian forces advanced west through the forests towards the Sosnove - Oleksandrivka Railway Line and Road and are rapidly approaching it. They are also advancing down the road to western Yarova, and captured new positions in the forests there. Additionally, the Russian soldiers who infiltrated southeastern Yarova were forced to withdraw after meeting fierce resistance from the Ukrainian garrison there and instead began attacks towards the village from forested areas further west. \nMeanwhile, Ukrainian forces continued their counterattacks in the village of Ridkodub. As a result of intensified attacks, they were able to recapture the agricultural buildings on the northern outskirts of the settlement, while the Russians largely pulled back to its easternmost street.\n+ ~7.09 km² in favour of Russia.\n+ ~0.50 km² in favour of Ukraine.",
      "timestamp": "2025-10-25T16:35:06.247955Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, with Ukrainian forces attempting to cut off the Russian assault groups in Kupyansk from the north.\nUkrainian forces advanced from their newly recaptured positions in the forest plantations north of Moskovka, across the P-79 Highway, and into the forests south of Kindrashivka and northwest of Radkivka. They were able to take the poorly consolidated Russian positions there and used them to push further into the treelines southeast and east of Kindrashivka. \nUkrainian armoured vehicles were able to advance further, and approached the western bank of the Oskil River, but were subsequently destroyed by FPV drones. Most of the infantry in the vehicles were killed shortly afterwards, and the chances of consolidation in these areas is next to zero. Nevertheless, Russian logistics into Kupyansk have been complicated. While all supply was already being carried out on foot through fields and forests, this shortening of the gap that can be used will make things more difficult and could delay the eventual fall of the city. \nMeanwhile, Russian forces continued to advance in Kupyansk itself. They were able to consolidate in the central market and advance to the residential areas and the university, physically encircling any remaining Ukrainian soldiers in the grey zone of the city centre. \n+ ~1.74 km² in favour of Ukraine.\n+ ~0.54 km² in favour of Russia.",
      "timestamp": "2025-10-25T16:35:06.247970Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces intensified their assault operations over the past week, making substantial progress.\nRussian forces advanced south from their recently captured positions across the international border northeast of Odradne, and captured new positions in the gulleys and treelines southeast of Odradne. This allowed for the Russians to break out of the village and take up new positions in the forest and treelines to the south. \nFrom there, a new incursion was made across the border in the direction of Bolohivka. The Russians quickly captured the lightly defended positions in the forests just across the border, linking up their larger incursion zone to the rest of the frontline in Kharkiv Oblast. They then began attacking Bolohivka from the northeast, while other forces advanced downhill and southeast along the treelines from their earlier incursion zone. This allowed for them to enter the village from two directions and quickly seize control over it.\nSince then, Russian forces began a new series of attacks in the area between Bolohivka and Odradne. They advanced south down the treelines and gulleys, taking up new positions on both the tactical heights and in the low-lying ground, and reached the northern outskirts of Dvorichanske where fighting is now ongoing. \n+ ~24.80 km² in favour of Russia.",
      "timestamp": "2025-10-25T16:35:06.247977Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance southwest of Vovchansk, further expanding their bridgehead on the southern bank of the Vovcha River.\nAfter establishing control over much of the western suburbs, Russian forces began attacking out of the city towards the village of Synelnykove. They were able to establish control over the rest of the residential parts of Vovchansk west of the railway line and secured new positions in the adjacent forests and on the outskirts of Synelnykove. \nFurther west, the Russians intensified their assault operations in the Synelnykove Forest. They pushed further south from the eastern bank of the Vovcha River and reached the Synelnykove - Hrafske Road, establishing control over numerous positions north of it.\n+ ~5.58 km² in favour of Russia.",
      "timestamp": "2025-10-25T16:35:06.247983Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their assault operations towards Kindrativka and have recaptured positions northeast of the village.\nAfter being forced to withdraw over the reservoir, Russian forces crossed it again using rubber boats and gained a foothold in the forest plantations on its southern bank. From there they advanced further, securing the entire southern bank, as well as positions further south along the treeline. \nMeanwhile, Ukrainian forces are attacking towards the road intersection west of Kostyantynivka, attempting to cut off supplies into the village. No confirmed progress has been made here.\n+ ~1.81 km² in favour of Russia.",
      "timestamp": "2025-10-25T16:35:06.247988Z"
    },
    {
      "original": "Footage showing the second Russian Iskander-M striking Kyiv.",
      "timestamp": "2025-10-25T16:35:06.247992Z"
    },
    {
      "original": "Consequences of the two Russian Iskander-M ballistic missile strikes on Ukrainian energy infrastructure in Kyiv.",
      "timestamp": "2025-10-25T16:35:06.247995Z"
    },
    {
      "original": "Consequences of the two Russian Iskander-M ballistic missile strikes on Ukrainian energy infrastructure in Kyiv.",
      "timestamp": "2025-10-25T16:35:06.247999Z"
    },
    {
      "original": "Last night, a series of Russian attacks were carried out on Kharkiv Oblast.\n15 Russian Geran-2 drones struck a target in the area of Pivdenne, just south of Kharkiv City. Media 1 & 2 show some of the explosions that were seen from Kharkiv City. At least 3 Geran-2 drones also impacted the railway station in the city of Lozova. \nAdditionally, 6 KAB glide-bombs targeted the industrial zone in northern Kharkiv, as seen in Media 3. The full extent of the damage here is unknown, but 13 civilians were injured due to damage to surrounding apartment buildings.",
      "timestamp": "2025-10-25T16:35:06.248004Z"
    },
    {
      "original": "Last night, a series of Russian attacks were carried out on Kharkiv Oblast.\n15 Russian Geran-2 drones struck a target in the area of Pivdenne, just south of Kharkiv City. Media 1 & 2 show some of the explosions that were seen from Kharkiv City. At least 3 Geran-2 drones also impacted the railway station in the city of Lozova. \nAdditionally, 6 KAB glide-bombs targeted the industrial zone in northern Kharkiv, as seen in Media 3. The full extent of the damage here is unknown, but 13 civilians were injured due to damage to surrounding apartment buildings.",
      "timestamp": "2025-10-25T16:35:06.248009Z"
    },
    {
      "original": "Consequences of the two Russian Iskander-M ballistic missile strikes on Ukrainian energy infrastructure in Kyiv.",
      "timestamp": "2025-10-25T16:35:06.248012Z"
    },
    {
      "original": "Despite firefighting efforts, a massive fire continues to burn in eastern Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T16:35:06.248016Z"
    },
    {
      "original": "Despite firefighting efforts, a massive fire continues to burn in eastern Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T16:35:06.248019Z"
    },
    {
      "original": "Last night, several Ukrainian UAVs attacked the Ryazan Oil Refinery in Ryazan Oblast.   At least two impacts were recorded, including 1 in the area of the hydrotreating unit and another the AVT-2 primary oil processing unit. Some sources reported that \"Peklo\"…",
      "timestamp": "2025-10-25T16:35:06.248022Z"
    },
    {
      "original": "Reuters reports that due to the repeated Ukrainian drone strikes on the Ryazan Oil Refinery, the refinery has shut down its main oil processing unit (ATV-4) for three months. \nThis unit can produce as much as 4 million metric tons of fuel per year (80,000 barrels per day), which equates to 35-50% of the refinery's total production capacity. In addition to this, nearby units such as a reformer, gasoil hydrotreater, and catalytic cracker were also reportedly temporarily halted due to the damage sustained. \nThe Ryazan Oil Refinery is the fourth largest in Russia, and processes approximately 5% of Russia's total refinery output.",
      "timestamp": "2025-10-25T16:35:06.248027Z"
    },
    {
      "original": "Overnight, 2 Russian Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Diaghilev Airbase, Ryazan Oblast.\nOne An-124-100 \"Ruslan\" cargo plane landed at Diaghilev Airbase, carrying Kh-101 cruise missiles for the Tu-95MS. To my knowledge, this is the first recorded instance of Russia using Diaghilev Airbase to equip their bombers. \nMeanwhile, 1 Tu-95MS is stationed at Olenya Airbase, Murmansk Oblast, and 3 are at Engels-2 Airbase, Saratov Oblast. 2 Tu-160s are also stationed at Engels-2. All of these aircraft are equipped with missiles.\nThere is an increased possibility of the next large-scale, combined missile attack on Ukraine taking place tonight, as large launches of Geran-2 drones are expected to take place.",
      "timestamp": "2025-10-25T16:35:06.248036Z"
    },
    {
      "original": "My interview with AMK mapping is now up.\nhttps://youtu.be/pl3bA4Xh9sI?si=q_LkZzJQN1BnSnKl",
      "timestamp": "2025-10-25T16:35:06.248040Z"
    },
    {
      "original": "My interview with AMK mapping is now up.  https://youtu.be/pl3bA4Xh9sI?si=q_LkZzJQN1BnSnKl",
      "timestamp": "2025-10-25T16:35:06.248044Z"
    },
    {
      "original": "This is my fourth episode on Kalibrated, and its interesting seeing how my views have evolved over time since the first time I appeared on the show in June 2024.",
      "timestamp": "2025-10-25T16:35:06.248047Z"
    },
    {
      "original": "Overnight, 2 Russian Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Diaghilev Airbase, Ryazan Oblast.  One An-124-100 \"Ruslan\" cargo plane landed at Diaghilev Airbase, carrying Kh-101 cruise missiles for the Tu-95MS. To my knowledge…",
      "timestamp": "2025-10-25T16:35:06.248053Z"
    },
    {
      "original": "There is a significant chance of Russia launching a large-scale, combined missile and drone attack on Ukraine tonight. \nSo far, launches of Geran-2 drones have been recorded (not confirmed) from Millerovo Airbase, Rostov Oblast, and Primorsko-Akhtarsk Airbase, Krasnodar Krai. Additional preparations for launches of Gerna-2/3 drones has been recorded from Navlya Test Site, Bryansk Oblast.\nDue to recent accumulations of Geran-2 drones at Millerovo Airbase, the numbers of drones launched from here alone could reach as high as 100. \nAdditionally, due to recent deliveries of missiles, there is a high threat of Iskander-M ballistic missile and Iskander-K cruise missile launches from OTRK installations in Bryansk Oblast, Kursk Oblast, and Voronezh Oblast.",
      "timestamp": "2025-10-25T16:35:06.248058Z"
    },
    {
      "original": "For the second time this week, a Russian BM-35 drone struck a wind turbine in Kramatorsk, Donetsk Oblast. No new power outages are reported.",
      "timestamp": "2025-10-25T16:35:06.248061Z"
    },
    {
      "original": "A Russian BM-35 drone has struck a wind turbine near Kramatorsk, Donetsk Oblast for the third time this week.",
      "timestamp": "2025-10-25T16:35:06.248064Z"
    },
    {
      "original": "There is a significant chance of Russia launching a large-scale, combined missile and drone attack on Ukraine tonight.   So far, launches of Geran-2 drones have been recorded (not confirmed) from Millerovo Airbase, Rostov Oblast, and Primorsko-Akhtarsk Airbase…",
      "timestamp": "2025-10-25T16:35:06.248067Z"
    },
    {
      "original": "Over the past 48 hours, as many as 4 Russian MiG-31Ks have been re-equipped with Kinzhal aeroballistic missiles at Akhtubinsk Airbase, Astrakhan Oblast. They may be used tonight.",
      "timestamp": "2025-10-25T16:35:06.248071Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909330Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909348Z"
    },
    {
      "original": "PERSISTENT PRESSURE: RUSSIAN FORCES MAKE INCREMENTAL GAINS ACROSS EASTERN FRONT",
      "timestamp": "2025-10-25T16:35:06.909352Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909360Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909367Z"
    },
    {
      "original": "Air Defenses Hit: Summary Of Russian Combat Footage From October 24, 2025\nOn October 24, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-25T16:35:06.909374Z"
    },
    {
      "original": "Air Defenses Hit: Summary Of Russian Combat Footage From October 24, 2025\nOn October 24, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-25T16:35:06.909381Z"
    },
    {
      "original": "U.S. Deploys Its Latest Aircraft Carrier In Caribbean, Targets Another Boat Near Venezuela (Video) \nThe Pentagon on October 24 ordered the deployment of the USS Gerald R. Ford Carrier Strike Group to the Caribbean Sea to support operations against drug cartels there, amid reports suggesting that President Donald Trump was nearing a decision on launching strikes against Venezuela.\nThe strike group docked near the harbor of Split, Croatia, on October 21. That is more than 4,300 nautical miles from the Caribbean, meaning it would take days for the group to be in position to launch any strikes.\nThe announcement of the carrier strike group deployment came just hours after Defense Secretary Pete Hegseth said that the U.S. military had struck another alleged drug-smuggling boat in the Caribbean.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909389Z"
    },
    {
      "original": "U.S. Deploys Its Latest Aircraft Carrier In Caribbean, Targets Another Boat Near Venezuela (Video) \nThe Pentagon on October 24 ordered the deployment of the USS Gerald R. Ford Carrier Strike Group to the Caribbean Sea to support operations against drug cartels there, amid reports suggesting that President Donald Trump was nearing a decision on launching strikes against Venezuela.\nThe strike group docked near the harbor of Split, Croatia, on October 21. That is more than 4,300 nautical miles from the Caribbean, meaning it would take days for the group to be in position to launch any strikes.\nThe announcement of the carrier strike group deployment came just hours after Defense Secretary Pete Hegseth said that the U.S. military had struck another alleged drug-smuggling boat in the Caribbean.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909397Z"
    },
    {
      "original": "Russian Army Captures Rodynske And Advances In Pokrovsk, Causing Panic In Ukraine (Videos) \nOn October 25, the Russian military captured a key settlement located to the north of Pokrovsk, and expanded its control within the city itself, causing panic in the ranks of Kiev forces.\nThe Tsentr [Center] Group of Forces has reportedly captured Rodynske and most of its outskirts to the north of Pokrovsk. Russian troops reached the route to the west of the settlement which links Pokrovsk with Dobropillya further to the north.\nIn Pokrovsk itself, the Tsentr Group of Forces made additional gains. Russian troops captured most of the city’s western entrance, advanced further to the north of the railroad in the center of the city, and reached the settlement of Rih, or Rig, to the east.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909405Z"
    },
    {
      "original": "Russian Army Captures Rodynske And Advances In Pokrovsk, Causing Panic In Ukraine (Videos) \nOn October 25, the Russian military captured a key settlement located to the north of Pokrovsk, and expanded its control within the city itself, causing panic in the ranks of Kiev forces.\nThe Tsentr [Center] Group of Forces has reportedly captured Rodynske and most of its outskirts to the north of Pokrovsk. Russian troops reached the route to the west of the settlement which links Pokrovsk with Dobropillya further to the north.\nIn Pokrovsk itself, the Tsentr Group of Forces made additional gains. Russian troops captured most of the city’s western entrance, advanced further to the north of the railroad in the center of the city, and reached the settlement of Rih, or Rig, to the east.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909414Z"
    },
    {
      "original": "Military Situation In Northern Palestine On October 25, 2025 (Map Update)",
      "timestamp": "2025-10-25T16:35:06.909417Z"
    },
    {
      "original": "Russian Army Advances In Vovchansk, Ukraine Murders Own Troops Near Kupyansk (Videos, Photos)\nOn October 25, the Russian military advanced in Vovchansk, and made a breakthrough close to Kupyansk as Ukraine stepped up efforts to prevent its troops from abandoning their positions in the Khakriv direction.\nThe Sever [North] Group of Forces has reportedly advanced in the western part of Vovchansk, mainly along the streets of Obozna and Zaliznychna. Russian troops are close to blocking the southern entrance of the key settlement, which would prevent Ukraine from sending supplies from Bilyi Kolodyaz.\nMoving to the south in Kharkiv, the Zapad [West] Group of Forces continue to battle Kiev forces inside Kupyansk and in nearby areas.\nMost of the city is already under the control of Russian troops. Ukraine is doing everything possible to force its troops to fight there.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909426Z"
    },
    {
      "original": "Russian Army Advances In Vovchansk, Ukraine Murders Own Troops Near Kupyansk (Videos, Photos)\nOn October 25, the Russian military advanced in Vovchansk, and made a breakthrough close to Kupyansk as Ukraine stepped up efforts to prevent its troops from abandoning their positions in the Khakriv direction.\nThe Sever [North] Group of Forces has reportedly advanced in the western part of Vovchansk, mainly along the streets of Obozna and Zaliznychna. Russian troops are close to blocking the southern entrance of the key settlement, which would prevent Ukraine from sending supplies from Bilyi Kolodyaz.\nMoving to the south in Kharkiv, the Zapad [West] Group of Forces continue to battle Kiev forces inside Kupyansk and in nearby areas.\nMost of the city is already under the control of Russian troops. Ukraine is doing everything possible to force its troops to fight there.\nRead more \nHERE",
      "timestamp": "2025-10-25T16:35:06.909435Z"
    }
  ],
  "script_run_time": "2025-10-25T16:35:06.910272Z"
}