{
  "messages": [
    {
      "original": "КАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-08-01T18:32:34.695816Z"
    },
    {
      "original": "КАБи на північ Харківщини!",
      "timestamp": "2025-08-01T18:32:34.695829Z"
    },
    {
      "original": "КАБи на Сумщину, Харківщину, Донеччину та Дніпропетровщину!",
      "timestamp": "2025-08-01T18:32:34.695833Z"
    },
    {
      "original": "Чернігівська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-01T18:32:34.695836Z"
    },
    {
      "original": "Сумська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-01T18:32:34.695839Z"
    },
    {
      "original": "Активність ворожої тактичної авіації на сході! \nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T18:32:34.695844Z"
    },
    {
      "original": "КАБи на схід Харківщини!",
      "timestamp": "2025-08-01T18:32:34.695847Z"
    },
    {
      "original": "Ворожі ударні БпЛА на північний схід від Чернігова, курс - південно-західний.",
      "timestamp": "2025-08-01T18:32:34.695850Z"
    },
    {
      "original": "Активність ворожої тактичної авіації на сході! \nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T18:32:34.695854Z"
    },
    {
      "original": "Чернігівщина: БпЛА курсом на Остер/Десну/Київщину.",
      "timestamp": "2025-08-01T18:32:34.695857Z"
    },
    {
      "original": "Київська область (Вишгородський р-н) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-08-01T18:32:34.695860Z"
    },
    {
      "original": "Житомирська область, Київська область (Вишгородський,Бучанський р-ни) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-08-01T18:32:34.695864Z"
    },
    {
      "original": "Загроза застосування балістики на півдні!",
      "timestamp": "2025-08-01T18:32:34.695867Z"
    },
    {
      "original": "Сумська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-01T18:32:34.695870Z"
    },
    {
      "original": "БпЛА на північному сході та сході Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-08-01T18:32:34.695873Z"
    },
    {
      "original": "Харків (Харківський р-н) - загроза застосування ворогом ударних БпЛА. .",
      "timestamp": "2025-08-01T18:32:34.695876Z"
    },
    {
      "original": "Київська область (Броварський, Бориспільський р-ни) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-08-01T18:32:34.695879Z"
    },
    {
      "original": "БпЛА з Чернігівщини на Київщину, курсом на Київ/Вишгород з північного сходу.",
      "timestamp": "2025-08-01T18:32:34.695882Z"
    },
    {
      "original": "Активність ворожої тактичної авіації на сході! \nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T18:32:34.695888Z"
    },
    {
      "original": "Пуски КАБ ворожою тактичною авіацією на схід Харківщини.",
      "timestamp": "2025-08-01T18:32:34.695891Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given for more serious infractions such as posting uncensored gore, nudity, etc. Just use common sense and don't be a jerk, and you will be fine. \nThere will still be free-speech and people are welcome to voice their opinions whether you are Pro-Russian, Pro-Ukraine, Neutral, or anything else, but it must be done in a respectful manner. You are allowed to criticize admins, but within obvious limits. \nWhen you have a channel with many conflicting perspectives, you need stricter moderation, or otherwise it falls apart. I aim for the chat to become more productive, but also not formal. Appeals will be in DMs.",
      "timestamp": "2025-08-01T18:32:35.123886Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given…",
      "timestamp": "2025-08-01T18:32:35.123896Z"
    },
    {
      "original": "Rules are now pinned in the chat. \nhttps://t.me/AMK_Mapping_Chat/139040",
      "timestamp": "2025-08-01T18:32:35.123900Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-01T18:32:35.123904Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-01T18:32:35.123907Z"
    },
    {
      "original": "Explosion heard in Sderot",
      "timestamp": "2025-08-01T18:32:35.123910Z"
    },
    {
      "original": "1 rocket was reportedly intercepted.",
      "timestamp": "2025-08-01T18:32:35.123913Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-01T18:32:35.123941Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-01T18:32:35.123954Z"
    },
    {
      "original": "Russian forces have captured the village of Sukhetske, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~39.\nTotal land area: ~0.32km².",
      "timestamp": "2025-08-01T18:32:35.123959Z"
    },
    {
      "original": "Russian forces have captured the village of Nykanorivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~250.\nTotal land area: ~1.35km².",
      "timestamp": "2025-08-01T18:32:35.123964Z"
    },
    {
      "original": "Russian forces have captured the village of Troyanda, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~80.\nTotal land area: ~0.20km².",
      "timestamp": "2025-08-01T18:32:35.123968Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance and have made significant progress in the direction of Pishchane. \nFollowing a series of Ukrainian counterattacks, Russian forces cleared the houses in western Stepova Novosilka which Ukraine had previously infiltrated, and pushed back down to railway line to the strongpoints in the area of the road bridge. These fortifications were subsequently captured, forcing a Ukrainian withdrawal further west, and a Russian advance further down the windbreaks on either side of the railway tracks. These positions are all on the tactical heights.\nAdditional pushes were made to the northwest, with Russian forces attacking down the treelines along the tactical heights, where they captured further positions north of the highway to Kupyansk in the treelines and forest plantations there.\n+ ~10.80km² in favour of Russia.",
      "timestamp": "2025-08-01T18:32:35.123973Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces counterattacked and regained some positions in Luhansk Oblast.\nUkrainian forces advanced from the southern forest west of Hrekivka, and cleared the adjacent treelines. They then moved south down the perpendicular treelines on the tactical heights, pushing along the western bank of the tributary of the Zherebets River, and pressuring the rear of the Russian garrison in Hrekivka. \n+ ~0.99km² in favour of Ukraine.",
      "timestamp": "2025-08-01T18:32:35.123978Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to make incremental progress east of the Nitrius River, and have re-established a bridgehead on its western bank.\nRussian forces advanced in three areas. In the northwest, they cleared the pocket east of the Nitrius River, and advanced back over one of the dams, establishing a foothold on the western bank in previously lost positions in southwestern Karpivka.\nTo the southeast, Russian forces continued to expand their zone of control west of Zelena Dolnya, and captured new positions on two opposite tactical heights, and in the forest plantations lining the gulley. They were also able to establish a foothold in the next set of forest plantations, northeast of Shandryholove. \nIn the east, Russian forces resumed their assault operations after being pushed out of Kolodyazi, and re-entered the village, capturing most of the industrial zone and part of the residential area in the centre of the settlement.\n+ ~7.31km² in favour of Russia.",
      "timestamp": "2025-08-01T18:32:35.123984Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces have achieved another localised breakthrough and have cut the railway line from Dobropillya. \nRussian continued to push from the Fedorivka-Boikivka area and captured numerous positions in the forests and treelines on the tactical heights to the west. They advanced into and quickly captured Zatyshok, before immediately pushing southwest to Sukhetske which was also captured. Other positions in the surrounding areas were seized, and a general push to the railway line was made, resulting in a ~2.7km long section of it and the trench lines running parallel to it coming under Russian control.\nRussian DRGs then began moving into northern Rodynske, carrying out operations in both the dachas and the northern residential areas. As a result northern Rodynske is currently in the grey zone. Additionally, by exploiting a gap in the trench lines, Russian forces began advancing towards the train station, although it's unclear if they achieved any success. \nTo the north, the Russian were able to complete the capture of Nykanorivka by pushing outwards from their foothold in the southern houses, and from the newly captured positions in the forests to the east. They then went on to establish control over the forests west and north of the village, and began attacking the freight train station at Dorozhnje. DRGs have already begun infiltrating the city of Bilytske from the east\nAdditionally, Russian forces cleared the rest of the salient west of Razine, recapturing the treeline positions there, and entered the eastern part of Chervonyi Lyman. \n+ ~26.40km² in favour of Russia.",
      "timestamp": "2025-08-01T18:32:35.123990Z"
    },
    {
      "original": "Russian forces have broken through to the northeastern outskirts of Siversk again, and captured an important trench strongpoint. \nThey have had more success so far than any of their previous failed attempts at entering the city, and the fighting has significantly intensified. It's possible that an attempt to capture Siversk is underway.",
      "timestamp": "2025-08-01T18:32:35.123994Z"
    },
    {
      "original": "1 Russian Tu-22M3 strategic bomber is airborne from Shaykovka Airbase in Kaluga Oblast, flying to the launch lines in the Black Sea. It is currently over Rostov Oblast.",
      "timestamp": "2025-08-01T18:32:35.123999Z"
    },
    {
      "original": "1 Russian Tu-22M3 strategic bomber is airborne from Shaykovka Airbase in Kaluga Oblast, flying to the launch lines in the Black Sea. It is currently over Rostov Oblast.",
      "timestamp": "2025-08-01T18:32:35.124003Z"
    },
    {
      "original": "Correction: Its flying over southern Crimea, heading for the launch lines southwest of Sevastopol.",
      "timestamp": "2025-08-01T18:32:35.124006Z"
    },
    {
      "original": "Correction: Its flying over southern Crimea, heading for the launch lines southwest of Sevastopol.",
      "timestamp": "2025-08-01T18:32:35.124009Z"
    },
    {
      "original": "2 bombers, not 1",
      "timestamp": "2025-08-01T18:32:35.124012Z"
    },
    {
      "original": "2 bombers, not 1",
      "timestamp": "2025-08-01T18:32:35.124014Z"
    },
    {
      "original": "They made a U-turn at Feodosia and are now flying back past Cape Chauda on a northeastern course, being escorted by 2 Su-35s.",
      "timestamp": "2025-08-01T18:32:35.124017Z"
    },
    {
      "original": "They made a U-turn at Feodosia and are now flying back past Cape Chauda on a northeastern course, being escorted by 2 Su-35s.",
      "timestamp": "2025-08-01T18:32:35.124020Z"
    },
    {
      "original": "They appear to be flying to Mozdok Airbase, North Ossetia.",
      "timestamp": "2025-08-01T18:32:35.124023Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T18:32:35.682740Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T18:32:35.682753Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682769Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682782Z"
    },
    {
      "original": "Come and See: The War in Ukraine, Unfiltered. A Video Selection from July 24-31 \nIn a time flooded with relentless propaganda and misinformation, it’s increasingly difficult to discern reality. Yet, one thing remains constant—firsthand accounts and unfiltered footage that capture the raw essence of the conflict. In this compilation, we present a selection of some of the most shocking, sorrowful, and occasionally absurd moments captured from both the frontlines and the rear. No filters, no distortions—just the war as it unfolded over the past week.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682791Z"
    },
    {
      "original": "Come and See: The War in Ukraine, Unfiltered. A Video Selection from July 24-31 \nIn a time flooded with relentless propaganda and misinformation, it’s increasingly difficult to discern reality. Yet, one thing remains constant—firsthand accounts and unfiltered footage that capture the raw essence of the conflict. In this compilation, we present a selection of some of the most shocking, sorrowful, and occasionally absurd moments captured from both the frontlines and the rear. No filters, no distortions—just the war as it unfolded over the past week.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682799Z"
    },
    {
      "original": "Trump's Economic Warfare Targets Virtually Entire BRICS\nAfter Donald Trump once again became the President of the United States, tariffs became the new buzzword in the halls of power in Washington DC. He's using them not only against America's numerous geopolitical adversaries, but also vassals and satellite states that he wants to exploit in hopes of reinvigorating the US economy. \nHowever, the last several days of Trump's moves demonstrate his very limited understanding of the geopolitical consequences of such actions. Namely, apart from the ongoing attempts to probe Russia's and China's capabilities through economic warfare, the US government is also targeting India and Brazil (in other words, all four founding member states of what today is the rapidly growing BRICS+ format).\nUsed to cut-throat, swindler tactics of the ruthless American real estate business, Trump believes he can use the \"small carrot, big stick\" approach to resuscitate America's geopolitical dominance...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682809Z"
    },
    {
      "original": "Russia’s Geran-3 Jet-Powered Drones Are Causing Headache In Kiev\nAt least eight jet-powered suicide drones were among more than 300 launched by Russia during an attack on Ukraine early on July 31, Ukrainian Air Force (UAF) spokesman Yuri Ignat revealed, warning that these drones are harder to track and intercept than propeller-driven models.\nThe drone in question is likely the Geran-3, which is said to be a Russian copy of the Shahed-238 first presented by Iran last November.\n“Basically, on radar it is displayed as a cruise missile by flight parameters, because the speed there can be 500-plus kilometers per hour ,” Ignat explained. “Not all means that we use today can intercept such targets.”\nThe Geran-3 is reported to have a range of 2,000-2,500 kilometers and can climb to an altitude of up to nearly ten kilometers. Its turbojet engine produces a maximum speed of up to 600 kilometers per hour. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682819Z"
    },
    {
      "original": "Israel Evacuates UAE Embassy Amid Fear Of Attacks\nIsrael began evacuating most of its diplomatic mission staff in the United Arab Emirates, Hebrew media reported late on July 31, right after the National Security Council (NSC) sharpened its travel warning for Israelis staying in the Gulf country.\n“This comes amid growing indications that terrorist organizations (including Iranian-affiliated groups, Hamas, Hezbollah and global Jihad) are stepping up efforts to harm Israelis,” the council said in a statement.\nIt is believed there is increased motivation for revenge” following Israel’s war with Iran, “in addition to rising anti-Israel incitement and pro-Palestinian sentiment,” the council added. “In light of this, the NSC emphasizes the potential for terrorist attacks against Israeli and Jewish targets in the UAE, particularly around Jewish holidays and Sabbaths.”\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682829Z"
    },
    {
      "original": "Naval Pantsir Proved Effective Against Sea-Skimming Missiles In Tests \nThe naval version of the Pantsir-S air defense system, dubbed the Pantsir-M, successfully shot down targets mimicking anti-ship cruise missiles flying just 3-5 meters above water level during tests of a Karakurt-class corvette, sources in the Russian military-industrial complex told Izvestia on July 31.\nThe Pantsir-M, which first entered service in 2018, is planned to replace Soviet-era Kashtan-M close-in weapon system (CIWS).\nThe system is equipped with a phased array radar, electro-optical/infrared targeting and identification systems based on that of the Pantsir-S.\nThe Pantsir-M “entered reliable operation” following the successful compilation of the latest tests, according to Izvestia’s sources, which noted that the system can now “confidently” shoot down all sorts of aerial targets, from missiles to small drones.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682840Z"
    },
    {
      "original": "Pokrovsk on the Brink: Ukrainian Lines Shatter as Russians Enter The Streets\nThe thunder of Russian artillery echoes through the streets of Pokrovsk as the city teeters on the brink of collapse. Stormtroopers of the Russian Armed Forces, advancing with precision and overwhelming firepower, have infiltrated the urban center, shattering Ukrainian defenses and sending shockwaves through Kyiv’s crumbling frontlines. What was once another fortified Ukrainian fortress is now a battleground where Russian troops advancing in key districts, while desperate Ukrainian commanders scramble to plug the widening gaps in their disintegrating lines.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682848Z"
    },
    {
      "original": "Pokrovsk on the Brink: Ukrainian Lines Shatter as Russians Enter The Streets\nThe thunder of Russian artillery echoes through the streets of Pokrovsk as the city teeters on the brink of collapse. Stormtroopers of the Russian Armed Forces, advancing with precision and overwhelming firepower, have infiltrated the urban center, shattering Ukrainian defenses and sending shockwaves through Kyiv’s crumbling frontlines. What was once another fortified Ukrainian fortress is now a battleground where Russian troops advancing in key districts, while desperate Ukrainian commanders scramble to plug the widening gaps in their disintegrating lines.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682856Z"
    },
    {
      "original": "In Video: Russian Drone Destroys Ukraine’s Polish-Made Anti-Drone System\nThe Russian military has destroyed a SKYctrl counter-drone system deployed by Kiev forces in the Chernihiv region using a Lancet loitering munition.\nThe pickup-mounted system was targeted close to the settlement of Mashevo, some 20 kilometers away from the border with Russia. Video footage of the strike indicates that the system was completely destroyed after getting directly hit by the Lancet.\nSKYctrl was developed by Poland’s Advanced Protection Systems. It is unclear when exactly the system was supplied to Ukraine.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682865Z"
    },
    {
      "original": "Russia Is Boosting Its Air Defenses With More Pantsir-SMD, S-350, S-400 Systems\nThe Russian Aerospace Forces continue to rearm its air defense units with Pantsir-SMD, S-350 Vityaz and S-400 Triumf systems to boost their defense capabilities, Deputy Commander-in-Chief of the aerospace forces Lt. Gen. Alexander Maksimtsev said in an interview with the Krasnaya Zvezda newspaper that was published on August 1.\n“In order to boost defense capabilities protecting administrative and political centers, important sites and regions of the country, as well as battlegroups and logistic support facilities from the enemy’s massive air strikes, the troops are being actively supplied with new Pantsir-SMD self-propelled, medium-range surface-to-air missile and anti-aircraft artillery systems. Rearmament with advanced S-350 Vityaz and S-400 Triumf systems continues,” Maksimtsev said.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T18:32:35.682874Z"
    }
  ],
  "script_run_time": "2025-08-01T18:32:35.683520Z"
}