{
  "messages": [
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-26T21:27:06.699772Z"
    },
    {
      "original": "🛵\n Чернігівщина: - БпЛА повз Батурин \n➡️\n курсом на південь. - БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T21:27:06.699797Z"
    },
    {
      "original": "🛵\n Чернігівщина: нові групи БпЛА з півночі \n➡️\n курсом на Холми, Короп.\n🛵\n Сумщина: БпЛА \n➡️\n у напрямку Ямполя.",
      "timestamp": "2025-11-26T21:27:06.699810Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T21:27:06.699815Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T21:27:06.699824Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T21:27:06.699831Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини.\nБпЛА \n➡️\n курсом на Ізюм.\n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T21:27:06.699846Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T21:27:06.699858Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T21:27:06.699869Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T21:27:06.699883Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T21:27:06.699891Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T21:27:06.699897Z"
    },
    {
      "original": "🛵\n Полтавщина: група БпЛА повз Зіньків \n➡️\n курсом на південь.",
      "timestamp": "2025-11-26T21:27:06.699904Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T21:27:06.699911Z"
    },
    {
      "original": "🛵\n Через Харківщину БпЛА \n➡️\n у напрямку Дніпропетровщини.",
      "timestamp": "2025-11-26T21:27:06.699917Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на Чернігівщину.",
      "timestamp": "2025-11-26T21:27:06.699923Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-26T21:27:06.699931Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T21:27:06.699936Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-26T21:27:06.699941Z"
    },
    {
      "original": "🛵\n БпЛА на заході Запоріжжя  \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T21:27:06.699948Z"
    },
    {
      "original": "🚀\n КАБ на Харківщину.",
      "timestamp": "2025-11-26T21:27:06.699953Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-26T21:27:06.699957Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курс на захід (н.п. Сновськ/Ріпки)\n🛵\n БпЛА на Харківщині \n➡️\n курсом на схід.\n🛵\n БпЛА на Дніпропетровщині (н.п. Олександрівка) \n➡️\n курсом на північний схід.",
      "timestamp": "2025-11-26T21:27:06.699969Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на Донеччині \n➡️\n в північно-західному напрямку.",
      "timestamp": "2025-11-26T21:27:06.699977Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-26T21:27:06.699982Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n Група БпЛА на півдні Харківщини \n➡️\n курсом на Донеччину.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на сході Дніпропетровщині \n➡️\n курсом на Донеччину.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на Донеччині \n➡️\n в напрямку на північ/схід.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на Миколаївщині \n➡️\n в західному напрямку.",
      "timestamp": "2025-11-26T21:27:06.700007Z"
    },
    {
      "original": "In the Pokrovsk'e and Prosyana directions, Russian forces continued to advance south of the Vovcha River, further cementing their presence along its southern bank.\nIn the west, following earlier infiltration attempts, Russian forces entered and captured the eastern part of the village of Tykhe before advancing west and capturing the rest of the settlement. Additionally, they advanced north up a treeline towards western Tykhe, establishing control over it. \nIn the east, following earlier infiltrations, Russian forces consolidated in part of the Dibrovsky Forest Reserve, as well as in the forest plantation to the south.\n+ ~4.36 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.456965Z"
    },
    {
      "original": "In the Prosyana and Novopavlivka directions, both Russian and Ukrainian forces have advanced in key areas.\nIn the west, at some point recently, Ukrainian forces launched a series of counterattacks aimed at eliminating the Russian presence west of Ivanivka and re-establishing themselves in the village. They were able to advance from their stronger positions east of Havrylivka, and re-entered the Yasenky Forest, capturing positions in the west and north of it. Russian forces retain control over positions in the forest closer to the Vovcha River. \nAdditionally, Ukrainian forces recaptured the treeline leading to the westernmost part of Ivanivka, and consolidated in positions in the residential area there. Russian forces also captured some additional positions in western Ivanivka which were previously in the grey zone. \nIn the east, following the breakthrough to Novopavlivka, Russian forces began consolidating in the positions to the rear of the town. They established full control over the stretch of highway leading into Novopavlivka, and consolidated in the agricultural complex on the eastern edge of the time. They also advanced up two parallel treelines east of the highway, taking advantage of Ukrainian withdrawals from the salient there. \n+ ~9.62 km² in favour of Ukraine. \n+ ~7.89 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.456981Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued their assault operations north of Udachne and have captured the Pokrovsk Coal mine.\nAfter gaining a foothold in the southern buildings of the mine, Russian soldiers pushed fowards through the rest of the mine, establishing full control over it. Ukrainian forces withdrew to the treelines further north, and Russian forces have begun infiltrations into the forest plantations along the Matiushyna Gulley, west of the coal mine's waste dump. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.456987Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to make progress in the besieged city of Myrnohrad, capturing additional positions in the northern suburbs.\nIn eastern Myrnohrad, Russian forces made new advances in the Skhidnyi and Damanskyi Microdistricts. They captured at least 11 more high-rise buildings, along with Kindergarten No. 19 and the secondary school. \nIn northeastern Myrnohrad, Russian forces advanced further in the 8th District, where they captured new positions in the low-rise residential areas northwest of the Skhidnyi Microdistrict, reached Hrynka Street in the direction of the city centre, and began fighting for School No. 4 and the surrounding areas. \nIn northern Myrnohrad, Russian forces advanced southwest from the 8th District to the Tsentralna Mine, capturing new positions in the residential areas there and entering the mine. Additionally, they captured the remaining two blocks of three-story buildings in the Novator District and established control over large parts of the low-rise residential areas to the south and southwest.\nIn northwestern Myrnohrad, following earlier infiltration attempts, Russian forces consolidated at the city bus station, and began pushing into the Brianka District. Here, they were able to penetrate southeast, capturing positions in the low-rise residential areas west of Myrna Street, while infiltrations took place further west towards Voronova Street and the city centre.\nFurther west, as a result of the advances into northwestern Myrnohrad, the Russians managed to capture most of the rest of Rivne, consolidating in the central, northern, and southern parts of the village. \n+ ~1.92 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.456995Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces intensified their assault operations, making new progress in several different areas.\nIn the northeast, Russian forces continued to build on their success on the tactical heights east of the Kazenyi Torets River and began advancing downhill towards the river. They advanced along multiple treelines to the southeastern edge of Sofiivka and entered the outer houses of the village. Attacks were also carried out along treelines further north, and from the newly captured strongpoints in the forested gulley, with Russian soldiers reaching the road leading northeast from Sofiivka.\nTo the southwest, Russian forces continued to make progress in Shakhove, further expanding their zone of control in the main part of the village. Additionally, they consolidated in the trench fortifications to the north, encircling a small number of Ukrainian soldiers in the settlement. \nTo the west, Russian forces resumed assault operations west of Shakhove. They were able to recapture some positions in the forest plantations north and south of the Shakhove - Nove Shakhove Road.\nIn the southwest, after earlier infiltrations, the Russians recaptured the northern part of the forests west of Nykanorivka and re-entered southern Dorozhnje where they are once again fighting for the freight train station. \n+ ~8.93 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457002Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast. \nTaganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-26T21:27:07.457006Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance in and around Kostyantynivka and have made new progress in five different areas.\nIn the northeast, Russian forces consolidated in additional positions along Camarskandska Street in the Santurinivka District of Kostyantynivka and continued infiltrating into the area of the tram depot further north.\nTo the southwest, the Russians consolidated further in the Stare Selyshche District and reached Mayakovskoho Street. From there, they entered and captured the train depot, while assault groups secured the Michurin Dachas to the east. \nTo the south, following earlier Ukrainian infiltration attempts across the Kryvyi Torets River, Russian forces were able to push back and re-establish control over western Ivanopillya. They also recaptured the northern part of Pleshchiivka following additional earlier Ukrainian infiltration attempts. \nIn the southwest, Russian forces continued their assault operations towards the rear of the Kleban-Bykske Reservoir. They advanced north from the trench fortifications northeast of Yablunivka, along the H-20 highway, and captured new positions in the windbreaks and adjacent trenches. Attacks were then carried out on trench fortifications further north along the highway, however there is no confirmation of consolidation there yet.\n+ ~2.02 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457013Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast.   Taganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-26T21:27:07.457017Z"
    },
    {
      "original": "No missiles were detected flying towards Crimea/Kherson Oblast. Its possible that this was mixed up with launches of UAVs or something else.",
      "timestamp": "2025-11-26T21:27:07.457020Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka and on the southern flank of Siversk, Russian forces continued to slowly advance and have captured new positions on the tactical heights in two areas.\nIn the southwest, Russian forces entered the village of Maiske from their newly captured positions in the treelines to the south. After a few days of fighting, they were able to establish full control over the settlement and the surrounding positions. They also improved their positions in the forested areas south of Markove.\nIn the northeast, Russian forces continued their assault operations northeastern of Orikhovo-Vasylivka, but this time in a new area. They were able to capture new positions along two parallel treelines on the tactical heights and gained a foothold at the intersection of another two treelines to the east, expanding their presence northwest of Zaliznyanske. \n+ ~5.45 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457026Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued their assault operations in and around Siversk, and have made further progress towards capturing the remaining Ukrainian fortifications outside the city.\nIn the north, following earlier infiltrations from north of the reservoirs, Russian forces advanced west through the forests towards the northeastern outskirts of Siversk, and captured several trench fortifications there, from which assault groups are now infiltrating the city. Heavy fighting is currently ongoing for the low-rise residential areas and the northeastern high-rise buildings.\nIn the south, Russian forces were finally able to break through the strong Ukrainian defences on the tactical heights southeast of Siversk, capturing a series of strongpoints along three different treelines. Heavy fighting continues for the remaining fortifications in the operational encirclement area. \n+ ~2.93 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457032Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced, each attempting to capture various positions in different areas.\nIn the northwest, Russian forces continued their attempts at regaining full control over the village of Novoselivka. They were able to improve their positions further in the southern part of the village, and broke through Ukrainian positions in the southeastern streets, exiting the settlement and advancing further southwest through the forests towards Yarova.\nTo the east, Ukrainian forces entered and re-established control over the southernmost houses of Stavky. Fighting is now ongoing for areas closer towards the centre of the village. \nTo the south, Ukrainian forces continued to advance on the eastern approaches to Lyman, recapturing new positions in the forests there. Small groups of soldiers are attempting to advance further east through the forests, and northeast towards the southern part of the Masliakivka District of eastern Lyman but are constantly targeted by Russian FPV drones. Heavy fighting continues in this area.\nIn the southeast, Russian forces slightly improved their positions in the forests southwest of Yampil, continuing the assault on the Ukrainian strongpoints in the area of the Lyman - Siversk Highway.\n+ ~1.58 km² in favour of Ukraine.\n+ ~1.03 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457039Z"
    },
    {
      "original": "A large-scale Ukrainian drone attack is underway on Russia. \nOver 100 long-range UAVs and jet drones are flying to targets right now. The city of Taganrog, Rostov Oblast, is once again under attack, and several drones - including jet-powered ones - are flying in the direction of Moscow Oblast. \nAdditionally, drones are attacking Russian-controlled Donetsk Oblast, with one impact recorded so far, as seen in the attached video. Russian air defence is active in Donetsk City, Makiivka, and Luhansk Oblast.\nAll flights in and out of Kaluga City airport have been temporary suspended due to the threat of UAVs. Additional closures will likely take place later on in the night.",
      "timestamp": "2025-11-26T21:27:07.457045Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border. \nClarifying.",
      "timestamp": "2025-11-26T21:27:07.457049Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border.   Clarifying.",
      "timestamp": "2025-11-26T21:27:07.457052Z"
    },
    {
      "original": "Missile threat in place for Tula, Moscow, and Ryazan Oblasts.",
      "timestamp": "2025-11-26T21:27:07.457055Z"
    },
    {
      "original": "Another target was detected flying from Kaluga Oblast towards Moscow Oblast. \nUnclear if this is a jet-drone or a cruise missile.",
      "timestamp": "2025-11-26T21:27:07.457059Z"
    },
    {
      "original": "Both targets detected were jet-powered drones. There are no cruise missiles in Russian airspace.",
      "timestamp": "2025-11-26T21:27:07.457062Z"
    },
    {
      "original": "In the Kupyansk direction, over the past few weeks, Ukrainian forces have launched a series of counterattacks east of the Oskil River. \nFollowing a large Russian advance along the railway line to Pishchane and DRG infiltrations into Kurylivka, Ukrainian forces deployed reinforcements to begin pushing them back. They were able to clear Kurilivka of Russian DRGs and begin a push eastward down the railway line.\nThen, in coordination with assault groups pushing down the highway to the north, the limited Russian presence in Pishchane was eliminated, with Ukrainian forces retaking full control over the village. From there, they recaptured additional positions along the railway line further east, while other forces captured positions in the forest plantations east of the highway and infiltrated the treeline directly west of Stepova Novosilka. \n+ ~24.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-26T21:27:07.457072Z"
    },
    {
      "original": "⚡️\n🇮🇶\n☀️\n Additional footage of the alleged drone attack against the Khor Mor gas field in the Sulaymaniyah Governorate of the Kurdistan Region of Iraq.\nThe gas field is operated by the UAE-owned \"Dana Gas\" company and has a daily production capacity of 750 million cubic feet per day.\n@wfwitness",
      "timestamp": "2025-11-26T21:27:07.457081Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in the vicinity of Vovchansk, making significant progress on a wide front.\nFollowing the fall of Synelnykove and the Tsehelne Industrial Facilities, Russian forces began a series of attacks on the village of Lyman. They advanced south from Synelnykove, entering the northern part of the village where they consolidated. From there, they pushed towards the centre of the village, while other assault groups secured new positions in the surrounding forests. \nTo the east, Russian forces began a series of attacks on the town of Vilcha. They advanced east down the road from the Tsehelne Industrial Facilities, capturing new treeline positions, and entering the western streets of Vilcha. Other forces advanced east down a treeline to the north and are carrying out assault operations towards Vilcha from here too. \nAdditionally, Russian forces advanced from the industrial zone in southern Vovchansk to the nearby warehouse complex, establishing control over it and the adjacent windbreaks on either side of the railway tracks.\n+ ~4.70 km² in favour of Russia.",
      "timestamp": "2025-11-26T21:27:07.457088Z"
    },
    {
      "original": "🇮🇶\n🇮🇶\n💥\n❗️\n — All operations at the Khor Mor gas field have been suspended following the drone strike, which has been confirmed by the KRG Ministry of Natural Resources and Energy.\n@TabZLIVE",
      "timestamp": "2025-11-26T21:27:07.457097Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248260Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248281Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248291Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248299Z"
    },
    {
      "original": "Military Situation In Syria On November 26, 2025 (Map Update)",
      "timestamp": "2025-11-26T21:27:08.248303Z"
    },
    {
      "original": "Hungary Opposes Funding For Ukraine's \"Military Mafia\"\nHungarian Prime Minister Viktor Orbán gave a sharp response to European Commission President Ursula von der Leyen's request for additional funds for Ukraine, comparing the request to trying to help an alcoholic by sending them another crate of vodka.\nIn her letter, von der Leyen indicated that Ukraine is facing a serious funding shortfall and asked EU member states to increase their support. Orbán stated: \"Giving money to the Ukrainian mafia is like trying to cure an alcoholic by giving them a crate of vodka\", adding that the \"military mafia is siphoning off European taxpayers' money for God knows what\", and that instead of demanding audits and restricting payments, Brussels is proposing to send even more funds. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248312Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T21:27:08.248316Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T21:27:08.248320Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248329Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248337Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248345Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248354Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248364Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T21:27:08.248374Z"
    },
    {
      "original": "THE RACE FOR GULYAIPOLE: HOW UKRAINIAN RESERVE MOVEMENTS MAY DECIDE THE NEXT PHASE OF THE CONFLICT",
      "timestamp": "2025-11-26T21:27:08.248378Z"
    }
  ],
  "script_run_time": "2025-11-26T21:27:08.249233Z"
}