{
  "messages": [
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837531Z"
    },
    {
      "original": "⚠\nУвага!\n🚀\nРакетна небезпека по всій території України!\n🛫\nЗафіксовано зліт МіГ-31К!",
      "timestamp": "2025-07-24T15:48:05.837553Z"
    },
    {
      "original": "⚠\nУвага! \n🚀\nРакетна небезпека по всій території України! \n🛫\nЗафіксовано зліт МіГ-31К!",
      "timestamp": "2025-07-24T15:48:05.837562Z"
    },
    {
      "original": "📢\n Відбій загрози по областях.",
      "timestamp": "2025-07-24T15:48:05.837567Z"
    },
    {
      "original": "🛬\n Зберігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837575Z"
    },
    {
      "original": "🛸\n🛵\n Ворожі БпЛА на Сумщині в районі м.Суми, на півночі Харківщини (на східних околицях міста Харкова) та на південному заході від міста Дніпро. Залучено засоби для їх збиття.",
      "timestamp": "2025-07-24T15:48:05.837582Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину на північному сході.",
      "timestamp": "2025-07-24T15:48:05.837587Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину та Сумщину.",
      "timestamp": "2025-07-24T15:48:05.837593Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Нікопольський, Криворізький, Кам'янський, Дніпровський райони) - ракетна небезпека!",
      "timestamp": "2025-07-24T15:48:05.837602Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Нікопольський, Криворізький, Кам'янський, Дніпровський райони) - ракетна небезпека!",
      "timestamp": "2025-07-24T15:48:05.837611Z"
    },
    {
      "original": "📢\nВідбій загрози!",
      "timestamp": "2025-07-24T15:48:05.837616Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА на північному сході Полтавщини, курс -  південно-східний. Залучено засоби для його збиття.",
      "timestamp": "2025-07-24T15:48:05.837626Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-07-24T15:48:05.837631Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837637Z"
    },
    {
      "original": "Швидкісна ціль на Сумщині (н.п.Хотінь)! Курс - південно-західний!",
      "timestamp": "2025-07-24T15:48:05.837641Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА на північних околицях н.п.Шостка (Сумщина). Залучено засоби для збиття.",
      "timestamp": "2025-07-24T15:48:05.837691Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-07-24T15:48:05.837696Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.\n🛵\n🛸\n Триває загроза застосування ворожих БпЛА по окремим областях.",
      "timestamp": "2025-07-24T15:48:05.837703Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837711Z"
    },
    {
      "original": "🚀\n \n🚀\nДонецька та Дніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837717Z"
    },
    {
      "original": "🛸\n🛵\n У напрямку м.Харкова з півночі - ворожі БпЛА. Можлива робота ППО. Перебувайте у безпечних місцях.\n   Також ворожі БпЛА на північному сході Чернігівщини (між н.п.Холми і Корюківка), на межі Сумщини і Чернігівщини ( в напрямку м.Новгород-Сіверського) та на північному сході Полтавщини (в напрямку н.п.Комишня).",
      "timestamp": "2025-07-24T15:48:05.837723Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-24T15:48:05.837728Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на межі Донецької, Запорізької та Дніпропетровської областей.",
      "timestamp": "2025-07-24T15:48:05.837733Z"
    },
    {
      "original": "The Thai Royal Army has released a statement regarding the recent border clashes, condemning Cambodian rocket attacks on Thailand. They stated that 2 BM-21 rockets impacted a civilian area in the Kapchoong District, Surin Province, injuring 3 civilians. \nCambodian rockets also struck a gas station, resulting in a large fire breaking out.",
      "timestamp": "2025-07-24T15:48:06.669462Z"
    },
    {
      "original": "The Thai Royal Army has released a statement regarding the recent border clashes, condemning Cambodian rocket attacks on Thailand. They stated that 2 BM-21 rockets impacted a civilian area in the Kapchoong District, Surin Province, injuring 3 civilians. \nCambodian rockets also struck a gas station, resulting in a large fire breaking out.",
      "timestamp": "2025-07-24T15:48:06.669475Z"
    },
    {
      "original": "The IDF announced that a soldier from the 71st Armored Corps Battalion of the 188th Armored Brigade was \"severely injured\" during clashes in the Khan Younis area of southern Gaza. He was airlifted out of the Gaza Strip and is receiving medical treatment at a hospital.",
      "timestamp": "2025-07-24T15:48:06.669482Z"
    },
    {
      "original": "Strong explosions in Kherson City. 4 KAB glide-bombs just hit the Dniprovskyi District of the city.",
      "timestamp": "2025-07-24T15:48:06.669486Z"
    },
    {
      "original": "A short time ago, 2 Russian KAB glide-bombs impacted an open area next to a number of high-rise apartment buildings in Kharkiv City Centre. Fires are now burning, and the surrounding buildings have been damaged. At least three civilians are known to be injured.",
      "timestamp": "2025-07-24T15:48:06.669492Z"
    },
    {
      "original": "A short time ago, 2 Russian KAB glide-bombs impacted an open area next to a number of high-rise apartment buildings in Kharkiv City Centre. Fires are now burning, and the surrounding buildings have been damaged. At least three civilians are known to be injured.",
      "timestamp": "2025-07-24T15:48:06.669495Z"
    },
    {
      "original": "A short time ago, 2 Russian KAB glide-bombs impacted an open area next to a number of high-rise apartment buildings in Kharkiv City Centre. Fires are now burning, and the surrounding buildings have been damaged. At least three civilians are known to be injured.",
      "timestamp": "2025-07-24T15:48:06.669498Z"
    },
    {
      "original": "The footage I geolocated shows that the KAB glide-bombs did not hit an apartment building, nor an open area. Instead, they targeted a non-residential building within the boundaries of the larger \"Rohatynskyi\" residential development area. \nImpact coordinates: 49.999281, 36.217408.",
      "timestamp": "2025-07-24T15:48:06.669503Z"
    },
    {
      "original": "The Thai Royal Army has released a statement regarding the recent border clashes, condemning Cambodian rocket attacks on Thailand. They stated that 2 BM-21 rockets impacted a civilian area in the Kapchoong District, Surin Province, injuring 3 civilians.  …",
      "timestamp": "2025-07-24T15:48:06.669506Z"
    },
    {
      "original": "The Thai Military reports that the death toll from the Cambodian rocket strikes on the gas station in the Sisaket Province of Thailand has increased to 9, with 14 others being injured. 1 child is among the dead.",
      "timestamp": "2025-07-24T15:48:06.669510Z"
    },
    {
      "original": "Ukrainian UAVs attacked the city of Adler, Krasnodar Krai last night. \nVideo 1 shows an impact at the Lukoil oil depot.\nVideo 2 shows an impact at fuel infrastrcture for Sochi International Airport.",
      "timestamp": "2025-07-24T15:48:06.669515Z"
    },
    {
      "original": "Ukrainian UAVs attacked the city of Adler, Krasnodar Krai last night. \nVideo 1 shows an impact at the Lukoil oil depot.\nVideo 2 shows an impact at fuel infrastrcture for Sochi International Airport.",
      "timestamp": "2025-07-24T15:48:06.669519Z"
    },
    {
      "original": "A couple of hours ago, The Royal Thai Airforce F-16s carried out a series of airstrikes on the headquarters of Cambodia’s 8th and 9th Armies. The extent of damage is currently unknown.\nMeanwhile, fighting is still ongoing along the same section of the Cambodian-Thai border, with mutual artillery shelling and small-arms clashes continuing.",
      "timestamp": "2025-07-24T15:48:06.669524Z"
    },
    {
      "original": "The footage I geolocated shows that the KAB glide-bombs did not hit an apartment building, nor an open area. Instead, they targeted a non-residential building within the boundaries of the larger \"Rohatynskyi\" residential development area.   Impact coordinates:…",
      "timestamp": "2025-07-24T15:48:06.669527Z"
    },
    {
      "original": "Clearer footage showing the second KAB hitting that building.",
      "timestamp": "2025-07-24T15:48:06.669530Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Kindrativka, Khotin direction, Sumy Oblast.\nPre-war population: ~862.\nTotal land area: ~3.95km².",
      "timestamp": "2025-07-24T15:48:06.669534Z"
    },
    {
      "original": "A massive explosion has occurred in the town of Al-Fu'ah, Idlib Governorate, northwestern Syria. Reports suggest that it is from an ammunition depot.",
      "timestamp": "2025-07-24T15:48:06.669538Z"
    },
    {
      "original": "A massive explosion has occurred in the town of Al-Fu'ah, Idlib Governorate, northwestern Syria. Reports suggest that it is from an ammunition depot.",
      "timestamp": "2025-07-24T15:48:06.669543Z"
    },
    {
      "original": "Update on the Thai-Cambodian conflict. \nThe Thai military has launched what they call \"Operation Yuttha Bodin\", aimed at combatting Cambodian forces in response to their \"military actions\".\nUnder heavy artillery cover, Thai forces launched an incursion across the international border with Cambodia, capturing the Preah Vihear Temple and the border crossing point on Highway 62. It's unclear if Thai forces were able to enter the heavily fortified Cambodian trench line defending the temple's eastern flank. Cambodia is now shelling these occupied positions with artillery. \nThai reinforcements are reportedly moving towards the border along highway 4120 (around 33km east of this initial incursion), with Cambodian sources reporting that their artillery shelling in the region targeted them. \nMass evacuations of civilians in border provinces in both Cambodia and Thailand are underway. Additionally, a new Thai airstrike was carried out by an F-16 on Cambodian positions south of the Ta Muen Thom Temple, near the international border.\\",
      "timestamp": "2025-07-24T15:48:06.669549Z"
    },
    {
      "original": "Updated list of countries/states that twitter users are automatically top experts on:\nUkraine\nRussia\nIsrael\nGaza\nSudan\nLebanon\nIran\nYemen \nArmenia\nAzerbaijan \nSouth Korea\nIndia\nPakistan\nVenezuela \nSyria\nThailand\nCambodia",
      "timestamp": "2025-07-24T15:48:06.669561Z"
    },
    {
      "original": "Exhibit 1:",
      "timestamp": "2025-07-24T15:48:06.669564Z"
    },
    {
      "original": "War Monitor Says Over 1,300 Were Killed In Al-Suwayda Battle (18+ Videos)\nThe death toll from the battle in the southern Syrian governorate of al-Suwayda has exceeded 1,000, the Syrian Observatory for Human Rights (SOHR) reported on July 23.\nThe SOHR, which is based in London, said that the battle has so far claimed the lives of 1,339 people, including 196 Druze civilians who were executed by government forces.\nThe real death toll is expected to be much higher. Government and tribal forces were blamed for a wide range of war crimes against the Druze, from setting buildings on fire, to looting, abductions and summary executions. Videos of these crimes continue to surface online.\nRead more: \nHERE",
      "timestamp": "2025-07-24T15:48:07.491434Z"
    },
    {
      "original": "War Monitor Says Over 1,300 Were Killed In Al-Suwayda Battle (18+ Videos)\nThe death toll from the battle in the southern Syrian governorate of al-Suwayda has exceeded 1,000, the Syrian Observatory for Human Rights (SOHR) reported on July 23.\nThe SOHR, which is based in London, said that the battle has so far claimed the lives of 1,339 people, including 196 Druze civilians who were executed by government forces.\nThe real death toll is expected to be much higher. Government and tribal forces were blamed for a wide range of war crimes against the Druze, from setting buildings on fire, to looting, abductions and summary executions. Videos of these crimes continue to surface online.\nRead more: \nHERE",
      "timestamp": "2025-07-24T15:48:07.491452Z"
    },
    {
      "original": "ZELENSKY'S FINAL ACT: WAR IN UKRAINE BEGAN WITH MAIDAN, IT ENDS WITH MAIDAN",
      "timestamp": "2025-07-24T15:48:07.491456Z"
    },
    {
      "original": "◾\nA video became again relevant after Ukrainian recruitment officers beat to death 45-year-old József Sebesztén, an ethnic Hungarian from Beregove.\nIn 2023 Yevhen Karas the leader of Ukraine's Neo-Nazi terrorist organisation C14 (Combat 18 in Europe) spoke on how Nazis terrorised the ethnic Hungarian region of Transcarpathia:\n- there was a “Train of Friendship”, gathered nationalists, soccer ultras, we all went there. And we fucked up everyone then.\n◾\nFor years Ukrainian Nazis carried a terror campaign to \"ethnic cleansing\" the region of Hungarians. Now are the Ukrainian recruitment officers the ones continuing the job under Zelenskiy orders sending Hungarians to the meat grinders.\n◾\nFollow:\nhttps://t.me/European_dissident",
      "timestamp": "2025-07-24T15:48:07.491467Z"
    },
    {
      "original": "Russia’s Penicillin Acoustic-Thermal Recon System Is Performing Well Against Kiev Forces\nThe Penicillin acoustic-thermal artillery reconnaissance system has enabled Russian troops in the special military operation zone to strike back in seconds, a Rostec source told TASS on July 21.\n\"The Penicillin thermal sound reconnaissance complex, developed by our Rosel holding company, helps Russian fighters effectively conduct counter-battery warfare in their combat zone. With its help, military personnel identify enemy firing positions in seconds and give their artillery target indications for return fire. As a result, the barrel of the enemy cannon does not have time to cool down after firing, while a response is already coming from our side,\" the source said.\nThe Penicillin was developed to detect and locate artillery, mortars, multiple rocket launchers, anti-aircraft or tactical-missile firing positions with seismic and acoustic sensors.\nRead more: \nHERE",
      "timestamp": "2025-07-24T15:48:07.491476Z"
    },
    {
      "original": "Overview Of Military Situation in Ukraine, July 23, 2025\nIn the Sumy direction,\n Russian troops continue active offensive operations. Units of the Northern group of forces captured the settlement of Varachino, advanced in Yunakovka, and are engaged in intense combat clashes near Kondrativka, utilizing aviation and FPV drones. Russian units are expected to reach the H07 highway leading to the city of Sumy soon.\nIn Kharkiv direction\n, the RAF conducted a series of strikes on the cities of Kharkiv, Izyum, Derhachi, and Kupiansk, including with drones and missiles, primarily targeting Kharkiv’s Industrial District. AFU positions and infrastructure were hit. Near Vovchansk, Ukrainian counterattack attempts proved unsuccessful.\nIn the Kostiantynivka direction\n, north of Myrnograd, Russian forces have established control over Fedorivka, and have also advanced towards Nykanorivka and in the southwestern sector of Poltavka.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491488Z"
    },
    {
      "original": "Overview Of Military Situation in Ukraine, July 23, 2025\nIn the Sumy direction,\n Russian troops continue active offensive operations. Units of the Northern group of forces captured the settlement of Varachino, advanced in Yunakovka, and are engaged in intense combat clashes near Kondrativka, utilizing aviation and FPV drones. Russian units are expected to reach the H07 highway leading to the city of Sumy soon.\nIn Kharkiv direction\n, the RAF conducted a series of strikes on the cities of Kharkiv, Izyum, Derhachi, and Kupiansk, including with drones and missiles, primarily targeting Kharkiv’s Industrial District. AFU positions and infrastructure were hit. Near Vovchansk, Ukrainian counterattack attempts proved unsuccessful.\nIn the Kostiantynivka direction\n, north of Myrnograd, Russian forces have established control over Fedorivka, and have also advanced towards Nykanorivka and in the southwestern sector of Poltavka.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491500Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 23, 2025\nOn July 23, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-24T15:48:07.491506Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 23, 2025\nOn July 23, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-24T15:48:07.491516Z"
    },
    {
      "original": "Western Media Admits Humanitarian Catastrophe In Ukraine\nWestern media is finally admitting that Ukraine is lying about its official casualty figures. A recent article published by Le Monde revealed that there is ample evidence that military casualties in Ukraine are much higher than official figures indicate, given the growing demand for cemetery space for new burials.\nAccording to Le Monde, all cemetery areas in Ukraine reserved for soldiers are already fully occupied. The overload is forcing authorities to use common cemetery space, which is normally reserved for civilians, as well as to establish various projects to expand current cemeteries and create new ones. The demand for burial space is enormous as more and more dead bodies arrive from the front lines.\n“Across the country, teams of architects have been working on memorials that reflect not only the scale of the ongoing carnage but also the evolving ideas about national identity,” the article reads.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491526Z"
    },
    {
      "original": "Thai Jets Bomb Cambodia After Deadly Rocket Attack Amid Worries Of All-Out War \nThai fighter jets attacked targets in Cambodia in response to a deadly rocket attack on July 24, in what could be the opening of an all-out war between the two neighboring countries.\nTensions between Thailand and Cambodia have been mounting for months. In May, a Cambodian soldier was killed during a brief clash between Thai and Cambodian troops in a contested border area of the Emerald Triangle, where Cambodia, Thailand, and Laos meet.\nBoth sides said that they were acting in self-defense at the time. Despite calls for escalations, the border saw a military build up on both sides.\nThailand took control of border checkpoints, imposed restrictions on crossings and threatened to cut electricity and internet to Cambodia’s border towns. In response, Cambodia stopped imports of Thai fruit and vegetables and banned Thai movies and TV dramas.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491537Z"
    },
    {
      "original": "Thai Jets Bomb Cambodia After Deadly Rocket Attack Amid Worries Of All-Out War \nThai fighter jets attacked targets in Cambodia in response to a deadly rocket attack on July 24, in what could be the opening of an all-out war between the two neighboring countries.\nTensions between Thailand and Cambodia have been mounting for months. In May, a Cambodian soldier was killed during a brief clash between Thai and Cambodian troops in a contested border area of the Emerald Triangle, where Cambodia, Thailand, and Laos meet.\nBoth sides said that they were acting in self-defense at the time. Despite calls for escalations, the border saw a military build up on both sides.\nThailand took control of border checkpoints, imposed restrictions on crossings and threatened to cut electricity and internet to Cambodia’s border towns. In response, Cambodia stopped imports of Thai fruit and vegetables and banned Thai movies and TV dramas.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491547Z"
    },
    {
      "original": "Russian Engineers Unveil Unique Optionally-Manned Ground Vehicle \nRussian engineers from the city of Omsk unveiled on July 22 a unique military tracked vehicle that can be operated by a driver, or remotely as a ground drone.\nThe vehicle, which was developed in cooperation with the Kulibin Club of the People’s Front, was presented with the Omich ground robotic complex.\nDubbed \n“Omich\n,” the vehicle was especially developed to carry out logistic missions in high-risk hard-terrain areas within the special military operation zone in Ukraine, like evacuating wounded troops and delivering all sorts of supplies, including weapons and ammunition.\nThe most unique feature of the Omich is that it can be driven like an all terrain vehicle, or operated from a remote location like a ground drone.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491559Z"
    },
    {
      "original": "Someone Is Systematically Targeting Syria’s New Army \nA massive blast rocked the outskirts of the town of Ma’arrat Misrin in the northern countryside of Idlib in northern Syria on July 24, wounding or killing more than 100 people.\nSyrian authorities remained silent on the causes of the blast, but the Syrian Observatory for Human Rights said that the explosion emitted from an ammunition depot of the Turkistan Islamic Party, a formation mainly made up of Chinese Uyghurs which dissolved itself and joined the ranks of the new Syrian military after the fall of the Assad regime.\nThe London-based monitoring group said that 12 people were killed and 107 others were wounded by the blast. However, the Syrian Health Ministry said that just six were killed and over 140 others were injured.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491568Z"
    },
    {
      "original": "Someone Is Systematically Targeting Syria’s New Army \nA massive blast rocked the outskirts of the town of Ma’arrat Misrin in the northern countryside of Idlib in northern Syria on July 24, wounding or killing more than 100 people.\nSyrian authorities remained silent on the causes of the blast, but the Syrian Observatory for Human Rights said that the explosion emitted from an ammunition depot of the Turkistan Islamic Party, a formation mainly made up of Chinese Uyghurs which dissolved itself and joined the ranks of the new Syrian military after the fall of the Assad regime.\nThe London-based monitoring group said that 12 people were killed and 107 others were wounded by the blast. However, the Syrian Health Ministry said that just six were killed and over 140 others were injured.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-24T15:48:07.491578Z"
    }
  ],
  "script_run_time": "2025-07-24T15:48:07.492472Z"
}