{
  "messages": [
    {
      "original": "🛵\n Група БпЛА з півдня \n➡️\n на Білгород-Дністровський!",
      "timestamp": "2025-12-22T10:41:47.324857Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу!",
      "timestamp": "2025-12-22T10:41:47.324875Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-12-22T10:41:47.324883Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-12-22T10:41:47.324890Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-22T10:41:47.324895Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини, рухається уздовж кордону з Білоруссю \n➡️\n курсом на Любеч, Славутич.",
      "timestamp": "2025-12-22T10:41:47.324901Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на захід.",
      "timestamp": "2025-12-22T10:41:47.324908Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Запорізької області, рухається уздовж лінії бойового зіткнення \n➡️\n курсом на Нікополь.",
      "timestamp": "2025-12-22T10:41:47.324915Z"
    },
    {
      "original": "🛵\n Група БпЛА з Чорного моря \n➡️\n на Одещину.",
      "timestamp": "2025-12-22T10:41:47.324921Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини, рухається уздовж кордону з Білоруссю \n➡️\n курсом на Любеч, Славутич.",
      "timestamp": "2025-12-22T10:41:47.324928Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини \n➡️\n курсом на Київщину.",
      "timestamp": "2025-12-22T10:41:47.324934Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Київщини \n➡️\n рухається у напрямку Іванкова.\n🛵\n Група БпЛА з Чорного моря \n➡️\n на південь Одещини, курсом на Тузли.",
      "timestamp": "2025-12-22T10:41:47.324944Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Київщини \n➡️\n курсом на захід.\n🛵\n БпЛА на сході Житомирщини \n➡️\n курсом на південний захід.\n🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-12-22T10:41:47.324956Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n курсом на Одещину.",
      "timestamp": "2025-12-22T10:41:47.324963Z"
    },
    {
      "original": "🛵\n Кілька БпЛА з Чорного моря \n➡️\n курсом на Одесу, Затоку.",
      "timestamp": "2025-12-22T10:41:47.324969Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n на Одещину.",
      "timestamp": "2025-12-22T10:41:47.324976Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Одещини \n➡️\n у напрямку Арциза.",
      "timestamp": "2025-12-22T10:41:47.324985Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 58 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 22 грудня (з 19:00 21 грудня) противник атакував 86 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Міллєрово, Приморсько-Ахтарськ – рф., ТОТ Донеччини, Чауда – ТОТ АР Крим, понад 50 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 58 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 26 ударних БпЛА на 12 локаціях, а також падіння збитих (уламки) на одній локації.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-22T10:41:47.325004Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Чернігів.",
      "timestamp": "2025-12-22T10:41:47.325010Z"
    },
    {
      "original": "🛵\nВорожі БпЛА на північному сході Київщини, курсом на Житомирщину;\n🛵\n Ворожий БпЛА в р-ні. Ромни (Сумщина) вектор руху південь Чернігівщини.",
      "timestamp": "2025-12-22T10:41:47.325016Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в акваторії Чорного моря у напрямку Південного.",
      "timestamp": "2025-12-22T10:41:47.325021Z"
    },
    {
      "original": "🚀\n Пуски КАБ в напрямку Одещину.",
      "timestamp": "2025-12-22T10:41:47.325025Z"
    },
    {
      "original": "Here’s some positive news for once!\nI recently got two new chickens for my flock - their names are Olivia and Lucy. They’re only 13 weeks old, but are growing fast. \nI’m currently trying to get them super tame and friendly like the rest of my chickens.",
      "timestamp": "2025-12-22T10:41:47.925003Z"
    },
    {
      "original": "Here’s some positive news for once!\nI recently got two new chickens for my flock - their names are Olivia and Lucy. They’re only 13 weeks old, but are growing fast. \nI’m currently trying to get them super tame and friendly like the rest of my chickens.",
      "timestamp": "2025-12-22T10:41:47.925017Z"
    },
    {
      "original": "In the Kupyansk direction, over the last week Ukrainian forces continued to advance and have cleared additional parts of western Kupyansk.  In the north, following the withdrawal of most Russian soldiers from northwestern Kupyansk, Ukrainian forces managed…",
      "timestamp": "2025-12-22T10:41:47.925021Z"
    },
    {
      "original": "(Part 1)\nI'd like to make this post to clear some things up about the Ukrainian counterattacks in Kupyansk, my coverage of the events, and what this means for the war.\nFirstly, let's look at the tactical side of things, and how people have reacted to it:\nThese Ukrainian counterattacks did not start when Deepstate posted their famous map update showing most of Kupyansk and the surrounding villages in blue, and multiple pockets of surrounded Russians. The counterattacks started back in early October, and I have been covering their progression since October 15 - nearly two months longer than Deepstate - and longer than almost anyone else on any platform. \nThis was not a surprise operation, but a prolonged, complex, and multi-stage operation that has taken place across multiple months. When I first started posting about Ukrainian gains in very important areas here - namely the advances north of the city towards Russian logistical routes - I was called out by countless Pro-Russian users for spreading \"Ukrainian propaganda\" and \"only mapping off geolocations and Ukrainian sources\". But... when well-known Russian sources and mappers began replicating my map changes in the following weeks, it was *largely* accepted as fact.\nRemember, before Deepstate's announcement of the Ukrainian progress of Kupyansk on December 12, and Zelensky's propaganda video at the Kupyansk steel on the city's outskirts on the same day, there was significant consensus among most of the community who follows this war that there was either no Ukrainian counterattacks, or that they were limited and mostly unsuccessful. \nNow, while I was covering the situation since October 15, I specifically began raising alarm bells for the Russian garrison in the western suburbs of the city on December 2, nearly 3 weeks ago. There, I stated \"The situation could soon reach a critical point for Russian formations in the western part of the city.\" I was specifically referring to the Ukrainian attempts to cut off the Russian logistical routes in the north, and to encircle Russian groupings in the southwest. And, surely enough, other mappers replicated these changes afterwards. \nWhat we've been experiencing recently is an almost identical phenomenon to what is seen constantly in the Pro-Ukrainian community, where Russian advances are denied for weeks, only for them to be accepted with a delay and the usual BS of \"This place served its purpose as Russia suffered tens of thousands of casualties in trying to take it\". We've all seen this narrative on tactically/strategically important places repeat itself over and over again, without fail. \nThe difference with Kupyansk that Russia is almost always on the front-foot and constantly maintains the initiative across nearly the entire frontline. When Pro-Russians are met with a sudden change in the tactical situation in such a critical sector, many end up replicating the age-old tactic employed by Pro-Ukrainians of delaying, delaying, delaying, and then shifting the goalposts once it becomes clear to everyone.\nI expect that Ukraine will indeed secure the entirety of western Kupyansk, so it will be interesting to see how long it will take for many Pro-Russians who have denied this for so long to catch up. \nNow, for the informational side of things:\nThe Kupyansk operation has had massive media and propaganda successes for Ukraine, due to the nature of how this war is covered by mainstream media. Zelensky's video on the outskirts of Kupyansk immediately went viral, with all mainstream media outlets instantly picking it up and spinning their usual narratives about the war and attempting to use it to suggest that it's a turning point for Ukraine or that it reflects a \"dire situation\" for Russia's \"4-year 'special military operation'\". It re-ignited the usual talk that we constantly see of \"Zelensky is brave enough to visit his freedom fighters right on the frontline, while Putin remains in his nuclear bunker, too paranoid and scared to go anywhere, while his commanders send his troops into meat-wave attacks\".",
      "timestamp": "2025-12-22T10:41:47.925034Z"
    },
    {
      "original": "In the Kupyansk direction, over the last week Ukrainian forces continued to advance and have cleared additional parts of western Kupyansk.  In the north, following the withdrawal of most Russian soldiers from northwestern Kupyansk, Ukrainian forces managed…",
      "timestamp": "2025-12-22T10:41:47.925038Z"
    },
    {
      "original": "(Part 2)\nNow of course, the Zelensky video at Kupyansk was \"debunked\" (I use quotations because the debunking is not completely definitive)... but how many of the hundreds of millions of ordinary people who don't actively follow this war will see that? It had the desired effect - even thought we might know what actually happened - and kept the general public thinking how they want them to.  \nBut, while this has been a big informational success, and a decent tactical success overall for Ukraine, the trajectory of the attrition dealt by Russia continues largely unimpeded. \nRussia is still winning, and other crucial sectors are still falling apart. The so-called \"Pro-Ukrainians\" continue to betray the country and people that they claim to support so strongly by ignoring the critical situations in Myrnohrad, Hulyaipole and Siversk. \nThe war, overall, remains unchanged, and continues to progress towards its obvious conclusion. Only then will the pro-Ukrainian goalposts shift so far away from their original place that the narrative as we know it collapses.",
      "timestamp": "2025-12-22T10:41:47.925044Z"
    },
    {
      "original": "The Ukrainian GUR published footage showing one of their operatives setting fire to a Russian Su-30 and Su-27 fighter at Lipetsk-2 Airbase, Lipetsk Oblast.",
      "timestamp": "2025-12-22T10:41:47.925048Z"
    },
    {
      "original": "Russian forces have captured the town of Vilcha, Bilyi Kolodyaz direction, Kharkiv Oblast.\nPre-war population: ~1,639.\nTotal land area: ~3.20 km².\nThe fighting for Vilcha lasted approximately 27 days.",
      "timestamp": "2025-12-22T10:41:47.925053Z"
    },
    {
      "original": "You know the information space is bad when someone calls me \"biased\" or \"unreliable\" and I have to check their profile to see if they're calling me too Pro-Russian or too Pro-Ukrainian \n🤣\n🤣",
      "timestamp": "2025-12-22T10:41:47.925059Z"
    },
    {
      "original": "A car bombing in Moscow has killed Major General Fanil Sarvarov, the head of the operational training department of the Russian General Staff.",
      "timestamp": "2025-12-22T10:41:47.925062Z"
    },
    {
      "original": "Large fires are burning in Russia’s Taman Bay on the Black Sea following an overnight Ukrainian drone attack. 2 vessels were struck, and damage to a pier has been reported",
      "timestamp": "2025-12-22T10:41:47.925077Z"
    },
    {
      "original": "Large fires are burning in Russia’s Taman Bay on the Black Sea following an overnight Ukrainian drone attack. 2 vessels were struck, and damage to a pier has been reported",
      "timestamp": "2025-12-22T10:41:47.925080Z"
    },
    {
      "original": "Ukrzaliznytsia reports that a freight train derailed near the city of Korosten, Zhytomyr Oblast.\nThey stated that the cause is \"unknown\", however it is known that it was struck by multiple Russian Geran-2 drones overnight.",
      "timestamp": "2025-12-22T10:41:47.925085Z"
    },
    {
      "original": "2 Russian Su-34s are flying to their launch lines in the Black Sea to launch glide-bombs at Odesa Oblast.",
      "timestamp": "2025-12-22T10:41:47.925088Z"
    },
    {
      "original": "2 Russian Su-34s are flying to their launch lines in the Black Sea to launch glide-bombs at Odesa Oblast.",
      "timestamp": "2025-12-22T10:41:47.925095Z"
    },
    {
      "original": "Currently over Crimea, flying west. \nGerans are also over the western Black Sea, flying to Odesa Oblast",
      "timestamp": "2025-12-22T10:41:47.925101Z"
    },
    {
      "original": "Currently over Crimea, flying west.   Gerans are also over the western Black Sea, flying to Odesa Oblast",
      "timestamp": "2025-12-22T10:41:47.925104Z"
    },
    {
      "original": "Both Su-34s are now over the Black Sea. 2 Su-35s are covering them.",
      "timestamp": "2025-12-22T10:41:47.925107Z"
    },
    {
      "original": "A Russian recon drone is operating just off the coast from Zatoka, Odesa Oblast. The glide-bombs will likely fly there.",
      "timestamp": "2025-12-22T10:41:47.925110Z"
    },
    {
      "original": "Su-34s are around 100 km from their launch lines",
      "timestamp": "2025-12-22T10:41:47.925113Z"
    },
    {
      "original": "Su-34s are around 100 km from their launch lines",
      "timestamp": "2025-12-22T10:41:47.925117Z"
    },
    {
      "original": "Approaching their launch lines",
      "timestamp": "2025-12-22T10:41:47.925120Z"
    },
    {
      "original": "Approaching their launch lines",
      "timestamp": "2025-12-22T10:41:47.925123Z"
    },
    {
      "original": "Launch maneuvers",
      "timestamp": "2025-12-22T10:41:47.925126Z"
    },
    {
      "original": "Launch maneuvers",
      "timestamp": "2025-12-22T10:41:47.925129Z"
    },
    {
      "original": "KABs are flying towards Zatoka, Odesa Oblast.",
      "timestamp": "2025-12-22T10:41:47.925132Z"
    },
    {
      "original": "KABs are flying towards Zatoka, Odesa Oblast.",
      "timestamp": "2025-12-22T10:41:47.925135Z"
    },
    {
      "original": "2 KABs in total, both flying towards Zatoka Bridge.",
      "timestamp": "2025-12-22T10:41:47.925138Z"
    },
    {
      "original": "These are Grom-E1 rocket-powered glide-bombs. They changed their course towards Chornomorsk, Odesa Oblast.",
      "timestamp": "2025-12-22T10:41:47.925141Z"
    },
    {
      "original": "Internal Fracture: How Desertion Is Weakening The Ukrainian Army\nIn December 2025, Ukraine's Prosecutor General's Office ceased publishing official statistics on desertion and unauthorized abandonment of a military unit (AWOL), citing national security interests. This move became a stark indicator of the systemic crisis engulfing the Armed Forces of Ukraine (AFU), where the number of servicemen leaving service has for several months exceeded the number of arriving mobilized personnel. \nMore than 300,000 cases of unauthorized abandonment and desertion have been recorded since 2022. However, according to estimates by several Ukrainian MPs and experts, the real picture is much bleaker. Verkhovna Rada MP Anna Skorokhod, for example, claimed that by the end of summer 2025, the real number of deserters had approached 400,000, meaning it could exceed half a million by the end of the year.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524320Z"
    },
    {
      "original": "Military Situation In Syria On December 21, 2025 (Map Update)",
      "timestamp": "2025-12-22T10:41:48.524333Z"
    },
    {
      "original": "Strikes On Odesa Bridges: Russia Cuts Ukraine Off From 60% Of Imported Fuel (Videos)\nOn the night of December 21, according to the Ukrainian Air Force, Russian troops launched 97 attack drones over Ukrainian territory, 75 of which were shot down or suppressed. \nThe primary targets of the Russian strikes were bridges and pontoon crossings in the Odesa region leading to Danube ports such as Izmail and Reni. These ports are a critically important economic artery for the country: Ukraine imports about 60% of all fuel through them. The bridges near the settlements of Zatoka and Mayaki serve as the main land gateways for these cargoes, including military supplies. Their destruction creates a threat of fuel shortages for the Armed Forces of Ukraine, agriculture, and the entire economy, raising prices and paralyzing logistics chains.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524342Z"
    },
    {
      "original": "Strikes On Odesa Bridges: Russia Cuts Ukraine Off From 60% Of Imported Fuel (Videos)\nOn the night of December 21, according to the Ukrainian Air Force, Russian troops launched 97 attack drones over Ukrainian territory, 75 of which were shot down or suppressed. \nThe primary targets of the Russian strikes were bridges and pontoon crossings in the Odesa region leading to Danube ports such as Izmail and Reni. These ports are a critically important economic artery for the country: Ukraine imports about 60% of all fuel through them. The bridges near the settlements of Zatoka and Mayaki serve as the main land gateways for these cargoes, including military supplies. Their destruction creates a threat of fuel shortages for the Armed Forces of Ukraine, agriculture, and the entire economy, raising prices and paralyzing logistics chains.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524351Z"
    },
    {
      "original": "Military Situation In Ukraine On December 21, 2025 (Maps Update)",
      "timestamp": "2025-12-22T10:41:48.524355Z"
    },
    {
      "original": "Military Situation In Ukraine On December 21, 2025 (Maps Update)",
      "timestamp": "2025-12-22T10:41:48.524359Z"
    },
    {
      "original": "Foreign Fighters Face \"Meat Grinder\": The Future Fate of International Legion in Ukraine\nReforms in the Ukrainian army are not good news for foreign mercenaries. There will be almost no room left for them in the comfortable rear. The soldiers of fortune are extremely skeptical of the new commander, as evidenced by their unwillingness to serve under him.\nSince the pace of mobilization cannot meet the Ukrainian army’s current needs, command is beginning to take radical steps. Specifically, they are drawing on all available resources from the rear and sending them to the assault troops. Foreign mercenaries who came to earn easy money have now fallen victim to this fate.\nThere are four foreign legions operating within the Ukrainian army. Three are combat units and one is a training unit that replenishes frontline units after a short training period. The term \"legion\" is used exclusively for propaganda purposes to create the impression that the unit is larger than it actually is. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524369Z"
    },
    {
      "original": "Foreign Fighters Face \"Meat Grinder\": The Future Fate of International Legion in Ukraine\nReforms in the Ukrainian army are not good news for foreign mercenaries. There will be almost no room left for them in the comfortable rear. The soldiers of fortune are extremely skeptical of the new commander, as evidenced by their unwillingness to serve under him.\nSince the pace of mobilization cannot meet the Ukrainian army’s current needs, command is beginning to take radical steps. Specifically, they are drawing on all available resources from the rear and sending them to the assault troops. Foreign mercenaries who came to earn easy money have now fallen victim to this fate.\nThere are four foreign legions operating within the Ukrainian army. Three are combat units and one is a training unit that replenishes frontline units after a short training period. The term \"legion\" is used exclusively for propaganda purposes to create the impression that the unit is larger than it actually is. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524378Z"
    },
    {
      "original": "How Fog Became An Ally For The Russian Army In The Sumy Sector: The Capture Of Hrabovske In Ukraine \nRussian forces are intensifying pressure across the entire front: in the Sumy sector, assault troops, exploiting thick fog, have captured Hrabovske and are pushing toward Riasne; in the Pokrovsk sector, they are clearing Myrnohrad; while in the Kharkiv and Zaporizhzhia sectors, they are methodically driving back Ukrainian units, seizing strongpoints and tree lines. \nThis tactical pressure is mirrored by deep cracks in the EU's united front: due to resistance from a number of countries, the bloc is forced to finance Kyiv through a complex loan scheme, effectively acknowledging the impossibility of directly using frozen Russian assets.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524387Z"
    },
    {
      "original": "How Fog Became An Ally For The Russian Army In The Sumy Sector: The Capture Of Hrabovske In Ukraine \nRussian forces are intensifying pressure across the entire front: in the Sumy sector, assault troops, exploiting thick fog, have captured Hrabovske and are pushing toward Riasne; in the Pokrovsk sector, they are clearing Myrnohrad; while in the Kharkiv and Zaporizhzhia sectors, they are methodically driving back Ukrainian units, seizing strongpoints and tree lines. \nThis tactical pressure is mirrored by deep cracks in the EU's united front: due to resistance from a number of countries, the bloc is forced to finance Kyiv through a complex loan scheme, effectively acknowledging the impossibility of directly using frozen Russian assets.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524395Z"
    },
    {
      "original": "Israel Fakes Panic Over Iranian Missiles To Push U.S. Towards Another War With Islamic Republic\nIn an unsurprising development, Israel is planning a new war on Iran, and actively working on securing support from the United States for this by using the Islamic Republic’s missile program as a pretext.\nThis was first revealed by NBC News which reported on December 20 that Prime Minister Benjamin Netanyahu will present plans for a possible fresh attack on Iran to President Donald Trump during his upcoming visit to the U.S. The meeting is expected to take place in the Mar-a-Lago resort in Florida at the end of the month.\nAccording to the report, Israel is growing increasingly concerned that Iran is rebuilding and even expanding its ballistic missile production in the wake of the nations’ 12-day war in June.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-22T10:41:48.524404Z"
    }
  ],
  "script_run_time": "2025-12-22T10:41:48.525290Z"
}