{
  "messages": [
    {
      "original": "🛵\n Київщина: БпЛА на сході області в напрямку н.п.Березань з північного сходу;\n🛵\n Харківщина: група БпЛА повз Балаклію, Андріївку, Савинці, Барвінкове, Лозову в західному та південно-західному напрямках (Полтавщина та Дніпропетровщина);\n🛵\n Полтавщина: групи БпЛА на/повз н.п.Оржиця на півдні, курс - північно-західний (Черкащина);\n🛵\n Херсонщина: група БпЛА на півночі області повз Архангельське курсом на Миколаївщину;\n🛵\n Сумщина: групи БпЛА в напрямку на/повз н.п.Недригайлів та Дубов'язівка;\n🛵\n БпЛА на півдні Кіровоградщини курсом на Миколаївщину.",
      "timestamp": "2026-01-08T23:16:23.554244Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку на/повз Бориспіль зі сходу.",
      "timestamp": "2026-01-08T23:16:23.554264Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-08T23:16:23.554273Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-08T23:16:23.554278Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку на/повз Бориспіль зі сходу.",
      "timestamp": "2026-01-08T23:16:23.554283Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Київ зі сходу.",
      "timestamp": "2026-01-08T23:16:23.554287Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Полтави з південного сходу.",
      "timestamp": "2026-01-08T23:16:23.554296Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА з півночі Херсонщини через північний схід Миколаївщини курсом на Кіровоградщину.",
      "timestamp": "2026-01-08T23:16:23.554300Z"
    },
    {
      "original": "Ціль на Харків з півночі.",
      "timestamp": "2026-01-08T23:16:23.554304Z"
    },
    {
      "original": "🛵\n Групи БпЛА з Черкащини та Чернігівщини в напрямку Київщини.",
      "timestamp": "2026-01-08T23:16:23.554308Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА повз Буринь, Терни, Дубов'язівку в західному напрямку;\n🛵\n Чернігівщина: БпЛА повз Короп, Борзну, Ічню, Бобровицю в напрямку Київщини;\n🛵\n Київщина: БпЛА в напрямку на/повз Бровари, Березань, Вишгород, Велику Димерку в західному напрямку, Кагарлик - в північному;\n🛵\n Харківщина: БпЛА повз Балаклію, Барвінкове в західному напрямку;\n🛵\n Полтавщина: БпЛА на півдні області в північно-західному напрямку.",
      "timestamp": "2026-01-08T23:16:23.554319Z"
    },
    {
      "original": "🛵\n Черкащина: БпЛА в напрямку на/повз Драбів, Канів в північно-західному напрямку;\n🛵\n Кіровоградщина: \n- БпЛА на/повз Рівне, Компанівку, Велику Виску, курс - північний/північно-західний;\n- БпЛА на/повз Бобринець, курс - західний.",
      "timestamp": "2026-01-08T23:16:23.554329Z"
    },
    {
      "original": "📢\n Загрози застосування балістичного озброєння.",
      "timestamp": "2026-01-08T23:16:23.554334Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва!",
      "timestamp": "2026-01-08T23:16:23.554338Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Наразі, основна хвиля атак ворожих ударних безпілотників спрямована на Київщину та столицю!",
      "timestamp": "2026-01-08T23:16:23.554344Z"
    },
    {
      "original": "📢\n Відбій загрози застосування дальнього балістичного озброєння.",
      "timestamp": "2026-01-08T23:16:23.554348Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n🛵\n Зберігається загроза застосування ворогом ударних БпЛА в областях, а саме: Київська та місто Київ, Чернігівська, Сумська, Полтавська, Черкаська, Харківська, Кіровоградська, Запорізька, Дніпропетровська, Донецька.",
      "timestamp": "2026-01-08T23:16:23.554354Z"
    },
    {
      "original": "08.01.2026 близько 23.30 було оголошено ракетну небезпеку по всій території України, через загрозу застосування противником балістичних ракет із полігону \"Капустин Яр\". \nЗафіксовано вибухи у Львівській області. Інформація уточнюється.",
      "timestamp": "2026-01-08T23:16:23.554359Z"
    },
    {
      "original": "🛵\n Київщина: \n- декілька груп БпЛА в напрямку столиці зі сходу, південного сходу та півдня,\n- групи БпЛА в напрямку на/повз Білу Церкву з південного сходу;\n🛵\n Чернігівщина: БпЛА повз Прилуки, Ічню, Бобровицю курсом на Київщину;\n🛵\n Сумщина: БпЛА повз Буринь і Терни в західному напрямку;\n🛵\n Кіровоградщина: \n- БпЛА повз Звенигородку на заході північним курсом (вектор - Київщина м.Біла Церква),\n- БпЛА в напрямку на/повз Шполу з півдня.\n🛵\n Черкащина: БпЛА повз Золотоношу, Канів курсом на Київщину;\n🛵\n Полтавщина: БпЛА повз Кременчук, Глобине на заході, Оржиця на сході північно-західним курсом;\n🛵\n Дніпропетровщина: БпЛА на північному сході області, курс - північно-західний.",
      "timestamp": "2026-01-08T23:16:23.554373Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на Сумщині курсом на Чернігівщину (вектор - Короп, Батурин).",
      "timestamp": "2026-01-08T23:16:23.554379Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку на/повз Полтаву з південного сходу.",
      "timestamp": "2026-01-08T23:16:23.554386Z"
    },
    {
      "original": "Fighting has resumed in the al Ashrafiya and Sheikh Maqsoud neighbourhoods of northern Aleppo as STG government forces are expected to launch a full-scale operation to capture the SDF-held enclave.  This comes as last-minute U.S. backed peace talks failed…",
      "timestamp": "2026-01-08T23:16:24.165395Z"
    },
    {
      "original": "It appears that the STG government offensive on the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods of northern Aleppo will begin in the coming hours. \nSustained shelling is currently underway, and the Turkish MOD has released a statement pledging to support the STG with the necessary support if requested.",
      "timestamp": "2026-01-08T23:16:24.165410Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance and have made new progress in four different areas.\nIn the northeast, Russian forces resumed assault operations in the area of Novomarkove. They managed to capture the treeline positions west of the village and the rest of the windbreaks on either side of the Siverskyi Donets Canal to the north. Other forces levelled the frontline in the treelines to the south and began pushing further west in the direction of Markove.\nTo the southwest, Russian forces continued advancing in the direction of Fedorivka, where they managed to consolidate in new positions in the forested parts of the gulley. They also improved their positions in the treeline to the west.\nTo the south, at some point recently, Russian forces consolidated in the southeastern part of Virolyubivka, on the southern bank of the tributary of the Bilenka River. Ukrainian forces subsequently carried out several counterattacks to dislodge these Russian soldiers, but they were ultimately repelled.\nTo the southeast, Russian forces continued incrementally advancing west of Chasiv Yar. They improved their positions along the railway windbreaks and breached Ukrainian fortifications in the treelines northwest of Mykolaivka, reaching the northwestern edge of the village. Other assault groups continued expanding their zone of control to the northwest, where they managed to capture new positions in two different treelines. \n+ ~5.68 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T23:16:24.165418Z"
    },
    {
      "original": "Here's a very interesting and useful tool which allows you to compare maps from different sources (me, Suriyak, Deepstate, and others).\nIt also has the timeline feature, similar to that of Deepstate's, allowing you to view changes over time. \nLink: \nhttps://UkraineViews.org",
      "timestamp": "2026-01-08T23:16:24.165424Z"
    },
    {
      "original": "This is the TG channel of the multi mapping tool I've shown a few times on my channel \nUkraineViews is a tool to navigate maps of the war in Ukraine across time and sources.\nhttps://UkraineViews.org\nhttps://t.me/UkraineViews",
      "timestamp": "2026-01-08T23:16:24.165429Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance and have captured the last 2023-era fortifications northwest of Bakhmut. \nIn the southwest, Russian forces advanced on a wide front from the Zaliznyanske area, capturing new positions in four different treelines, including in the last 2023 strongpoints, and the rest of the forest south of Bondarne.\nIn the northeast, Russian forces continued advancing through Bondarne and captured central part of the village. Fighting continues for its western houses. \n+ ~4.58 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T23:16:24.165436Z"
    },
    {
      "original": "It appears that the STG government offensive on the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods of northern Aleppo will begin in the coming hours.   Sustained shelling is currently underway, and the Turkish MOD has released a statement pledging to…",
      "timestamp": "2026-01-08T23:16:24.165440Z"
    },
    {
      "original": "The STG has announced a curfew for the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo, urging civilians to stay away from SDF positions as they begin their offensive.",
      "timestamp": "2026-01-08T23:16:24.165443Z"
    },
    {
      "original": "A failed rocket launch was carried out from Gaza City, which crashed approximately 140 metres away, near a hospital. An Israeli airstrike was reportedly carried out on the launch site afterwards.",
      "timestamp": "2026-01-08T23:16:24.165449Z"
    },
    {
      "original": "A failed rocket launch was carried out from Gaza City, which crashed approximately 140 metres away, near a hospital. An Israeli airstrike was reportedly carried out on the launch site afterwards.",
      "timestamp": "2026-01-08T23:16:24.165453Z"
    },
    {
      "original": "The STG has issued evacuation orders for civilians in 5 parts of northern Aleppo, ahead of their ground offensive.",
      "timestamp": "2026-01-08T23:16:24.165456Z"
    },
    {
      "original": "There are Russian soldiers in Podoly, and they are not DRGs. Apparently, troops were landed there, in the trench systems. I still don't know how they got there, but judging by the direction the vehicle was traveling, it had to cover a long distance, which seems to indicate that the Ukrainian presence in a large area is highly debatable and that Ukrainian drones are what is really preventing Russian consolidation.\nIn any case, Kupiansk remains a very strange front, with quite contradictory news reports.",
      "timestamp": "2026-01-08T23:16:24.165460Z"
    },
    {
      "original": "There are Russian soldiers in Podoly, and they are not DRGs. Apparently, troops were landed there, in the trench systems. I still don't know how they got there, but judging by the direction the vehicle was traveling, it had to cover a long distance, which…",
      "timestamp": "2026-01-08T23:16:24.165463Z"
    },
    {
      "original": "This area in blue is known to have a very low presence of Ukrainian soldiers, so it's definitely possible that Russian forces infiltrated through there.",
      "timestamp": "2026-01-08T23:16:24.165475Z"
    },
    {
      "original": "The STG has issued evacuation orders for civilians in 5 parts of northern Aleppo, ahead of their ground offensive.",
      "timestamp": "2026-01-08T23:16:24.165479Z"
    },
    {
      "original": "Under heavy artillery cover, STG government forces have launched their full-scale ground offensive against the SDF-held Kurdish-majority Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo.\nThe two main epicentres of fighting right now are in the Resafa District and the Syriac Quarter. STG forces attempted to attack the Syriac Quarter from at least two directions, after it was shelled with mortars. One of these attacks has been repelled by the SDF, with the STG suffering casualties. \nThey are also attacking towards the centre of the Resafa District, where heavy fighting is ongoing. \nAdditional evacuation orders have been issued for 3 more areas, bringing the total number of evacuation orders to 8.",
      "timestamp": "2026-01-08T23:16:24.165486Z"
    },
    {
      "original": "Scenes from northern Aleppo, where the shelling and battles have significant intensified.",
      "timestamp": "2026-01-08T23:16:24.165489Z"
    },
    {
      "original": "Scenes from northern Aleppo, where the shelling and battles have significant intensified.",
      "timestamp": "2026-01-08T23:16:24.165503Z"
    },
    {
      "original": "The STG is carrying out artillery strikes on SDF snipers at the entrance to the Sheikh Masoud Neighbourhood as cover for advancing ground units.",
      "timestamp": "2026-01-08T23:16:24.165508Z"
    },
    {
      "original": "One Russian \"Varshavyanka\" submarine has been deployed to the waters of the Black Sea from Novorossiysk Naval Base, Krasnodar Krai. \nTotal possible salvo: 6 Kalibr cruise missiles.",
      "timestamp": "2026-01-08T23:16:24.165512Z"
    },
    {
      "original": "A short time ago, a Russian Oreshnik IRBM impacted the Stryi underground gas storage facility in Lviv Oblast. Strong explosions were heard.",
      "timestamp": "2026-01-08T23:16:24.165515Z"
    },
    {
      "original": "Security camera footage of the Oreshnik strike on Lviv Oblast.",
      "timestamp": "2026-01-08T23:16:24.165517Z"
    },
    {
      "original": "Clearer footage of the Oreshnik strike.\nReportedly, this was not the Stryi underground gas facility. I'm working to confirm this now.",
      "timestamp": "2026-01-08T23:16:24.165522Z"
    },
    {
      "original": "Additionally, at least 100 Geran-2 drones are flying in the direction of Kyiv. There is a high likelihood of additional missiles being used (not Oreshnik or Kh-101).",
      "timestamp": "2026-01-08T23:16:24.165525Z"
    },
    {
      "original": "Ukraine Lost Another Key Settlement In Zaporozhye (Videos)\nOn January 8, the Russian military resumed advance along the Haichur River in Zaporozhye, capturing a key settlement from Kiev forces.\nBratskoye, located on the right bank of the Haichur far to the north from the city of Huliapole, was captured by the 36th Guards Separate Motorised Rifle Brigade of the 29th Army of the Vostok [East] Group of Forces, according to the Russian Ministry of Defense.\nAway from Haichur, to the west in Zaporozhye, the Vostok Group of Forces continue to make gains in the Stepnohirsk direction.\nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757280Z"
    },
    {
      "original": "Ukraine Lost Another Key Settlement In Zaporozhye (Videos)\nOn January 8, the Russian military resumed advance along the Haichur River in Zaporozhye, capturing a key settlement from Kiev forces.\nBratskoye, located on the right bank of the Haichur far to the north from the city of Huliapole, was captured by the 36th Guards Separate Motorised Rifle Brigade of the 29th Army of the Vostok [East] Group of Forces, according to the Russian Ministry of Defense.\nAway from Haichur, to the west in Zaporozhye, the Vostok Group of Forces continue to make gains in the Stepnohirsk direction.\nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757297Z"
    },
    {
      "original": "Military Situation In Ukraine On January 8, 2026 (Maps Update)",
      "timestamp": "2026-01-08T23:16:24.757301Z"
    },
    {
      "original": "Military Situation In Ukraine On January 8, 2026 (Maps Update)",
      "timestamp": "2026-01-08T23:16:24.757305Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: Tanker Ablaze Off Turkey, Dnipro Blackout, Russia Plans 'Oreshnik' Strike\nOn the night of January 8, Ukrainian air forces recorded 97 drones launched from Russian territory, of which 70 were shot down or suppressed. Russian air defense destroyed 66 Ukrainian drones, with the majority over Crimea, the Azov Sea, and the Black Sea. As a result of these strikes, Ukraine's energy infrastructure was damaged, including blackouts in key regions, while the Russian side did not report significant destruction.\nSimultaneously, it was reported that on January 7, off the coast of Turkey, approximately 50 kilometers from Kastamonu province, a drone attacked the oil tanker Elbus, sailing under the flag of Palau. According to Turkish media, including Ortadoğu Gazetesi and NTV, the strike hit the upper part of the vessel, causing a fire. The crew was unharmed, and the tanker was towed to the port of İnebolu for inspection.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757314Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: Tanker Ablaze Off Turkey, Dnipro Blackout, Russia Plans 'Oreshnik' Strike\nOn the night of January 8, Ukrainian air forces recorded 97 drones launched from Russian territory, of which 70 were shot down or suppressed. Russian air defense destroyed 66 Ukrainian drones, with the majority over Crimea, the Azov Sea, and the Black Sea. As a result of these strikes, Ukraine's energy infrastructure was damaged, including blackouts in key regions, while the Russian side did not report significant destruction.\nSimultaneously, it was reported that on January 7, off the coast of Turkey, approximately 50 kilometers from Kastamonu province, a drone attacked the oil tanker Elbus, sailing under the flag of Palau. According to Turkish media, including Ortadoğu Gazetesi and NTV, the strike hit the upper part of the vessel, causing a fire. The crew was unharmed, and the tanker was towed to the port of İnebolu for inspection.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757322Z"
    },
    {
      "original": "Major Battle Begins In Syria’s Aleppo As Thousands Of Troops Storm Kurdish Neighborhoods (Videos)\nThe forces of Syria’s Islamist-led Interim Government launched a large offensive to capture the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh in Aleppo from Kurdish fighters affiliated with the Syrian Democratic Forces (SDF) late on January 8, just a day after the clashes broke out in the northern city.\nEarly on in the day, government forces issued a number of evacuation orders covering large parts of the two neighborhoods.\nThe warnings, coupled with intense shelling and an earlier order declaring Sheikh Maqsoud and Ashrafieh a closed military zone, caused a mass exclusion from the neighborhoods, with state media reporting the displacement of more than 165,000 people.\nAs the offensive began in the evening, videos emerged online showing dozens of troops, reportedly from the 60th, 72th and 98th divisions, pouring into Sheikh Maqsoud and Ashrafieh in armored personnel carriers and tanks.\nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757331Z"
    },
    {
      "original": "Major Battle Begins In Syria’s Aleppo As Thousands Of Troops Storm Kurdish Neighborhoods (Videos)\nThe forces of Syria’s Islamist-led Interim Government launched a large offensive to capture the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh in Aleppo from Kurdish fighters affiliated with the Syrian Democratic Forces (SDF) late on January 8, just a day after the clashes broke out in the northern city.\nEarly on in the day, government forces issued a number of evacuation orders covering large parts of the two neighborhoods.\nThe warnings, coupled with intense shelling and an earlier order declaring Sheikh Maqsoud and Ashrafieh a closed military zone, caused a mass exclusion from the neighborhoods, with state media reporting the displacement of more than 165,000 people.\nAs the offensive began in the evening, videos emerged online showing dozens of troops, reportedly from the 60th, 72th and 98th divisions, pouring into Sheikh Maqsoud and Ashrafieh in armored personnel carriers and tanks.\nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757339Z"
    },
    {
      "original": "SYRIA'S DIRTY DEAL WITH ISRAEL",
      "timestamp": "2026-01-08T23:16:24.757342Z"
    },
    {
      "original": "Pokrovsk Sector: Russian Army Clears Udachny And Repels Ukrainian Counterattacks \nIn the Zaporizhzhia sector, where drones are being used extensively, heavy fighting continues for control of the northern part of the Prymorske settlement. Meanwhile, Russian units have crossed the Haichur River and established control over the Bratske settlement.\nIn the Kharkiv sector, the Russian \"North\" grouping advanced up to 750 meters on several sections near the Staritsa settlement and consolidated their position in a section of forest southeast of Liman.\nIn the Krasnyi Liman sector, Russian assault groups advanced on the eastern approaches to Svyatohirsk and captured the Novoselivka railway station. \nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757350Z"
    },
    {
      "original": "Pokrovsk Sector: Russian Army Clears Udachny And Repels Ukrainian Counterattacks \nIn the Zaporizhzhia sector, where drones are being used extensively, heavy fighting continues for control of the northern part of the Prymorske settlement. Meanwhile, Russian units have crossed the Haichur River and established control over the Bratske settlement.\nIn the Kharkiv sector, the Russian \"North\" grouping advanced up to 750 meters on several sections near the Staritsa settlement and consolidated their position in a section of forest southeast of Liman.\nIn the Krasnyi Liman sector, Russian assault groups advanced on the eastern approaches to Svyatohirsk and captured the Novoselivka railway station. \nRead more \nHERE",
      "timestamp": "2026-01-08T23:16:24.757357Z"
    }
  ],
  "script_run_time": "2026-01-08T23:16:24.758053Z"
}