{
  "messages": [
    {
      "original": "Ракета на Кременчук.",
      "timestamp": "2025-08-13T10:13:32.987354Z"
    },
    {
      "original": "Кременчук перебувайте в укриттях.",
      "timestamp": "2025-08-13T10:13:32.987368Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-08-13T10:13:32.987375Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-08-13T10:13:32.987381Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-13T10:13:32.987389Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину",
      "timestamp": "2025-08-13T10:13:32.987393Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-13T10:13:32.987401Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину та Запоріжжя.",
      "timestamp": "2025-08-13T10:13:32.987405Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 32 ВОРОЖІ БПЛА ТА 2 РАКЕТИ\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 13 серпня (із 21.00 12 серпня)  противник атакував 49-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Приморсько-Ахтарськ, Шаталово – рф., а також 2-ма балістичними ракетами Іскандер-М/KN-23 із Курської обл., рф.\nУдарними БпЛА атаковано Донеччину, Сумщину та Чернігівщину, ракетами – Полтавщину.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.00, протиповітряною обороною збито/подавлено 34 цілі: 2 балістичні ракети Іскандер-М/KN-23 та 32 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання 17 БпЛА на 15 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-13T10:13:32.987424Z"
    },
    {
      "original": "🛸\n В районі Чернігова - ворожий розвідувальний БпЛА! Можлива робота ППО. Даний безпілотник є потенційним навідником ворожих засобів ураження.",
      "timestamp": "2025-08-13T10:13:32.987428Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з Курська.",
      "timestamp": "2025-08-13T10:13:32.987434Z"
    },
    {
      "original": "🚀\n \n🚀\nКуп'янський та Ізюмський райони - загроза застосування авіаційних засобів ураження!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-13T10:13:32.987441Z"
    },
    {
      "original": "🚀\n \n🚀\nСумський та Конотопський  райони - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-13T10:13:32.987447Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-13T10:13:32.987451Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-13T10:13:32.987456Z"
    },
    {
      "original": "⚠️\n⚠️\nСпостерігається активність  розвідувальних БпЛА в Чернігівській, Харківській та Херсонській областях, залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження. Не ігноруйте сигнали повітряної тривоги!",
      "timestamp": "2025-08-13T10:13:32.987461Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-13T10:13:32.987465Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА в районі Сум! Залучено засоби для його збиття.",
      "timestamp": "2025-08-13T10:13:32.987469Z"
    },
    {
      "original": "🛸\n В Чернігівському районі  - ворожий розвідувальний БпЛА! Залучено засоби для його збиття. Даний безпілотник є потенційним навідником ворожих засобів ураження.\n⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку та Синельниківський район Дніпропетровщини! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-13T10:13:32.987478Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на межі Донеччини та Запоріжжя в напрямку півдня Дніпропетровщини!",
      "timestamp": "2025-08-13T10:13:32.987482Z"
    },
    {
      "original": "In the Bilozerske direction, Russian forces continued to exploit their breakthrough and advanced even deeper through Ukrainian lines, physically cutting the Dobropillya - Kramatorsk Highway.   After securing a deep wedge between Dobropillya and Shakhove, Russian…",
      "timestamp": "2025-08-13T10:13:33.757400Z"
    },
    {
      "original": "I have overlayed \n@Playfra0's\n fortification map with my control map. With this, you can see that not only has the Dobropillya - Kramatorsk Highway been cut, but the Russians have also breached and captured a section of the \"New Donbas Line\", which is Ukraine's final line of defence in Donetsk Oblast.\nThis line was designed to protect Kharkiv and Dnipropetrovsk Oblasts, and was actually built behind Kramatorsk and Slovyansk. It's safe to say that the Ukrainian command did not expect the front to move like this.",
      "timestamp": "2025-08-13T10:13:33.757414Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-13T10:13:33.757418Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-13T10:13:33.757422Z"
    },
    {
      "original": "This is his \"trap\" then vs now.",
      "timestamp": "2025-08-13T10:13:33.757425Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-13T10:13:33.757428Z"
    },
    {
      "original": "Oh damn, this is the one year anniversary of the \"Its a trap\" tweet.",
      "timestamp": "2025-08-13T10:13:33.757431Z"
    },
    {
      "original": "Where are all the linear/constant warfare mathematicians today?",
      "timestamp": "2025-08-13T10:13:33.757434Z"
    },
    {
      "original": "Ukrainian artillery shelling is targeting eastern Rodynske, confirming the Russian entry into the city. \nGeolocation\n: 48.353474, 37.212539",
      "timestamp": "2025-08-13T10:13:33.757439Z"
    },
    {
      "original": "Russian forces have captured the village of Leontovychi,  Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~698.\nTotal land area: ~2.10km².",
      "timestamp": "2025-08-13T10:13:33.757444Z"
    },
    {
      "original": "Russian forces have captured the village of Novoekonomichne, Northeastern flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~2,763.\nTotal land area: ~5.24km² .",
      "timestamp": "2025-08-13T10:13:33.757452Z"
    },
    {
      "original": "Russian forces have captured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.52km².",
      "timestamp": "2025-08-13T10:13:33.757457Z"
    },
    {
      "original": "Russian forces have captured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-13T10:13:33.757461Z"
    },
    {
      "original": "Russian forces have captured the village of Nove Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~191.\nTotal land area: ~0.53km².",
      "timestamp": "2025-08-13T10:13:33.757465Z"
    },
    {
      "original": "Russian forces have captured the village of Zolotyi Kolodyaz, Bilozerske Direction, Donetsk Oblast.\nPre-war population: ~910.\nTotal land area: ~2.50km².",
      "timestamp": "2025-08-13T10:13:33.757469Z"
    },
    {
      "original": "In the Bilozerske direction, Russian forces continued to exploit their breakthrough and advanced even deeper through Ukrainian lines, physically cutting the Dobropillya - Kramatorsk Highway.   After securing a deep wedge between Dobropillya and Shakhove, Russian…",
      "timestamp": "2025-08-13T10:13:33.757473Z"
    },
    {
      "original": "The disaster for Ukraine in Pokrovsk-Bilozerske continues to unfold. \nHere's what we know has happened:\nA new breakthrough was achieved towards Hryshyne from the east following weeks of DRG activities. The full extent of this breakthrough remains unknown, but DRGs are operating on the outskirts of both Hryshyne and Novooleksandrivka. This makes the second to last road out of Pokrovsk-Myrnohrad unusable.\nDorozhnje and the freight train station of the same name have been occupied after over a week of battles, along with Ivanivka and Nove Shakhove to the north. \nDRGs continue to operate in and around Novyi Donbas  and on the approaches to Dobropillya. No new DRG activity within Dobropillya's city limits has been recorded over the past 12 hours. \nThe 12th \"Azov\" Brigade of the National Guard of Ukraine was deployed to Rubizhne (circled in green), which has prevented it's capture. Nevertheless, Zolotyi  Kolodyaz - the focus of the initial media frenzy - has come under Russian control. DRGs continue to operate on the approaches to Hruzke. \nRussian forces captured the Krasnolymanskaya Mine and the adjacent terykon. They also secured part of eastern Rodynske and made additional progress in Chervonyi Lyman. \nNovoekonomichne has come under Russian control, and progress was made northwest of Hrodivka and west of Myrolyubivka. \nThe rest of Lysivka has moved into the grey zone, with unconfirmed reports of its capture. Suhkyi Yar and the guitar-shaped fortification continue to hold.\nRussian forces continue to push north through western Pokrovsk and completed the capture of Leontovychi.\nPositions were improved in northern Kotlyne and east of the village.\nSouthern Udachne and the town's train station was captured by Russian forces. Most of the rest of the town is a kill-zone or in the grey zone. \nThe remaining Ukrainian soldiers in Pokrovsk, Myrnohrad, and the surrounding villages are about to be encircled if nothing is done very soon. Only one road remains even slightly safe for a withdrawal to take place. \nI will make a full and more accurate map update tomorrow, but I thought I should share these developments sooner rather than later.",
      "timestamp": "2025-08-13T10:13:33.757485Z"
    },
    {
      "original": "The 12th \"Azov\" Brigade (1st corps) of the National Guard of Ukraine (NGU) has been redeployed to the Novyi Donbas-Stepy-Rubizhne line in an attempt to contain the chaotic situation east of Dobropillya.",
      "timestamp": "2025-08-13T10:13:33.757490Z"
    },
    {
      "original": "Russian forces have captured the village of Vilne, Dobropillya direction, Donetsk Oblast. \nPre-war population: ~71.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-13T10:13:33.757495Z"
    },
    {
      "original": "Keep in mind, most of the updates from the Pokrovsk-Dobropillya-Bilozerske area are days behind. The true situation will be much worse than is shown, especially considering almost all of this is being done in media silence.",
      "timestamp": "2025-08-13T10:13:33.757498Z"
    },
    {
      "original": "Russian forces have recaptured the village of Torske, Lyman direction, Donetsk Oblast.\nPre-war population: ~1,650\nTotal land area; ~8.31km²",
      "timestamp": "2025-08-13T10:13:33.757502Z"
    },
    {
      "original": "Russian forces have captured the village of Zelenyi Hai, Borova direction, Kharkiv Oblast.\nPre-war population: ~40.\nTotal land area: ~0.57km².",
      "timestamp": "2025-08-13T10:13:33.757506Z"
    },
    {
      "original": "This is his \"trap\" then vs now.",
      "timestamp": "2025-08-13T10:13:33.757509Z"
    },
    {
      "original": "I think David has a humiliation fetish...",
      "timestamp": "2025-08-13T10:13:33.757512Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces continued to exploit their breakthrough east of Dobropillya, and made significant progress to the rear of Pokrovsk. \nRussian forces advanced in two areas. Most of the progress was made in the south, where after consolidating control over their positions on the railway line, they began pushing west to the Pokrovsk - Dobropillya Highway. DRGs has already been operating here, and by this time were 8km to the west on the outskirts of Novooleksandrivka and Hryshyne. \nRussian forces continued to advance west, moving across the tactical heights, and seizing positions in the treelines northwest of Rodynske. Keep in mind, the true scale of this advance may be further than is shown. \nTo the south, around a week ago Russian forces established full control over the Krasnolymanskaya Mine and its terykon, giving them far more surveillance over Rodynske and the surrounding areas. From there, they were able to advance west, past the smaller terykon, and entered eastern Rodynske. Positions were taken up in both high-rise buildings and in the private sector. Additional progress was also made in Chervonyi Lyman, with Russian forces approaching southeastern Rodynske from the east. Most of the village is now under Russian control.\nIn the north, Russian forces managed to enter the Ukrainian strongpoints at Dorozhnje, and by utilising the newly recapturing positions in the forests to the east, managed to capture the village and its freight train station. They were also able to capture Ivanivka, and complete the capture of Nove Shakhove. \n+ ~27.33km² in favour of Russia.",
      "timestamp": "2025-08-13T10:13:33.757519Z"
    }
  ],
  "script_run_time": "2025-08-13T10:13:34.393206Z"
}