{
  "messages": [
    {
      "original": "🛵\n БпЛА на півдні Харківщини \n➡️\n курсом на Лозову.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Павлоград.",
      "timestamp": "2025-11-11T11:10:40.229267Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-11T11:10:40.229287Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T11:10:40.229292Z"
    },
    {
      "original": "🛵\n БпЛА на Одещину з акваторії Чорного моря.",
      "timestamp": "2025-11-11T11:10:40.229296Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T11:10:40.229300Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині рухається уздовж узбережжя Чорного моря \n➡️\n курсом на Чорноморськ!",
      "timestamp": "2025-11-11T11:10:40.229306Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину, південь Харківщини !",
      "timestamp": "2025-11-11T11:10:40.229311Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря \n➡️\n курсом на Одесу!",
      "timestamp": "2025-11-11T11:10:40.229316Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T11:10:40.229321Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Харківщини \n➡️\n курсом на Лозову.",
      "timestamp": "2025-11-11T11:10:40.229327Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину, південь Харківщини!",
      "timestamp": "2025-11-11T11:10:40.229331Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з південного сходу!",
      "timestamp": "2025-11-11T11:10:40.229337Z"
    },
    {
      "original": "🛵\n БпЛА з Курської обл., рф \n➡️\n курсом на Суми.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Павлоград.",
      "timestamp": "2025-11-11T11:10:40.229345Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-11T11:10:40.229352Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та схід Дніпропетровщини!",
      "timestamp": "2025-11-11T11:10:40.229356Z"
    },
    {
      "original": "🚀\nКАБи на південний схід Дніпропетровщини, північний схід Запорізької області!",
      "timestamp": "2025-11-11T11:10:40.229362Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з південного сходу!",
      "timestamp": "2025-11-11T11:10:40.229367Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-11T11:10:40.229371Z"
    },
    {
      "original": "🚀\nКАБи на північний схід Запорізької області!",
      "timestamp": "2025-11-11T11:10:40.229376Z"
    },
    {
      "original": "🛵\n БпЛА з Бєлгородської обл., рф \n➡️\n на південь Сумщини, північ Харківщини.",
      "timestamp": "2025-11-11T11:10:40.229382Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T11:10:40.229386Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇬🇧\n🇷🇴\n🇺🇸\n🇷🇺\nThe FSB report that they foiled a an alleged Ukrainian intelligence plot to hijack a Russian MiG-31 armed with a Kinzhal and launch it at NATO’s largest airbase in Constanţa, Romania, in order to provoke NATO. \nthe operation was prepared by Ukraine’s Main Directorate of Intelligence under the supervision of British intelligence and that Russian pilots were offered $3 million to carry out the hijacking. \n@wfwitness",
      "timestamp": "2025-11-11T11:10:41.008035Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇬🇧\n🇷🇴\n🇺🇸\n🇷🇺\nThe FSB report that they foiled a an alleged Ukrainian intelligence plot to hijack a Russian MiG-31 armed with a Kinzhal and launch it at NATO’s largest airbase in Constanţa, Romania, in order to provoke NATO.   the operation was prepared by Ukraine’s…",
      "timestamp": "2025-11-11T11:10:41.008059Z"
    },
    {
      "original": "Top 10 things that didn't happen:",
      "timestamp": "2025-11-11T11:10:41.008063Z"
    },
    {
      "original": "Yesterday evening, approximately 7 Russian Geran-2 drones attacked a target in the city of Bohodukhiv, Kharkiv Oblast. The drones were equipped with incendiary warheads, which are not often used by Russia.",
      "timestamp": "2025-11-11T11:10:41.008067Z"
    },
    {
      "original": "Yesterday evening, approximately 7 Russian Geran-2 drones attacked a target in the city of Bohodukhiv, Kharkiv Oblast. The drones were equipped with incendiary warheads, which are not often used by Russia.",
      "timestamp": "2025-11-11T11:10:41.008073Z"
    },
    {
      "original": "Overnight, Russia once again attacked the city of Kramatorsk, Donetsk Oblast, with Geran-2 drones. \nApproximately 7 drones attacked an unknown target within the city limits. No other details are known at this moment.",
      "timestamp": "2025-11-11T11:10:41.008077Z"
    },
    {
      "original": "Overnight, Russia once again attacked the city of Kramatorsk, Donetsk Oblast, with Geran-2 drones. \nApproximately 7 drones attacked an unknown target within the city limits. No other details are known at this moment.",
      "timestamp": "2025-11-11T11:10:41.008081Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saratov Oil Refinery. Two impacts were recorded, resulting in a large fire breaking out. \nCoordinates: 51.456652, 45.936631",
      "timestamp": "2025-11-11T11:10:41.008085Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saratov Oil Refinery. Two impacts were recorded, resulting in a large fire breaking out. \nCoordinates: 51.456652, 45.936631",
      "timestamp": "2025-11-11T11:10:41.008089Z"
    },
    {
      "original": "Before and after of a treeline near Vuhledar, Donetsk Oblast.",
      "timestamp": "2025-11-11T11:10:41.008092Z"
    },
    {
      "original": "As everyone focuses on the final battles taking place for Pokrovsk, think I should highlight the sheer intensity of battles ongoing in Rodynske right now, just north of Pokrovsk.  Ukrainian forces who infiltrated the city around six days ago have entrenched…",
      "timestamp": "2025-11-11T11:10:41.008095Z"
    },
    {
      "original": "The fighting in Rodynske right now is so heavy that even with the thick fog and clouds covering the Donbas, combat related fires can still be seen on NASA's satellites. Combat fires often don't show up even when its sunny.\nFor reference, the only other heat signature seen in Ukraine right now is heat coming from a large factory in Ivano-Frankivsk, western Ukraine.",
      "timestamp": "2025-11-11T11:10:41.008099Z"
    },
    {
      "original": "Only a couple of streets of Pokrovsk remain until the city is captured by Russia.",
      "timestamp": "2025-11-11T11:10:41.008102Z"
    },
    {
      "original": "In the Stepnohirsk direction, over the past week Russian forces have intensified their assault operations, recapturing key positions.\nRussian forces continued to advance north through the village of Prymorske, recapturing the rest of the southern dachas and entering the main southern residential area. Forward assault groups reached and crossed the first gulley where fighting is now ongoing.\nTo the southeast, Russian forces advanced east towards the Kollektivnyye, Elektrovoznik-2, and Ogorody Dachas, capturing positions along the northern bank of the dried-up Zaliv Inlet. They were also able to capture the Stepnohirsk overpass, south of the Sukhaya River, and positions in the surrounding forested areas.\n+ ~2.99 km² in favour of Russia.",
      "timestamp": "2025-11-11T11:10:41.008108Z"
    },
    {
      "original": "Russian artillery shelling has resulted in power outages in large parts of Kherson City. The trolleybus lines have been halted, and disruptions in water supply are reported.",
      "timestamp": "2025-11-11T11:10:41.008111Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-11T11:10:41.008114Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-11T11:10:41.008118Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-11T11:10:41.008122Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-11T11:10:41.008125Z"
    },
    {
      "original": "Probably Russian S-300/400 air defence activity",
      "timestamp": "2025-11-11T11:10:41.008130Z"
    },
    {
      "original": "In the Hulyaipole direction, the situation continues to deteriorate for Ukraine, as Russian forces continue to rapidly advance.\nIn the south, Russian forces continued to advance west of Poltavka and began bypassing Vesele from the north, capturing new treeline positions on the tactical heights. Further north, after entering Novouspenivske from the south, the Russians established full control over the village and its surrounding positions. Simultaneously, the Russians consolidated to the north in Nove and quickly captured the rest of the village. Before this, any remaining Ukrainian soldiers withdrew from the areas east of Nove and Novouspenivske to avoid being encircled.\nAs these two villages were being captured, Russian DRGs began infiltrated to the villages of Rivnopillya and Yablukove, engaging in clashes with Ukrainian units sent to the area to clear them out. Assault groups, taking advantage of the complicated situation for Ukraine, then broke through Ukrainian positions west of Nove by advancing southwest down the road for over 5.6 km, capturing positions in numerous different treelines. Some forces were able to enter and entrench in eastern Yablukove, while others advanced to the west towards Rivnopillya, capturing the eastern street of the settlement. \nFurther north, taking advantage of the local collapse of Ukrainian defences near Solodke, Russian forces advanced west from Uspenivka for over 4 km, capturing numerous new treelines on the tactical heights and levelling the frontline between the newly captured village of Solodke and the breakthroughs further south. \nIn the north, Russian forces continued to advance around Zlahoda. They pushed south from the village to the next treelines, capturing them and entering the village of Rybne, which was quickly brought under control. They then advanced further south to the treelines on the tactical heights, capturing them and linking up their bridgehead over the Yanchur River with the rest of the Hulyaipole direction.\n+ ~46.27 km² in favour of Russia.",
      "timestamp": "2025-11-11T11:10:41.008137Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to advance and have established a foothold in the village of Orestopil.\nAfter DRGs infiltrated the village earlier, and Russian assault groups reached its southwestern outskirts, Russian forces entered the western part of the village, establishing control over positions on two streets. DRGs continue to operate further east, with the rest of the village now falling into the grey zone.\n+ ~0.60 km² in favour of Russia.",
      "timestamp": "2025-11-11T11:10:41.008141Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continue to advance in the salient south of Novopavlivka and have captured new key positions.\nFollowing the Ukrainian withdrawal from the southern part of the salient north of Dachne, Russian forces crossed the Kalmychkova Gulley along the highway and captured positions in the treelines on the tactical heights to the north. Other forces pushed west from already-established positions north of the gulley, making new progress along additional treelines. \nMeanwhile, in Novopavlivka, assault operations continue in the southern part of the town, with Russian soldiers attempting to make additional progress in the direction of the centre.\n+ ~3.94 km² in favour of Russia.",
      "timestamp": "2025-11-11T11:10:41.008147Z"
    },
    {
      "original": "Military Situation In Ukraine On November 10, 2025 (Maps Update)",
      "timestamp": "2025-11-11T11:10:41.785041Z"
    },
    {
      "original": "Military Situation In Ukraine On November 10, 2025 (Maps Update)",
      "timestamp": "2025-11-11T11:10:41.785058Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Kyiv Braces For Its Toughest Winter\nOn November 9-10, Russia and Ukraine continued their mutual strikes. According to the Russian Ministry of Defense, Russian air defense systems destroyed 71 Ukrainian unmanned aerial vehicles. The Ukrainian Air Force reported that overnight Russia used two Kinzhal hypersonic missile systems, five S-300/400 missiles, and 67 attack UAVs against Ukrainian territory, of which 52 drones were shot down.\nPower outages in Ukraine this winter will be more extensive than in previous winter seasons, Ukrainian media report, citing a representative from a state-owned energy sector company.\n\"There is no frost yet, and there is already a shortage of power generation. In the future, it will only become more difficult. If we survive the winter with only two stages of blackouts, it will be a huge success. The energy system lost at least 1 gigawatt of generating capacity just from the latest attack,\" the message states.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785068Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Kyiv Braces For Its Toughest Winter\nOn November 9-10, Russia and Ukraine continued their mutual strikes. According to the Russian Ministry of Defense, Russian air defense systems destroyed 71 Ukrainian unmanned aerial vehicles. The Ukrainian Air Force reported that overnight Russia used two Kinzhal hypersonic missile systems, five S-300/400 missiles, and 67 attack UAVs against Ukrainian territory, of which 52 drones were shot down.\nPower outages in Ukraine this winter will be more extensive than in previous winter seasons, Ukrainian media report, citing a representative from a state-owned energy sector company.\n\"There is no frost yet, and there is already a shortage of power generation. In the future, it will only become more difficult. If we survive the winter with only two stages of blackouts, it will be a huge success. The energy system lost at least 1 gigawatt of generating capacity just from the latest attack,\" the message states.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785077Z"
    },
    {
      "original": "KYIV BLACKOUT OBSCURES DEEPENING OPERATIONAL CRISES IN UKRAINE'S VOLCHANSK AND KUPYANSK",
      "timestamp": "2025-11-11T11:10:41.785080Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785088Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785096Z"
    },
    {
      "original": "Radar Hit: Summary Of Russian Combat Footage From November 10, 2025\nOn November 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-11T11:10:41.785106Z"
    },
    {
      "original": "Radar Hit: Summary Of Russian Combat Footage From November 10, 2025\nOn November 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-11T11:10:41.785112Z"
    },
    {
      "original": "Another Israeli-Iranian War Is ‘Only Matter Of Time’ – Report\nAnother war between Israel and Iran is “only a matter of time,” according to a report published by The New York Times on November 9.\nThe report casts serious doubt on the idea that the 12-day war between the countries in June neutralized Iran’s nuclear program.\nIt claims that Middle East officials and experts increasingly believe Israeli and United States strikes caused less damage to the Islamic Republic’s nuclear facilities than previously thought, and that both countries are preparing for the prospect of another attack.\n“Iran’s stockpile of highly enriched uranium, enough to make 11 nuclear weapons, is either buried under rubble, as Iran claims, or has been spirited away to a safe place, as Israeli officials believe,” the report said.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785122Z"
    },
    {
      "original": "Ukrainian Troops Abandoning Front In Large Numbers\nThe number of desertions in Ukraine has been growing for a long time. As a natural consequence of the brutal process of forced mobilization and the high intensity of hostilities on the battlefield, more and more Ukrainians are simply fleeing their ranks as soon as they have the chance to evade the authorities. This is a clear sign of the decline of the Ukrainian military and the inability of the Kiev neo-Nazi regime to maintain the war effort in the long term.\nRecently, Western media reported that more than \n21,000 Ukrainian soldiers\n abandoned their country's armed forces in October alone. This number is massive for such a short period of time and shows the profound level of crisis within the Ukrainian military. In fact, this is the highest number of desertions reported in a single month since the beginning of the conflict, which also indicates that more recently the conditions of the war have become increasingly intolerable...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T11:10:41.785131Z"
    }
  ],
  "script_run_time": "2025-11-11T11:10:41.786247Z"
}