{
  "messages": [
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n у бік Ніжина, Мени, Борзни. \n🛵\n БпЛА \n➡️\n на/повз Запоріжжя.",
      "timestamp": "2025-09-27T14:36:16.604966Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n у районі Новгород-Сіверського та Коропа.",
      "timestamp": "2025-09-27T14:36:16.604987Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n у районі Новгород-Сіверського та Коропа.",
      "timestamp": "2025-09-27T14:36:16.604996Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n на Бахмач.",
      "timestamp": "2025-09-27T14:36:16.605004Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n на півночі Сумщини.",
      "timestamp": "2025-09-27T14:36:16.605011Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з півночно-західного напрямку Сумщини, курсом на південь Чернігівщини!",
      "timestamp": "2025-09-27T14:36:16.605017Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Миколаївщині! Залучено засоби для його збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-09-27T14:36:16.605023Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n на Ріпки.\n🛵\n Схід Дніпропетровщини БпЛА \n➡️\n на Павлоград, решта на схід.",
      "timestamp": "2025-09-27T14:36:16.605035Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Сумщини \n➡️\n на Хотінь та в напрямку Сум.",
      "timestamp": "2025-09-27T14:36:16.605043Z"
    },
    {
      "original": "🛵\n  БпЛА на Київщині в районі Богуслава, курсом на південно-західний напрямок.",
      "timestamp": "2025-09-27T14:36:16.605049Z"
    },
    {
      "original": "🛵\n  БпЛА з Київщини \n➡️\n на Черкащину.\n🛵\n БпЛА з Дніпропетровщини \n➡️\n на Запоріжжя.\n🛵\n БпЛА на сході Чернігівщини \n➡️\n на Мену.",
      "timestamp": "2025-09-27T14:36:16.605063Z"
    },
    {
      "original": "🛵\n Запоріжжя: БпЛА на околицях міста.",
      "timestamp": "2025-09-27T14:36:16.605069Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-27T14:36:16.605080Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-27T14:36:16.605088Z"
    },
    {
      "original": "🚀\nПуски КАБів \n➡️\n на Донеччину та Сумщину.",
      "timestamp": "2025-09-27T14:36:16.605095Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Запоріжжя та Сум!",
      "timestamp": "2025-09-27T14:36:16.605105Z"
    },
    {
      "original": "🛵\n  БпЛА у Запорізькій області \n➡️\n на Кушугум.\n🛵\n БпЛА у Сумській області, на  півдні від Конотопу \n➡️\n на Дубовязівку.\n🛵\n БпЛА на сході Чернігівщини \n➡️\n на Сосницю.",
      "timestamp": "2025-09-27T14:36:16.605118Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у Сумській області, на півночі \n➡️\n курсом на захід. Та на заході, в напрямку Чернігівщини.",
      "timestamp": "2025-09-27T14:36:16.605125Z"
    },
    {
      "original": "🛵\n Ударні безпілотники у  Богодухівському районі на Харківщині, курсом на південно-західний напрямок.",
      "timestamp": "2025-09-27T14:36:16.605130Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-27T14:36:16.605136Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини \n➡️\n на південь.",
      "timestamp": "2025-09-27T14:36:16.605141Z"
    },
    {
      "original": "🛵\n БпЛА з півдня Харківщини, на Дніпропетровщину, Самарівський район.",
      "timestamp": "2025-09-27T14:36:16.605147Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-27T14:36:17.331242Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-27T14:36:17.331256Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that groups of Ukrainian soldiers were encircled in the western part of Sichneve around four days ago, after Russian forces bypassed the village and continued advancing further west.   Russian forces are now striking them…",
      "timestamp": "2025-09-27T14:36:17.331262Z"
    },
    {
      "original": "We have geolocations confirming my earlier reports that Ukrainian forces were encircled in Sichneve and were being hit by FPV drones.",
      "timestamp": "2025-09-27T14:36:17.331266Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n IDF: The Air Force, guided by Military Intelligence, struck a alleged Hezbollah precision missile production site in Lebanon’s Bekaa region.\nThe IDF said the site’s existence violates understandings between Israel and Lebanon and vowed to continue acting against threats to Israel.\n@wfwitness",
      "timestamp": "2025-09-27T14:36:17.331279Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-09-27T14:36:17.331284Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-09-27T14:36:17.331288Z"
    },
    {
      "original": "Iskander on Khotin, Sumy Oblast",
      "timestamp": "2025-09-27T14:36:17.331292Z"
    },
    {
      "original": "Iskander on Khotin, Sumy Oblast",
      "timestamp": "2025-09-27T14:36:17.331296Z"
    },
    {
      "original": "Flying to Ulyanivka/Sumy City",
      "timestamp": "2025-09-27T14:36:17.331300Z"
    },
    {
      "original": "Disappeared. This was an S-300 in ground-to-ground mode.",
      "timestamp": "2025-09-27T14:36:17.331304Z"
    },
    {
      "original": "8 Russian Tu-95MS strategic bombers departed from Ukrainka Airbase, Amur Oblast. The purpose of the flight is unknown - possibly large-scale training exercises.",
      "timestamp": "2025-09-27T14:36:17.331308Z"
    },
    {
      "original": "Correction: 3 rockets were launched. 1 impacted in Ashdod.",
      "timestamp": "2025-09-27T14:36:17.331312Z"
    },
    {
      "original": "The Saraya Al-Quds Brigades (Palestinian Islamic Jihad) has claimed responsibility for the rocket attack on the Israeli city of Ashdod, over 30 km away from the closest potential launch positions. \nThey stated that three \"Badr-3\" MLRS rockets were used.",
      "timestamp": "2025-09-27T14:36:17.331317Z"
    },
    {
      "original": "Remind me, who was it who carried out that drone strike on a car with a family of American citizens this week?",
      "timestamp": "2025-09-27T14:36:17.331321Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n Netanyahu:\n 'The amount of civilians killed compared to the amount of terrorists in Gaza is extremely low'\n@Middle_East_Spectator",
      "timestamp": "2025-09-27T14:36:17.331331Z"
    },
    {
      "original": "It feels like its been a while since i've addressed the overall situation across the front in Ukraine. Over the last few months, Ukrainian forces have been conducting localised counterattacks in various places across the front when they hold a slight numerical advantage. However, this has significantly depleted the overall situation for the AFU, as the strategic whack-a-mole game grows in intensity. Gaps are opening up more frequently, and in greater magnitude. The biggest example was the Zolotyy Kolodyaz breakthrough, which forced Ukraine to pull elite Azov units from the Serebryanske forestry and Kupyansk, as well as regular units from Pokrovske direction. What we saw was the clearest evidence of the whackamole theory yet, as villages toward Pokrovske tumbled, the Serebraynske forest, which had held out for over 2 YEARS collapsed immediately, and Russian forces now controlling over half of Kupyansk. The whack a mole game continues, and will continue, with larger and larger gaps opening up, until the eventual end of organised resistance by the AFU. To be vulnerable and honest, i've made so many mistakes predicting a timeline of collapse, so im not gonna try to predict a timeline again lol. But collapse is happening, in stages, gradually.",
      "timestamp": "2025-09-27T14:36:17.331335Z"
    },
    {
      "original": "5 Tu-95MS bombers from Ukrainka landed at Engels-2 airbase today. There are now 8 Tu-95MS at Engels-2 and 1 at Olenya airbase.\nFollowing this redeployment, at least 8 Tu-95MS are ready for combat. A large-scale missile attack against Ukraine is likely within the next 48 hours",
      "timestamp": "2025-09-27T14:36:17.331340Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance within Kupyansk City and have broken through towards the southwestern suburbs. \nAfter a period of intensified assault operations, DRG activities, and infantry accumulation, Russian forces were able to make significant progress in the western part of Kupyansk, advancing through the residential areas west of the Kupyanka River. They were able to capture positions along Lermontova Street, which leads to Sobolivka, while assault groups penetrated further south to the high-rise buildings of the Yuvileynyi Neighbourhood in the southwest of the city. \nEast of the Kupyanka River, Russian forces improved their positions in the residential areas and reached the industrial zone in the centre of Kupyansk. They are now bypassing the Ukrainian \"Comb\" stronghold in the high-rise micro-district in the northern suburbs which the Russians previously failed to enter. Meanwhile, Russian forces continued to carry out assault operations in the area of the Central City Hospital, while Ukrainian forces continued to repel Russian attacks in the city centre. \n+ ~0.96 km² in favour of Russia.",
      "timestamp": "2025-09-27T14:36:17.331346Z"
    },
    {
      "original": "Russian forces have captured the village of Derylove, Lyman direction, Donetsk Oblast.\nPre-war population: ~108.\nTotal land area: ~0.63 km².",
      "timestamp": "2025-09-27T14:36:17.331351Z"
    },
    {
      "original": "\"At this rate, they will reach Kyiv in 465 years\"\n➡️\n Send submissions in the group via this \nlink",
      "timestamp": "2025-09-27T14:36:17.331357Z"
    },
    {
      "original": "In the Pokrovske and Hulyaipole directions, Russian forces continue to rapidly advance west towards the Yanchur River, making new progress in three areas.\nIn the south, Russian forces continue approach the chain of settlements along the Yanchur River, advancing further along the treelines on the tactical heights north of Olhivske, and improving their positions along the heights southwest of Novoivanivka. \nFurther north, the Russians advanced north from Novoivanivka capturing additional treelines and supporting the assault operations to Novohryhorivka. Deep advances were made along the gulley on the Dnipropetrovsk - Zaporizhzhia Regional Border, with Russian forces approaching the rear of Novohryhorivka. \nIn Dnipropetrovsk Oblast, after taking Novomykolaivka, Russian forces stormed the eastern outskirts of Kalynivske, while aviation and artillery worked on the main Ukrainian defensive nodes in the area. This collapsed the Ukrainian defense of the flanks and allowed for the Russians to quickly take the lightly defended village of Kalynivske, as well as the adjacent fortifications. The fall of Kalynivske allowed for Russian forces to push along the treelines on the tactical heights to the south, and level the front south of Kalynivske. They were also able to capture positions northwest and north of Kalynivka in the forests and treelines in the low-lying ground, approaching Stepove from the south. \nIn the north, Russian forces continued to develop their offensive in the area of Sosnivka. They were able to capture another treeline north of Berestove, and secured a series of treeline intersections northwest of Ternove, forcing a Ukrainian withdrawal from the salient south of Sosnivka. \n+ ~39.80 km² in favour of Russia.",
      "timestamp": "2025-09-27T14:36:17.331364Z"
    },
    {
      "original": "❗️\nNew Zealand will not recognize 'Palestinian state' now, 'question of when, not if'\nNew Zealand will not recognize a 'Palestinian state' for now but remains committed to pursuing a 'two-state solution,' Foreign Minister Winston Peters said.\n“With a war raging, Hamas remaining the de facto government of Gaza, and no clarity on next steps, too many questions remain about the future state of Palestine for it to be prudent for New Zealand to announce recognition at this time,” Peters stated in a speech at the UN General Assembly in New York on Friday.\n“We are also concerned that a focus on recognition, in the current circumstances, could complicate efforts to secure a ceasefire by pushing Israel and Hamas into even more intransigent positions,\" he added.\nPrime Minister Christopher Luxon said in Auckland today that \"recognition of Palestinian statehood is a question of when, not if.\"",
      "timestamp": "2025-09-27T14:36:17.331372Z"
    }
  ],
  "script_run_time": "2025-09-27T14:36:17.780304Z"
}