{
  "messages": [
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-10-01T08:54:15.967873Z"
    },
    {
      "original": "🚀\n \n🚀\nЗапорізька область та Дніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-01T08:54:15.967890Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Харківщини \n➡️\n курсом на Харків.",
      "timestamp": "2025-10-01T08:54:15.967896Z"
    },
    {
      "original": "🛵\n Ударний безпілотник в напрямку н.п. Димер на Київщині.",
      "timestamp": "2025-10-01T08:54:15.967901Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини \n➡️\n курсом на захід. \n🛵\n  БпЛА над Київським водосховищем \n➡️\n курсом на південь, на Київ.\n🛵\n БпЛА на півночі від Черкас \n➡️\n курсом на південь.",
      "timestamp": "2025-10-01T08:54:15.967912Z"
    },
    {
      "original": "🛵\n Київ загроза застосування ударного БпЛА з півночі.",
      "timestamp": "2025-10-01T08:54:15.967916Z"
    },
    {
      "original": "🛵\n БпЛА на півночі від Сум \n➡️\n курсом на північно-західний напрямок.",
      "timestamp": "2025-10-01T08:54:15.967921Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-01T08:54:15.967928Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-10-01T08:54:15.967935Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-01T08:54:15.967942Z"
    },
    {
      "original": "Ракета на Донеччині в північно-західному напрямку",
      "timestamp": "2025-10-01T08:54:15.967946Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 44 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 01 жовтня (із 20.30 30 вересня) противник атакував 49-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллерово, Брянськ – рф, Чауда - ТОТ Криму, протикорабельною ракетою \"Онікс\" (район пуску – ТОТ Криму), а також чотирма балістичними ракетами Іскандер-М/KN-23 (пуски із Орловської обл. - рф).\nПовітряний напад відбивали авіація, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.30, протиповітряною обороною збито/подавлено 44 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, сході та в центрі країни.\nЗафіксовано влучання 5 ракет та БпЛА противника на 6 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемог",
      "timestamp": "2025-10-01T08:54:15.967962Z"
    },
    {
      "original": "⚠\n Увага! \n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-10-01T08:54:15.967969Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі.",
      "timestamp": "2025-10-01T08:54:15.967975Z"
    },
    {
      "original": "🛵\n🛸\n В напрямку Сум ворожий БпЛА з північного сходу.",
      "timestamp": "2025-10-01T08:54:15.967981Z"
    },
    {
      "original": "⚠\n Увага! \n🛫\n Активність ворожої тактичної авіації  на східному напрямку!  \n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-01T08:54:15.967987Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з ТОТ Луганщини.",
      "timestamp": "2025-10-01T08:54:15.967991Z"
    },
    {
      "original": "Швидкісна ціль на Запоріжжі в напрямку н.п.Комишуваха з півдня.",
      "timestamp": "2025-10-01T08:54:15.967996Z"
    },
    {
      "original": "🛵\n🛸\n Ворожий БпЛА на Чернігівщині на сході від н.п.Холми в північному напрямку.",
      "timestamp": "2025-10-01T08:54:15.968001Z"
    },
    {
      "original": "🚀\nПуски КАБ на південь Сумщини.",
      "timestamp": "2025-10-01T08:54:15.968004Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-01T08:54:15.968008Z"
    },
    {
      "original": "🛵\n🛸\n Ворожі БпЛА  на межі Чернігівщини і Сумщини між н.п.Батурин і н.п.Конотоп.",
      "timestamp": "2025-10-01T08:54:15.968013Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to make significant progress, and have collapsed a section of Ukraine's defensive line outside Siversk.\nIn the east, Russian forces continued to infiltrate through the fields towards Dronivka, and were able to consolidate in the mine. From there, they are infiltrating towards the chalk quarry east of Dronivka. As a result of this, Ukraine was forced to withdraw from the village of Serebryanka, and is now holding a defence from three sides in Dronivka. Russian forces have also recaptured the rest of Serebryanka, as well as the surrounding positions, and are now trying to permanently establish themselves in the chalk quarry. \nThe Russians were also able to fully secure the northern bank of the Siverskyi Donets River, aligning the front along the Donetsk - Luhansk Regional Border, and officially ending the battles for the Severodonetsk District of Luhansk Oblast which have been ongoing since the first days of the war. \nTo the west, Russian forces marginally advanced towards Dronivka from the west, securing new positions in the forest on the western bank of the Siverskyi Donets River. \nIn the west, Russian forces continued their offensive on Yampil. They were able to consolidate control over additional positions in the eastern part of the village, including at the railway station, and are continuing their attacks beyond the village centre (which is currently in the grey zone). They were also able to advance further west through the forests, establishing control over the railway crossing and surrounding areas.\n+ ~24.46 km² in favour of Russia.",
      "timestamp": "2025-10-01T08:54:16.663920Z"
    },
    {
      "original": "On the western flank of Kostyantynivka, Russian forces continued their offensive north towards the city of Druzhkivka, and have made additional progress along the tactical heights and in the low-lying ground.\nRussian forces pushed further north along the Poltavka River, and have established control over new positions in the forest plantations surrounding the reservoir. Further west, they crossed a gulley and secured the forest plantations on its northern edge, while other forces pushed north along the treelines on the tactical heights to the northeast.\n+ ~6.12 km² in favour of Russia.",
      "timestamp": "2025-10-01T08:54:16.663934Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to quickly advance and have broken through Ukrainian positions towards Verbove.\nAfter capturing Kalynivske, Russian forces began pushing west along the road to Verbove under heavy air and artillery cover, quickly capturing Ukrainian positions there and in the treelines on the tactical heights to the south. From there, they entered eastern Verbove with little resistance and occupied at least half of the village, including the agricultural buildings. The intensity of FAB glide-bomb strikes in this area is increasing, with Ukrainian temporary deployment points and fortifications constantly being struck.\nAdditionally, Russian forces advanced north from their positions west of Berezove, and captured the one-house \"village\" of Stepove. They then pushed further and established control over the treeline to the north, as well as the treelines east of Stepove. \nTo the northeast, Russian forces advanced further north up the gulley leading to southwestern Sosnivka, and cleared out the rest of the salient here. \n+ ~17.81 km² in favour of Russia.",
      "timestamp": "2025-10-01T08:54:16.663940Z"
    },
    {
      "original": "A short time ago, Israeli forces infiltrated the village of Koayiah in southern Syria from their buffer zone around the Golan Heights. \nUnder the cover of reconnaissance drones, they advanced down the road through the village of Ma'ariya, and established control over Koayiah up to the bridge leading to the neighbouring settlement of Baiyt Irah. \nSeveral vehicles have been deployed, and two checkpoints were set up - one of which is on the Koayiah - Aabdyn Road, controlling movement in and out of Koayiah.",
      "timestamp": "2025-10-01T08:54:16.663945Z"
    },
    {
      "original": "— \n🇺🇦\n/\n🇩🇪\n/\n🇷🇺\n NEW: \nBBC reports that the 'mastermind' behind the sabotage attack against the Nordstream 2 pipeline in 2022 is a Ukrainian man by the name of 'Volodymyr Z'\nSounds familiar?\n@Middle_East_Spectator",
      "timestamp": "2025-10-01T08:54:16.663954Z"
    },
    {
      "original": "The situation in Suwayda remains tense but stable, with the STG and Bedouin forces occupying a number of towns on the border with Rif Dimashq and Daraa to the north and west. Many of these towns were predominantly Christian and have been looted and vandalized by the Damascus authorities and Bedouin tribes.\nOn the other hand, in the east, ISIS terrorists began to increase their operations against the Druze for the first time since 2018, when the SAA liberated the Safa volcanic area. Despite the presence of the NFSA in Tanf and the rest of Badiyah, the insurgency continues to grow stronger and may launch a serious insurgency in the near future.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1liqnO9iSvshTLwgPB3q9sJTgfUI&ll=32.83725589253059%2C36.64276501880522&z=10\n ]",
      "timestamp": "2025-10-01T08:54:16.663959Z"
    },
    {
      "original": "The situation in Suwayda remains tense but stable, with the STG and Bedouin forces occupying a number of towns on the border with Rif Dimashq and Daraa to the north and west. Many of these towns were predominantly Christian and have been looted and vandalized by the Damascus authorities and Bedouin tribes.\nOn the other hand, in the east, ISIS terrorists began to increase their operations against the Druze for the first time since 2018, when the SAA liberated the Safa volcanic area. Despite the presence of the NFSA in Tanf and the rest of Badiyah, the insurgency continues to grow stronger and may launch a serious insurgency in the near future.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1liqnO9iSvshTLwgPB3q9sJTgfUI&ll=32.83725589253059%2C36.64276501880522&z=10\n ]",
      "timestamp": "2025-10-01T08:54:16.663965Z"
    },
    {
      "original": "Last night, a combined strike was carried out on Kharkiv City. 4 Iskander-M ballistic missiles and 4-6 KAB glide-bombs were used. The main target was the \"Barabashovo\" Autoparts Market, however it appears that it hasn't been used for trade since the beginning of the war.",
      "timestamp": "2025-10-01T08:54:16.663968Z"
    },
    {
      "original": "Last night, a combined strike was carried out on Kharkiv City. 4 Iskander-M ballistic missiles and 4-6 KAB glide-bombs were used. The main target was the \"Barabashovo\" Autoparts Market, however it appears that it hasn't been used for trade since the beginning of the war.",
      "timestamp": "2025-10-01T08:54:16.663974Z"
    },
    {
      "original": "Russian forces have captured the village of Zarichne, Lyman direction, Donetsk Oblast.\nPre-war population: ~2,367.\nTotal land area: ~9.72 km².",
      "timestamp": "2025-10-01T08:54:16.663979Z"
    },
    {
      "original": "The IDF continues to demolish the last remaining buildings in Israeli-occupied Rafah, southern Gaza.",
      "timestamp": "2025-10-01T08:54:16.663982Z"
    },
    {
      "original": "Last night, a combined strike was carried out on Kharkiv City. 4 Iskander-M ballistic missiles and 4-6 KAB glide-bombs were used. The main target was the \"Barabashovo\" Autoparts Market, however it appears that it hasn't been used for trade since the beginning…",
      "timestamp": "2025-10-01T08:54:16.663985Z"
    },
    {
      "original": "The aftermath of the Russian strikes on the Barabashovo Market in Kharkiv City is clearer now that the fire has been put out.",
      "timestamp": "2025-10-01T08:54:16.663988Z"
    },
    {
      "original": "Rare footage showing two Russian Geran-2 drone strikes on a Ukrainian freight train carrying equipment for the AFU. The train was covered by at least two Ukrainian tactical aircraft, but the Gerans and the reconnaissance drones were able to dodge them, with the Gerans hitting their targets. \nAdditionally, the footage shows a strike on fuel tanks near the city of Bobrovytsia, Chernihiv Oblast.",
      "timestamp": "2025-10-01T08:54:16.663992Z"
    },
    {
      "original": "A Ukrainian An-124 transport aircraft picked up containers from Ben Gurion International Airport in the Israeli capital of Tel Aviv, before flying to Leipzig Airport in Germany. \nThe cargo likely consists of PAC-2 surface-to-air missiles for the Israeli Patriot system(s) previously transferred to Ukraine.",
      "timestamp": "2025-10-01T08:54:16.663995Z"
    },
    {
      "original": "A Ukrainian An-124 transport aircraft picked up containers from Ben Gurion International Airport in the Israeli capital of Tel Aviv, before flying to Leipzig Airport in Germany. \nThe cargo likely consists of PAC-2 surface-to-air missiles for the Israeli Patriot system(s) previously transferred to Ukraine.",
      "timestamp": "2025-10-01T08:54:16.663999Z"
    },
    {
      "original": "Ukrainian HIMARS GMLRS have once again struck Belgorod.",
      "timestamp": "2025-10-01T08:54:16.664002Z"
    }
  ],
  "script_run_time": "2025-10-01T08:54:17.211433Z"
}