{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-08-21T23:17:23.614748Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-21T23:17:23.614769Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-08-21T23:17:23.614774Z"
    },
    {
      "original": "🛵\n Херсонщина - загроза застосування ударних БпЛА!",
      "timestamp": "2025-08-21T23:17:23.614779Z"
    },
    {
      "original": "🛵\n Херсонщина - загроза застосування ударних БпЛА!",
      "timestamp": "2025-08-21T23:17:23.614783Z"
    },
    {
      "original": "Та Миколаївська область!",
      "timestamp": "2025-08-21T23:17:23.614787Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-08-21T23:17:23.614791Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-08-21T23:17:23.614795Z"
    },
    {
      "original": "🛵\n БпЛА на сході  Харківщини \n➡️\n   курсом на північ.",
      "timestamp": "2025-08-21T23:17:23.614805Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному та північно-східному  напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-21T23:17:23.614813Z"
    },
    {
      "original": "🛵\n БпЛА на сході  білгородщини \n➡️\n   курсом на північ Сумщини.\n🛸\n Північ Харківщини - ворожі БпЛА! Дані безпілотники можуть бути навідниками ворожих засобів ураження. Під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T23:17:23.614820Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-08-21T23:17:23.614825Z"
    },
    {
      "original": "🛸\n Північно-східний район Чернігівщини - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження. У разі оголошення тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T23:17:23.614830Z"
    },
    {
      "original": "🛵\n Полтавщина - загроза застосування ударних БпЛА!",
      "timestamp": "2025-08-21T23:17:23.614841Z"
    },
    {
      "original": "🚨\nОновлення щодо \"шахедів\":\n🛵\n  БпЛА на півночі Харківщини та на сході Полтавщини \n➡️\n курсом на південно-східний напрямок.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на північно-західний напрямок.\n🛵\n БпЛА на Донеччині \n➡️\n курсом на Добропілля.",
      "timestamp": "2025-08-21T23:17:23.614854Z"
    },
    {
      "original": "🛸\n Центр Чернігівщини - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження. У разі оголошення тривоги перебувайте у безпечних місцях!\n🛵\n Чернігівщина - на північно-східному напрямку БпЛА \n➡️\n курсом на південь!",
      "timestamp": "2025-08-21T23:17:23.614862Z"
    },
    {
      "original": "🛵\n На заході Донеччини 14 БпЛА \n➡️\n курсом на північно-східний напрямок!",
      "timestamp": "2025-08-21T23:17:23.614868Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на південно-східний напрямок.",
      "timestamp": "2025-08-21T23:17:23.614873Z"
    },
    {
      "original": "🚨\nОновлення щодо \"шахедів\":\n🛵\n  БпЛА на заході Харківщини \n➡️\n курсом на південно-східний напрямок. БпЛА на Харків.\n🛵\n БпЛА на півночі  Запоріжжя\n➡️\n курсом на південь Дніпропетровщини.\n🛵\n БпЛА на Донеччині \n➡️\n курсом на північ.\n🛵\n Запоріжжя - загроза застосування ударних БпЛА!",
      "timestamp": "2025-08-21T23:17:23.614887Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Харківщини \n➡️\n курсом на південь та БпЛА на півдні\n➡️\n курсом на схід. \nХарків- загроза застосування ударних БпЛА!.",
      "timestamp": "2025-08-21T23:17:23.614894Z"
    },
    {
      "original": "🛵\n БпЛА на півночі  Запоріжжя(в районі обласного центру)\n➡️\n курсом на південь .",
      "timestamp": "2025-08-21T23:17:23.614900Z"
    },
    {
      "original": "Earlier, a Zircon missile was also used on Sumy City",
      "timestamp": "2025-08-21T23:17:24.109322Z"
    },
    {
      "original": "They are flying towards Chortkiv, Ternopil Oblast.",
      "timestamp": "2025-08-21T23:17:24.109338Z"
    },
    {
      "original": "Currently, the last missiles are flying northwest through Ternopil Oblast, west of Ternopil City.",
      "timestamp": "2025-08-21T23:17:24.109342Z"
    },
    {
      "original": "Currently, the last missiles are flying northwest through Ternopil Oblast, west of Ternopil City.",
      "timestamp": "2025-08-21T23:17:24.109345Z"
    },
    {
      "original": "The missiles are flying towards Lviv City.",
      "timestamp": "2025-08-21T23:17:24.109348Z"
    },
    {
      "original": "The missiles are flying towards Lviv City.",
      "timestamp": "2025-08-21T23:17:24.109353Z"
    },
    {
      "original": "The group split. Part is flying to Lutsk. The rest are flying to Mykolaiv, Lviv Oblast.",
      "timestamp": "2025-08-21T23:17:24.109356Z"
    },
    {
      "original": "A group of missiles is flying to Lutsk from the south.",
      "timestamp": "2025-08-21T23:17:24.109360Z"
    },
    {
      "original": "Multiple explosions in Lviv",
      "timestamp": "2025-08-21T23:17:24.109363Z"
    },
    {
      "original": "Explosions in Lutsk. The missile attack is over.",
      "timestamp": "2025-08-21T23:17:24.109366Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n Details of today's complex Al-Qassam ambush against an Israeli outpost in Gaza:\n– A unit of 18 Hamas fighter emerged from a tunnel near a temporary IDF outpost in southern Khan Younis.\n– The unit jumped over the dirt barrier and entered the outpost, targeting several Israeli Merkava IV tanks with Yassin-105 RPGs and IEDs from close range.\n– One of the fighter managed to snipe the commander of a Merkava IV tank, fatally injuring him.\n– Subsequently, the fighters began assaulting a building that housed IDF troops, with machine gun fire, grenades and RPGs.\n– The unit then entered the building, killing severel Israeli soldiers at point-blank range, while also losing several of their own fighters in the process.\n– When an Israeli rescue force arrived, the last Al-Qassam fighter emerged from a tunnel and blew himself up amidst the soldiers, leading to casualties.\n– Lastly, the Al-Qassam Brigades fired mortar shells upon the entry and exits of the outpost, cutting off supply lines and preventing easy evacuation.\n@Middle_East_Spectator",
      "timestamp": "2025-08-21T23:17:24.109381Z"
    },
    {
      "original": "Approximate paths of the Russian missiles over Ukraine last night.\nThe following was used:\n~12 Kh-101 cruise missiles, launched from 2 Tu-95MS in Engels District, Saratov Oblast).\n~12 Kalibr cruise missiles, launched from 1 \"Varshavyanka\"-class submarine and 1 \"Admiral Makarov\"-class frigate in the Black Sea, off the coast of Anapa, Krasnodar Krai. \n4 Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31Ks east of Lipetsk City, Lipetsk Oblast.\n1 Zircon hypersonic cruise missile launched from Cape Chauda, Crimea. \nInterception rates are unknown, but 2 Kh-101s are known to have been shot down over Kyiv Oblast. \nOver 500 Geran-2 drones were also launched in several waves from several locations surrounding Ukraine. \nThe targets of the missiles were: \nMukachevo, Zakkarpatia Oblast.\nZaporizhzhia City, Zaporizhzhia Oblast.\nLviv City, Lviv Oblast.\nLutsk, Volyn Oblast.\nDubno, Rivne Oblast.\nSumy City, Sumy Oblast.\nGeran-2 drones targeted the above cities, as well as:\nPavlohrad, Dnipropetrovsk Oblast.\nVinnytsia City, Vinnytsia Oblast.\nOkhtyrka, Sumy Oblast.\nRivne City, Rivne Oblast.\nMezhova, Dnipropetrovsk Oblast.\nPokrovske, Dnipropetrovsk Oblast.",
      "timestamp": "2025-08-21T23:17:24.109398Z"
    },
    {
      "original": "Approximate paths of the Russian missiles over Ukraine last night.  The following was used:  ~12 Kh-101 cruise missiles, launched from 2 Tu-95MS in Engels District, Saratov Oblast).  ~12 Kalibr cruise missiles, launched from 1 \"Varshavyanka\"-class submarine…",
      "timestamp": "2025-08-21T23:17:24.109402Z"
    },
    {
      "original": "One of the targets of last night's combined Russian missile strike was the Flextronics plant owned by the U.S. company \"Flex\", in Mukachevo, Zakarpattia Oblast. As many as 12 Kalibr cruise missiles impacted the plant, resulting in a massive fire breaking out. \nThe plant has been operating in Mukachevo for over 13 years and was originally built for civilian purposes.",
      "timestamp": "2025-08-21T23:17:24.109406Z"
    },
    {
      "original": "One of the targets of last night's combined Russian missile strike was the Flextronics plant owned by the U.S. company \"Flex\", in Mukachevo, Zakarpattia Oblast. As many as 12 Kalibr cruise missiles impacted the plant, resulting in a massive fire breaking out. \nThe plant has been operating in Mukachevo for over 13 years and was originally built for civilian purposes.",
      "timestamp": "2025-08-21T23:17:24.109410Z"
    },
    {
      "original": "Last night, Russian Kh-101 cruise missiles and Geran-2 drones struck the \"Concern Electron\" plant in Lviv City. The full extent of the damage is unknown. \nThis plant was previously targeted on July 12, 2025.\nCoordinates: 49.842332, 24.002155\nEdit: I'm aware the geolocation proof is wrong. The coordinates are correct though.",
      "timestamp": "2025-08-21T23:17:24.109416Z"
    },
    {
      "original": "Last night, 3-4 Russian Kh-101 cruise missiles impacted the Motor Sich Plant in Zaporizhzhia City. \nLocals report that Building 113 was the main target, which was used for producing engines for aircraft, drones and other light aviation. A large fire broke out afterwards.",
      "timestamp": "2025-08-21T23:17:24.109440Z"
    },
    {
      "original": "Russian forces have captured the village of Bezsalivka, Bilopillya direction, Sumy Oblast. \nPre-war population: ~60.\nTotal land area: ~0.62km².",
      "timestamp": "2025-08-21T23:17:24.109446Z"
    },
    {
      "original": "Russian forces have captured the town of Shcherbynivka, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~3,266.\nTotal land area: ~5.92km².",
      "timestamp": "2025-08-21T23:17:24.109451Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Andriivka-Klevtsove, Prosyana direction, Donetsk Oblast.\nPre-war population: ~777.\nTotal land area: ~3.66km².",
      "timestamp": "2025-08-21T23:17:24.109455Z"
    },
    {
      "original": "Russian forces have captured the village of Novoheorhiivka, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~34.\nTotal land area: ~0.25km²",
      "timestamp": "2025-08-21T23:17:24.109459Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. I also have Signal if you prefer that.",
      "timestamp": "2025-08-21T23:17:24.109465Z"
    },
    {
      "original": "AMK Mapping\n pinned «\nIf you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks.   You…\n»",
      "timestamp": "2025-08-21T23:17:24.109472Z"
    },
    {
      "original": "In Video: Russian Geran Drone Hit Ukrainian HIMARS Launch Site\nThe Russian military has targeted a forest where Kiev forces deployed a United States-made M142 HIMARS multiple rocket launcher with Geran suicide drones.\nThe system carried out a launch from the small forest, located near the settlement of Rohivka in the Chernihiv direction, before getting detected. The launch site was quickly then targeted with at least two Geran drones. Footage of the strike posted to social networks on August 20 showed multiple secondary explosions after the strike. Rocket pods were clearly destroyed, although the fate of the launcher remains unclear.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613140Z"
    },
    {
      "original": "Long Arm of War: Russian Missiles Shatter Ukrainian West In One Of Most Devastating Attacks\nIn the dead of night on August 21, 2025, the skies over Ukraine erupted in what appears to be one of the most massive and sophisticated air assaults since the beginning of the conflict. Russian armed forces executed a powerful, multi-wave combined attack, leveraging almost a full spectrum of its aerial arsenal in a coordinated operation designed to overwhelm Ukrainian defenses and cripple critical national infrastructure.\nThe scale of the offensive was unprecedented. According to Ukrainian reports, Russian forces launched a total of 614 air attack assets. This immense armada included 574 Geranium/Shahed-type kamikaze drones, deployed in swarms to saturate and exhaust air defense systems. They were followed by a precise and devastating barrage of 40 missiles of virtually every class in Russia’s inventory.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613157Z"
    },
    {
      "original": "Long Arm of War: Russian Missiles Shatter Ukrainian West In One Of Most Devastating Attacks\nIn the dead of night on August 21, 2025, the skies over Ukraine erupted in what appears to be one of the most massive and sophisticated air assaults since the beginning of the conflict. Russian armed forces executed a powerful, multi-wave combined attack, leveraging almost a full spectrum of its aerial arsenal in a coordinated operation designed to overwhelm Ukrainian defenses and cripple critical national infrastructure.\nThe scale of the offensive was unprecedented. According to Ukrainian reports, Russian forces launched a total of 614 air attack assets. This immense armada included 574 Geranium/Shahed-type kamikaze drones, deployed in swarms to saturate and exhaust air defense systems. They were followed by a precise and devastating barrage of 40 missiles of virtually every class in Russia’s inventory.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613166Z"
    },
    {
      "original": "Russian Army Is Hunting Down Ukraine’s Remaining CAESAR Howitzer \nThe Russian military is hunting down Ukraine’s remaining French-made CAESAR self-propelled howitzers with much success.\nOn August 20, two videos showing the destruction of two such howitzers surfaced online. Both howitzers were struck in the Dnipropetrovsk direction. One was targeted with a Lancet loitering munition, while the other was hit by multiple VT-40 FPV suicide drones.\nManufactured by France’s Nexter Systems, the CAESAR is a 155 mm 52-caliber howitzer mounted on a six-wheeled or eight-wheeled truck chassis. The howitzer can fire up to six rounds per minute and has a firing range of around 42 kilometers using extended range, full bore shells, and up to 55 kilometers using rocket assisted shells.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613174Z"
    },
    {
      "original": "Russian Army Is Hunting Down Ukraine’s Remaining CAESAR Howitzer \nThe Russian military is hunting down Ukraine’s remaining French-made CAESAR self-propelled howitzers with much success.\nOn August 20, two videos showing the destruction of two such howitzers surfaced online. Both howitzers were struck in the Dnipropetrovsk direction. One was targeted with a Lancet loitering munition, while the other was hit by multiple VT-40 FPV suicide drones.\nManufactured by France’s Nexter Systems, the CAESAR is a 155 mm 52-caliber howitzer mounted on a six-wheeled or eight-wheeled truck chassis. The howitzer can fire up to six rounds per minute and has a firing range of around 42 kilometers using extended range, full bore shells, and up to 55 kilometers using rocket assisted shells.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613183Z"
    },
    {
      "original": "Military Situation In Palestine On August 21, 2025 (Map Update)",
      "timestamp": "2025-08-21T23:17:24.613187Z"
    },
    {
      "original": "Ukrainian Troops Are Helping Russian Army Strike Nationalist Barrier Detachments \nThe AFU, or at least some of its units, are now clearly in an intra-conflict with the NGU’s barrier detachments (National Guard of Ukraine). The recent incidents shows a growing trend where Ukrainian troops are favoring the option of cooperating with the Russian military in order to get a chance to withdraw and save their lives.\nOn August 8, it was reported that Russian airstrikes destroyed two such detachments near the settlements of Orestopol and Alekseevka of the Dnipropetrovsk region after receiving information from the 31st Brigade of the AFU.\nAnother incident was reported by Russian media on August 14, in which the AFU’s 60th Brigade reported the coordinates of the command post responsible for the operations of barrier detachments deployed in the Donetsk direction to the Russian military. \n(Video) Ukrainian barrier detachment opened fire on soldiers evacuating from a trench stormed by Russian troops.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613196Z"
    },
    {
      "original": "Military Situation In Ukraine On August 21, 2025 (Maps Update)",
      "timestamp": "2025-08-21T23:17:24.613200Z"
    },
    {
      "original": "Military Situation In Ukraine On August 21, 2025 (Maps Update)",
      "timestamp": "2025-08-21T23:17:24.613204Z"
    },
    {
      "original": "Russian Aerospace Forces Gets More Su-35S Fighter Jets \nThe United Aircraft Corporation (UAC) has delivered a new batch of Sukhoi Su-35S fighter jets to the Russian Aerospace Forces (VKS), the press office of Rostec, which owns UAC, announced on August 21.\n“The generation 4++ aircraft have undergone a full cycle of factory trials and have been accepted by the technical personnel and tested by pilots of the Defense Ministry of Russia in various operational modes,” the press office said in a statement.\nThe Su-35s was designed to engage all types of aerial targets in long and close ranged air battles as well as to attack ground and sea-surface targets.\n“The powerplant based on new engines with digital control and thrust vectoring makes it possible to considerably improve the aircraft’s flight performance and maneuverable characteristics,” Rostec said.\nRead more \nHERE",
      "timestamp": "2025-08-21T23:17:24.613214Z"
    },
    {
      "original": "ISRAEL OUT FOR BLOOD IN GAZA",
      "timestamp": "2025-08-21T23:17:24.613217Z"
    },
    {
      "original": "Iranian Navy Launches Live-Fire Exercise (Video)\nIranian Navy Launches Live-Fire Exercise (Video)The Iranian Navy started on August 21 a live-fire exercise, the Islamic Republic’s first since the end of the 12-day war with Israel.\nThe exercise, codenamed “Sustainable Power 1404,” will go on for two days with the participation of warships, submarines, warplanes, coastal defense missile sites, and electronic warfare units in the northern Indian Ocean and the Sea of Oman.\nRead more: \nHERE",
      "timestamp": "2025-08-21T23:17:24.613224Z"
    }
  ],
  "script_run_time": "2025-08-21T23:17:24.614048Z"
}