{
  "messages": [
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-15T04:53:20.539394Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-15T04:53:20.539409Z"
    },
    {
      "original": "🛵\n БпЛА в районі Ніжина на Чернігівщині, постійно змінюють курс.\n🛵\n БпЛА в північній та східній частинах Чернігівщини, курс західний.",
      "timestamp": "2025-09-15T04:53:20.539416Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-15T04:53:20.539421Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-15T04:53:20.539426Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-15T04:53:20.539430Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини, курсом на Київщину",
      "timestamp": "2025-09-15T04:53:20.539435Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини, курсом на Київщину",
      "timestamp": "2025-09-15T04:53:20.539439Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва з північно-східного напрямку",
      "timestamp": "2025-09-15T04:53:20.539443Z"
    },
    {
      "original": "🛵\n БпЛА в центральній та південній частині Чернігівщини, постійно змінюють курс.\n🛵\n БпЛА в західній частині Сумщини, курс південно-західний.\n🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-09-15T04:53:20.539451Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-15T04:53:20.539456Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-15T04:53:20.539461Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-09-15T04:53:20.539476Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-15T04:53:20.539481Z"
    },
    {
      "original": "🛵\n БпЛА на заході Харківщини, курсом на Полтавщину.\n🛵\n БпЛА в центральній частині Чернігівщини, постійно змінюють курс.\n🛵\n БпЛА в центральній частині Полтавщини, курс південно-західний.\n🛬\n Активність ворожої тактичної авіації на східному та північно-східному напрямках!",
      "timestamp": "2025-09-15T04:53:20.539490Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-15T04:53:20.539495Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-15T04:53:20.539499Z"
    },
    {
      "original": "🛵\n БпЛА східніше Полтави, курс південний.",
      "timestamp": "2025-09-15T04:53:20.539503Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Харківщини, курс західний/південно-західний.\n🛵\n БпЛА в північній частині Полтавщини, курс західний.\n🛵\n БпЛА в східній частині Сумщини, курс південний.\n🛵\n БпЛА в східній частині Чернігівщини, постійно змінюють курс.",
      "timestamp": "2025-09-15T04:53:20.539512Z"
    },
    {
      "original": "🛵\n БпЛА в північній частині Харківщини, курс південний.\n🛵\n БпЛА з Донеччини, курсом на Дніпропетровщину.\n🛵\n БпЛА на межі Харківщини та Дніпропетровщини, курс західний.\n🛵\n БпЛА з Херсонщини, курсом на Миколаївщину.",
      "timestamp": "2025-09-15T04:53:20.539521Z"
    },
    {
      "original": "🛵\n БпЛА в північній частині Харківщини, курс південний. \n🛵\n БпЛА з Донеччини, курсом на Дніпропетровщину. \n🛵\n БпЛА на межі Харківщини та Дніпропетровщини, курс західний. \n🛵\n БпЛА з Херсонщини, курсом на Миколаївщину.",
      "timestamp": "2025-09-15T04:53:20.539529Z"
    },
    {
      "original": "🛵\n БпЛА в західній частині Херсонщини змінили курс на північний/північно-західний.",
      "timestamp": "2025-09-15T04:53:20.539533Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Дніпропетровщини, курс західний.",
      "timestamp": "2025-09-15T04:53:20.539537Z"
    },
    {
      "original": "🛵\n БпЛА на межі Сумщини та Чернігівщини, курс західний.\n🛸\n В районі Запоріжжя - ворожий розвідувальний БпЛА! Можлива робота ППО.",
      "timestamp": "2025-09-15T04:53:20.539543Z"
    },
    {
      "original": "🛵\n БпЛА в північній частині Чернігівщини, курс західний.\n🛵\n БпЛА в північній частині Сумщини, постійно змінює курс.\n🛸\n Південніше Запоріжжя - ворожий розвідувальний БпЛА! Можлива робота ППО.",
      "timestamp": "2025-09-15T04:53:20.539550Z"
    },
    {
      "original": "Sirens are sounding in Eilat, southern Israel as a Houthi drone flies north over the city.",
      "timestamp": "2025-09-15T04:53:21.061322Z"
    },
    {
      "original": "Interceptors were launched, but the drone is still flying north towards Ramon Airport.",
      "timestamp": "2025-09-15T04:53:21.061331Z"
    },
    {
      "original": "Interceptors were launched, but the drone is still flying north towards Ramon Airport.",
      "timestamp": "2025-09-15T04:53:21.061335Z"
    },
    {
      "original": "A helicopter is now in pursuit of the houthi drone.",
      "timestamp": "2025-09-15T04:53:21.061339Z"
    },
    {
      "original": "Activity on Russian strategic comms related to Tu-95MS and Tu-160 bombers at Engels-2 Airbase has been recorded. There is a possibility of a missile attack taking place on Ukraine tonight.",
      "timestamp": "2025-09-15T04:53:21.061342Z"
    },
    {
      "original": "The radio activity at Engels-2 Airbase has stopped. The Tu-160 that is airborne may be training/redeploying.",
      "timestamp": "2025-09-15T04:53:21.061345Z"
    },
    {
      "original": "A helicopter is now in pursuit of the houthi drone.",
      "timestamp": "2025-09-15T04:53:21.061348Z"
    },
    {
      "original": "All flights in and out of Ramon Airport have been suspended as the drone continues to approach from the south.",
      "timestamp": "2025-09-15T04:53:21.061352Z"
    },
    {
      "original": "A helicopter is now in pursuit of the houthi drone.",
      "timestamp": "2025-09-15T04:53:21.061355Z"
    },
    {
      "original": "The drone was shot down by the helicopter.",
      "timestamp": "2025-09-15T04:53:21.061359Z"
    },
    {
      "original": "Russian forces have recaptured the village of Tykhe, Velykyi Burluk direction, Kharkiv Oblast.\nPre-war population: ~164.\nTotal land area: ~0.80 km² \nIt's unclear exactly when this happened.",
      "timestamp": "2025-09-15T04:53:21.061365Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the hangar at the airfield near Dolnya, Kyiv Oblast, was destroyed after it was targeted as a part of the combined missile and drone attack on September 7. \nIt appears it was targeted by Geran-2 drones, rather than cruise missiles.\nCoordinates: 50.059612, 30.719478\nImage credit: \nhttps://t.me/osint_alarm/318",
      "timestamp": "2025-09-15T04:53:21.061372Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the hangar at the airfield near Dolnya, Kyiv Oblast, was destroyed after it was targeted as a part of the combined missile and drone attack on September 7. \nIt appears it was targeted by Geran-2 drones, rather than cruise missiles.\nCoordinates: 50.059612, 30.719478\nImage credit: \nhttps://t.me/osint_alarm/318",
      "timestamp": "2025-09-15T04:53:21.061378Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continue to advance west through Zaporizhzhia Oblast and have reached the village of Novoivanivka.\nRussian forces continued attacking along the tactical heights, and over the past few days, have advanced for over 5 km along the road to Novoivanivka. Here, they established control over the treelines perpendicular to the road, while other forces crossed a tributary of the Yanchur River, and captured the village of Obratne as well as the treelines west of it. \nFurther south Russian forces advanced to the gulley east of Novoivanivka, and established control over the rest of the heights up to the reservoirs to the southeast. \n+ ~20.90 km² in favour of Russia.",
      "timestamp": "2025-09-15T04:53:21.061384Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to quickly advance in Dnipropetrovsk Oblast and have captured the village of Ternove. \nAfter breaking through to and capturing Novomykolaivka, Russian forces began advancing towards Berezove from the south and captured the treelines on approach to the village. They also captured the treelines on the heights north of Zaporizke and began bypassing Ternove from the west. Once other forces captured the treelines near the gulley north of Ternove and began pushing southwest towards the treelines north of Berezove, Ukraine was forced to abandon the village. \n+ ~17.40 km² in favour of Russia.",
      "timestamp": "2025-09-15T04:53:21.061389Z"
    },
    {
      "original": "In the Prosyana direction, Russian forces continue to advance and have recaptured most of their previously lost positions. \nRussian forces pushed further west from the Tolstoi area and captured the rest of the orchards after Ukrainian forces withdrew to Andriivka Klevstove. \nFurther north, after Ukrainian forces failed to retake the southern part of Zelenyi hai, Russian forces pushed north again and recaptured the rest of the residential part of the village. Ukraine still holds the agricultural complex west of the settlement. The Russians then went on to advance southwest through the treelines to northern Andriivka-Klevstove and entered the village from there, as well as from the east.  As a result, most of the village is either under Russian control or in the grey zone, while the highway running into was captured.\n+16.20 km² in favour of Russia.",
      "timestamp": "2025-09-15T04:53:21.061397Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have broken through to the edge of Kostyantynivka. \nRussian forces established control over further treeline positions on the tactical heights southeast of Predtechyne, before advancing west down the treeline to the Yahidka Dachas. Ukrainian forces withdrew with little resistance to the Santurynivka District of Kostyantynivka, allowing for the Russians to establish control over these dachas. Consolidation efforts are ongoing. \n+ ~5.96 km² in favour of Russia.",
      "timestamp": "2025-09-15T04:53:21.061401Z"
    },
    {
      "original": "Here is the interactive Ukraine map link for those who haven't visited my Linktree page in the channel description. All updates are visible there before I post about them.\nEdit: Oh wow, I just saw the map thumbnail with the old frontlines...\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=48.508957095828315%2C37.75815629381896&z=15",
      "timestamp": "2025-09-15T04:53:21.061407Z"
    },
    {
      "original": "The IDF is continuing its systematic efforts to destroy the remaining tower blocks in Gaza City. This video shows an airstrike on a residential building in the Al-Rimal neighborhood.",
      "timestamp": "2025-09-15T04:53:21.061410Z"
    },
    {
      "original": "Another small Geran-2 drone attack on Ukraine tonight. Less than 40 drones, many of which were Gerberas, attacked targets in western Dnipropetrovsk Oblast, Donetsk Oblast, southern Kharkiv Oblast, northern Chernihiv Oblast, and possibly Poltava Oblast.",
      "timestamp": "2025-09-15T04:53:21.061413Z"
    },
    {
      "original": "Zaporizhzhia City is under heavy MLRS shelling. At least 15 explosions have been heard.",
      "timestamp": "2025-09-15T04:53:21.061416Z"
    },
    {
      "original": "The Ukrainian GUR published footage showing an FPV drone from their UAV unit striking a Russian Buk-M3 medium-range air defence system near the village of Oleksandrivka, Zaporizhzhia Oblast.",
      "timestamp": "2025-09-15T04:53:21.061419Z"
    },
    {
      "original": "Zaporizhzhia City is under heavy MLRS shelling. At least 15 explosions have been heard.",
      "timestamp": "2025-09-15T04:53:21.061422Z"
    },
    {
      "original": "Fires are now burning in the southern outskirts of Zaporizhzhia City after it was hit by 15 rockets.",
      "timestamp": "2025-09-15T04:53:21.061425Z"
    },
    {
      "original": "Fires are now burning in the southern outskirts of Zaporizhzhia City after it was hit by 15 rockets.",
      "timestamp": "2025-09-15T04:53:21.061429Z"
    },
    {
      "original": "Around 98% of Ukrainian long-range UAVs get shot down by Russian air defence / EW. Ukraine often launches hundreds at a time just for a couple to get through. \nThe drones that do get through (usually only 1 or 2 each day), and that hit refineries do minor damage as evidenced by footage and satellite imagery, due to how refineries are built, and the drones' small warheads. \nThe damage done is then repaired within months due to how robust refineries are. This leads to only a temporary loss. \nMeanwhile, the figures on Russian refining capabilities always get skewed to show total amount per refinery (per year), and not what is actually lost... which is only part of the refining capabilities for part of a year.\nAt the same time, everyone seems to be ignoring the hundreds of Russian Geran-2 drone STRIKES (not launches, strikes) per week that are hitting targets of military significance and contributing massively to the overall war of attrition.\nBut don't worry... just 50 more days and Russia will collapse.",
      "timestamp": "2025-09-15T04:53:21.061436Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Drone Attacks and Railway Sabotage\nThe overall ratio of attacking fixed-wing UAVs between Russian and Ukrainian forces last night favored Ukraine, with 80 Ukrainian UAVs shot down over Russia (plus 44 UAVs during the day) compared to 58 Geran/Herber UAVs and 1 Iskander-M missile (targeting Dnipropetrovsk region) launched at Ukraine.\nWhile Kyiv is focused on massive strikes on border areas and sabotage on railway lines, Russian forces during this period are concentrating on precision strikes against military targets—primarily temporary deployment points of the Armed Forces of Ukraine and positions of drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-15T04:53:21.550708Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Drone Attacks and Railway Sabotage\nThe overall ratio of attacking fixed-wing UAVs between Russian and Ukrainian forces last night favored Ukraine, with 80 Ukrainian UAVs shot down over Russia (plus 44 UAVs during the day) compared to 58 Geran/Herber UAVs and 1 Iskander-M missile (targeting Dnipropetrovsk region) launched at Ukraine.\nWhile Kyiv is focused on massive strikes on border areas and sabotage on railway lines, Russian forces during this period are concentrating on precision strikes against military targets—primarily temporary deployment points of the Armed Forces of Ukraine and positions of drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-15T04:53:21.550721Z"
    },
    {
      "original": "U.S. Guardsmen Raided Venezuelan Vessel \nVenezuela has accused the United States of illegally boarding one of its fishing vessels in the country’s special economic zone.\nTensions between the two countries have been mounting since last month when the administration of President Donald Trump doubled the reward for the arrest of Venezuelan President Maduro to $50 million on drug trafficking charges then deployed a large naval force with more than 4,000 troops close to the country’s shores on a so-called “counter narco-terror operation”.\nIn a statement released on September 13, Venezuela’s Ministry of Foreign Affairs said a vessel with nine “humble” and “harmless” fishermen was intercepted by the USS Jason Dunham, an Arleigh Burke-class guided missile destroyer, a day earlier.\nRead more \nHERE",
      "timestamp": "2025-09-15T04:53:21.550730Z"
    },
    {
      "original": "Military Situation In Israel-Palestine On September 14, 2025 (Map Update)",
      "timestamp": "2025-09-15T04:53:21.550734Z"
    },
    {
      "original": "Israeli Strikes Knock Down More Towers In Gaza \nThe Israeli Defense Forces (IDF) struck three tall multi-story in Gaza City on September 14, as it prepared to completely occupy the area.\nThe first to go down was Kawthar tower, in the Tel al-Hawa neighborhood. The tower was flattened to the ground by multiple strikes in the morning, around an hour after an IDF warning. There were no reports of casualties. According to the IDF, Hamas had placed surveillance equipment in that building to track troop movements in the area, in order to plan attacks.\nLater in the afternoon, the Mahna Tower in Tel al-Hawa was struck, also following an IDF evacuation warning. Shortly afterward, Israel destroyed the al-Munawwarah City building on the Islamic University of Gaza campus. Casualties were reported after the strike on Mahana tower.\nRead more \nHERE",
      "timestamp": "2025-09-15T04:53:21.550742Z"
    },
    {
      "original": "Israeli Strikes Knock Down More Towers In Gaza \nThe Israeli Defense Forces (IDF) struck three tall multi-story in Gaza City on September 14, as it prepared to completely occupy the area.\nThe first to go down was Kawthar tower, in the Tel al-Hawa neighborhood. The tower was flattened to the ground by multiple strikes in the morning, around an hour after an IDF warning. There were no reports of casualties. According to the IDF, Hamas had placed surveillance equipment in that building to track troop movements in the area, in order to plan attacks.\nLater in the afternoon, the Mahna Tower in Tel al-Hawa was struck, also following an IDF evacuation warning. Shortly afterward, Israel destroyed the al-Munawwarah City building on the Islamic University of Gaza campus. Casualties were reported after the strike on Mahana tower.\nRead more \nHERE",
      "timestamp": "2025-09-15T04:53:21.550750Z"
    },
    {
      "original": "Military Situation In Ukraine On September 14, 2025 (Maps Update)",
      "timestamp": "2025-09-15T04:53:21.550754Z"
    },
    {
      "original": "Military Situation In Ukraine On September 14, 2025 (Maps Update)",
      "timestamp": "2025-09-15T04:53:21.550758Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 14, 2025\nOn September 14, multiple videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-15T04:53:21.550766Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 14, 2025\nOn September 14, multiple videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-15T04:53:21.550773Z"
    }
  ],
  "script_run_time": "2025-09-15T04:53:21.551235Z"
}