{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-30T13:56:23.472156Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2025-12-30T13:56:23.472181Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-30T13:56:23.472193Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2025-12-30T13:56:23.472199Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Чорноморське.\n🛵\n Декілька груп БпЛА маневрують в акваторії Чорного моря.",
      "timestamp": "2025-12-30T13:56:23.472211Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-30T13:56:23.472219Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-30T13:56:23.472228Z"
    },
    {
      "original": "Ракета через Миколаївщину!",
      "timestamp": "2025-12-30T13:56:23.472232Z"
    },
    {
      "original": "Ракета через Миколаївщину!",
      "timestamp": "2025-12-30T13:56:23.472236Z"
    },
    {
      "original": "Курсом на Баштанку!",
      "timestamp": "2025-12-30T13:56:23.472241Z"
    },
    {
      "original": "Курсом на Баштанку!",
      "timestamp": "2025-12-30T13:56:23.472245Z"
    },
    {
      "original": "Повз Баштанку \n➡️\n у напрямку Кіровоградщини!",
      "timestamp": "2025-12-30T13:56:23.472253Z"
    },
    {
      "original": "Повз Баштанку \n➡️\n у напрямку Кіровоградщини!",
      "timestamp": "2025-12-30T13:56:23.472260Z"
    },
    {
      "original": "Ракета через Кіровоградщину \n➡️\n курсом на Умань (Черкащина)!",
      "timestamp": "2025-12-30T13:56:23.472266Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА через Золочів та Люботин.",
      "timestamp": "2025-12-30T13:56:23.472272Z"
    },
    {
      "original": "🛵\n Запорізька область: група БпЛА \n➡️\n у напрямку Марганця.\n🛵\n Харківщина: БпЛА \n➡️\n повз Валки та Краснопавлівку.\n🛵\n Одещина: БпЛА \n➡️\n із акваторії Чорного моря у напрямку Овідіополя/Чорноморська.",
      "timestamp": "2025-12-30T13:56:23.472292Z"
    },
    {
      "original": "🛵\n Запорізька область: група БпЛА \n➡️\n у напрямку Марганця. \n🛵\n Харківщина: БпЛА \n➡️\n повз Валки та Краснопавлівку. \n🛵\n Одещина: БпЛА \n➡️\n із акваторії Чорного моря у напрямку Овідіополя/Чорноморська.",
      "timestamp": "2025-12-30T13:56:23.472311Z"
    },
    {
      "original": "🛵\n Запорізька область: БпЛА \n➡️\n у напрямку Запоріжжя. \n🛵\n Дніпропетровщина: БпЛА \n➡️\n курсом на Нікополь.\n🛵\n Чернігівщина: БпЛА повз Седнів\n➡️\n на Чернігів.",
      "timestamp": "2025-12-30T13:56:23.472328Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів!",
      "timestamp": "2025-12-30T13:56:23.472334Z"
    },
    {
      "original": "🛵\n БпЛА на/повз Кривий Ріг зі сходу!",
      "timestamp": "2025-12-30T13:56:23.472343Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря на Чорноморськ.",
      "timestamp": "2025-12-30T13:56:23.472348Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку міста Запоріжжя з півдня.",
      "timestamp": "2025-12-30T13:56:23.472354Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-30T13:56:23.472362Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря у напрямку н.п. Чорноморськ/Овідіополь.",
      "timestamp": "2025-12-30T13:56:23.472369Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-30T13:56:23.472376Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-30T13:56:23.472383Z"
    },
    {
      "original": "New footage shows Russian drones carrying out deep strikes on Ukrainian targets.\nThe video shows the following being hit:\n- P-19 radar\n- 19Zh6 radar\n- 79K6 Pelican radar\n- Zoopark-3 radar\n- P-18 radar\n- An-26 cargo plane\n- Mi-24 helicopter (apparently a decoy)\n- 2 dry cargo ships",
      "timestamp": "2025-12-30T13:56:24.007061Z"
    },
    {
      "original": "I personally don't believe there was any drone attack attempts on Putin's presidential palace.\nThe Russian MOD claims that they shot down 91 (!) UAVs in Novgorod Oblast flying towards the presidential palace in the region. Not a single Russian monitoring channel reported on any UAV detections in the region during the day, despite their coverage reflecting Russian MOD interception statistics on other regions. \nTo me, this seems like an attempt at further portraying Ukraine as unwilling to negotiate while not having to carry out any false flag themselves. This kind of activity should be expected from both sides, so as usual, don't believe everything you see at face value.",
      "timestamp": "2025-12-30T13:56:24.007080Z"
    },
    {
      "original": "I personally don't believe there was any drone attack attempts on Putin's presidential palace.  The Russian MOD claims that they shot down 91 (!) UAVs in Novgorod Oblast flying towards the presidential palace in the region. Not a single Russian monitoring…",
      "timestamp": "2025-12-30T13:56:24.007085Z"
    },
    {
      "original": "Those who blindly trust the Russian MOD are as dumb and naive as NAFOids trusting everything that comes from the Ukrainian general staff.",
      "timestamp": "2025-12-30T13:56:24.007089Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-30T13:56:24.007093Z"
    },
    {
      "original": "No large attack tonight.\nThe highest threat is in place for tomorrow, meaning the probability of strategic bombers being used has increased.\nNothing is definite at the moment as some unusual Russian movements have taken place.",
      "timestamp": "2025-12-30T13:56:24.007099Z"
    },
    {
      "original": "No large attack tonight.  The highest threat is in place for tomorrow, meaning the probability of strategic bombers being used has increased.  Nothing is definite at the moment as some unusual Russian movements have taken place.",
      "timestamp": "2025-12-30T13:56:24.007109Z"
    },
    {
      "original": "It could also be on new years. It's just too difficult to tell right now. I will update you all when I get more concrete information.",
      "timestamp": "2025-12-30T13:56:24.007113Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to advance and have made new progress in two different areas.\nIn the west, Russian forces continued to advance north through Prymorske. They were able to consolidate in new positions in the southern part of the village, including in a number of three-story buildings. DRGs continued to operate further north in the area of the village centre, and reached its northern streets, while others infiltrated further east through the Pererva Gulley\nIn the east, Russian forces continued to expand their zone of control northeast of Stepnohirsk, capturing new positions in the treelines west of the gulley leading from Stepnohirsk. Other forces infiltrated further into Lukyanivske, and are engaged in fighting for the residential part of the village. Fighting also continues for the central and northern parts of Stepnohirsk, where a grey-zone remains.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007124Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance following the fall of Hulyaipole and have made new progress south of the city.\nUkrainian forces have completed their withdrawal from the 2022-era fortifications east of the highway due to the risk of encirclement from the recent Russian advances in Hulyaipole. This allowed for the Russians to capture the remaining stretch of highway between Hulyaipole and Dorozhynyanka. Other assault groups advanced further southwest down the nearby gulley, capturing additional treeline positions.\n+ ~2.31 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007132Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced in various different areas.\nIn the southwest, the frontline was corrected in favour of Ukraine after they carried out additional counterattacks around two weeks ago. They advanced east from the area of the pig farms, recapturing the rest of the road the Hryshyne, and consolidating in the treeline to the north. From there, they recaptured the forested areas on either side of the highway, including the intersection northwest of Svitle.\nTo the northeast, Russian forces continued their assault operations in Rodynske. They were able to recapture School No. 35 and some of the nearby 3-story buildings and are now assaulting Ukrainian positions in the remaining buildings to the west. Fighting continues for the northern low-rise residential area, where small assault groups from both sides are currently operating, and in the southwestern streets of the city.\nIn the northeast, Russian forces continued pushing the Ukrainians back from the rear of Rodynske. They advanced from their newly recaptured positions at the  Krasnolymanskaya Mine, consolidating in the nearby treeline and forested areas. Small groups of infantry are now attempting to advance across the fields and reach the railway line. Additionally, the Russians managed to advance further north up the forests northeast of the mine, recapturing the mine shaft and the surrounding areas following a Ukrainian withdrawal back to the village of Sukhetske. \n+ ~3.71 km² in favour of Ukraine.\n+ ~3.12 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007142Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance, capturing new positions in two differenat areas southwest of Siversk,\nIn the north, Russian forces continued to advance in the village of Riznykivka. They pushed further west down the southern bank of the Sukha River, capturing new positions in the direction of the central part of the village.\nIn the south, Russian forces captured the rest of a treeline and an adjacent forest west of Zvanivka, thereby fully aligning the front with the gulley stretching southwest from Riznykivka.\n+ ~1.69 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007150Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance southeast of Lyman and have made new progress in the village of Dibrova.\nRussian forces resumed their assault operations from northern Dibrova and captured new positions in the nearby forests. From there, they entered the western streets of the main part of the village, capturing new positions there too. Other forces advanced west from the eastern streets, securing the central part. Fighting is ongoing for the southwestern streets. \n+ ~0.75 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007157Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.\n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.\n📝\nRussian authorities claim 91 drones were intercepted on their way to the state residence.",
      "timestamp": "2025-12-30T13:56:24.007170Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.  \n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.  \n📝\nRussian…",
      "timestamp": "2025-12-30T13:56:24.007179Z"
    },
    {
      "original": "Shocker",
      "timestamp": "2025-12-30T13:56:24.007183Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have captured new positions northeast of Svyatohirsk.\nBuilding on their earlier success, Russian forces advanced further through the Sviati Hory National Park, capturing additional positions further southwest in the direction of the Sosnove - Oleksandrivka. DRGs have since infiltrated through the forests into the area of the Sosnove Railway Station.\n+ ~1.38 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007190Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks and have made additional progress in western Kupyansk.\nFollowing the capture of the Kupyansk Motor Transport College, Ukrainian forces began attacking northwest through the low-rise residential streets in the grey-zone. Other forces who were already advancing southeast from the highway linked up with them, physically encircling the remaining Russian formations entrenched in and around the Yuvileynyi high-rise micro-district. \n+ ~0.27 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007197Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made more progress south of Varachyne.\nFollowing earlier assaults which saw Russia capture Varachyne and the defences south of the village, they continued advancing south, capturing additional treeline positions. Other assault groups advanced further south down the gulley to the east, capturing new positions in the forests there. \nUkrainian forces are responding by heavily striking Russian logistical routes to the Yablunivka - Varachyne sector with FPV drones. As a result of this and somewhat clearer weather conditions at times, Russian movement to and from positions is becoming much more difficult. A significant portion of supplies are now being carried by drone drops. \n+ ~1.35 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-30T13:56:24.007204Z"
    },
    {
      "original": "Iskander on Kharkiv OBlast",
      "timestamp": "2025-12-30T13:56:24.007208Z"
    },
    {
      "original": "Iskander on Kharkiv OBlast",
      "timestamp": "2025-12-30T13:56:24.007211Z"
    },
    {
      "original": "Explosion in Kharkiv",
      "timestamp": "2025-12-30T13:56:24.007214Z"
    },
    {
      "original": "Iskander on Odesa from Crimea",
      "timestamp": "2025-12-30T13:56:24.007217Z"
    },
    {
      "original": "Explosion in Odesa",
      "timestamp": "2025-12-30T13:56:24.007221Z"
    },
    {
      "original": "Around an hour and a half ago, two Russian KAB glide-bombs impacted the southern suburbs of Zaporizhzhia City. \nOne civilian was wounded. No further details are known at this moment.",
      "timestamp": "2025-12-30T13:56:24.007225Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604246Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604264Z"
    },
    {
      "original": "'Fog Of War': Russian Army Advances In Lyman As Ukraine Takes More Losses \nIn the Lyman sector, Russian units captured several strongpoints around Hrekivka and took control of a small forested area. \nAdvances were also noted along the tree lines on the approaches to Korovyi Yar. In the Pokrovsk sector, the left flank of the group is advancing towards Dobropillia in the Hrishyne area and on the approaches to Serhiivka. In the Slaviansk sector, units advanced up to four kilometers in the Zakotne area, capturing territory north of the Siverskyi Donets River and the eastern part of the settlement. They simultaneously repelled mechanized counterattacks in the Sviato-Pokrovske area. \nFormer Polish Minister of Foreign Affairs Jacek Czaputowicz believes that Russian President Vladimir Putin will ultimately win the Ukrainian conflict.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604273Z"
    },
    {
      "original": "'Fog Of War': Russian Army Advances In Lyman As Ukraine Takes More Losses \nIn the Lyman sector, Russian units captured several strongpoints around Hrekivka and took control of a small forested area. \nAdvances were also noted along the tree lines on the approaches to Korovyi Yar. In the Pokrovsk sector, the left flank of the group is advancing towards Dobropillia in the Hrishyne area and on the approaches to Serhiivka. In the Slaviansk sector, units advanced up to four kilometers in the Zakotne area, capturing territory north of the Siverskyi Donets River and the eastern part of the settlement. They simultaneously repelled mechanized counterattacks in the Sviato-Pokrovske area. \nFormer Polish Minister of Foreign Affairs Jacek Czaputowicz believes that Russian President Vladimir Putin will ultimately win the Ukrainian conflict.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604282Z"
    },
    {
      "original": "No Retreat Order, No Evacuation: How The Ukrainian Command Abandoned Its Soldiers In Myrnohrad\nThe other day, Russian armed forces announced the complete establishment of control over the city of Myrnohrad on the Pokrovsk direction. Under conditions of complete encirclement, the remnants of Ukrainian subunits, having not received evacuation from their command, made contact with Russian forces and surrendered in an organized manner. Testimonies from a number of detained Armed Forces of Ukraine (AFU) servicemen paint a picture of heavy losses, logistical collapse, and a loss of control in this sector of the front.\nThus, soldiers from various AFU brigades—including Roman Prystupa, Valeriy Yasinsky, Hennadiy Antonenko, Ivan Kucera, and Mykhailo Hamarnyk—stated in joint testimony:\n\"We were in Myrnohrad. Constant shelling. In general, everything is fucked. We had heavy losses. We had to pull back to the city center. We all sat together from different units in one common basement of a house.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604292Z"
    },
    {
      "original": "No Retreat Order, No Evacuation: How The Ukrainian Command Abandoned Its Soldiers In Myrnohrad\nThe other day, Russian armed forces announced the complete establishment of control over the city of Myrnohrad on the Pokrovsk direction. Under conditions of complete encirclement, the remnants of Ukrainian subunits, having not received evacuation from their command, made contact with Russian forces and surrendered in an organized manner. Testimonies from a number of detained Armed Forces of Ukraine (AFU) servicemen paint a picture of heavy losses, logistical collapse, and a loss of control in this sector of the front.\nThus, soldiers from various AFU brigades—including Roman Prystupa, Valeriy Yasinsky, Hennadiy Antonenko, Ivan Kucera, and Mykhailo Hamarnyk—stated in joint testimony:\n\"We were in Myrnohrad. Constant shelling. In general, everything is fucked. We had heavy losses. We had to pull back to the city center. We all sat together from different units in one common basement of a house.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604302Z"
    },
    {
      "original": "Energy Strikes: Summary Of Russian Combat Footage From December 29, 2025\nOn December 29, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-30T13:56:24.604309Z"
    },
    {
      "original": "Energy Strikes: Summary Of Russian Combat Footage From December 29, 2025\nOn December 29, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-30T13:56:24.604316Z"
    },
    {
      "original": "Trump Gives Israel Greenlight To Attack Iran Again \nUnited States President Donald Trump said on December 29 that he would back a new Israeli attack on Iran if the latter “will continue with missiles”.\nStanding next to Prime Minister Benjamin Netanyahu at the Mar-a-Lago Club in Florida, Trump answered “yes” when asked about the matter.\nIf Iran continued its nuclear program, he said he would back an attack “fast,” adding “One would be yes, absolutely, the other was, we’ll do it immediately.”\nTrump’s remarks were expected. The last few weeks saw the release of several reports by Hebrew, Western and even Persian pro-opposition media focused on Iran’s attempt to rebuild and expand its missile program. This campaign was clearly launched to justify an escalation by Israel.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604325Z"
    },
    {
      "original": "Saudi Arabia Bombs Emirati Arms In Yemen, Gives UAE 24 Hours To Withdraw From Country (Video)\nSaudi Arabia has bombed an arms shipment sent by the United Arab Emirates to Yemen, and issued a warning to Abu Dhabi giving it 24 hours to completely withdraw from the country, ending an alliance that was forged around a decade ago.\nTensions began in Yemen earlier in the month, when the UAE-backed Southern Transitional Council (STC) launched a military operation across the south of the country, beginning in Hadhramaut, which was then under the control of the government of Yemen allied to Saudi Arabia.\nThe kingdom first took action on December 26, conducting a few airstrikes on STC positions in Wadi Nahb in Hadhramaut.\nWith political efforts to solve the issue with the UAE failing, the Saudi-led Arab Coalition struck on December 30 foreign military support at Mukalla port.\nSaudi Arabia urged the UAE to comply with Yemen’s request to withdraw its forces from Yemeni territories within 24 hours.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604334Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – December 30, 2025",
      "timestamp": "2025-12-30T13:56:24.604338Z"
    },
    {
      "original": "Chinese Drones Film Taiwan’s 'Taipei 101' Tower During Large-Scale Drills Around Island  \nThe Eastern Theater Command of the Chinese People's Liberation Army (PLA) on December 29 released drone footage of Taiwan’s Taipei 101, taken during the ongoing \"Justice Mission 2025\" drills.\nThe footage was included in a short video titled \"So Near, So Beautiful — Anytime to Taipei\" that was posted by the command on its official Sina Weibo account. Beside Taipei 101, the video also shows aircraft and naval vessels taking part in the large-scale drills off the shores of the island.\nChina Military Bugle, the official English-speaking press account of the PLA, later posted on X another video showing a TB-001A combat drone providing an aerial view of Taipei 101.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604346Z"
    },
    {
      "original": "Chinese Drones Film Taiwan’s 'Taipei 101' Tower During Large-Scale Drills Around Island  \nThe Eastern Theater Command of the Chinese People's Liberation Army (PLA) on December 29 released drone footage of Taiwan’s Taipei 101, taken during the ongoing \"Justice Mission 2025\" drills.\nThe footage was included in a short video titled \"So Near, So Beautiful — Anytime to Taipei\" that was posted by the command on its official Sina Weibo account. Beside Taipei 101, the video also shows aircraft and naval vessels taking part in the large-scale drills off the shores of the island.\nChina Military Bugle, the official English-speaking press account of the PLA, later posted on X another video showing a TB-001A combat drone providing an aerial view of Taipei 101.\nRead more \nHERE",
      "timestamp": "2025-12-30T13:56:24.604354Z"
    }
  ],
  "script_run_time": "2025-12-30T13:56:24.605205Z"
}