{
  "messages": [
    {
      "original": "🚀\nШвидкісна ціль на Харків!",
      "timestamp": "2026-01-15T19:05:37.599058Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харків!",
      "timestamp": "2026-01-15T19:05:37.599074Z"
    },
    {
      "original": "🚀\nЩе ціль на Харків!",
      "timestamp": "2026-01-15T19:05:37.599080Z"
    },
    {
      "original": "🛵\n  Група ударних БпЛА на Запоріжжі (район Томаківка), курс на північний захід",
      "timestamp": "2026-01-15T19:05:37.599088Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА \n➡️\n на Кривий Ріг!",
      "timestamp": "2026-01-15T19:05:37.599094Z"
    },
    {
      "original": "🛵\n  Швидкісний БпЛА на півночі Київщини!",
      "timestamp": "2026-01-15T19:05:37.599099Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n в напрямку Києва!",
      "timestamp": "2026-01-15T19:05:37.599105Z"
    },
    {
      "original": "🛵\n Житомирщина: БпЛА з півночі \n➡️\n курсом на Народичі.",
      "timestamp": "2026-01-15T19:05:37.599111Z"
    },
    {
      "original": "🛵\n  Швидкісний БпЛА на півночі Київщини!",
      "timestamp": "2026-01-15T19:05:37.599115Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n в напрямку Броварів.",
      "timestamp": "2026-01-15T19:05:37.599121Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА \n➡️\n на Харків.",
      "timestamp": "2026-01-15T19:05:37.599127Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину та Запоріжжя.",
      "timestamp": "2026-01-15T19:05:37.599132Z"
    },
    {
      "original": "🛵\n Чернігівщина - БпЛА повз н.п. Сновськ, в південному напрямку.",
      "timestamp": "2026-01-15T19:05:37.599137Z"
    },
    {
      "original": "🛵\n Запорізька область - БпЛА повз Комишуваху в західному напрямку.",
      "timestamp": "2026-01-15T19:05:37.599141Z"
    },
    {
      "original": "🛸\n В Чорному морі поблизу Одещини розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-15T19:05:37.599146Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжі \n➡️\n курсом на Дніпропетровщину (н.п. Марганець)",
      "timestamp": "2026-01-15T19:05:37.599152Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, повз Десну \n➡️\n курсом на Київщину.",
      "timestamp": "2026-01-15T19:05:37.599158Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Рожни.",
      "timestamp": "2026-01-15T19:05:37.599174Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Рожни.",
      "timestamp": "2026-01-15T19:05:37.599179Z"
    },
    {
      "original": "🛵\n продовжує рух в напрямку Києва.",
      "timestamp": "2026-01-15T19:05:37.599185Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Вишгород з півночі.",
      "timestamp": "2026-01-15T19:05:37.599190Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Жуляни з півночі.",
      "timestamp": "2026-01-15T19:05:37.599195Z"
    },
    {
      "original": "🛵\n Сумщина - ворожі БпЛА на сході",
      "timestamp": "2026-01-15T19:05:37.599199Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Жуляни з півночі.",
      "timestamp": "2026-01-15T19:05:37.599205Z"
    },
    {
      "original": "🛵\n БпЛА із Київщини \n➡️\n у напрямку Житомирщини, курсом на Овруч.",
      "timestamp": "2026-01-15T19:05:37.599211Z"
    },
    {
      "original": "🛵\n  Запоріжжя - БпЛА на Вільнянськ\n🛵\n Дніпропетровщина - Марганець, Нікополь.",
      "timestamp": "2026-01-15T19:05:37.599217Z"
    },
    {
      "original": "At least two Russian Iskander-M ballistic missiles impacted the suburbs of Mykolaiv City.  Repeated launches from Crimea are reported.",
      "timestamp": "2026-01-15T19:05:38.126691Z"
    },
    {
      "original": "A large fire is seen burning at the impact site.",
      "timestamp": "2026-01-15T19:05:38.126703Z"
    },
    {
      "original": "Russian forces have captured the village of Komarivka, Hlukhiv direction, Sumy Oblast.\nPre-war population: ~116.\nTotal land area: ~1.22 km².\nThe fighting for Komarivka lasted approximately 18 days.",
      "timestamp": "2026-01-15T19:05:38.126710Z"
    },
    {
      "original": "Kh-59/69 cruise missile to Konotop, Sumy Oblast.",
      "timestamp": "2026-01-15T19:05:38.126713Z"
    },
    {
      "original": "Kh-59/69 cruise missile to Konotop, Sumy Oblast.",
      "timestamp": "2026-01-15T19:05:38.126717Z"
    },
    {
      "original": "The missile disappeared east of Konotop. It was launched from a Su-57 in eastern Kursk Oblast.",
      "timestamp": "2026-01-15T19:05:38.126720Z"
    },
    {
      "original": "Iskander from Feodosia, Crimea, to Odesa",
      "timestamp": "2026-01-15T19:05:38.126724Z"
    },
    {
      "original": "Iskander from Feodosia, Crimea, to Odesa",
      "timestamp": "2026-01-15T19:05:38.126730Z"
    },
    {
      "original": "Explosion in Odesa",
      "timestamp": "2026-01-15T19:05:38.126733Z"
    },
    {
      "original": "Explosion in Odesa",
      "timestamp": "2026-01-15T19:05:38.126737Z"
    },
    {
      "original": "It impacted in Chornomorsk, just south of Odesa",
      "timestamp": "2026-01-15T19:05:38.126740Z"
    },
    {
      "original": "The impact took place in the area of the Chornomorsk Port. Smoke is seen rising.",
      "timestamp": "2026-01-15T19:05:38.126743Z"
    },
    {
      "original": "Russian forces have captured the village of Prylipka, Bilyi Kolodyaz direction, Kharkiv Oblast.\nPre-war population: ~100.\nTotal land area: ~0.32 km².\nThe fighting for Prylipka lasted approximately 40 days.",
      "timestamp": "2026-01-15T19:05:38.126750Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their offensive operations, making further significant progress in the direction of the Konka River.\nOver the last 10 days, Russian forces have been advancing towards the village of Novoyakovlivka. They first improved their positions in the treelines southeast of Lukyanivske, and once that village fell, they were able to penetrate further northeast up a gulley, reaching Novoyakovlivka. From there, they were able to enter the western streets of the settlement, where fighting is now ongoing.\nOnce this spearhead had formed, efforts were quickly made to strengthen its flanks. Russian assault groups advanced east along the treelines on the tactical heights from the newly captured Lukyanivske, establishing control over new positions southwest and west of Novoyakovlivka. Infiltrations are now being carried out into the neighbouring village of Novoboikivske, as well as into the village of Pavlivka, to the south of Novoyakovlivka, after new positions were captured west of the settlement. \n+ ~7.97 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-15T19:05:38.126758Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.\nCurrently I'm trying to determine some additional info about movements, so I will make a follow up post with more details when some things clear up.",
      "timestamp": "2026-01-15T19:05:38.126762Z"
    },
    {
      "original": "Kharkiv City / surroundings is currently under attack from Tornado-S rockets. They seem to be impacting the Pisochyn area, just west of the city. This is where the TEC-5 Combined Heat and Power Plant is.",
      "timestamp": "2026-01-15T19:05:38.126765Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance north of Pokrovsk, capturing new positions towards the rear of Rodynske.\nAfter regaining the initiative once again and recapturing a number of previously lost areas, Russian forces continued pushing north from Pokrovsk. They were able to cross the road to Hryshyne at another point, capturing the second pig farm complex and securing positions in the adjacent treelines. From there, assault groups advanced further north, reaching the former \"Zaporozhskaya\" Mine from the south, which DRGs earlier infiltrated from Rodynske. \nAs a result of these advances, the remaining Ukrainian formations in southwestern Rodynske withdrew to avoid being encircled, allowing the Russians to regain control over those streets and shift the fighting back to the northwestern part of the city. Russian forces also recaptured a number of positions along the highway between Rodynske and Pokrovsk, as well as the ruins of the pig farm complex there. \n+ ~7.80 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-15T19:05:38.126774Z"
    },
    {
      "original": "Kharkiv City / surroundings is currently under attack from Tornado-S rockets. They seem to be impacting the Pisochyn area, just west of the city. This is where the TEC-5 Combined Heat and Power Plant is.",
      "timestamp": "2026-01-15T19:05:38.126777Z"
    },
    {
      "original": "At least six strikes with Tornado-S rockets have been carried out on the TEC-6 Combined Heat and Power Plant in Kharkiv City so far.",
      "timestamp": "2026-01-15T19:05:38.126782Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.  Currently I'm trying to determine some additional info about movements, so I will make a follow up post with…",
      "timestamp": "2026-01-15T19:05:38.126786Z"
    },
    {
      "original": "There are also reports that Russia is preparing to use an Oreshnik IRBM during the weekend. \nIn my opinion, this is being mixed up with a potential threat for Iskander-I launches (Iskander-M with a 1,000 km range).",
      "timestamp": "2026-01-15T19:05:38.126790Z"
    },
    {
      "original": "In the Druzhkivka direction, Russian forces continued to advance northeast of Sofiivka, capturing positions in the direction of a number of Ukrainian stronghold settlements.\nAfter making progress northeast of Sofiivka, Russian forces continued to build on their success, advancing up four parallel treelines and entrenching along a perpendicular treeline further north. Additionally, Russian DRGs managed to cross the Poltavka River and enter the village of Novopavlivka.\n+ ~0.92 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-15T19:05:38.126796Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, making significant progress in developing their offensive.\nFollowing at least a week infiltrations, Russian forces managed to consolidate in the southern part of Illinka and in the forested gulley to the south. This allowed for DRGs to infiltrate even deeper, entering the low-rise residential parts of southwestern Kostyantynivka for the first time, and reaching areas further north in the direction of northwestern Kostyantynivka.\nAdditionally, Russian forces managed to clear out the rest of the pocket northeast of Yablunivka, where they captured a number of strongpoints in the forests there, and also improved their positions in the treelines in the direction of Berestok. This forced most of the remaining Ukrainian formations to withdraw from the forests north of the Kleban-Bykske reservoir, with those last positions now fully in the grey-zone. \n+ ~9.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-15T19:05:38.126803Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\n Footage of the Israeli airstrikes targeting the town of Shamar in western Bekaa.\n@wfwitness",
      "timestamp": "2026-01-15T19:05:38.126810Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\n Footage of the Israeli airstrikes targeting the town of Shamar in western Bekaa.\n@wfwitness",
      "timestamp": "2026-01-15T19:05:38.126817Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.  Currently I'm trying to determine some additional info about movements, so I will make a follow up post with…",
      "timestamp": "2026-01-15T19:05:38.126821Z"
    },
    {
      "original": "There is information about the possibility of an attack tonight, but this seems highly unlikely to me.\nRussian strategic aviation doesn't seem to have completed it's preparations yet, and there isn't any activity on combat frequencies yet. I will continue to monitor and update if anything changes.",
      "timestamp": "2026-01-15T19:05:38.126827Z"
    },
    {
      "original": "'Prava Molod' And the Battle for Young Minds: Creating Ukraine's Ideological Cannon Fodder\nUkrainian youth organizations are involved in matters far beyond the realm of childhood. The Right Sector prepares its own reinforcements from a young age. Young people raised the right way justify the existence of the Kyiv regime.\nThe battle for minds in Ukraine is now in full swing. The authorities, their supposed opposition, and even common sense are all trying to pull the country's most valuable resource to their side. That resource is the younger generation. Young minds are not fully developed, making them more susceptible to outside influences than other social groups. They are more likely to become radicalized, act rashly, and perform incredible feats. What seeds are planted in their minds determines the outcome. Neo-Nazi groups in Ukraine are not averse to taking advantage of this.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698615Z"
    },
    {
      "original": "'Prava Molod' And the Battle for Young Minds: Creating Ukraine's Ideological Cannon Fodder\nUkrainian youth organizations are involved in matters far beyond the realm of childhood. The Right Sector prepares its own reinforcements from a young age. Young people raised the right way justify the existence of the Kyiv regime.\nThe battle for minds in Ukraine is now in full swing. The authorities, their supposed opposition, and even common sense are all trying to pull the country's most valuable resource to their side. That resource is the younger generation. Young minds are not fully developed, making them more susceptible to outside influences than other social groups. They are more likely to become radicalized, act rashly, and perform incredible feats. What seeds are planted in their minds determines the outcome. Neo-Nazi groups in Ukraine are not averse to taking advantage of this.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698630Z"
    },
    {
      "original": "Russia Armed Brand New Geran-4 Jet-Powered Drone With Air-To-Air Missile (Photos)\nThe existence of an interceptor version of Russia’s latest Geran-4 jet-powered drone armed with an R-60M short-range air-to-air missile has been confirmed.\nThe presence of the Geran-4 itself was revealed very recently by Ukraine’s Main Intelligence Directorate, more known by its acronym GUR.\nThe Geran-4 was described as a deeply upgraded version of the Geran-3, which is alleged to be a copy of the Iranian Shahed-238 jet-powered drone. The drone maintains the overall delta-wing design, but with better aerodynamic and stealth features. It is also equipped with a more powerful jet engine – allegedly a copy of the Chinese Telefly TF-TJ1600A-.\nThe drone could reportedly reach speeds between 350 and 500 kilometers per hour, and has an effective range of 850 kilometers.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698641Z"
    },
    {
      "original": "Russia Armed Brand New Geran-4 Jet-Powered Drone With Air-To-Air Missile (Photos)\nThe existence of an interceptor version of Russia’s latest Geran-4 jet-powered drone armed with an R-60M short-range air-to-air missile has been confirmed.\nThe presence of the Geran-4 itself was revealed very recently by Ukraine’s Main Intelligence Directorate, more known by its acronym GUR.\nThe Geran-4 was described as a deeply upgraded version of the Geran-3, which is alleged to be a copy of the Iranian Shahed-238 jet-powered drone. The drone maintains the overall delta-wing design, but with better aerodynamic and stealth features. It is also equipped with a more powerful jet engine – allegedly a copy of the Chinese Telefly TF-TJ1600A-.\nThe drone could reportedly reach speeds between 350 and 500 kilometers per hour, and has an effective range of 850 kilometers.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698650Z"
    },
    {
      "original": "Assault Contracts: What Polymarket Predicts About the Capture of Ukrainian Cities in 2026\nAs of January of 2026, the Polymarket prediction market remains a key informal indicator of expectations regarding the development of the Russian army’s offensive. Its contracts focus on several hot spots, where traders place bets on the timing of the capture of specific cities. Trading is most active for key locations such as Kostyantynivka, where there is ongoing heavy urban fighting, and Orikhiv, to whose distant approaches Russian troops have successfully advanced.\nHowever, the market clearly shows operational difficulties. A notable example is the situation near Kupyansk, where the Ukrainian Armed Forces launched a large-scale counteroffensive in late December, pushing Russian forces back from part of the right bank of the city. This event undoubtedly adjusted forecasts and timelines, making the capture of the entire city unlikely in the next month. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698659Z"
    },
    {
      "original": "Trump May Be About To Trick Iran Once Again\nUnited States President Donald Trump has backed down from earlier threats to attack Iran over violence against protests, as the Islamic Republic confirmed that it won’t be carrying out any executions.\nTrump has repeatedly threatened Iran since the start of the month, vowing to hold the government there accountable if protesters are killed. Reports from Iranian monitoring groups and officials from the country suggest that over 2,000 people, including both protesters and security personnel, have been killed so far.\nThe surprise shift came amid heightened tensions overnight, with the U.S. evacuating key bases in the Middle East and Iran closing its air base amid reports suggesting that an attack on the Islamic Republic was imminent.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698667Z"
    },
    {
      "original": "A Security Time Bomb: Brazil's Ukraine Veterans Could Shift the Criminal Balance\nToday, at least 500 Brazilian mercenaries are fighting in the Ukrainian army, and about 90 of them have been identified. Some of them will be fortunate enough to survive a conflict of this intensity. But what will happen to them when the war ends?\nMany of the survivors will most likely return home. This greatly concerns the Brazilian government. The question of whose side people with vast military experience will take remains unanswered. State security forces cannot offer the level of monetary compensation that mercenaries received in Ukraine. The nature of the human psyche makes it difficult to return to a previous standard of living after experiencing wealth. However, there will be those willing to pay a good salary for valuable combat experience. These are various criminal groups and drug cartels.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698676Z"
    },
    {
      "original": "A Security Time Bomb: Brazil's Ukraine Veterans Could Shift the Criminal Balance\nToday, at least 500 Brazilian mercenaries are fighting in the Ukrainian army, and about 90 of them have been identified. Some of them will be fortunate enough to survive a conflict of this intensity. But what will happen to them when the war ends?\nMany of the survivors will most likely return home. This greatly concerns the Brazilian government. The question of whose side people with vast military experience will take remains unanswered. State security forces cannot offer the level of monetary compensation that mercenaries received in Ukraine. The nature of the human psyche makes it difficult to return to a previous standard of living after experiencing wealth. However, there will be those willing to pay a good salary for valuable combat experience. These are various criminal groups and drug cartels.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698684Z"
    },
    {
      "original": "Russian Army Make New Breakthroughs South And North Of Krasny Liman (Videos)\nOn January 15, the Russian military expanded its control to the south of Krasny Liman, after breaking through another Ukrainian line of defenses, all while expanding its control to the north of the key city in Donetsk.\nThe Zapad [West] Group of Forces stormed Ozerne, located some 25 kilometers to the south of Krasn Liman. Russian troops managed to capture most of the settlement’s center, and made gains in its western outskirts, securing more than 2,3 square kilometers in their initial push.\nThe troops later advanced into the southern part of Ozerne, bringing most of the settlement under their control without facing any real resistance from Kiev forces.\nThe Zapad Group of Forces has been also expanding its control to the north of Krasny Liman, in a bid to further strangle the logistics of Kiev forces.\nRead more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698693Z"
    },
    {
      "original": "Russian Army Make New Breakthroughs South And North Of Krasny Liman (Videos)\nOn January 15, the Russian military expanded its control to the south of Krasny Liman, after breaking through another Ukrainian line of defenses, all while expanding its control to the north of the key city in Donetsk.\nThe Zapad [West] Group of Forces stormed Ozerne, located some 25 kilometers to the south of Krasn Liman. Russian troops managed to capture most of the settlement’s center, and made gains in its western outskirts, securing more than 2,3 square kilometers in their initial push.\nThe troops later advanced into the southern part of Ozerne, bringing most of the settlement under their control without facing any real resistance from Kiev forces.\nThe Zapad Group of Forces has been also expanding its control to the north of Krasny Liman, in a bid to further strangle the logistics of Kiev forces.\nRead more \nHERE",
      "timestamp": "2026-01-15T19:05:38.698702Z"
    },
    {
      "original": "Military Situation In Ukraine On January 15, 2026 (Maps Update)",
      "timestamp": "2026-01-15T19:05:38.698706Z"
    },
    {
      "original": "Military Situation In Ukraine On January 15, 2026 (Maps Update)",
      "timestamp": "2026-01-15T19:05:38.698711Z"
    }
  ],
  "script_run_time": "2026-01-15T19:05:38.699441Z"
}