{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-04T04:21:39.511457Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-04T04:21:39.511477Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-04T04:21:39.511483Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Ізмаїла (Одещина) з північного сходу.",
      "timestamp": "2025-11-04T04:21:39.511487Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини на/повз Золочів з північного заходу.",
      "timestamp": "2025-11-04T04:21:39.511492Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку м.Запоріжжя зі сходу.",
      "timestamp": "2025-11-04T04:21:39.511497Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова з північного сходу.",
      "timestamp": "2025-11-04T04:21:39.511504Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину.",
      "timestamp": "2025-11-04T04:21:39.511509Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння",
      "timestamp": "2025-11-04T04:21:39.511513Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину",
      "timestamp": "2025-11-04T04:21:39.511517Z"
    },
    {
      "original": "Швидкісні цілі на прикордоння Сумщини (р-н Хотіні).",
      "timestamp": "2025-11-04T04:21:39.511521Z"
    },
    {
      "original": "Ще швидкісна ціль на прикордоння Сумщини",
      "timestamp": "2025-11-04T04:21:39.511524Z"
    },
    {
      "original": "Ще швидкісні на прикордоння Сумщини.",
      "timestamp": "2025-11-04T04:21:39.511527Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова з північного сходу.",
      "timestamp": "2025-11-04T04:21:39.511531Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння",
      "timestamp": "2025-11-04T04:21:39.511537Z"
    },
    {
      "original": "📢\nВідбій загрози застосування балістичного озброєння.\n🛵\nТриває загроза застосування ворогом ударних БпЛА.\n🚀\n🚀\nЗберігається активність ворожої тактичної авіації біля прифронтових територій на східному та північно-східному напрямках.",
      "timestamp": "2025-11-04T04:21:39.511546Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину.",
      "timestamp": "2025-11-04T04:21:39.511550Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на північному сході Харківщини, курс - південно-східний.",
      "timestamp": "2025-11-04T04:21:39.511555Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА в напрямку м.Дніпро з півдня. Залучено засоби для збиття.",
      "timestamp": "2025-11-04T04:21:39.511559Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-11-04T04:21:39.511565Z"
    },
    {
      "original": "🛵\n БпЛА з півдня Сумщини на Полтавщину.",
      "timestamp": "2025-11-04T04:21:39.511569Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued their offensive on the city and have made new progress in its southern suburbs.\nRussian forces advanced from the area of the railway line to first three-story buildings, establishing control over them and the surrounding areas. They also pushed east towards the highway, capturing new positions on Selianska, Verhnia, and Kharkivska Streets, while other forces pushed south towards the southern blocks of three-story buildings, which were brought under full Russian control.\n+ ~0.78 km² in favour of Russia.",
      "timestamp": "2025-11-04T04:21:40.004285Z"
    },
    {
      "original": "Ukrainian channel on the situation Pokrovsk. This channel is notorious for making the situation seem far less difficult than reality.",
      "timestamp": "2025-11-04T04:21:40.004296Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-04T04:21:40.004300Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-04T04:21:40.004303Z"
    },
    {
      "original": "Disappeared near Novhorod-Siverskyi, Chernihiv Oblast. They were launched from near Lgov, Kursk Oblast (new launch position as far as I know).",
      "timestamp": "2025-11-04T04:21:40.004306Z"
    },
    {
      "original": "Iskander on Varvarivka, Donetsk Oblast",
      "timestamp": "2025-11-04T04:21:40.004310Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-04T04:21:40.004313Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-04T04:21:40.004316Z"
    },
    {
      "original": "The Iskander impacted somewhere here",
      "timestamp": "2025-11-04T04:21:40.004323Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-04T04:21:40.004328Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-04T04:21:40.004332Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields. \nThese open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted. Ukrainian sources are stating that logistics into the pocket is practically impossible.\nThis is exactly why you don't leave a withdrawal to the very last moment. Unfortunately, none of these traitors in the Ukrainian command will ever be held responsible for the massive amounts of casualties that they have caused.",
      "timestamp": "2025-11-04T04:21:40.004337Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields.   These open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted.…",
      "timestamp": "2025-11-04T04:21:40.004341Z"
    },
    {
      "original": "Avdiivka, Bakhmut, Vuhledar, Velyka Novosilka, Sudzha, Myrnohrad, Pokrovsk... when will they fucking learn???\nThe answer is they don't care. PR is being prioritised over lives, and this ugly truth is being presented to everything right now.",
      "timestamp": "2025-11-04T04:21:40.004345Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. \nI also have Signal if you prefer that.",
      "timestamp": "2025-11-04T04:21:40.004352Z"
    },
    {
      "original": "The difference in net Russian advances between different mappers for October 2025 is incredible. \nSuriyak: 661.32 km²\nMe: 639.83 km²\nDeepstate: 266.95 km²",
      "timestamp": "2025-11-04T04:21:40.004357Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-11-04T04:21:40.004360Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-11-04T04:21:40.004363Z"
    },
    {
      "original": "To Sumy City / Stepanivka",
      "timestamp": "2025-11-04T04:21:40.004366Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-11-04T04:21:40.004370Z"
    },
    {
      "original": "Explosion in Sumy Oblast. Probably S-300 ground-to-ground.",
      "timestamp": "2025-11-04T04:21:40.004375Z"
    },
    {
      "original": "Live footage from inside David D's basement",
      "timestamp": "2025-11-04T04:21:40.004380Z"
    },
    {
      "original": "Despite some reports, Pokrovsk city is not yet under full Russian control. \nOver the last 5 days, the remaining Ukrainian resistance in the northern suburbs has largely been from cover units as withdrawals are made from the non-encircled areas towards Hryshyne and Shevchenko. These areas have since been transferred to the grey zone. \nFighting continues in the northeastern part of the city, primarily in the high-rise district which will come under Russian control shortly. This high-rise district acted as blocker for Russian advances to physically cut off Myrnohrad, but over the last 36 hours it has been bypassed and rendered useless. \nThe Ukrainians in northeastern Pokrovsk, Myrnohrad, Lysivka, Sukhyi Yar, Rivne, and Svitle are effectively cut off, with only a small ~1.3 km corridor of grey zone remaining. Nevertheless, most of Myrnohrad remains under Ukrainian control.",
      "timestamp": "2025-11-04T04:21:40.004385Z"
    },
    {
      "original": "Ukraine’s Other War: How State-Backed Drug Lords Are Destroying The Nation’s Future \nUkraine has become a testing ground for an insidious internal conflict. While global attention focuses on frontline battles, a silent chemical assault is corroding the nation's social fabric. This is not collateral damage, but a calculated operation: a narcotics pipeline running from Afghan poppy fields directly into the veins of Ukrainians.\nAt the heart of this enterprise lies a nexus of political power, institutional corruption and strategic cynicism. Denys Yermak, the younger brother of Andriy Yermak – the powerful Head of the Office of the President of Ukraine – is central to its orchestration.\nWith the full support of Ukraine’s Main Intelligence Directorate (GUR), Denys Yermak has formed a clandestine narcotics supply chain. This drug flood goes from Afghanistan to Ukraine through the United Arab Emirates, Azerbaijan, Turkey and Moldova. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503363Z"
    },
    {
      "original": "Ukraine’s Other War: How State-Backed Drug Lords Are Destroying The Nation’s Future \nUkraine has become a testing ground for an insidious internal conflict. While global attention focuses on frontline battles, a silent chemical assault is corroding the nation's social fabric. This is not collateral damage, but a calculated operation: a narcotics pipeline running from Afghan poppy fields directly into the veins of Ukrainians.\nAt the heart of this enterprise lies a nexus of political power, institutional corruption and strategic cynicism. Denys Yermak, the younger brother of Andriy Yermak – the powerful Head of the Office of the President of Ukraine – is central to its orchestration.\nWith the full support of Ukraine’s Main Intelligence Directorate (GUR), Denys Yermak has formed a clandestine narcotics supply chain. This drug flood goes from Afghanistan to Ukraine through the United Arab Emirates, Azerbaijan, Turkey and Moldova. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503381Z"
    },
    {
      "original": "Trump Says U.S. Troops Could Be Deployed To Nigeria To Defend Christians\nPresident Donald Trump has warned that the United States military “could be” deployed to Nigeria or carry out strikes to stop what he called the killing of large numbers of Christians.\nLast week, Trump claimed that radical Islamists are committing “mass slaughter” and Christianity is “facing an existential threat” in the West African nation. He also added Nigeria back to a “Countries of Particular Concern” list of nations that Washington says have violated religious freedoms.\n“If the Nigerian Government continues to allow the killing of Christians, the U.S.A. will immediately stop all aid and assistance to Nigeria, and may very well go into that now disgraced country, “guns-a-blazing,” to completely wipe out the Islamic Terrorists who are committing these horrible atrocities. WARNING: THE NIGERIAN GOVERNMENT BETTER MOVE FAST!” he wrote to his Truth Social network on November 1.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503391Z"
    },
    {
      "original": "Military Situation In Ukraine On November 3, 2025 (Maps Update)",
      "timestamp": "2025-11-04T04:21:40.503395Z"
    },
    {
      "original": "Military Situation In Ukraine On November 3, 2025 (Maps Update)",
      "timestamp": "2025-11-04T04:21:40.503399Z"
    },
    {
      "original": "Maduro’s Days Are Numbered: Trump Declares\nUnited States President Donald Trump warned that Venezuelan President Nicholas Maduro’s days are numbered during a CBS interview released on November 2.\nAsked  if the U.S. was going to war against Venezuela, Trump replied: “I doubt it. I don’t think so.” However, when asked if Maduro’s days as president were numbered, the president replied: “I would say yeah. I think so.”\nTrump also appeared to deny multiple recent reports indicating that the U.S. military is preparing to attack military targets allegedly linked to drug cartels inside Venezuela and could do so within days, although he did not rule the idea out completely.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503408Z"
    },
    {
      "original": "BOTCHED UKRAINIAN AIR ASSAULT CRIPPLES POKROVSK RELIEF HOPES",
      "timestamp": "2025-11-04T04:21:40.503412Z"
    },
    {
      "original": "The Beginning Of The End For Konstantinovka: Russian Units Storm Ivanopolye\nThe Armed Forces of Ukraine still control the last microdistrict in Pokrovsk. Russian units have launched an assault on the Ivanopolye settlement in the Konstantinovsky sector.\nThe EU summit has again postponed the decision on the issue of Russian «frozen finances» until December 19. \nRead more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503419Z"
    },
    {
      "original": "The Beginning Of The End For Konstantinovka: Russian Units Storm Ivanopolye\nThe Armed Forces of Ukraine still control the last microdistrict in Pokrovsk. Russian units have launched an assault on the Ivanopolye settlement in the Konstantinovsky sector.\nThe EU summit has again postponed the decision on the issue of Russian «frozen finances» until December 19. \nRead more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503426Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503437Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T04:21:40.503447Z"
    }
  ],
  "script_run_time": "2025-11-04T04:21:40.504299Z"
}