{
  "messages": [
    {
      "original": "🚀\n Балістика з Брянська!",
      "timestamp": "2026-01-20T04:15:00.590946Z"
    },
    {
      "original": "В повітрі МіГ-31, Ймовірність застосування \"Кинджалів\"",
      "timestamp": "2026-01-20T04:15:00.590963Z"
    },
    {
      "original": "Вінниця балістика!",
      "timestamp": "2026-01-20T04:15:00.590967Z"
    },
    {
      "original": "🛵\n Фіксується рух ворожих ударних БпЛА на Харківщині, Дніпропетровщині, Сумщині та Чернігівщині! Працює протиповітряна оборона!",
      "timestamp": "2026-01-20T04:15:00.590973Z"
    },
    {
      "original": "🛵\n Кілька БпЛА в бік Дніпра з півдня!",
      "timestamp": "2026-01-20T04:15:00.590978Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА увійшли в Харківську, Сумську та Чернігівську області, декілька безпілотників на півдні від міста Запоріжжя!",
      "timestamp": "2026-01-20T04:15:00.590983Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину!",
      "timestamp": "2026-01-20T04:15:00.590988Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА  над Київським водосховищем у бік Вишгорода!",
      "timestamp": "2026-01-20T04:15:00.590993Z"
    },
    {
      "original": "✈\n Виліт Ту-95МС з Оленьї!\nМожливі пуски крилатих ракет повітряного базування ближче до 6.00! \n🚨\n У разі оголошення тривоги дотримуйтесь правил безпеки.\nПовітряні Сили в готовності до відбиття  удару противника!",
      "timestamp": "2026-01-20T04:15:00.591003Z"
    },
    {
      "original": "🛵\n Наразі основна мас ворожих ударних БпЛА - в Чернігівській обл. Фіксується понад 20 ворожих дронів. Йде бойова робота!",
      "timestamp": "2026-01-20T04:15:00.591008Z"
    },
    {
      "original": "🚀\n Пуски КАБ на  Запоріжжі.",
      "timestamp": "2026-01-20T04:15:00.591013Z"
    },
    {
      "original": "🛵\n  Нова група БпЛА на Чернігівщині \n➡️\n південно-західним курсом.\n🛵\n  Група БпЛА на Київщину (н.п. Баришівка) з Чернігівщини.\n🛵\n БпЛА курсом на Житомирщину - з Київщини.",
      "timestamp": "2026-01-20T04:15:00.591022Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину!",
      "timestamp": "2026-01-20T04:15:00.591027Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА в напрямку н.п Обухів, Вишгород.",
      "timestamp": "2026-01-20T04:15:00.591035Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на околицях м. Дніпро.",
      "timestamp": "2026-01-20T04:15:00.591040Z"
    },
    {
      "original": "🛵\n Житомирщина - БпЛА на Коростень.\n🛵\n Київщина - БпЛА на Васильків, Іванків, Макарів.",
      "timestamp": "2026-01-20T04:15:00.591046Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на півночі Сумщини та Чернігівщини \n➡️\n в південно-західному напрямку.",
      "timestamp": "2026-01-20T04:15:00.591052Z"
    },
    {
      "original": "🛵\n Київщина - БпЛА на Калинівку.",
      "timestamp": "2026-01-20T04:15:00.591056Z"
    },
    {
      "original": "🛵\n Київщина - група БпЛА на півночі - курсом на Житомирщину.",
      "timestamp": "2026-01-20T04:15:00.591061Z"
    },
    {
      "original": "🛵\n Чернігівщина:\n- БпЛА повз Короп курсом на Борзну.\n- Група БпЛА на півночі - курс на Любеч, Ріпки, Славутич.\n🛵\n Житомирщина:\n- БпЛА на Малин, Головине, Бучмани.\n🛵\n Сумщина:\n- БпЛА на Путивль, Степаніку.",
      "timestamp": "2026-01-20T04:15:00.591071Z"
    },
    {
      "original": "Large numbers of Russian Geran-2 and Gerbera drones are arriving at various airbases in preparation for large attacks on Ukraine.\n- Several IL-76MD cargo planes landed at Baltimore Airbase, Voronezh Oblast, with drones being delivered to launch sites (presumably including Tsumublova Testing Ground, Oryol Oblast) via rail.\n- An IL-76MD landed at Shatalovo Airbase, Smolensk Obalst, delivering drones to the launch site there.\n- An IL-76MD landed at Hvardiiske Airbase, Crimea, delivering drones to the launch site there.",
      "timestamp": "2026-01-20T04:15:01.396691Z"
    },
    {
      "original": "An IL-76MD cargo plane landed at Akhtubinsk Airbase, Astrakhan Oblast during the day.\nThe cargo presumably consists of Kh-59/69 cruise missiles for the Su-57 fighters stationed there.",
      "timestamp": "2026-01-20T04:15:01.396704Z"
    },
    {
      "original": "Explosions in Dnipro. Cause unknown, possibly a missile. There was also an explosion in Zaporizhzhia.\nClarifying.",
      "timestamp": "2026-01-20T04:15:01.396709Z"
    },
    {
      "original": "Explosions in Dnipro. Cause unknown, possibly a missile. There was also an explosion in Zaporizhzhia.  Clarifying.",
      "timestamp": "2026-01-20T04:15:01.396713Z"
    },
    {
      "original": "Zaporizhzhia City is being targeted by Tornado-S rockets equipped with cluster warheads, which were launched from the Tokmak area of Zaporizhzhia Oblast. At least three impacts have been recorded, 2 of which struck the southern part of the city while the third hit the southern outskirts/nearby settlements. A Russian reconnaissance drone is operating in the area, adjusting the strikes.\nThe explosion heard in Dnipro is from a Geran-2 drone strike on the Stara Ihren District in the southeastern part of the city. Several more drones are now flying in.",
      "timestamp": "2026-01-20T04:15:01.396717Z"
    },
    {
      "original": "A bunch of Ukrainian accounts are fabricating a Ukrainian HIMARS attack on a substation in Donetsk City.\nThis has not happened, and the photos being spread are old and unrelated. As of now, only UAVs have attacked the city.",
      "timestamp": "2026-01-20T04:15:01.396722Z"
    },
    {
      "original": "Russia's Rubicon unit has published new footage showing a series of drone strikes on rear Ukrainian targets.\nTargets hit include:\n- A 19Zh6 radar + a trailer in Mykolaiv Oblast (47.07939, 32.09680), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.40642, 35.73496), ~63 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.42119, 35.82679), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.80733, 35.38527), ~114 km from the frontline.\n- A P-18 radar in Dnipropetrovsk Oblast (48.81586, 35.75437), ~101 km from the frontline.\n- A P-18MU radar + a truck in Mykolaiv Oblast (46.97961, 31.70417), ~47 km from the frontline.\n- Command and control vehicle for a P-18MA radar in Mykolaiv Oblast (47.22859, 32.542), ~63 km from the frontline.\n- Command and control vehicle for a 36D6 radar in Odesa Oblast (46.60873, 30.91776), ~45 km from the frontline.\n- A 36D6 radar in Kharkiv Oblast (49.40271, 36.61234), ~75 km from the frontline.\n- A Buk Surface-to-air missile system in Dnipropetrovsk Oblast (48.3567, 36.24613), ~38 km from the frontline.\n- 4 strikes on the \"Hirnyk\" 35 kV electrical substation in Donetsk Oblast (48.58938, 37.48830), ~8 km from the frontline.",
      "timestamp": "2026-01-20T04:15:01.396735Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-20T04:15:01.396738Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-20T04:15:01.396742Z"
    },
    {
      "original": "Disappeared near Zolochiv, Kharkiv Oblast.",
      "timestamp": "2026-01-20T04:15:01.396745Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-20T04:15:01.396749Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-20T04:15:01.396756Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-20T04:15:01.396759Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-20T04:15:01.396765Z"
    },
    {
      "original": "Another explosion in Zolochiv, impacting the same target.",
      "timestamp": "2026-01-20T04:15:01.396768Z"
    },
    {
      "original": "Four Russian Tornado-S rockets impacted the \"Kharkivska\" 330 kV electrical substation in the Slobidskyi District of Kharkiv City. Strong explosions were heard and a large fire subsequently broke out.\nCoordinates: 49.961754, 36.280484",
      "timestamp": "2026-01-20T04:15:01.396773Z"
    },
    {
      "original": "Four Russian Tornado-S rockets impacted the \"Kharkivska\" 330 kV electrical substation in the Slobidskyi District of Kharkiv City. Strong explosions were heard and a large fire subsequently broke out.\nCoordinates: 49.961754, 36.280484",
      "timestamp": "2026-01-20T04:15:01.396777Z"
    },
    {
      "original": "DTEK, Ukraine's largest private investor in the energy sector, published photos claiming to show damage to a substation in Odesa City following Russian Geran-2 drone strikes overnight. \nHowever, the photos turned out to be edited screenshots from an older video of theirs showing damage to the Artsyz substation in Artsyz, Odesa Oblast, after it was attacked by missiles and drones on December 18, 2025. \nGeran strikes were indeed carried out on energy infrastructure in Odesa City last night, but these images do not show the damage from this.",
      "timestamp": "2026-01-20T04:15:01.396782Z"
    },
    {
      "original": "Overnight, a Russian Geran-2 drone struck the railway bridge in the town of Vasylkivka, Dnipropetrovsk Oblast.\nThe drone was equipped with a phosphorus warhead, which resulted in a fire breaking out that burned for over 3 hours, melting the metal of the bridge.\nSince then, at least 2 more Geran strikes have been carried out on a different target in Vasylkivka. \nBridge coordinates: 48.20796, 36.00145",
      "timestamp": "2026-01-20T04:15:01.396790Z"
    },
    {
      "original": "Another large-scale combined Russian missile and drone attack is underway on Ukraine.\nSo far, at least 18 Iskander-M ballistic missiles have been used, with around 15 targeting energy infrastructure in Kyiv and 3 targeting Dnipro. \n~11 (!) Iskanders were shot down in three waves near Kyiv due to new patriot deliveries. 2 impacted the CHP-6 power plant, 2 impacted CHP-4 power plant. \nAll the Iskanders that targeted Dnipro impacted their targets. \nAdditionally, 2 Iskander-I ballistic missiles (Iskander-M with a 1,000 km range) launched from near Novorossiysk, Krasnodar Krai, impacted a target southeast of Vinnytsia City, Vinnytsia Oblast. \nAs for strategic aviation, at least 4 Tu-95MS strategic bombers are airborne from Olenya Airbase, Murmansk Oblast, flying to their launch lines in Engels District, Saratov Oblast, where they will likely launch Kh-101 cruise missiles in the next 2.5 hours. \n2-3 Buyan-M corvettes from Kaspiysk Naval Base are equipped with Kalibr cruise missiles in the Caspian Sea. They may launch missiles later on too. \nI likely wont cover the rest of this attack today as I will be busy for most of the time, but I aim to post a full summary + the consequences afterwards.",
      "timestamp": "2026-01-20T04:15:01.396799Z"
    },
    {
      "original": "Another large-scale combined Russian missile and drone attack is underway on Ukraine.  So far, at least 18 Iskander-M ballistic missiles have been used, with around 15 targeting energy infrastructure in Kyiv and 3 targeting Dnipro.   ~11 (!) Iskanders were…",
      "timestamp": "2026-01-20T04:15:01.396803Z"
    },
    {
      "original": "Footage showing a portion of the Patriot activity against Russian Iskander-M ballistic missiles over Kyiv overnight. \nThese videos are recorded from the same location. Clip 1 shows an attack on the CHP-4 power plant in southeastern Kyiv, and clip 2 shows an attack on the CHP-5 power plant.\nApproximately 11 Iskander-Ms were shot down, with around 4 impacts being recorded to CHP-4 and CHP-6 power plants. \nVideo credit: \nIntel Cams | OSINT",
      "timestamp": "2026-01-20T04:15:01.396810Z"
    },
    {
      "original": "Footage showing a portion of the Patriot activity against Russian Iskander-M ballistic missiles over Kyiv overnight. \nThese videos are recorded from the same location. Clip 1 shows an attack on the CHP-4 power plant in southeastern Kyiv, and clip 2 shows an attack on the CHP-5 power plant.\nApproximately 11 Iskander-Ms were shot down, with around 4 impacts being recorded to CHP-4 and CHP-6 power plants. \nVideo credit: \nIntel Cams | OSINT",
      "timestamp": "2026-01-20T04:15:01.396816Z"
    },
    {
      "original": "At least 7 Tu-95MS strategic bombers carried out launch maneuvers in Vologda Oblast around 30 minutes ago. These launches were likely simulated, and real ones are expected from either Saratov or Volgograd Oblasts.",
      "timestamp": "2026-01-20T04:15:01.396819Z"
    },
    {
      "original": "Russian Army Advances Near Kostiantynivka And Approaches Orikhiv (Videos)\nOn January 19, the Russian military advanced near the city of Kostiantynivka in Donetsk and approached the city of Orikhiv in Zaporizhzhia.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Novopavlovka, which is located to the northwest of Kostiantynivka, according to the Russian Ministry of Defense. The capture of the settlement marked the first Russian push in this area in a long time.\nMeanwhile far to the west in Zaporizhzhia, the Russian MoD reported that the Vostok [East] Group of Forces had captured Pavlivka, which was located to the east of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241916Z"
    },
    {
      "original": "Russian Army Advances Near Kostiantynivka And Approaches Orikhiv (Videos)\nOn January 19, the Russian military advanced near the city of Kostiantynivka in Donetsk and approached the city of Orikhiv in Zaporizhzhia.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Novopavlovka, which is located to the northwest of Kostiantynivka, according to the Russian Ministry of Defense. The capture of the settlement marked the first Russian push in this area in a long time.\nMeanwhile far to the west in Zaporizhzhia, the Russian MoD reported that the Vostok [East] Group of Forces had captured Pavlivka, which was located to the east of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241934Z"
    },
    {
      "original": "Energy Crisis in Ukraine: Awaiting a New Massive Russian Strike\nUkrainian monitoring resources are recording signs that Russia is preparing a missile strike within the next 48 hours. According to their data, bombers are being redeployed from distant bases to operational airfields for combat sorties. The country's leadership has been expecting a massive air raid on the energy system for several nights, one capable of finishing it off amidst peak frosts and provoking a humanitarian crisis. However, the anticipated strike has not yet occurred, although tension is mounting.\nIt is reported that Ukraine's energy system is in a state of deep crisis: generation is now primarily reliant on nuclear power plants, as there are no other types of power plants that have not been targeted by attacks. Strikes on energy and logistics create a cumulative effect, undermining defensive capabilities. According to \"Ukrenergo\" data from January 19, the average availability of electricity across Ukraine is 9 hours per day (37.3%), with the worst indicators in Poltava Oblast (20.8%) and the best in Kyiv Oblast (62.5%). The weekly average is 10.2 hours (42.4%).\n👉\n Read more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241944Z"
    },
    {
      "original": "Energy Crisis in Ukraine: Awaiting a New Massive Russian Strike\nUkrainian monitoring resources are recording signs that Russia is preparing a missile strike within the next 48 hours. According to their data, bombers are being redeployed from distant bases to operational airfields for combat sorties. The country's leadership has been expecting a massive air raid on the energy system for several nights, one capable of finishing it off amidst peak frosts and provoking a humanitarian crisis. However, the anticipated strike has not yet occurred, although tension is mounting.\nIt is reported that Ukraine's energy system is in a state of deep crisis: generation is now primarily reliant on nuclear power plants, as there are no other types of power plants that have not been targeted by attacks. Strikes on energy and logistics create a cumulative effect, undermining defensive capabilities. According to \"Ukrenergo\" data from January 19, the average availability of electricity across Ukraine is 9 hours per day (37.3%), with the worst indicators in Poltava Oblast (20.8%) and the best in Kyiv Oblast (62.5%). The weekly average is 10.2 hours (42.4%).\n👉\n Read more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241954Z"
    },
    {
      "original": "FROM BLACKOUTS TO BREAKTHROUGHS: RUSSIA INTENSIFIES OFFENSIVE AS KYIV'S GRID COLLAPSES",
      "timestamp": "2026-01-20T04:15:02.241958Z"
    },
    {
      "original": "Syrian Government Expands Control In Kurdish Al-Hasakah As Deal With SDF Collapses (Videos)\nThe forces of the Syrian Transitional Government (STG) on January 19 consolidated their control over one of the largest towns in the southern al-Haskaah countryside, and began advancing in the northern countryside of the Kurdish-majority governorate amid reports suggesting that the merger agreement reached with the Syrian Democratic Forces (SDF) has collapsed. \nThe state-run SANA news agency, citing a military source, confirmed that government forces took over the town of al-Shaddadi, and released footage from the town.\nEarlier, the SDF said that its fighters lost control of a prison near the town with thousands of ISIS detainees. The STG accused the group of releasing the detainees and said that it directed its forces to secure the prison and recapture anyone who escaped. However, the group released videos confirming that it was government forces that let the detainees out. \nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241967Z"
    },
    {
      "original": "Syrian Government Expands Control In Kurdish Al-Hasakah As Deal With SDF Collapses (Videos)\nThe forces of the Syrian Transitional Government (STG) on January 19 consolidated their control over one of the largest towns in the southern al-Haskaah countryside, and began advancing in the northern countryside of the Kurdish-majority governorate amid reports suggesting that the merger agreement reached with the Syrian Democratic Forces (SDF) has collapsed. \nThe state-run SANA news agency, citing a military source, confirmed that government forces took over the town of al-Shaddadi, and released footage from the town.\nEarlier, the SDF said that its fighters lost control of a prison near the town with thousands of ISIS detainees. The STG accused the group of releasing the detainees and said that it directed its forces to secure the prison and recapture anyone who escaped. However, the group released videos confirming that it was government forces that let the detainees out. \nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241976Z"
    },
    {
      "original": "From Zakotnoye To Prishib: Russia Develops Attack In Krasnolimansk, Move To Blockade Ukrainian Forces \nIn the Krasnolimansk area, Russian \"West\" Grouping units have advanced along the Siverskyi Donets River and are fighting counterbattles on the southern outskirts of Krasny Liman. In the Kupiansk area, intense fighting continues in the city, and Ukrainian forces are attempting to break through the defenses from Kondrashovka and Radkovka.\nIn the Stepovoye–Mali Shcherbaky sector of Zaporizhzhia , Russian air-assault units have resumed their offensive, clearing destroyed settlements and forest belts amid active drone counteraction. In the Sumy and Kharkiv areas, Russian assault groups have advanced 700 and 650 meters, respectively. The Ukrainian command in the Kharkiv area is having difficulty using foreign mercenaries.\nHungarian Prime Minister Viktor Orbán has expressed skepticism about the possible deployment of European peacekeeping forces to Ukraine in the future.\nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241985Z"
    },
    {
      "original": "From Zakotnoye To Prishib: Russia Develops Attack In Krasnolimansk, Move To Blockade Ukrainian Forces \nIn the Krasnolimansk area, Russian \"West\" Grouping units have advanced along the Siverskyi Donets River and are fighting counterbattles on the southern outskirts of Krasny Liman. In the Kupiansk area, intense fighting continues in the city, and Ukrainian forces are attempting to break through the defenses from Kondrashovka and Radkovka.\nIn the Stepovoye–Mali Shcherbaky sector of Zaporizhzhia , Russian air-assault units have resumed their offensive, clearing destroyed settlements and forest belts amid active drone counteraction. In the Sumy and Kharkiv areas, Russian assault groups have advanced 700 and 650 meters, respectively. The Ukrainian command in the Kharkiv area is having difficulty using foreign mercenaries.\nHungarian Prime Minister Viktor Orbán has expressed skepticism about the possible deployment of European peacekeeping forces to Ukraine in the future.\nRead more \nHERE",
      "timestamp": "2026-01-20T04:15:02.241994Z"
    }
  ],
  "script_run_time": "2026-01-20T04:15:02.242863Z"
}