{
  "messages": [
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини. \n🛵\n Харківщина: БпЛА \n➡️\n в районі Краснокутська.",
      "timestamp": "2025-12-10T09:52:40.873644Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Охтирку.\n🛵\n Харківщина: БпЛА \n➡️\n у бік Берестина/ Слобожанського.",
      "timestamp": "2025-12-10T09:52:40.873667Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Охтирку. \n🛵\n Харківщина: БпЛА \n➡️\n у бік Берестина/ Слобожанського.",
      "timestamp": "2025-12-10T09:52:40.873681Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Слобожанського, Балаклії, Шевченкового.",
      "timestamp": "2025-12-10T09:52:40.873688Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Слобожанського, Балаклії, Шевченкового.",
      "timestamp": "2025-12-10T09:52:40.873694Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини \n➡️\n у напрямку Павлограда та Дніпра.",
      "timestamp": "2025-12-10T09:52:40.873700Z"
    },
    {
      "original": "🛵\n Декілька груп ударних БпЛА через Херсонщину \n➡️\n у бік Миколаївщини.",
      "timestamp": "2025-12-10T09:52:40.873707Z"
    },
    {
      "original": "🛵\n Декілька груп ударних БпЛА через Херсонщину \n➡️\n у бік Миколаївщини.",
      "timestamp": "2025-12-10T09:52:40.873713Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Херсонщини \n➡️\n в акваторію Чорного моря.",
      "timestamp": "2025-12-10T09:52:40.873719Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Херсонщини \n➡️\n в акваторію Чорного моря.",
      "timestamp": "2025-12-10T09:52:40.873725Z"
    },
    {
      "original": "🛵\n БпЛА із Чорного моря \n➡️\n на Одещину (Південне) та Миколаївщину ( у бік Березанки).",
      "timestamp": "2025-12-10T09:52:40.873733Z"
    },
    {
      "original": "🛵\n БпЛА із Чорного моря \n➡️\n на Одещину (Південне) та Миколаївщину ( у бік Березанки).",
      "timestamp": "2025-12-10T09:52:40.873738Z"
    },
    {
      "original": "🛵\n Групи БпЛА \n➡️\n вздовж межі Миколаївщини та Одещини, курс північний.",
      "timestamp": "2025-12-10T09:52:40.873743Z"
    },
    {
      "original": "🛵\n Групи БпЛА \n➡️\n вздовж межі Миколаївщини та Одещини, курс північний.",
      "timestamp": "2025-12-10T09:52:40.873749Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Ананьїв.\n🛵\n Групи БпЛА маневрують поблизу Тендрівської коси.",
      "timestamp": "2025-12-10T09:52:40.873756Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Ананьїв. \n🛵\n Групи БпЛА маневрують поблизу Тендрівської коси.",
      "timestamp": "2025-12-10T09:52:40.873763Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n курсом на Одесу/Чорноморське.",
      "timestamp": "2025-12-10T09:52:40.873768Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n курсом на Одесу/Чорноморське.",
      "timestamp": "2025-12-10T09:52:40.873774Z"
    },
    {
      "original": "🛵\n Одещина: групи БпЛА \n➡️\n повз Іванівку на північ.",
      "timestamp": "2025-12-10T09:52:40.873779Z"
    },
    {
      "original": "🛵\n Чернігів - БпЛА у напрямку міста!",
      "timestamp": "2025-12-10T09:52:40.873784Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Запорізької області курсом на Дніпропетровщину (Синельниківський район).",
      "timestamp": "2025-12-10T09:52:40.873788Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-10T09:52:40.873792Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-12-10T09:52:40.873796Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-12-10T09:52:40.873809Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-10T09:52:40.873813Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-10T09:52:40.873817Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини на Сумщину (Конотопський район).\n🛵\n БпЛА на межі Дніпропетровщини та Донеччини.",
      "timestamp": "2025-12-10T09:52:40.873822Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 50 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 10 грудня (з 18.00 09 грудня) противник атакував 80-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Приморсько-Ахтарськ, Міллєрово– рф., Чауда - ТОТ АР Криму, близько 50 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 50 ворожих БпЛА типу Shahed, Гербера і дрони інших типів на півдні та сході країни.\nЗафіксовано влучання 29 ударних БпЛА на 7 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-10T09:52:40.873840Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-12-10T09:52:40.873844Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщині.",
      "timestamp": "2025-12-10T09:52:40.873848Z"
    },
    {
      "original": "In the Siversk and Lyman directions, Russian forces continued their assault operations and have made significant progress over the last week. \nIn the southeast, Russian forces managed to consolidate in most of the high-rise buildings of northeastern Siversk. From there, they advanced southwest and captured the railway station, while other forces advanced west to the city centre. \nAdditionally, Russian forces eliminated the pocket to the southeast of Siversk, and in coordination with attacks from the southern outskirts, established control over the southeastern part of the city, largely levelling the frontline along the railway line. Ukrainian forces have mostly withdrawn from the main part of Siversk east of the Bakhmutovka River, while Russian forces are attempting to infiltrate the western suburbs. They also managed to capture the terykon north of the city.\nTo the northwest, the Russians continued advancing beyond Platonivka and captured the forested gulley south of the village. They also advanced through the forest plantations to the southwest and captured the southeastern streets of Zakitne. \nFurther northwest, Russian forces captured the remaining part of the forests north of Zakitne and cleared the positions in the forested area on the northern bank of the Siverskyi Donets River. \nTo the west, the Russians captured the crossroads north of Ozerne and continue attempts to enter the northern part of the village amid fierce fighting. Additionally, Russian forces managed to capture the northern and eastern parts of Dibrova, as well as the forests to the east and southeast. Marginal advances also took place west of the two reservoirs in the direction of the highway.\n+ ~29.57 km² in favour of Russia.",
      "timestamp": "2025-12-10T09:52:41.598856Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress in three different areas.\nIn the southeast, Russian forces continued to incrementally advance through the fields east of Lyman, amid heavy fighting. They were able to establish control over additional positions in the treelines south of the Zarichne - Lyman Road, and are attempting to advance further west.\nTo the north, Russian forces resumed their assault operations northeast of Lyman and have captured additional positions in the western part of the Pen'kovyy yar Gulley. \nIn the northwest, after an earlier withdrawal, Russian forces re-entered the agricultural complex on the northeastern outskirts of Dobrysheve and established full control over it. \n+ ~2.20 km² in favour of Russia.",
      "timestamp": "2025-12-10T09:52:41.598873Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations in the western part of Luhansk Oblast and have made new progress in the direction of the Luhansk - Kharkiv regional border.\nRussian forces advanced northwest up both banks of a tributary of the Zherebets River, capturing new positions in 7 different treelines. They also managed to gain a foothold in the eastern part of the Lomovaty Forest and advanced further northwest in the direction of the Borovy Forest.\n+ ~4.31 km² in favour of Russia.",
      "timestamp": "2025-12-10T09:52:41.598879Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, each focusing on a different side of the Oskil River.\nIn the west, Ukrainian forces recaptured the forests southwest of Kupyansk and made additional progress in the southern streets of the city. They also advanced from the village of Moskovka into the northwestern streets, as well as from the western suburbs towards the city centre, where they are now fighting for the area of the train station - bypassing Russian strongpoints in the northwestern suburbs from the south. Meanwhile, Russian forces repelled the Ukrainian attacks in the Yuvileynyi high-rise micro-district, and regained control over its western apartment buildings.\nSince then, after heavy fighting, Ukrainian forces managed to establish control over a number of enterprises along the R-79 highway and infiltrated the northern streets of Kupyansk, therefore blocking Russian logistics and operationally encircling their garrison in the part of the city west of the Oskil River.\nIn the east, over the last week Russian forces have made significant progress east of the Oskil River. They advanced for over 2.6 km down the road across open ground to the northern outskirts of Petropavlivka and entrenched in its northern street. From there, after bringing in reinforcements, the Russians pushed southwest to the eastern bank of the Hnylytsya River and south to the centre of Petropavlivka, establishing control over the forest plantations north of a tributary of the Hnylytsya River. Attacks are now underway towards the eastern part of the village; however the situation in the centre of the settlement and nearby areas remains somewhat fluid and dynamic. \nTo the southeast, Russian forces resumed their assault operations on the southeastern part of Petropavlivka and gained a foothold in the first houses of the village. Other assault groups managed to capture positions in the forested area to the south. \n+ ~8.53 km² in favour of Russia. \n+ ~5.80 km² in favour of Ukraine.",
      "timestamp": "2025-12-10T09:52:41.598889Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, each focusing on a different side of the Oskil River.  In the west, Ukrainian forces recaptured the forests southwest of Kupyansk and made additional progress in the southern streets…",
      "timestamp": "2025-12-10T09:52:41.598896Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:\nThe yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian soldiers there, who managed to reach the western bank of the Oskil River. This has been achieved after weeks of Ukrainian counterattacks. There is currently no evidence of consolidation there, however.\nThe red shows the main Russian strongholds in western Kupyansk, which the Ukrainians are either bypassing or directly assaulting. \nThe situation has reached this point due to a severe lack of Russian manpower within Kupynask. This is due to a lack of Russian consolidation north of the city, making logistics (which already have to go over the river further north which is monitored 24/7 by Ukrainian drones) incredible difficult. For this reason, Russian soldiers in western Kupyansk likely number between just 200 and 400.\nThe fact that Russian forces managed to break into Kupyansk and quickly capture large parts of the city is evidence of how poorly the Ukrainian defence was initially conducted here, and how critical their manpower shortages were. \nHowever, due to reinforcements being brought in, Ukraine achieved a localised numerical superiority in this area, which is allowing for them to carry out these successful counterattacks. \nThis is why I warned about this sector a week ago, and how it could become critical for Russian forces. Since then, the situation has absolutely reached a critical level.",
      "timestamp": "2025-12-10T09:52:41.598905Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-10T09:52:41.598910Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-10T09:52:41.598915Z"
    },
    {
      "original": "123:0 is absolutely brutal \n😁",
      "timestamp": "2025-12-10T09:52:41.598919Z"
    },
    {
      "original": "I keep seeing people ask me how to access my interactive Ukraine map, so I might start linking it under each map update like Suriyak. Remember, all updates are posted there first, although some changes may be clarified and adjusted before I make a written report.\nI will only do that on Telegram though, as posting links to other sites on Twitter kills your reach. \nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=49.55942754881313%2C37.24161958921334&z=8",
      "timestamp": "2025-12-10T09:52:41.598925Z"
    },
    {
      "original": "Iskander-M ballistic missiles continue to be delivered to OTRK installations near Ukraine.\nRecently, IL-76MD military transport aircraft have landed at Baltimore Airbase, Voronezh Oblast, and at Rostov-on-Don-Central Airbase, Rostov Oblast. Iskanders will be delivered by road to OTRK installations near Liski, Voronezh Oblast, and near Taganrog, Rostov Oblast. The cargo likely also consisted of Geran-2 drones which will be transported by rail to launch sites.\nAdditionally, an IL-76MD landed at Engels-2 Airbase, carrying Kh-101 cruise missiles in preparation for the next large-scale, combined missile and drone attack on Ukraine. These missiles will be equipped to Tu-95MS/Tu-160M strategic bombers once they return from their large-scale training missions in the Far East.",
      "timestamp": "2025-12-10T09:52:41.598930Z"
    },
    {
      "original": "🇬🇧\n🇺🇦\n⚡️\n- \"It is with deep regret that we must announce that a member of the UK Armed Forces died in Ukraine this morning, Tuesday 9 December. \nHe was injured in a tragic accident whilst observing Ukrainian forces test a new defensive capability, away from the front lines.\nThe family has been notified and our thoughts are with them at this sad and difficult time.\"\n- UK Ministry of Defence",
      "timestamp": "2025-12-10T09:52:41.598938Z"
    },
    {
      "original": "Today, December 9, the Russian Aerospace Forces and the People’s Liberation Army Air Force conducted joint large-scale exercises involving strategic bombers in the Sea of Japan, the East China Sea, and the western part of the Pacific Ocean.\nAround midnight UTC, four Russian Tu-95MSes departed from Ukrainka Air Base and headed to the Sea of Japan. Another Tu-95MS departed from Ukrainka Air Base around 03:00 UTC.\nThe Tu-95MSes conducted simulated Kh-101 missile launches over the Japanese Archipelago at around 03:30 UTC.\nTwo Il-78Ms from Belaya Air Base provided aerial refueling for Russian Tu-95MSs over the Sea of Japan from 09:00 to 12:30 UTC.\nRussian Tu-95MS then made their way into the East China Sea, where they met two Chinese H-6K and joined together into a combined strike group.\nDuring the training mission, the A-50U (RF-50606, Red 51) over the Sea of Japan acted as a command post and maintained communication with a Project 1155 large anti-submarine ship operating in the Sea of Okhotsk.\nFrom the Chinese side, the airspace was controlled by a KJ-500A. The bombers were escorted by Chinese J-16s and J-11s, together with Russian Su-30SMs (RF-81700, Blue 51; RF-91815, Red 17).\nIn the flight response, F-15s of the Republic of Korea Air Force and F-35s of the Japan Air Self-Defense Force were scrambled.\nBy \nAviVector",
      "timestamp": "2025-12-10T09:52:41.598948Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡️\n- A Thai KB-5E loitering drone (knockoff of the Iranian Shahed-136) flying into Cambodian territory for a strike.",
      "timestamp": "2025-12-10T09:52:41.598953Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-10T09:52:41.598959Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-10T09:52:41.598966Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:  The yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian…",
      "timestamp": "2025-12-10T09:52:41.598969Z"
    },
    {
      "original": "Update on the situation in Kupyansk:\nThe situation continues to deteriorate for the Russian garrison in the western part of the city, which remains operationally encircled. An information blackout has been imposed by the Russian command, with information sharing resulting in severe punishments. This makes it difficult to determine the exact situation, however based on satellite imagery, geolocations, and reports from various sources, we can draw up a somewhat accurate representation of how things are currently playing out. \nAs I wrote in my last post, Ukrainian forces have managed to block the last supply route for Russian forces in western Kupyansk, which runs along the western bank of the Oskil River. As a result, all supply to the garrison has to be conducted by drones, although this isn't a new phenomenon for this sector. Nevertheless, the Ukrainians failed to consolidate, and Russia has largely repelled the attacks on this area. \nThe Ukrainian command has brought up additional reserves to Kupyansk, including mercenaries, which are continuing the counterattacks, despite heavy losses. However, they are encountering increasing difficulties in securing key areas, despite many instances of poor Russian coordination. Russian FAB glide-bomb strikes have remained unusually low, but are currently focusing on striking the logistical routes into the city. As a result of this, and other Russian strikes, as well as the attack on the dam in Pechenihy, supply for Ukrainian assault groups is becoming increasingly difficult. \nMoreover, Russian forces have begun attempts at eliminating the Ukrainian presence to northeast and north of Radkivka, which has long been a \"thorn\" for Russia which decreased their logistical potential. The outcome of these attacks is unknown, but if successful, they will likely consolidate and reinforce the whole area and attempt to advance south and cut off the Ukrainian spearhead in the northern part of Kupyansk. \nMeanwhile, Ukrainian forces continued making incremental progress within Kupyansk. Control over a number of high-rise buildings and nearby houses in the north was confirmed, although this likely occurred more than two weeks ago. They also managed to recapture the grain elevators just west of the city centre (which the Russians subsequently dropped at least one FAB on) as well as the residential streets to the west. Additionally, despite recent Russian counterattacks in the southwestern Yuvileynyi high-rise micro-district which saw them recover control over the rest of the apartment buildings there, Ukrainian forces were able to consolidate in approximately half of the low-rise residential area to the west. \nThe situation in other parts of western Kupyansk remains very fluid and dynamic. Ukrainian and Russian soldiers continue to hold positions overlapping each other, leading to a complicated mess of small groups of soldiers from each side maneuvering through urban areas and constantly being targeted by drones and artillery. However, the initiative remains firmly with Ukraine, and the first cases of Russian soldiers attempting to cross the Oskil River via the area of the destroyed highway overpass into the eastern part of the city have been recorded. \nMeanwhile, east of the Oskil River, Russian forces continue their assault operations in Petropavlivka. Currently, it appears they are trying to \"save\" the situation in western Kupyansk by securing this key village, eliminating the Ukrainian control in the area of Synkivka, and swinging west to \"link up\" with the garrison via the southeastern suburbs of Kupyansk. However, the Ukrainian defence east of the river is very strong, and Russian advances and consolidation has proven difficult and costly.",
      "timestamp": "2025-12-10T09:52:41.598977Z"
    },
    {
      "original": "Cambodian T-55 tanks can be seen being transported to the frontline.",
      "timestamp": "2025-12-10T09:52:41.598981Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-10T09:52:41.598984Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-10T09:52:41.598987Z"
    },
    {
      "original": "I want to be clear with this now: I want nothing to do with betting or gambling on the war in Ukraine. \nRecently, following the ISW fraud controversy with Polymarket, I keep seeing people suggest that my maps and reports should be used as a deciding factor for determining the outcome of bets. One of those such posts got over 1.6 million views.\nI even had the \"Pentagon Pizza Watch\" account reach out to me asking if my map could be embedded in his external betting service. He proceeded to get angry at me when I pointed out how immoral and scummy it was, and how when he used Deepstate's API, it ultimately got their service temporarily taken down, leaving many people - including humanitarian aid workers - in the dark. \nBetting on a war where hundreds of thousands of people are dying and millions are suffering is immoral and disgusting, and I will never support it or take part in any of it. Your actions on the internet have real life consequences, even if they aren't immediately apparent and obvious to you.",
      "timestamp": "2025-12-10T09:52:41.598994Z"
    },
    {
      "original": "Military Situation In Ukraine On December 9, 2025 (Maps Update)",
      "timestamp": "2025-12-10T09:52:42.323962Z"
    },
    {
      "original": "Military Situation In Ukraine On December 9, 2025 (Maps Update)",
      "timestamp": "2025-12-10T09:52:42.323975Z"
    },
    {
      "original": "Russian Army Now Controls Most Of Siversk (Videos)\nOn December 9, the Russian military expanded its control inside Siversk, capturing more than 60-70% of the city, one of the largest in Donetsk, according to varying sources.\nThe Yug [South] Group of Forces first advanced in the center of Siversk, along the railway, from south to north, capturing most of this part of the city. Russian troops then broke through Ukrainian defenses in the southwestern part of the city, and began advancing from there into the urban areas in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.323985Z"
    },
    {
      "original": "Russian Army Now Controls Most Of Siversk (Videos)\nOn December 9, the Russian military expanded its control inside Siversk, capturing more than 60-70% of the city, one of the largest in Donetsk, according to varying sources.\nThe Yug [South] Group of Forces first advanced in the center of Siversk, along the railway, from south to north, capturing most of this part of the city. Russian troops then broke through Ukrainian defenses in the southwestern part of the city, and began advancing from there into the urban areas in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.323993Z"
    },
    {
      "original": "Military Situation In Syria On December 9, 2025 (Map Update)",
      "timestamp": "2025-12-10T09:52:42.323996Z"
    },
    {
      "original": "Russian Army Captures Town In Dnepropetrovsk, Keeps Pressure On Zaporozhye (Videos)\nOn December 9, the Russian military captured another settlement in Dnepropetrovsk, all while maintaining pressure on Kiev forces in neighboring Zaporozhye.\nOstapovskoye, located in the area where the Yanchur River splits from the Haichur River in Dnepropetrovsk, was captured by the Vostok [East] Group of Forces, according to the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 36th Separate Guards Motorised Rifle Brigade of the 29th Army.\nFurther south along the Haichur in Zaporozhye, the Vostok Group of Forces continue to battle Kiev forces inside Varvarivka, as well as in the area north of the key city of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.324004Z"
    },
    {
      "original": "Russian Army Captures Town In Dnepropetrovsk, Keeps Pressure On Zaporozhye (Videos)\nOn December 9, the Russian military captured another settlement in Dnepropetrovsk, all while maintaining pressure on Kiev forces in neighboring Zaporozhye.\nOstapovskoye, located in the area where the Yanchur River splits from the Haichur River in Dnepropetrovsk, was captured by the Vostok [East] Group of Forces, according to the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 36th Separate Guards Motorised Rifle Brigade of the 29th Army.\nFurther south along the Haichur in Zaporozhye, the Vostok Group of Forces continue to battle Kiev forces inside Varvarivka, as well as in the area north of the key city of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.324011Z"
    },
    {
      "original": "STRETCHED DEFENSES: UKRAINE FACES SETBACKS FROM VOLCHANSK TO GULYAIPOLE",
      "timestamp": "2025-12-10T09:52:42.324015Z"
    },
    {
      "original": "Battle In Huliaipole Heats Up: Russian Units Cross Haichur And Clash With Ukrainian Forces \nRussian units crossed the Bakhmutka River along the Siversk sector. The Russian 36th Guards Motorized Rifle Brigade took control of Ostapivske. The Russian army crossed the Haichur River in the southeastern part of Huliaipole. \nU.S. President Donald Trump unofficially set the goal of reaching an agreement «by Christmas».\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.324024Z"
    },
    {
      "original": "Battle In Huliaipole Heats Up: Russian Units Cross Haichur And Clash With Ukrainian Forces \nRussian units crossed the Bakhmutka River along the Siversk sector. The Russian 36th Guards Motorized Rifle Brigade took control of Ostapivske. The Russian army crossed the Haichur River in the southeastern part of Huliaipole. \nU.S. President Donald Trump unofficially set the goal of reaching an agreement «by Christmas».\nRead more \nHERE",
      "timestamp": "2025-12-10T09:52:42.324037Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From December 9, 2025\nOn December 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-10T09:52:42.324043Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From December 9, 2025\nOn December 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-10T09:52:42.324050Z"
    }
  ],
  "script_run_time": "2025-12-10T09:52:42.324825Z"
}