{
  "messages": [
    {
      "original": "🛵\n🛸\n БпЛА курсом на Суми з півночі.",
      "timestamp": "2025-12-19T09:43:48.649235Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-12-19T09:43:48.649252Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини (вектор - н.п.Кароліно-Бугаз/Затока).",
      "timestamp": "2025-12-19T09:43:48.649257Z"
    },
    {
      "original": "🛵\n Одещина:\n- декілька груп БпЛА \n➡️\n в напрямку Затоки, Сергіївки;\n- БпЛА \n➡️\n у бік Одеси;\n- групи БпЛА \n➡️\n курсом на Маяки;\n- групи БпЛА маневрують в акваторії Чорного моря.",
      "timestamp": "2025-12-19T09:43:48.649268Z"
    },
    {
      "original": "🛵\n Донеччина: БпЛА \n➡️\n курсом на Словʼянськ, Добропілля.\n🛵\n Херсонщина: БпЛА \n➡️\n курсом на Херсон, Берислав.",
      "timestamp": "2025-12-19T09:43:48.649277Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА з Херсонщини \n➡️\n у напрямку акваторії Чорного моря.",
      "timestamp": "2025-12-19T09:43:48.649283Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-19T09:43:48.649287Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА з Херсонщини \n➡️\n у напрямку акваторії Чорного моря.",
      "timestamp": "2025-12-19T09:43:48.649293Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря \n➡️\n в напрямку Чорноморська.",
      "timestamp": "2025-12-19T09:43:48.649298Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 108 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 19 грудня (з 18.30 18 грудня) противник атакував 160-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Курськ, Приморсько-Ахтарськ, Брянськ, Міллєрово– рф., Гвардійське - ТОТ АР Криму, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено 108 ворожих БпЛА типу Shahed, Гербера і дрони інших типів на півдні та сході країни.\nЗафіксовано влучання 47 ударних БпЛА на 23 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-19T09:43:48.649317Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: група БпЛА \n➡️\n курсом на Нікополь. \n🛵\n Одещина: БпЛА маневрують в акваторії Чорного моря.",
      "timestamp": "2025-12-19T09:43:48.649328Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА через Херсонщину \n➡️\n в напрямку Високопілля.",
      "timestamp": "2025-12-19T09:43:48.649334Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА північніше Нікополя, вектором руху на Дніпро/Кам'янське;\n🛵\n Ворожі БпЛА південно-західніше Кривого Рогу у напрямку Кіровоградщини.",
      "timestamp": "2025-12-19T09:43:48.649340Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-19T09:43:48.649348Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині та Сумщині.",
      "timestamp": "2025-12-19T09:43:48.649352Z"
    },
    {
      "original": "🛵\n Полтавська область (Кременчуцький р-н) - загроза застосування ворогом ударних БпЛА з півдня.",
      "timestamp": "2025-12-19T09:43:48.649356Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині у бік Апостолове з північного сходу.",
      "timestamp": "2025-12-19T09:43:48.649361Z"
    },
    {
      "original": "🛵\n БпЛА в Богодухівському районі  Харківщини, у напрямку Богодухів/Гути з півночі.",
      "timestamp": "2025-12-19T09:43:48.649365Z"
    },
    {
      "original": "🚀\nПуски КАБ на схід Харківщини.",
      "timestamp": "2025-12-19T09:43:48.649369Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-19T09:43:48.649376Z"
    },
    {
      "original": "🚀\n КАБ в напрямку Запоріжжя!",
      "timestamp": "2025-12-19T09:43:48.649381Z"
    },
    {
      "original": "🚀\n Запоріжжя - в укриття!",
      "timestamp": "2025-12-19T09:43:48.649385Z"
    },
    {
      "original": "Now 4+ Geran-2 drones are flying to attack the same area.",
      "timestamp": "2025-12-19T09:43:49.450514Z"
    },
    {
      "original": "Following the earlier KAB strikes, the southern suburbs/outskirts of Zaporizhzhia are under heavy MLRS fire. \nAt least 6 strikes so far.",
      "timestamp": "2025-12-19T09:43:49.450526Z"
    },
    {
      "original": "Following the earlier KAB strikes, the southern suburbs/outskirts of Zaporizhzhia are under heavy MLRS fire.   At least 6 strikes so far.",
      "timestamp": "2025-12-19T09:43:49.450530Z"
    },
    {
      "original": "The MLRS strikes targeted the Balabyne area, just south of the city.",
      "timestamp": "2025-12-19T09:43:49.450538Z"
    },
    {
      "original": "Repeated MLRS strikes and more launches. 16+ so far.\nA Russian recon drone is operating over Balabyne, adjusting the strikes.",
      "timestamp": "2025-12-19T09:43:49.450542Z"
    },
    {
      "original": "It’s come to my attention that I have been doxxed once again (for the 4th time). Harassment and threats have been a regular occurrence for me on this cesspool of a platform (Twitter), so it’s nothing new or unexpected.\nFunnily enough, the first and second times I was doxxed actually publicized me a lot, and was one of the main contributing factors to me getting to where I am today. So I guess I can thank Nafo for that lol. \nBut please note, no matter what people do or say to me, I’m not going to stop doing my work. My goal has always been to provide accurate and informative news on wars such as Ukraine, and to expose and publicize the crimes committed by the Russian, Ukrainian, European, and American governments in this horrible conflict which could have ended years ago.\nThat being said, I’m not going to engage in long debates with random users on Twitter about this. I’m never going to change your mind about me or this war, so there’s literally no point. These are worthless arguments that both of us would forget in a few days. I have so many better and more productive things to do both online and in real life. I’ve got a lot on right now, and I’m looking forward to continue what I’m doing while working on my own life. \nAnd to those who support me through liking my posts, commenting, and messaging me, I appreciate you more than you could ever imagine. This has been an incredible experience that I could’ve never predicted would happen.",
      "timestamp": "2025-12-19T09:43:49.450550Z"
    },
    {
      "original": "Telegram > Twitter \n😁",
      "timestamp": "2025-12-19T09:43:49.450554Z"
    },
    {
      "original": "And of course my fucking twitter account's reach has been throttled by 3x once again (it does this every 2-3 days now), so much less people will see my post on it.   So convenient.",
      "timestamp": "2025-12-19T09:43:49.450558Z"
    },
    {
      "original": "Thanks for making a fuss about the whole channel thing, everyone. \nIt turns out that it took YouTube just 6 minutes to reinstate my channel after I made the post about it being suspended lol. \nBut unfortunately, this will likely become a regular occurrence.",
      "timestamp": "2025-12-19T09:43:49.450563Z"
    },
    {
      "original": "The Ukrainian General Staff published footage showing drone strikes on two Russian S-400 surface-to-air missile launchers near the village of Raevka, Belgorod Oblast, around 50 km from the nearest Ukrainian-controlled territory.\nThe strikes, which took place on December 14, destroyed 1 launcher and either seriously damaged or destroyed the second.",
      "timestamp": "2025-12-19T09:43:49.450567Z"
    },
    {
      "original": "Last night, Ukrainian Neptune cruise missiles once again attacked the Oryol Thermal Power Plant. 2 strikes were recorded, one of which targeted the transformer equipment.",
      "timestamp": "2025-12-19T09:43:49.450570Z"
    },
    {
      "original": "Last night, Ukrainian Neptune cruise missiles once again attacked the Oryol Thermal Power Plant. 2 strikes were recorded, one of which targeted the transformer equipment.",
      "timestamp": "2025-12-19T09:43:49.450574Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- President Donald Trump will address the nation at 1:00 p.m. EST on Friday, December 19th.",
      "timestamp": "2025-12-19T09:43:49.450580Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- President Donald Trump will address the nation at 1:00 p.m. EST on Friday, December 19th.",
      "timestamp": "2025-12-19T09:43:49.450584Z"
    },
    {
      "original": "Russian forces have captured the village of Sofiivka, Druzhkivka direction, Donetsk Oblast.\nPre-war population: ~538.\nTotal land area: ~1.78 km².\nThe fighting for Sofiivka lasted approximately 24 days.",
      "timestamp": "2025-12-19T09:43:49.450590Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their intensified assault operations and have made additional significant progress.\nFollowing the withdrawal of the remaining Ukrainian forces from their strongpoints south of the main gulley stretching east from Stepnohirsk, Russian forces cleared those remaining positions there, levelling the frontline. At the same time, other forces had infiltrated across the gulley and consolidated in several positions at the former mining and processing plant. \nOther forces then captured a number of treelines east of Stepnohirsk, before breaking through to the solar field where they linked up with the initial infiltration groups. The solar fields were brought under control, allowing for the Russians to advance even further northeast, occupying some forested areas and infiltrating the industrial zone in the village of Lukyanivske. \nAdditionally, Russian forces cleared the remaining streets in eastern Stepnohirsk that were still in the grey-zone. Fighting continues for the high-rise buildings in the town centre, however only small pockets of Ukrainian resistance remain there. \n+ ~15.9 km² in favour of Russia.",
      "timestamp": "2025-12-19T09:43:49.450596Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to make progress in Hulyaipole as Ukraine's defence of the city continues to collapse.\nIn the eastern part of the city, Russian forces continued advancing west towards the centre, establishing control over the remaining houses east of Myru Street, including a number of warehouses..\nIn the southern part of Hulyaipole, Russian forces continued expanding their spearhead, bypassing the cemetery from the west and capturing positions on Kooperatynvna Street. Further west, other forces continued pressing north towards the high-rise buildings which have become the main Ukrainian stronghold in the city. Under heavy air cover, they were able to reach the intersection of Vyshneva Street and the main highway and are now engaged in fierce battles for the approaches to the local high school, which is situated right in front of the apartment buildings.\nIn the city centre, Russian forces continued to slowly expand their bridgehead over the Haichur River amid heavy fighting. They managed to secure the hospital complex, the kindergarten, and multiple 3-story apartment buildings, and are attempting to break through to the northeastern edge of the high-rise blocks. \n+ ~0.83 km² in favour of Russia.",
      "timestamp": "2025-12-19T09:43:49.450605Z"
    },
    {
      "original": "Insane footage from Lyman showing how the city has been covered in a net of fiber-optic cables from FPV drones.",
      "timestamp": "2025-12-19T09:43:49.450608Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance and have established a strong, tactical bridgehead on the western bank of the Haichur River.\nIn the north, around a week ago, Russian forces managed to cross the Haichur River and infiltrate a number of treelines on its western bank. After consolidating and bringing in additional reinforcements, they began advancing to the northwest and southwest, moving uphill to additional treeline positions, as well as expanding the width of the bridgehead to the north.\nIn the south, Russian forces managed to break into the northern part of Varvarivka, establishing a solid foothold in the village. Other forces penetrated the settlement at multiple points from the treelines to the east, and entered from the south, establishing full control over it. \n+ ~21.3 km² in favour of Russia.",
      "timestamp": "2025-12-19T09:43:49.450614Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces intensified their assault operations and have recaptured positions in two different areas.\nIn the west, at some point over the last two weeks, Russian forces managed to re-infiltrate the village of Ivanivka from the forests to the west, consolidating in its western streets. Other forces subsequently crossed the Vovcha River and re-entered its eastern streets from their newly secured positions in the fortified forests west of Filiya. These actions allowed Russia to recapture large parts of the village. They are now attempting to clear additional positions in the central and eastern streets.\nIn the east, Russian forces continued advancing north from the Filiya area. They improved their positions north of the fortified forest, while other forces advanced up the road from Filiya and recaptured positions in the forest plantations there. From there Russian soldiers are trying to re-enter Novopavlivka in order to link up with isolated groups still remaining in the southern part of the town.\n+ ~11.08 km² in favour of Russia.",
      "timestamp": "2025-12-19T09:43:49.450619Z"
    },
    {
      "original": "🇪🇺\n🇺🇦\n⚡️\n — NEW:\n The EU has agreed to give Ukraine a €90 billion interest-free loan for military and budget needs in 2026–2027, funded through joint EU borrowing and backed by the EU budget. \n➡️\n Ukraine would repay it only if Russia pays war reparations; otherwise, the EU may later use frozen Russian assets.",
      "timestamp": "2025-12-19T09:43:49.450629Z"
    },
    {
      "original": "Another exchange of Russian and Ukrainian bodies is reportedly underway right now. \nDetails should be made available soon",
      "timestamp": "2025-12-19T09:43:49.450633Z"
    },
    {
      "original": "Russian Army Is Strangling Kiev Forces Inside Huliapole (Videos)\nOn December 18, the Russian military began advancing around Huliapole in Zaporozhye to besiege remaining Ukrainian troops inside the city, all while expanding its control to the north along the Haichur River.\nThe Vostok [East] Group of Forces flanked Kiev forces in the northern part of Huliapole, moving directly from the northern outskirts of the city to its western part. Russian troops also expanded their control in the southern outskirts of Hauliapole, to the east of the T-0401 road.\nThe latest moves are clearly a part of a maneuver meant to besiege remaining Ukrainian troops inside Huliapole. The troops are already facing intense Russian bombardment, and any move by them is immediately targeted by the drone units of the Vostok Group of Forces.\nIt’s worth noting that half of the city, including most of its eastern and southern parts and several areas in its center are already in the hands of the Russian military.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303863Z"
    },
    {
      "original": "Russian Army Is Strangling Kiev Forces Inside Huliapole (Videos)\nOn December 18, the Russian military began advancing around Huliapole in Zaporozhye to besiege remaining Ukrainian troops inside the city, all while expanding its control to the north along the Haichur River.\nThe Vostok [East] Group of Forces flanked Kiev forces in the northern part of Huliapole, moving directly from the northern outskirts of the city to its western part. Russian troops also expanded their control in the southern outskirts of Hauliapole, to the east of the T-0401 road.\nThe latest moves are clearly a part of a maneuver meant to besiege remaining Ukrainian troops inside Huliapole. The troops are already facing intense Russian bombardment, and any move by them is immediately targeted by the drone units of the Vostok Group of Forces.\nIt’s worth noting that half of the city, including most of its eastern and southern parts and several areas in its center are already in the hands of the Russian military.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303881Z"
    },
    {
      "original": "Echoes of the Third Reich: Ukrainian Torture Chambers and Russian Prisoners of War\nShocking details have emerged about Russian soldiers held captive in Ukraine. The utterly inhumane treatment of captured soldiers has resulted in severe physical and psychological trauma. The horror of the Gestapo torture chambers has been reborn in Ukraine.\nAn effective state propaganda machine cannot alter the situation on the ground. No matter how loudly the Ukrainian media proclaims their own victories and defeats of Russian troops, the front line continues to retreat westward. A series of local tactical crises for the Ukrainian army is gradually turning into operational crises. With each passing month, these crises will only increase in number.\nStaffing issues mean that a company of 110 men may have no more than one or two platoons totaling 30 to 60 men. Interruptions in Western supplies of weapons and military equipment have seriously undermined the Armed For\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303892Z"
    },
    {
      "original": "Echoes of the Third Reich: Ukrainian Torture Chambers and Russian Prisoners of War\nShocking details have emerged about Russian soldiers held captive in Ukraine. The utterly inhumane treatment of captured soldiers has resulted in severe physical and psychological trauma. The horror of the Gestapo torture chambers has been reborn in Ukraine.\nAn effective state propaganda machine cannot alter the situation on the ground. No matter how loudly the Ukrainian media proclaims their own victories and defeats of Russian troops, the front line continues to retreat westward. A series of local tactical crises for the Ukrainian army is gradually turning into operational crises. With each passing month, these crises will only increase in number.\nStaffing issues mean that a company of 110 men may have no more than one or two platoons totaling 30 to 60 men. Interruptions in Western supplies of weapons and military equipment have seriously undermined the Armed For\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303900Z"
    },
    {
      "original": "THE U.S. FOREVER WAR IN SYRIA",
      "timestamp": "2025-12-19T09:43:50.303904Z"
    },
    {
      "original": "Battle For Myrnohrad: Russian Army Deals Another Blow To Ukraine\nUkrainian presence in Myrnohrad has been reduced to pockets. Russian forces are working to besiege Kiev forces in Huliapole and have crossed the Haichur River in a new area. Kiev is losing its grip on the situation around Vovchansk. Meanwhile, Ukrainian President Vladimir Zelensky is still clinging to the idea of joining NATO.\nThe Sever [North] Group of Forces of the Russian military is expanding its control around Vovchanst in Kharkiv at a slow, but steady pace.\nRussian troops have cleared out some six square kilometers to the south and southeast of Vovchanst. The troops also made additional gains in Vilcha, right to the south of the Vovchanst, with reports suggesting that at least 70% of the settlement, the entire northern part and most of the center, had been captured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303913Z"
    },
    {
      "original": "Battle For Myrnohrad: Russian Army Deals Another Blow To Ukraine\nUkrainian presence in Myrnohrad has been reduced to pockets. Russian forces are working to besiege Kiev forces in Huliapole and have crossed the Haichur River in a new area. Kiev is losing its grip on the situation around Vovchansk. Meanwhile, Ukrainian President Vladimir Zelensky is still clinging to the idea of joining NATO.\nThe Sever [North] Group of Forces of the Russian military is expanding its control around Vovchanst in Kharkiv at a slow, but steady pace.\nRussian troops have cleared out some six square kilometers to the south and southeast of Vovchanst. The troops also made additional gains in Vilcha, right to the south of the Vovchanst, with reports suggesting that at least 70% of the settlement, the entire northern part and most of the center, had been captured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303937Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: 70% of Ukraine's Power Plants Disabled, a Third of Defense Industry Paralyzed\nOn December 17-18, 2024, Russia and Ukraine continued to exchange strikes against each other's territory. According to official statements, Ukrainian air defenses shot down 63 out of 82 attacking Russian drones. Russian air defense systems, in turn, destroyed 47 Ukrainian drones, primarily over the Bryansk region.\nRussian strikes on Ukrainian defense-industrial complex (DIC) facilities are reported to have severely impacted weapons production. Ukrainian military expert Alexander Kovalenko claims that at least a third of defense enterprises have faced disruptions to state contracts due to destruction. He describes a paradoxical situation where enterprises damaged by strikes receive no aid, no contract extensions, and no relief from their obligations. Instead, they are fined and dragged into litigation for delivery delays. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303946Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: 70% of Ukraine's Power Plants Disabled, a Third of Defense Industry Paralyzed\nOn December 17-18, 2024, Russia and Ukraine continued to exchange strikes against each other's territory. According to official statements, Ukrainian air defenses shot down 63 out of 82 attacking Russian drones. Russian air defense systems, in turn, destroyed 47 Ukrainian drones, primarily over the Bryansk region.\nRussian strikes on Ukrainian defense-industrial complex (DIC) facilities are reported to have severely impacted weapons production. Ukrainian military expert Alexander Kovalenko claims that at least a third of defense enterprises have faced disruptions to state contracts due to destruction. He describes a paradoxical situation where enterprises damaged by strikes receive no aid, no contract extensions, and no relief from their obligations. Instead, they are fined and dragged into litigation for delivery delays. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-19T09:43:50.303954Z"
    },
    {
      "original": "Rocket Strikes: Summary Of Russian Combat Footage From December 18, 2025\nOn December 18, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-19T09:43:50.303962Z"
    },
    {
      "original": "Rocket Strikes: Summary Of Russian Combat Footage From December 18, 2025\nOn December 18, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-19T09:43:50.303969Z"
    }
  ],
  "script_run_time": "2025-12-19T09:43:50.304779Z"
}