{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-12-10T17:02:32.209897Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщині.",
      "timestamp": "2025-12-10T17:02:32.209913Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-10T17:02:32.209922Z"
    },
    {
      "original": "🚀\nКАБи на Запорізьку область!",
      "timestamp": "2025-12-10T17:02:32.209927Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-10T17:02:32.209935Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-12-10T17:02:32.209939Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину, Дніпропетровщину!",
      "timestamp": "2025-12-10T17:02:32.209944Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-12-10T17:02:32.209948Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-12-10T17:02:32.209964Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-12-10T17:02:32.209969Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-12-10T17:02:32.209973Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-10T17:02:32.209981Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-12-10T17:02:32.209985Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині \n➡️\n курсом на Полтавщину.",
      "timestamp": "2025-12-10T17:02:32.209991Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину.",
      "timestamp": "2025-12-10T17:02:32.209995Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини  \n➡️\n в південному напрямку.",
      "timestamp": "2025-12-10T17:02:32.210001Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-10T17:02:32.210008Z"
    },
    {
      "original": "🚀\nКАБи на Донеччині.",
      "timestamp": "2025-12-10T17:02:32.210013Z"
    },
    {
      "original": "🚀\nПуски КАБ на межі Запорізької, Донецької та Дніпропетровської областей.",
      "timestamp": "2025-12-10T17:02:32.210017Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі",
      "timestamp": "2025-12-10T17:02:32.210021Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, each focusing on a different side of the Oskil River.  In the west, Ukrainian forces recaptured the forests southwest of Kupyansk and made additional progress in the southern streets…",
      "timestamp": "2025-12-10T17:02:33.052304Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:\nThe yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian soldiers there, who managed to reach the western bank of the Oskil River. This has been achieved after weeks of Ukrainian counterattacks. There is currently no evidence of consolidation there, however.\nThe red shows the main Russian strongholds in western Kupyansk, which the Ukrainians are either bypassing or directly assaulting. \nThe situation has reached this point due to a severe lack of Russian manpower within Kupynask. This is due to a lack of Russian consolidation north of the city, making logistics (which already have to go over the river further north which is monitored 24/7 by Ukrainian drones) incredible difficult. For this reason, Russian soldiers in western Kupyansk likely number between just 200 and 400.\nThe fact that Russian forces managed to break into Kupyansk and quickly capture large parts of the city is evidence of how poorly the Ukrainian defence was initially conducted here, and how critical their manpower shortages were. \nHowever, due to reinforcements being brought in, Ukraine achieved a localised numerical superiority in this area, which is allowing for them to carry out these successful counterattacks. \nThis is why I warned about this sector a week ago, and how it could become critical for Russian forces. Since then, the situation has absolutely reached a critical level.",
      "timestamp": "2025-12-10T17:02:33.052317Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-10T17:02:33.052323Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-10T17:02:33.052328Z"
    },
    {
      "original": "123:0 is absolutely brutal \n😁",
      "timestamp": "2025-12-10T17:02:33.052335Z"
    },
    {
      "original": "I keep seeing people ask me how to access my interactive Ukraine map, so I might start linking it under each map update like Suriyak. Remember, all updates are posted there first, although some changes may be clarified and adjusted before I make a written report.\nI will only do that on Telegram though, as posting links to other sites on Twitter kills your reach. \nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=49.55942754881313%2C37.24161958921334&z=8",
      "timestamp": "2025-12-10T17:02:33.052340Z"
    },
    {
      "original": "Iskander-M ballistic missiles continue to be delivered to OTRK installations near Ukraine.\nRecently, IL-76MD military transport aircraft have landed at Baltimore Airbase, Voronezh Oblast, and at Rostov-on-Don-Central Airbase, Rostov Oblast. Iskanders will be delivered by road to OTRK installations near Liski, Voronezh Oblast, and near Taganrog, Rostov Oblast. The cargo likely also consisted of Geran-2 drones which will be transported by rail to launch sites.\nAdditionally, an IL-76MD landed at Engels-2 Airbase, carrying Kh-101 cruise missiles in preparation for the next large-scale, combined missile and drone attack on Ukraine. These missiles will be equipped to Tu-95MS/Tu-160M strategic bombers once they return from their large-scale training missions in the Far East.",
      "timestamp": "2025-12-10T17:02:33.052345Z"
    },
    {
      "original": "🇬🇧\n🇺🇦\n⚡️\n- \"It is with deep regret that we must announce that a member of the UK Armed Forces died in Ukraine this morning, Tuesday 9 December. \nHe was injured in a tragic accident whilst observing Ukrainian forces test a new defensive capability, away from the front lines.\nThe family has been notified and our thoughts are with them at this sad and difficult time.\"\n- UK Ministry of Defence",
      "timestamp": "2025-12-10T17:02:33.052353Z"
    },
    {
      "original": "Today, December 9, the Russian Aerospace Forces and the People’s Liberation Army Air Force conducted joint large-scale exercises involving strategic bombers in the Sea of Japan, the East China Sea, and the western part of the Pacific Ocean.\nAround midnight UTC, four Russian Tu-95MSes departed from Ukrainka Air Base and headed to the Sea of Japan. Another Tu-95MS departed from Ukrainka Air Base around 03:00 UTC.\nThe Tu-95MSes conducted simulated Kh-101 missile launches over the Japanese Archipelago at around 03:30 UTC.\nTwo Il-78Ms from Belaya Air Base provided aerial refueling for Russian Tu-95MSs over the Sea of Japan from 09:00 to 12:30 UTC.\nRussian Tu-95MS then made their way into the East China Sea, where they met two Chinese H-6K and joined together into a combined strike group.\nDuring the training mission, the A-50U (RF-50606, Red 51) over the Sea of Japan acted as a command post and maintained communication with a Project 1155 large anti-submarine ship operating in the Sea of Okhotsk.\nFrom the Chinese side, the airspace was controlled by a KJ-500A. The bombers were escorted by Chinese J-16s and J-11s, together with Russian Su-30SMs (RF-81700, Blue 51; RF-91815, Red 17).\nIn the flight response, F-15s of the Republic of Korea Air Force and F-35s of the Japan Air Self-Defense Force were scrambled.\nBy \nAviVector",
      "timestamp": "2025-12-10T17:02:33.052364Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡️\n- A Thai KB-5E loitering drone (knockoff of the Iranian Shahed-136) flying into Cambodian territory for a strike.",
      "timestamp": "2025-12-10T17:02:33.052370Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-10T17:02:33.052377Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-10T17:02:33.052384Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:  The yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian…",
      "timestamp": "2025-12-10T17:02:33.052387Z"
    },
    {
      "original": "Update on the situation in Kupyansk:\nThe situation continues to deteriorate for the Russian garrison in the western part of the city, which remains operationally encircled. An information blackout has been imposed by the Russian command, with information sharing resulting in severe punishments. This makes it difficult to determine the exact situation, however based on satellite imagery, geolocations, and reports from various sources, we can draw up a somewhat accurate representation of how things are currently playing out. \nAs I wrote in my last post, Ukrainian forces have managed to block the last supply route for Russian forces in western Kupyansk, which runs along the western bank of the Oskil River. As a result, all supply to the garrison has to be conducted by drones, although this isn't a new phenomenon for this sector. Nevertheless, the Ukrainians failed to consolidate, and Russia has largely repelled the attacks on this area. \nThe Ukrainian command has brought up additional reserves to Kupyansk, including mercenaries, which are continuing the counterattacks, despite heavy losses. However, they are encountering increasing difficulties in securing key areas, despite many instances of poor Russian coordination. Russian FAB glide-bomb strikes have remained unusually low, but are currently focusing on striking the logistical routes into the city. As a result of this, and other Russian strikes, as well as the attack on the dam in Pechenihy, supply for Ukrainian assault groups is becoming increasingly difficult. \nMoreover, Russian forces have begun attempts at eliminating the Ukrainian presence to northeast and north of Radkivka, which has long been a \"thorn\" for Russia which decreased their logistical potential. The outcome of these attacks is unknown, but if successful, they will likely consolidate and reinforce the whole area and attempt to advance south and cut off the Ukrainian spearhead in the northern part of Kupyansk. \nMeanwhile, Ukrainian forces continued making incremental progress within Kupyansk. Control over a number of high-rise buildings and nearby houses in the north was confirmed, although this likely occurred more than two weeks ago. They also managed to recapture the grain elevators just west of the city centre (which the Russians subsequently dropped at least one FAB on) as well as the residential streets to the west. Additionally, despite recent Russian counterattacks in the southwestern Yuvileynyi high-rise micro-district which saw them recover control over the rest of the apartment buildings there, Ukrainian forces were able to consolidate in approximately half of the low-rise residential area to the west. \nThe situation in other parts of western Kupyansk remains very fluid and dynamic. Ukrainian and Russian soldiers continue to hold positions overlapping each other, leading to a complicated mess of small groups of soldiers from each side maneuvering through urban areas and constantly being targeted by drones and artillery. However, the initiative remains firmly with Ukraine, and the first cases of Russian soldiers attempting to cross the Oskil River via the area of the destroyed highway overpass into the eastern part of the city have been recorded. \nMeanwhile, east of the Oskil River, Russian forces continue their assault operations in Petropavlivka. Currently, it appears they are trying to \"save\" the situation in western Kupyansk by securing this key village, eliminating the Ukrainian control in the area of Synkivka, and swinging west to \"link up\" with the garrison via the southeastern suburbs of Kupyansk. However, the Ukrainian defence east of the river is very strong, and Russian advances and consolidation has proven difficult and costly.",
      "timestamp": "2025-12-10T17:02:33.052396Z"
    },
    {
      "original": "Cambodian T-55 tanks can be seen being transported to the frontline.",
      "timestamp": "2025-12-10T17:02:33.052400Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-10T17:02:33.052403Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-10T17:02:33.052406Z"
    },
    {
      "original": "I want to be clear with this now: I want nothing to do with betting or gambling on the war in Ukraine. \nRecently, following the ISW fraud controversy with Polymarket, I keep seeing people suggest that my maps and reports should be used as a deciding factor for determining the outcome of bets. One of those such posts got over 1.6 million views.\nI even had the \"Pentagon Pizza Watch\" account reach out to me asking if my map could be embedded in his external betting service. He proceeded to get angry at me when I pointed out how immoral and scummy it was, and how when he used Deepstate's API, it ultimately got their service temporarily taken down, leaving many people - including humanitarian aid workers - in the dark. \nBetting on a war where hundreds of thousands of people are dying and millions are suffering is immoral and disgusting, and I will never support it or take part in any of it. Your actions on the internet have real life consequences, even if they aren't immediately apparent and obvious to you.",
      "timestamp": "2025-12-10T17:02:33.052414Z"
    },
    {
      "original": "The Thai military reports that Cambodia has launched more than 3,160 BM-21 Grad rockets and carried out 125 drone strikes so far during the renewed conflict.",
      "timestamp": "2025-12-10T17:02:33.052417Z"
    },
    {
      "original": "Russian forces have captured the village of Pazeno, southwestern flank of Siversk, Donetsk Oblast.\nPre-war population: ~16.\nTotal land area: ~0.43 km².\nThe fighting for Pazeno lasted approximately 8 days.",
      "timestamp": "2025-12-10T17:02:33.052424Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-10T17:02:33.052429Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-10T17:02:33.052434Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From December 9, 2025\nOn December 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-10T17:02:33.832683Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From December 9, 2025\nOn December 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-10T17:02:33.832697Z"
    },
    {
      "original": "Air Base In Syria’s Damascus Set To Host U.S. Troops Got Hit By Rockets (Photos)\nLate on December 9, a salvo of rockets targeted a key air base located right next to the Syrian capital, Damascus, where United States troops could soon be deployed, in the second such attack in recent weeks.\nThree rockets were fired at Mezzeh Air Base - located just under four kilometers away from the People’s Palace to the southwest of Damascus - causing no casualties or damage, the state-run Syrian Arab News Agency reported.\nThe air base came to first public attention on November 6, when a report by Reuters revealed U.S. plans to establish military presence there.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832706Z"
    },
    {
      "original": "Air Base In Syria’s Damascus Set To Host U.S. Troops Got Hit By Rockets (Photos)\nLate on December 9, a salvo of rockets targeted a key air base located right next to the Syrian capital, Damascus, where United States troops could soon be deployed, in the second such attack in recent weeks.\nThree rockets were fired at Mezzeh Air Base - located just under four kilometers away from the People’s Palace to the southwest of Damascus - causing no casualties or damage, the state-run Syrian Arab News Agency reported.\nThe air base came to first public attention on November 6, when a report by Reuters revealed U.S. plans to establish military presence there.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832715Z"
    },
    {
      "original": "Iran Is Expanding Its Missile Program (Video)\nA senior representative of the Israeli military told lawmakers during a closed meeting of the Knesset Foreign Affairs and Defense Committee that Iran was able to resume large-scale production of ballistic missiles roughly six months after the 12-day war with Israel, Ynet reported on December 8.\nThe representative said during the briefing, which was described by several participants to the Israeli news website, that Iran is rapidly restoring its missile manufacturing capacity after suffering heavy damage during the war.\nThe warning came amid large naval drills by the Islamic Revolutionary Guard Corps (IRGC) in the Persian Gulf, involving ballistic missiles, cruise missiles and drones.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832723Z"
    },
    {
      "original": "French Special Forces Played Key Role In Foiling Benin Coup \nFrench special forces supported Beninese troops who put down a coup on December 7, Col. Dieudonne Djimon Tevoedjre, the head of the country's republican guard, told AFP.\nThe coup attempt began early in the morning with troops from the country’s National Guard attacking the residence of President Patrice Talon in the port city of Cotonou.\nAn aide to President Emmanuel Macron acknowledged that France provided \"surveillance, observation and logistical support\" assistance to Beninese troops, at the request of the government, without confirming or denying the presence of French special forces.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832731Z"
    },
    {
      "original": "Military Situation In Northern Palestine On December 10, 2025 (Map Update)",
      "timestamp": "2025-12-10T17:02:33.832735Z"
    },
    {
      "original": "Russian Army Reaches Center Of Myrnohrad As Ukraine Admits Retreats (Videos)\nOn December 10, the Russian military reached the center of Myrnohrad as it continued operations to neutralize all Ukrainian troops besieged in the city which is located right next to Pokrovsk in Donetsk.\nTroops from the Tsentr [Center] Group of Forces reached the center of Mynohard, also known as Dimitrov, after securing larges in the southern and eastern parts of the city.\nAn area with the size of 6.1 square kilometers, including multiple tree lines and several high-rise buildings, in the south of the city was captured by the troops, who also made gains in the eastern part of the city and captured all of Svetloye microdistrict in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832746Z"
    },
    {
      "original": "Russian Army Reaches Center Of Myrnohrad As Ukraine Admits Retreats (Videos)\nOn December 10, the Russian military reached the center of Myrnohrad as it continued operations to neutralize all Ukrainian troops besieged in the city which is located right next to Pokrovsk in Donetsk.\nTroops from the Tsentr [Center] Group of Forces reached the center of Mynohard, also known as Dimitrov, after securing larges in the southern and eastern parts of the city.\nAn area with the size of 6.1 square kilometers, including multiple tree lines and several high-rise buildings, in the south of the city was captured by the troops, who also made gains in the eastern part of the city and captured all of Svetloye microdistrict in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832755Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Hackers Expose Over 2,000 Drone and Military Equipment Production Sites for Ukrainian Forces\nThe intensity of strikes on December 9-10 was relatively low. Ukrainian\n Air Force reported Russian forces launched 80 strike drones, downing 50. Russian Air Defense destroyed 20 Ukrainian UAVs over Bryansk, Kaluga, Belgorod, and Moscow regions.\nThese now-routine attacks once again paralyzed Ukraine's energy system and coincided in timing with a statement by Russian hackers about creating a unique tool for planning future strikes. The KillNet collective presented a closed online platform, MATRIX, whose key module is a dynamic map of Ukrainian military-industrial complex facilities. The platform is reportedly based on data \"obtained through the compromise of Ukrainian information sources and systems,\" including results from hacking the database of a drone manufacturers' marketplace and the servers of the company \"Boevi Ptakhy Ukrainy\".\n👉\n Read more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832764Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Hackers Expose Over 2,000 Drone and Military Equipment Production Sites for Ukrainian Forces\nThe intensity of strikes on December 9-10 was relatively low. Ukrainian\n Air Force reported Russian forces launched 80 strike drones, downing 50. Russian Air Defense destroyed 20 Ukrainian UAVs over Bryansk, Kaluga, Belgorod, and Moscow regions.\nThese now-routine attacks once again paralyzed Ukraine's energy system and coincided in timing with a statement by Russian hackers about creating a unique tool for planning future strikes. The KillNet collective presented a closed online platform, MATRIX, whose key module is a dynamic map of Ukrainian military-industrial complex facilities. The platform is reportedly based on data \"obtained through the compromise of Ukrainian information sources and systems,\" including results from hacking the database of a drone manufacturers' marketplace and the servers of the company \"Boevi Ptakhy Ukrainy\".\n👉\n Read more \nHERE",
      "timestamp": "2025-12-10T17:02:33.832772Z"
    }
  ],
  "script_run_time": "2025-12-10T17:02:33.833589Z"
}