{
  "messages": [
    {
      "original": "🛵\n Дніпро - БпЛА в напрямку міста з півдня.\n🛵\nКіровоградщина - БпЛА на Кропивницький.\n🛵\n Чернігівщина - БпЛА курсом на північ Київщини.\n🛵\nКиївщина - БпЛА повз Іваньків, північно-західним курсом.\n🛵\n БпЛА на півночі Рівненщини, в західному напрямку.",
      "timestamp": "2026-01-20T11:15:54.019654Z"
    },
    {
      "original": "🛵\n Полтавщина - БпЛА повз Миргород - в південно-західному напрямку.",
      "timestamp": "2026-01-20T11:15:54.019672Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-20T11:15:54.019682Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2026-01-20T11:15:54.019686Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Житомир з північного напрямку.\n🛵\n БпЛА північніше Димера на Київщині, курс західний.\n🛵\n БпЛА в Ніжинському районі Чернігівщини, курс південно-західний.\n🛵\n БпЛА Шосткинському районі Сумщини, курс західний.\n🛵\n БпЛА в районі Кам'янського водосховища, курсом на Кременчук.\n🛵\n БпЛА східніше Чугуєва на Харківщині, курс східний.\n🛵\n БпЛА в Синельниківському районі Дніпропетровщини, курс північний",
      "timestamp": "2026-01-20T11:15:54.019700Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2026-01-20T11:15:54.019705Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Житомир!",
      "timestamp": "2026-01-20T11:15:54.019711Z"
    },
    {
      "original": "🛵\n Київщина: група БпЛА \n➡️\n у напрямку Макарова.",
      "timestamp": "2026-01-20T11:15:54.019716Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 27 РАКЕТ ТА 315 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 січня (з 19:00 19 січня) противник атакував однією протикорабельною ракетою “Циркон” (район пуску ТОТ АР Крим), 18 балістичними ракетами Іскандер-М/С-300 (район пусків - Брянська, Ростовська області – рф.),  15 крилатими ракетами Х-101  (район пуску Вологодська область – рф), а також 339 ударними БпЛА типу Shahed, Гербера, Італмас і безпілотниками інших типів із напрямків: Курськ, Орел, Міллерово, Приморсько-Ахтарськ, Шаталово, Брянськ – рф., Гвардійське, Чауда – ТОТ АР Крим, ТОТ Донецьк, близько 250 із них – \"шахеди\".\n❗️\nОсновний напрямок удару – Київщина.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 10:00, протиповітряною обороною збито/подавлено 342 цілі: 14 балістичних ракет Іскандер-М/С-300, 13 крилатих ракет Х-101 та 315 ворожих БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 5 ракет та 24 ударних БпЛА на 11 локаціях, а також падіння збитих (уламки) БпЛА на 12 локаціях. Інформація щодо 2 ворожих ракет уточнюється.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-20T11:15:54.019735Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2026-01-20T11:15:54.019740Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у передмісті Чернігова.\n🛵\n Київщина: БпЛА \n➡️\n у напрямку Іванкова.",
      "timestamp": "2026-01-20T11:15:54.019747Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n на півночі Чернігівщини. Курс \n➡️\n на Київщину.",
      "timestamp": "2026-01-20T11:15:54.019753Z"
    },
    {
      "original": "🛵\n Чернігівщина:\n- БпЛА повз Прилуки \n➡️\n у напрямку Полтавщини. \n- група БпЛА повз Славутич \n➡️\n у напрямку Гончарівського.",
      "timestamp": "2026-01-20T11:15:54.019761Z"
    },
    {
      "original": "🛵\n БпЛА із Чернігівщини \n➡️\n у напрямку Києва.",
      "timestamp": "2026-01-20T11:15:54.019771Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n у напрямку Пирятина.",
      "timestamp": "2026-01-20T11:15:54.019776Z"
    },
    {
      "original": "Швидкісна ціль через Чернігівщину повз Козелець!",
      "timestamp": "2026-01-20T11:15:54.019779Z"
    },
    {
      "original": "Швидкісна ціль через Чернігівщину повз Козелець!",
      "timestamp": "2026-01-20T11:15:54.019782Z"
    },
    {
      "original": "Курс \n➡️\n на Київщину!",
      "timestamp": "2026-01-20T11:15:54.019787Z"
    },
    {
      "original": "Курс \n➡️\n на Київщину!",
      "timestamp": "2026-01-20T11:15:54.019791Z"
    },
    {
      "original": "Курсом на Димер!",
      "timestamp": "2026-01-20T11:15:54.019795Z"
    },
    {
      "original": "🛵\n🛸\n  Група БпЛА \n➡️\n над Запоріжжям/околицями.",
      "timestamp": "2026-01-20T11:15:54.019802Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n у напрямку Пирятина.",
      "timestamp": "2026-01-20T11:15:54.019808Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА повз Лубни \n➡️\n у напрямку Миргорода.",
      "timestamp": "2026-01-20T11:15:54.019813Z"
    },
    {
      "original": "Russia's Rubicon unit has published new footage showing a series of drone strikes on rear Ukrainian targets.\nTargets hit include:\n- A 19Zh6 radar + a trailer in Mykolaiv Oblast (47.07939, 32.09680), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.40642, 35.73496), ~63 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.42119, 35.82679), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.80733, 35.38527), ~114 km from the frontline.\n- A P-18 radar in Dnipropetrovsk Oblast (48.81586, 35.75437), ~101 km from the frontline.\n- A P-18MU radar + a truck in Mykolaiv Oblast (46.97961, 31.70417), ~47 km from the frontline.\n- Command and control vehicle for a P-18MA radar in Mykolaiv Oblast (47.22859, 32.542), ~63 km from the frontline.\n- Command and control vehicle for a 36D6 radar in Odesa Oblast (46.60873, 30.91776), ~45 km from the frontline.\n- A 36D6 radar in Kharkiv Oblast (49.40271, 36.61234), ~75 km from the frontline.\n- A Buk Surface-to-air missile system in Dnipropetrovsk Oblast (48.3567, 36.24613), ~38 km from the frontline.\n- 4 strikes on the \"Hirnyk\" 35 kV electrical substation in Donetsk Oblast (48.58938, 37.48830), ~8 km from the frontline.",
      "timestamp": "2026-01-20T11:15:54.785604Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-20T11:15:54.785616Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-20T11:15:54.785619Z"
    },
    {
      "original": "Disappeared near Zolochiv, Kharkiv Oblast.",
      "timestamp": "2026-01-20T11:15:54.785624Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-20T11:15:54.785627Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-20T11:15:54.785630Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-20T11:15:54.785633Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-20T11:15:54.785636Z"
    },
    {
      "original": "Another explosion in Zolochiv, impacting the same target.",
      "timestamp": "2026-01-20T11:15:54.785639Z"
    },
    {
      "original": "Four Russian Tornado-S rockets impacted the \"Kharkivska\" 330 kV electrical substation in the Slobidskyi District of Kharkiv City. Strong explosions were heard and a large fire subsequently broke out.\nCoordinates: 49.961754, 36.280484",
      "timestamp": "2026-01-20T11:15:54.785643Z"
    },
    {
      "original": "Four Russian Tornado-S rockets impacted the \"Kharkivska\" 330 kV electrical substation in the Slobidskyi District of Kharkiv City. Strong explosions were heard and a large fire subsequently broke out.\nCoordinates: 49.961754, 36.280484",
      "timestamp": "2026-01-20T11:15:54.785649Z"
    },
    {
      "original": "DTEK, Ukraine's largest private investor in the energy sector, published photos claiming to show damage to a substation in Odesa City following Russian Geran-2 drone strikes overnight. \nHowever, the photos turned out to be edited screenshots from an older video of theirs showing damage to the Artsyz substation in Artsyz, Odesa Oblast, after it was attacked by missiles and drones on December 18, 2025. \nGeran strikes were indeed carried out on energy infrastructure in Odesa City last night, but these images do not show the damage from this.",
      "timestamp": "2026-01-20T11:15:54.785654Z"
    },
    {
      "original": "Overnight, a Russian Geran-2 drone struck the railway bridge in the town of Vasylkivka, Dnipropetrovsk Oblast.\nThe drone was equipped with a phosphorus warhead, which resulted in a fire breaking out that burned for over 3 hours, melting the metal of the bridge.\nSince then, at least 2 more Geran strikes have been carried out on a different target in Vasylkivka. \nBridge coordinates: 48.20796, 36.00145",
      "timestamp": "2026-01-20T11:15:54.785658Z"
    },
    {
      "original": "Another large-scale combined Russian missile and drone attack is underway on Ukraine.\nSo far, at least 18 Iskander-M ballistic missiles have been used, with around 15 targeting energy infrastructure in Kyiv and 3 targeting Dnipro. \n~11 (!) Iskanders were shot down in three waves near Kyiv due to new patriot deliveries. 2 impacted the CHP-6 power plant, 2 impacted CHP-4 power plant. \nAll the Iskanders that targeted Dnipro impacted their targets. \nAdditionally, 2 Iskander-I ballistic missiles (Iskander-M with a 1,000 km range) launched from near Novorossiysk, Krasnodar Krai, impacted a target southeast of Vinnytsia City, Vinnytsia Oblast. \nAs for strategic aviation, at least 4 Tu-95MS strategic bombers are airborne from Olenya Airbase, Murmansk Oblast, flying to their launch lines in Engels District, Saratov Oblast, where they will likely launch Kh-101 cruise missiles in the next 2.5 hours. \n2-3 Buyan-M corvettes from Kaspiysk Naval Base are equipped with Kalibr cruise missiles in the Caspian Sea. They may launch missiles later on too. \nI likely wont cover the rest of this attack today as I will be busy for most of the time, but I aim to post a full summary + the consequences afterwards.",
      "timestamp": "2026-01-20T11:15:54.785666Z"
    },
    {
      "original": "Another large-scale combined Russian missile and drone attack is underway on Ukraine.  So far, at least 18 Iskander-M ballistic missiles have been used, with around 15 targeting energy infrastructure in Kyiv and 3 targeting Dnipro.   ~11 (!) Iskanders were…",
      "timestamp": "2026-01-20T11:15:54.785670Z"
    },
    {
      "original": "Footage showing a portion of the Patriot activity against Russian Iskander-M ballistic missiles over Kyiv overnight. \nThese videos are recorded from the same location. Clip 1 shows an attack on the CHP-4 power plant in southeastern Kyiv, and clip 2 shows an attack on the CHP-5 power plant.\nApproximately 11 Iskander-Ms were shot down, with around 4 impacts being recorded to CHP-4 and CHP-6 power plants. \nVideo credit: \nIntel Cams | OSINT",
      "timestamp": "2026-01-20T11:15:54.785675Z"
    },
    {
      "original": "Footage showing a portion of the Patriot activity against Russian Iskander-M ballistic missiles over Kyiv overnight. \nThese videos are recorded from the same location. Clip 1 shows an attack on the CHP-4 power plant in southeastern Kyiv, and clip 2 shows an attack on the CHP-5 power plant.\nApproximately 11 Iskander-Ms were shot down, with around 4 impacts being recorded to CHP-4 and CHP-6 power plants. \nVideo credit: \nIntel Cams | OSINT",
      "timestamp": "2026-01-20T11:15:54.785681Z"
    },
    {
      "original": "At least 7 Tu-95MS strategic bombers carried out launch maneuvers in Vologda Oblast around 30 minutes ago. These launches were likely simulated, and real ones are expected from either Saratov or Volgograd Oblasts.",
      "timestamp": "2026-01-20T11:15:54.785684Z"
    },
    {
      "original": "6-7 Tu-95MS carried out repeated launch maneuvers. If the launches were real, Kh-101 cruise missiles should enter Ukrainian airspace in the next hour.",
      "timestamp": "2026-01-20T11:15:54.785689Z"
    },
    {
      "original": "Working on a map of the attack now. Nothing special happened, only Kh-101 cruise missiles were used for the second half.",
      "timestamp": "2026-01-20T11:15:54.785692Z"
    },
    {
      "original": "It turns out the 2 Iskander-I ballistic missiles used were actually Zircon hypersonic cruise missiles launched from Cape Chauda, Crimea.",
      "timestamp": "2026-01-20T11:15:54.785695Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~8 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~7 Iskander-M ballistic missiles launched from OTRK installations south of Pochep, Bryansk Oblast. \n~4 Iskander-M ballistic missiles launched from OTRK installations in the vicinity of Taganrog, Rostov Oblast.\n~12 Kh-101 cruise missiles launched from 4 Tu-95MS strategic bombers at their launch lines near the village of Uzmore, Saratov Oblast. \n~9 Kh-101 cruise missiles launched from 3 Tu-95MS strategic bombers at their launch lines in western Penza Oblast.\n~2 Zircon hypersonic cruise missiles launched from ground-based installations at Cape Chauda, Crimea. \n-----------------------\nTotal missiles launched:\n~19 Iskander-M ballistic missiles.\n~21 Kh-101 cruise missiles.\n~2 Zircon hypersonic cruise missiles.\n~42 missiles in total.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, it appears that Ukrainian air defence was able to intercept at least 11 Iskander-Ms and 7 Kh-101s.\n-----------------------\nThe main targets for this strike was Ukrainian energy and defence industry infrastructure. The following was targeted:\n\"Zakhidna\" 330 kV electrical substation, Kyiv Oblast (50.46635, 30.25184) by ~9 Kh-101s.\nUnknown target southeast of Bila Tserkva, Kyiv Oblast by ~5 Kh-101s.\nDnepropress Heavy Hydraulic Press Plant, Dnipropetrovsk Oblast (48.39373, 35.00303) by ~4 Iskander-Ms.\nCHP-6 Combined Heat and Power Plant, Kyiv Oblast (50.53188, 30.66309) by ~2 Iskander-Ms.\nCHP-4 Combined Heat and Power Plant, Kyiv Oblast  (50.44693, 30.64255) by ~2 Iskander-Ms.\nUnknown target southeast of Vinnytsia City, Vinnytsia Oblast by ~2 Zircons. \n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is sometimes lower than actual launches.",
      "timestamp": "2026-01-20T11:15:54.785714Z"
    },
    {
      "original": "Russia has begun using a new location to launch their Iskander-M ballistic missiles, south of the town of Pochep (circled in orange). This location was used to attack Kyiv overnight.\nThe other two known launch locations are northwest of Klintsy and in the vicinity of Bryansk City (circled in yellow).",
      "timestamp": "2026-01-20T11:15:54.785718Z"
    },
    {
      "original": "Energy Crisis in Ukraine: Awaiting a New Massive Russian Strike\nUkrainian monitoring resources are recording signs that Russia is preparing a missile strike within the next 48 hours. According to their data, bombers are being redeployed from distant bases to operational airfields for combat sorties. The country's leadership has been expecting a massive air raid on the energy system for several nights, one capable of finishing it off amidst peak frosts and provoking a humanitarian crisis. However, the anticipated strike has not yet occurred, although tension is mounting.\nIt is reported that Ukraine's energy system is in a state of deep crisis: generation is now primarily reliant on nuclear power plants, as there are no other types of power plants that have not been targeted by attacks. Strikes on energy and logistics create a cumulative effect, undermining defensive capabilities. According to \"Ukrenergo\" data from January 19, the average availability of electricity across Ukraine is 9 hours per day (37.3%), with the worst indicators in Poltava Oblast (20.8%) and the best in Kyiv Oblast (62.5%). The weekly average is 10.2 hours (42.4%).\n👉\n Read more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548441Z"
    },
    {
      "original": "Energy Crisis in Ukraine: Awaiting a New Massive Russian Strike\nUkrainian monitoring resources are recording signs that Russia is preparing a missile strike within the next 48 hours. According to their data, bombers are being redeployed from distant bases to operational airfields for combat sorties. The country's leadership has been expecting a massive air raid on the energy system for several nights, one capable of finishing it off amidst peak frosts and provoking a humanitarian crisis. However, the anticipated strike has not yet occurred, although tension is mounting.\nIt is reported that Ukraine's energy system is in a state of deep crisis: generation is now primarily reliant on nuclear power plants, as there are no other types of power plants that have not been targeted by attacks. Strikes on energy and logistics create a cumulative effect, undermining defensive capabilities. According to \"Ukrenergo\" data from January 19, the average availability of electricity across Ukraine is 9 hours per day (37.3%), with the worst indicators in Poltava Oblast (20.8%) and the best in Kyiv Oblast (62.5%). The weekly average is 10.2 hours (42.4%).\n👉\n Read more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548458Z"
    },
    {
      "original": "FROM BLACKOUTS TO BREAKTHROUGHS: RUSSIA INTENSIFIES OFFENSIVE AS KYIV'S GRID COLLAPSES",
      "timestamp": "2026-01-20T11:15:55.548461Z"
    },
    {
      "original": "Syrian Government Expands Control In Kurdish Al-Hasakah As Deal With SDF Collapses (Videos)\nThe forces of the Syrian Transitional Government (STG) on January 19 consolidated their control over one of the largest towns in the southern al-Haskaah countryside, and began advancing in the northern countryside of the Kurdish-majority governorate amid reports suggesting that the merger agreement reached with the Syrian Democratic Forces (SDF) has collapsed. \nThe state-run SANA news agency, citing a military source, confirmed that government forces took over the town of al-Shaddadi, and released footage from the town.\nEarlier, the SDF said that its fighters lost control of a prison near the town with thousands of ISIS detainees. The STG accused the group of releasing the detainees and said that it directed its forces to secure the prison and recapture anyone who escaped. However, the group released videos confirming that it was government forces that let the detainees out. \nRead more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548469Z"
    },
    {
      "original": "Syrian Government Expands Control In Kurdish Al-Hasakah As Deal With SDF Collapses (Videos)\nThe forces of the Syrian Transitional Government (STG) on January 19 consolidated their control over one of the largest towns in the southern al-Haskaah countryside, and began advancing in the northern countryside of the Kurdish-majority governorate amid reports suggesting that the merger agreement reached with the Syrian Democratic Forces (SDF) has collapsed. \nThe state-run SANA news agency, citing a military source, confirmed that government forces took over the town of al-Shaddadi, and released footage from the town.\nEarlier, the SDF said that its fighters lost control of a prison near the town with thousands of ISIS detainees. The STG accused the group of releasing the detainees and said that it directed its forces to secure the prison and recapture anyone who escaped. However, the group released videos confirming that it was government forces that let the detainees out. \nRead more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548476Z"
    },
    {
      "original": "From Zakotnoye To Prishib: Russia Develops Attack In Krasnolimansk, Move To Blockade Ukrainian Forces \nIn the Krasnolimansk area, Russian \"West\" Grouping units have advanced along the Siverskyi Donets River and are fighting counterbattles on the southern outskirts of Krasny Liman. In the Kupiansk area, intense fighting continues in the city, and Ukrainian forces are attempting to break through the defenses from Kondrashovka and Radkovka.\nIn the Stepovoye–Mali Shcherbaky sector of Zaporizhzhia , Russian air-assault units have resumed their offensive, clearing destroyed settlements and forest belts amid active drone counteraction. In the Sumy and Kharkiv areas, Russian assault groups have advanced 700 and 650 meters, respectively. The Ukrainian command in the Kharkiv area is having difficulty using foreign mercenaries.\nHungarian Prime Minister Viktor Orbán has expressed skepticism about the possible deployment of European peacekeeping forces to Ukraine in the future.\nRead more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548485Z"
    },
    {
      "original": "From Zakotnoye To Prishib: Russia Develops Attack In Krasnolimansk, Move To Blockade Ukrainian Forces \nIn the Krasnolimansk area, Russian \"West\" Grouping units have advanced along the Siverskyi Donets River and are fighting counterbattles on the southern outskirts of Krasny Liman. In the Kupiansk area, intense fighting continues in the city, and Ukrainian forces are attempting to break through the defenses from Kondrashovka and Radkovka.\nIn the Stepovoye–Mali Shcherbaky sector of Zaporizhzhia , Russian air-assault units have resumed their offensive, clearing destroyed settlements and forest belts amid active drone counteraction. In the Sumy and Kharkiv areas, Russian assault groups have advanced 700 and 650 meters, respectively. The Ukrainian command in the Kharkiv area is having difficulty using foreign mercenaries.\nHungarian Prime Minister Viktor Orbán has expressed skepticism about the possible deployment of European peacekeeping forces to Ukraine in the future.\nRead more \nHERE",
      "timestamp": "2026-01-20T11:15:55.548492Z"
    },
    {
      "original": "Air Defenses And Radars Hit: Summary Of Russian Combat Footage From January 19, 2026 \nOn January 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-20T11:15:55.548498Z"
    },
    {
      "original": "Air Defenses And Radars Hit: Summary Of Russian Combat Footage From January 19, 2026 \nOn January 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-20T11:15:55.548504Z"
    }
  ],
  "script_run_time": "2026-01-20T11:15:55.549237Z"
}