{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південно-східного напрямку.",
      "timestamp": "2026-01-08T07:37:59.195019Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу на Кривий Ріг.",
      "timestamp": "2026-01-08T07:37:59.195038Z"
    },
    {
      "original": "🛵\n БпЛА з півдня на м.Запоріжжя.",
      "timestamp": "2026-01-08T07:37:59.195043Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-08T07:37:59.195051Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-08T07:37:59.195056Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини на Кіровоградщину, курс північно-західний.",
      "timestamp": "2026-01-08T07:37:59.195060Z"
    },
    {
      "original": "🛵\n Група БпЛА курсом на м.Дніпро з південно-західного напрямку.",
      "timestamp": "2026-01-08T07:37:59.195065Z"
    },
    {
      "original": "🛵\n БпЛА в Запорізькій області курсом на Дніпропетровщину (Нікопольський район).",
      "timestamp": "2026-01-08T07:37:59.195073Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на Шахтарське.",
      "timestamp": "2026-01-08T07:37:59.195078Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2026-01-08T07:37:59.195083Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-08T07:37:59.195087Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Дніпропетровщини курсом на захід.",
      "timestamp": "2026-01-08T07:37:59.195091Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-08T07:37:59.195096Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу курсом на Павлоград.",
      "timestamp": "2026-01-08T07:37:59.195100Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Південне.",
      "timestamp": "2026-01-08T07:37:59.195105Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Миколаївщину.",
      "timestamp": "2026-01-08T07:37:59.195109Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 70 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 08 січня (з 19:00 07 січня) противник атакував 97 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Приморсько-Ахтарськ – рф., Чауда, Гвардійське – ТОТ АР Крим, Донецьк - ТОТ України, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено 70 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на сході та півдні країни.\nЗафіксовано влучання 27 ударних БпЛА на 13 локаціях, а також падіння збитих (уламки) на одній локації.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-08T07:37:59.195129Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2026-01-08T07:37:59.195134Z"
    },
    {
      "original": "🛵\n Запорізька область: БпЛА \n➡️\n в районі Комишувахи. \n🛵\n Донеччина: БпЛА \n➡️\n у напрямку Добропілля.",
      "timestamp": "2026-01-08T07:37:59.195142Z"
    },
    {
      "original": "🛵\n Запорізька область: БпЛА \n➡️\n в районі Комишувахи.  \n🛵\n Донеччина: БпЛА \n➡️\n у напрямку Добропілля.",
      "timestamp": "2026-01-08T07:37:59.195150Z"
    },
    {
      "original": "🛵\n Групи БпЛА \n➡️\n повз Марганець у напрямку Нікополя.",
      "timestamp": "2026-01-08T07:37:59.195155Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-08T07:37:59.771720Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-08T07:37:59.771735Z"
    },
    {
      "original": "Nick just cannot keep the \"America First\" narrative consistent, and the invasion of Venezuela is showing this to everyone with functioning memories. \nHis reliance on the assumption that he is automatically right, and that anyone else saying anything different must be wrong, is showing more and more. More proof that intelligence isn't the only thing you need to make logical, consistent arguments. \nAlso, it's so funny seeing him getting ratio'd on his own channel \n🤣",
      "timestamp": "2026-01-08T07:37:59.771742Z"
    },
    {
      "original": "People will say “he got the call” or some shit but really he was just using that niche, antisemitic, anti authoritarian, counterculture young male angst to propel him into the next strata.\nOnce he got there he did the only thing he could to make him more successful.\nSo goes the world unfortunately.",
      "timestamp": "2026-01-08T07:37:59.771747Z"
    },
    {
      "original": "The Ukrainian 108th Territorial Defence Brigade acknowledged recent claims of mistreatment of soldiers, stating that \"some soldiers have been sent for additional training\".\nDeepstate has also said that they have received many messages from relatives of soldiers fighting in \"one of the battalions of the 108th\" (probably referring to 100th Territorial Defence Battalion) regarding problems with middle-level commanders. \nThe 108th Brigade is currently defending the area of the village of Bilohirya - a previously quiet section of the front recently reactivated after Russian forces managed to capture almost all of the village. Russian forces are currently attempting to exploit their successes for additional gains in the area. It is known that the 100th battalion of the 108th brigade carried out multiple unsuccessful counterattacks during the fighting for Bilohirya towards the end of December, so it's possible that this is what these complaints are referring to.",
      "timestamp": "2026-01-08T07:37:59.771752Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to advance through Prymorske, and are coming closer to establishing full control over the village.\nFollowing earlier deep infiltrations by DRGs, Russian forces managed to enter and capture the central part of Prymorske, allowing for them to begin attacking the eastern part of the village from two directions. The eastern streets were subsequently brought under full Russian control, along with the nearby forested areas. \nMeanwhile, DRGs continued to penetrate to the northern outskirts of Prymorske, which looks to have been mostly abandoned by Ukraine. It's likely that Ukrainian forces are attempting to turn northern Prymorske into a kill zone with drones to prevent Russian consolidation and accumulation for future attacks. \n+ ~3.27 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771760Z"
    },
    {
      "original": "HIMARS launches from Chuhuiv, Kharkiv Oblast, in the direction of Vovchansk and then Belgorod Oblast.",
      "timestamp": "2026-01-08T07:37:59.771763Z"
    },
    {
      "original": "Repeated HIMARS launches. \nThey are being launched from northeast of Pechenihy, and are flying past Vovchansk in the direction of Shebekino, Belgorod Oblast.",
      "timestamp": "2026-01-08T07:37:59.771767Z"
    },
    {
      "original": "Trump is so happy if you've seen any video of him lately its like he's been re-elected for a 10th term and he's been given 100 peace prizes.\nThat is extremely dangerous because he got that happiness from breaking laws and invading a country.\nIf there is no consequences, trust me. He will do it again.",
      "timestamp": "2026-01-08T07:37:59.771772Z"
    },
    {
      "original": "Trump is so happy if you've seen any video of him lately its like he's been re-elected for a 10th term and he's been given 100 peace prizes.  That is extremely dangerous because he got that happiness from breaking laws and invading a country.  If there is…",
      "timestamp": "2026-01-08T07:37:59.771776Z"
    },
    {
      "original": "Trump's not really any different from any other US president in recent history. He's just got no filter and is open about his intent for American imperialism. This gives people no excuse anymore to deny their goals of restoring hegemony.",
      "timestamp": "2026-01-08T07:37:59.771779Z"
    },
    {
      "original": "The only reason why people are recognising this intent is because its easy and accepted to bash Trump as a clown. Essentially, he is destroying his own narrative literally by being himself.",
      "timestamp": "2026-01-08T07:37:59.771782Z"
    },
    {
      "original": "Fighting has resumed in the al Ashrafiya and Sheikh Maqsoud neighbourhoods of northern Aleppo as STG government forces are expected to launch a full-scale operation to capture the SDF-held enclave.\nThis comes as last-minute U.S. backed peace talks failed, which would have seen the enclave be handed over to the STG peacefully. The STG is shelling the Kurdish-majority neighbourhoods with grad rockets, and bringing in additional reinforcements.",
      "timestamp": "2026-01-08T07:37:59.771786Z"
    },
    {
      "original": "Fighting has resumed in the al Ashrafiya and Sheikh Maqsoud neighbourhoods of northern Aleppo as STG government forces are expected to launch a full-scale operation to capture the SDF-held enclave.\nThis comes as last-minute U.S. backed peace talks failed, which would have seen the enclave be handed over to the STG peacefully. The STG is shelling the Kurdish-majority neighbourhoods with grad rockets, and bringing in additional reinforcements.",
      "timestamp": "2026-01-08T07:37:59.771790Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance, further expanding their zone of control west of Hulyaipole amid significantly intensified assault operations.\nIn the north, Russian forces advanced west from the northwestern part of Hulyaipole, breaking through Ukrainian positions along the treelines on the tactical heights and reaching the area of the special education school, which was subsequently brought under their control. Infiltrations by both DRGs and ordinary assault groups were then carried out into the villages of Staroukrainka, Sviatopetrivka, and Zelene, where the Ukrainians are attempting to carry out clearing operations. The Russian zone of control was also expanded in the treelines to the south of this spearhead.\nTo the south, Russian forces continued pushing along the highway and captured new treeline positions west of the agricultural buildings. DRGs continued their infiltrations into Zaliznychne, which is being further reinforced by the Ukrainian command. \nIn the southeast, Russian forces continued to incrementally advance south of Hulyaipole, where they pushed past the highway and consolidated in new treeline positions there.\n+ ~6.82 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771798Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations and have made significant progress in the fortifications southeast of Novopavlivka.\nFollowing their successes in the town and the elimination of the Ukrainian salient to the south, Russian forces continued advancing north along the fortified tactical heights, capturing new positions along four parallel treelines. From there, they advanced further north up another two treelines, while infiltrations took place towards the northeastern outskirts of Novopavlivka. \n+ ~7.91 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771804Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces launched a series of counterattacks in the direction of Udachne.\nFollowing the Russian capture of the Pokrovsk Coal mine, Ukrainian forces recaptured the forest plantations in the gulleys to the west. From there, they are infiltrating in small groups in the direction of the Udachne school and the agricultural buildings, where clashes took place with Russian troops.\nMeanwhile, Russian forces resumed their assault operations north of the Pokrovsk Coal Mine after weather conditions improved, and are attempting to take up new positions in the treelines there.\n+ ~1.39 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771811Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces resumed their counterattacks in Rodynske, where they recaptured positions in the northern part of the city. \nFollowing improvements in weather conditions, the Ukrainian 20th brigade \"Lyubart\" recently launched a series of attacks in the northern part of the city, re-establishing control over the highschool and capturing a block of buildings in the area of the firestation. Other assault groups broke into the northern low-rise residential streets, consolidating in large parts of it and reinforcing positions previously in the mixed grey-zone. \nAttempts are now underway to bypass the highschool, while Russian forces are carrying out intensified strikes with FAB glide-bombs on Ukrainian positions in the area of the school, the firestation, and in the low-rise streets. Russian assault groups continue their attacks from their foothold in the northeastern streets, where they are attempting to resecure parts of the grey-zone. Back-and-forth fighting also continues in the southwestern part of the city. \n+ ~0.32 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771818Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations following a series of Ukrainian counterattacks.\nRussian forces advanced north from the village of Shakhove, breaking through the kill-zone imposed by Ukrainian drones, and entrenching in the forests to the north. From there, they began advancing to the west, reaching the clay quarries and establishing control over treeline positions. Other assault groups improved their positions northwest of Shakhove in additional forested areas.\n+ ~8.72 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T07:37:59.771824Z"
    },
    {
      "original": "Syrian Government Forces Are About To Storm Kurdish Neighborhoods In Aleppo City (Videos)\nClashes have renewed in the northern Syrian city of Aleppo between the forces of the Islamist-led Interim Government and fighters affiliated with the Syrian Democratic Forces (SDF), with reports indicating that Damascus had made the decision to go to war against the Kurdish-led group.\nTensions between the Interim Government and the SDF have been building up for months over the failure to implement the integration agreement signed last March.\nThe end of the year deadline passed with no progress, and direct talks held in Damascus on January 4 failed to produce any meaningful understanding.\nThe clashes broke out around the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh on January 6, with each side accusing the other of attacking first.\nMultiple attempts to de-escalate failed, and by the end of the day it became clear that government forces are preparing an operation to capture the neighborhoods.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.346914Z"
    },
    {
      "original": "Syrian Government Forces Are About To Storm Kurdish Neighborhoods In Aleppo City (Videos)\nClashes have renewed in the northern Syrian city of Aleppo between the forces of the Islamist-led Interim Government and fighters affiliated with the Syrian Democratic Forces (SDF), with reports indicating that Damascus had made the decision to go to war against the Kurdish-led group.\nTensions between the Interim Government and the SDF have been building up for months over the failure to implement the integration agreement signed last March.\nThe end of the year deadline passed with no progress, and direct talks held in Damascus on January 4 failed to produce any meaningful understanding.\nThe clashes broke out around the Kurdish neighborhoods of Sheikh Maqsoud and Ashrafieh on January 6, with each side accusing the other of attacking first.\nMultiple attempts to de-escalate failed, and by the end of the day it became clear that government forces are preparing an operation to capture the neighborhoods.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.346944Z"
    },
    {
      "original": "Military Situation In Northern Palestine On January 7, 2026 (Map Update)",
      "timestamp": "2026-01-08T07:38:00.346953Z"
    },
    {
      "original": "U.S. Seizes Russian Tanker Linked To Venezuela In Major Escalation (Photos, Video)\nThe United States military on January 7 seized the Russian-flagged oil tanker Marinera in the North Atlantic, after pursuing it all the way from the Caribbean Sea.\nIn a statement, the U.S. European Command stated that the tanker was seized in coordination with the Justice Department and the Department of Homeland Security.\nThe tanker, previously named the “Bella 1,” first came to attention last month when the U.S. Coast Guard attempted to seize it as it approached Venezuela. The crew declined to let the Americans on board at the time, and headed for the Atlantic. During the pursuit, the vessel changed its name and switched to the Russian flag.\nU.S. Secretary of State Marco Rubio revealed after the seizure that the U.S. is “about to execute on a deal” to take tens of millions of barrels of Venezuela’s oil and “sell it in the marketplace at market rates.”\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.346969Z"
    },
    {
      "original": "U.S. Seizes Russian Tanker Linked To Venezuela In Major Escalation (Photos, Video)\nThe United States military on January 7 seized the Russian-flagged oil tanker Marinera in the North Atlantic, after pursuing it all the way from the Caribbean Sea.\nIn a statement, the U.S. European Command stated that the tanker was seized in coordination with the Justice Department and the Department of Homeland Security.\nThe tanker, previously named the “Bella 1,” first came to attention last month when the U.S. Coast Guard attempted to seize it as it approached Venezuela. The crew declined to let the Americans on board at the time, and headed for the Atlantic. During the pursuit, the vessel changed its name and switched to the Russian flag.\nU.S. Secretary of State Marco Rubio revealed after the seizure that the U.S. is “about to execute on a deal” to take tens of millions of barrels of Venezuela’s oil and “sell it in the marketplace at market rates.”\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.346988Z"
    },
    {
      "original": "A Coalition of Hesitation: The Hollow Core of Europe's New Ukraine Initiative\nThis is a new attempt to draw Europe into a proxy war with Russia. The \"Coalition of the Willing\" has adopted a document that could further provoke Moscow and contribute to the escalation of the conflict. The support that European leaders have shown for Ukrainian President Volodymyr Zelensky is not as clear-cut as it seems. Washington continues to take a wait-and-see approach. Meanwhile, Paris and London have announced their intention to deploy troops to Ukraine. How will Moscow respond?\nOn January 6, the “Coalition of the Willing” held a meeting in Paris. This association consists of more than 30 countries, primarily European, which are considering participating in a potential peacekeeping mission in Ukraine. France and the United Kingdom play a coordinating role in the coalition. British Prime Minister Keir Starmer announced the coalition's formation in early March 2025. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347001Z"
    },
    {
      "original": "A Coalition of Hesitation: The Hollow Core of Europe's New Ukraine Initiative\nThis is a new attempt to draw Europe into a proxy war with Russia. The \"Coalition of the Willing\" has adopted a document that could further provoke Moscow and contribute to the escalation of the conflict. The support that European leaders have shown for Ukrainian President Volodymyr Zelensky is not as clear-cut as it seems. Washington continues to take a wait-and-see approach. Meanwhile, Paris and London have announced their intention to deploy troops to Ukraine. How will Moscow respond?\nOn January 6, the “Coalition of the Willing” held a meeting in Paris. This association consists of more than 30 countries, primarily European, which are considering participating in a potential peacekeeping mission in Ukraine. France and the United Kingdom play a coordinating role in the coalition. British Prime Minister Keir Starmer announced the coalition's formation in early March 2025. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347010Z"
    },
    {
      "original": "Cuba Shares Details Of 32 Officers Killed In Venezuela, U.S. Admits Seven Delta Troops Were Wounded \nThe Cuban government on January 6 shared the names, ranks and ages of 32 of its military personnel who were killed during the capture of Venezuelan President Nicolás Maduro by United States special forces three days earlier.\nThe personnel, ranging in age from 26 to 60, belonged to the Revolutionary Armed Forces and the Ministry of the Interior. They included colonels, lieutenants, majors and captains, as well as a number of reserve soldiers. Headshots of each one of them were released by state media.\nHavana was quick to acknowledge the deaths of the personnel who were deployed in Caracas under an agreement with the Venezuelan government.\nThe operation in Caracas was carried out by the U.S. military’s elite Delta Force. President Donald Trump said right after that “a couple of guys were hit,” but a Pentagon official told MS Now on January 7 that the number of wounded was in fact seven.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347019Z"
    },
    {
      "original": "Cuba Shares Details Of 32 Officers Killed In Venezuela, U.S. Admits Seven Delta Troops Were Wounded \nThe Cuban government on January 6 shared the names, ranks and ages of 32 of its military personnel who were killed during the capture of Venezuelan President Nicolás Maduro by United States special forces three days earlier.\nThe personnel, ranging in age from 26 to 60, belonged to the Revolutionary Armed Forces and the Ministry of the Interior. They included colonels, lieutenants, majors and captains, as well as a number of reserve soldiers. Headshots of each one of them were released by state media.\nHavana was quick to acknowledge the deaths of the personnel who were deployed in Caracas under an agreement with the Venezuelan government.\nThe operation in Caracas was carried out by the U.S. military’s elite Delta Force. President Donald Trump said right after that “a couple of guys were hit,” but a Pentagon official told MS Now on January 7 that the number of wounded was in fact seven.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347028Z"
    },
    {
      "original": "A TACTICAL TRADE-OFF: SACRIFICING GAINS AT SLAVYANSK TO WIN AT KONSTANTINOVKA AND ZAPORIZHZHIA",
      "timestamp": "2026-01-08T07:38:00.347032Z"
    },
    {
      "original": "Advance Towards Orikhiv: Russian Army Threatens Ukraine's Logistics Near Key City\nIn the Zaporizhzhia sector, Russian \"Vostok\" and \"Dnepr\" units are engaged in intense fighting, advancing toward Zaporizhzhia from the east and south. Key developments have occurred in the areas of Huliaipole, Prymorske, and Stepnohirsk, where control has been established over Lukyanivske and Novoyakovlevka.\nIn the Kharkiv sector, Russian army activity is primarily concentrated in the Vovchansk area. Russian units have advanced into parts of Staritsa and Volchanskie Khutora while successfully neutralizing several drone crews in the Zolochiv district. \nIn the Kupyansk sector, Russian troops expanded their control zone by more than a kilometer after consolidating their position in the eastern part of Tyshchenkivka. Assault operations continue in the Kurylivka area.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347040Z"
    },
    {
      "original": "Advance Towards Orikhiv: Russian Army Threatens Ukraine's Logistics Near Key City\nIn the Zaporizhzhia sector, Russian \"Vostok\" and \"Dnepr\" units are engaged in intense fighting, advancing toward Zaporizhzhia from the east and south. Key developments have occurred in the areas of Huliaipole, Prymorske, and Stepnohirsk, where control has been established over Lukyanivske and Novoyakovlevka.\nIn the Kharkiv sector, Russian army activity is primarily concentrated in the Vovchansk area. Russian units have advanced into parts of Staritsa and Volchanskie Khutora while successfully neutralizing several drone crews in the Zolochiv district. \nIn the Kupyansk sector, Russian troops expanded their control zone by more than a kilometer after consolidating their position in the eastern part of Tyshchenkivka. Assault operations continue in the Kurylivka area.\nRead more \nHERE",
      "timestamp": "2026-01-08T07:38:00.347052Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From January 7, 2026\nOn January 7, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-08T07:38:00.347065Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From January 7, 2026\nOn January 7, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-08T07:38:00.347078Z"
    }
  ],
  "script_run_time": "2026-01-08T07:38:00.347860Z"
}