{
  "messages": [
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Татарбунари.",
      "timestamp": "2025-08-20T09:35:29.958492Z"
    },
    {
      "original": "🛵\n  Одещина: під атакою \n➡️\n Ізмаїл.",
      "timestamp": "2025-08-20T09:35:29.958513Z"
    },
    {
      "original": "Миколаївська, Херсонська області - ракетна небезпека!",
      "timestamp": "2025-08-20T09:35:29.958518Z"
    },
    {
      "original": "Миколаївська, Херсонська області - ракетна небезпека!",
      "timestamp": "2025-08-20T09:35:29.958522Z"
    },
    {
      "original": "Швидкісна ціль на Миколаївщині!",
      "timestamp": "2025-08-20T09:35:29.958526Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Чернігівщини!",
      "timestamp": "2025-08-20T09:35:29.958533Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Чернігівщини!",
      "timestamp": "2025-08-20T09:35:29.958539Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на Новгород - Сіверський, Борзну",
      "timestamp": "2025-08-20T09:35:29.958551Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n повз Борову.",
      "timestamp": "2025-08-20T09:35:29.958573Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n на Сумщину. Курс \n➡️\n на Хотінь.",
      "timestamp": "2025-08-20T09:35:29.958583Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n курсом на Миргород",
      "timestamp": "2025-08-20T09:35:29.958590Z"
    },
    {
      "original": "🛸\n  Ворожі розвідувальні БпЛА \n➡️\n у Запорізькій, Чернігівській, Харківській областях. Залучено засоби для збиття!",
      "timestamp": "2025-08-20T09:35:29.958596Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Сумщини. Курс \n➡️\n на Чернігівщину.",
      "timestamp": "2025-08-20T09:35:29.958604Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному та південно-східному напрямках зберігається!\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-20T09:35:29.958610Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО БАЛІСТИЧНУ РАКЕТУ ТА 62 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 серпня (із 19.30 19 серпня) противник атакував 2-ма балістичними ракетами Іскандер-М (із ТОТ Криму), а також та 93-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Брянськ, Міллерово, Приморсько-Ахтарськ – рф., Чауда – ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено балістичну ракету Іскандер-М та 62 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання ворожої ракети та ударних БпЛА на 20 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-20T09:35:29.958632Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-20T09:35:29.958636Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Чернігівщині поблизу н.п. Березна. Залучено засоби для збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-08-20T09:35:29.958641Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-08-20T09:35:29.958647Z"
    },
    {
      "original": "☄️\n Харківщина - загроза застосування балістичного озброєння!",
      "timestamp": "2025-08-20T09:35:29.958651Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-20T09:35:29.958656Z"
    },
    {
      "original": "🚀\n Запорізька область та Дніпропетровщина  (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-20T09:35:29.958660Z"
    },
    {
      "original": "🛸\n Чернігівщина - ворожі розвідувальні БпЛА на околицях Ніжина! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-20T09:35:29.958664Z"
    },
    {
      "original": "⚠\nУвага!\nРакетна небезпека по всій території України!\nЗліт МіГ-31К!",
      "timestamp": "2025-08-20T09:35:29.958669Z"
    },
    {
      "original": "Update from the Gaza Strip - Khan Younis Governorate:\nThe IDF continued their low-intensity operations in and around the city of Khan Younis, clearing new areas and consolidating in the city centre.\nIsraeli forces resumed their clearing operations in the western part of Qizan An Najjar, and established control over the rest of this town. They also reached the former humanitarian tent complex on the western outskirts of Khan Younis, clearing it and the surrounding areas.\nAdditionally, the IDF cleared new parts of the dense urban neighbourhoods of western Khan Younis, continuing to demolish buildings and set up forward command and control points.\nPalestinian factions continued to detonate IEDs and launch rockets, albeit at a decreased rate. \n+ ~1.74km² in favour of the IDF.",
      "timestamp": "2025-08-20T09:35:30.390848Z"
    },
    {
      "original": "The target of the 2 Iskander-M strikes on Slovyansk was a temporary deployment point used by Azov (confirmed by locals). This is why it took over 12 hours for official photos to be released, compared to the usual 1-4 hours.  Coordinates: 48.8547272, 37.5837133",
      "timestamp": "2025-08-20T09:35:30.390861Z"
    },
    {
      "original": "Here's footage showing the second Iskander-M ballistic missile strike on Slovyansk, Donetsk Oblast (one previous impact can already be seen to the right of the second).\nAs I previously reported, the target was a temporary deployment point for Azov, or more specifically, the 3rd separate assault brigade. This was today confirmed by Russian sources who received the recon drone footage. Another example of the exclusive info I provide from time to time not being BS.",
      "timestamp": "2025-08-20T09:35:30.390866Z"
    },
    {
      "original": "Around an hour and a half ago, Israeli media reported that a major \"security incident\" has occurred in Israeli-occupied Rafah, southern Gaza. \nReports state that a group of 15-20 heavily armed Palestinian fighters stormed an Israeli position from a tunnel which they dug, firing Anti-tank missiles, RPGs, and heavy machine guns. The fighting lasted for around half an hour, with Palestinian forces reportedly attempting to capture Israeli soldiers. \nMultiple IDF evacuation helicopters evacuated the dead and wounded to hospitals.",
      "timestamp": "2025-08-20T09:35:30.390871Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches.",
      "timestamp": "2025-08-20T09:35:30.390875Z"
    },
    {
      "original": "Around an hour and a half ago, Israeli media reported that a major \"security incident\" has occurred in Israeli-occupied Rafah, southern Gaza.   Reports state that a group of 15-20 heavily armed Palestinian fighters stormed an Israeli position from a tunnel…",
      "timestamp": "2025-08-20T09:35:30.390878Z"
    },
    {
      "original": "Update: The attempts to capture the Israeli soldiers failed after the 30 minutes of intense clashes. The attack was supported and coordinated with a mortar unit, which fired on the Israeli positions.\nIsraeli sources claim that 8 of the ~15 militants were killed, and the rest escaped back into their tunnel. Operations to find them are ongoing, and Israeli artillery shelling was reported in the area. The target unit was the Israeli \"Haruv\" reconnaissance unit of the 900th \"Kfir\" Infantry Brigade. Kfir's last known location was in Khan Younis, which lines up with clarified Israeli reports on the location of the attack. \nThis is a very rare case of a large cell, supported by another cell from afar, carrying out an attack.",
      "timestamp": "2025-08-20T09:35:30.390883Z"
    },
    {
      "original": "Additional Iskander threat from Crimea",
      "timestamp": "2025-08-20T09:35:30.390887Z"
    },
    {
      "original": "Iskander launch from Crimea",
      "timestamp": "2025-08-20T09:35:30.390890Z"
    },
    {
      "original": "No updates on the MiG. Waiting on the Iskander to be detected.",
      "timestamp": "2025-08-20T09:35:30.390893Z"
    },
    {
      "original": "The Iskander is likely flying to Dnipro/Kryvyi Rih. Still not detected in the airspace.",
      "timestamp": "2025-08-20T09:35:30.390897Z"
    },
    {
      "original": "Iskander in the Nikopol area, flying to Kryvyi Rih",
      "timestamp": "2025-08-20T09:35:30.390900Z"
    },
    {
      "original": "The MiG-31K is flying through Lipetsk Oblast.",
      "timestamp": "2025-08-20T09:35:30.390903Z"
    },
    {
      "original": "The MiG-31K is flying through Lipetsk Oblast.",
      "timestamp": "2025-08-20T09:35:30.390910Z"
    },
    {
      "original": "The MiG is flying near the launch lines near Lipetsk City. Western course.",
      "timestamp": "2025-08-20T09:35:30.390913Z"
    },
    {
      "original": "Iskander in the Nikopol area, flying to Kryvyi Rih",
      "timestamp": "2025-08-20T09:35:30.390916Z"
    },
    {
      "original": "The Iskander disappeared",
      "timestamp": "2025-08-20T09:35:30.390919Z"
    },
    {
      "original": "2 MiG-31Ks are now confirmed to be airborne. Both in the Lipetsk area.",
      "timestamp": "2025-08-20T09:35:30.390922Z"
    },
    {
      "original": "The Iskander was a misidentification on the Ukrainian Airforce's part. No repeated launches recorded yet. Possibly an S-300/400 air defence missile.",
      "timestamp": "2025-08-20T09:35:30.390925Z"
    },
    {
      "original": "2 MiG-31Ks are now confirmed to be airborne. Both in the Lipetsk area.",
      "timestamp": "2025-08-20T09:35:30.390928Z"
    },
    {
      "original": "The MiGs are circling in the area of Lipetsk City, near the launch lines.",
      "timestamp": "2025-08-20T09:35:30.390931Z"
    },
    {
      "original": "Correction: only one MiG is operating near Lipetsk. The other is still in the area of Savasleika Airbase.",
      "timestamp": "2025-08-20T09:35:30.390934Z"
    },
    {
      "original": "Unconfirmed reports of a cruise missile in Belarusian airspace, flying south past Pinsk. A tactical aircraft of an unknown type was recorded there earlier.",
      "timestamp": "2025-08-20T09:35:30.390937Z"
    },
    {
      "original": "Unconfirmed reports of a cruise missile in Belarusian airspace, flying south past Pinsk. A tactical aircraft of an unknown type was recorded there earlier.",
      "timestamp": "2025-08-20T09:35:30.390940Z"
    },
    {
      "original": "Unidentified missile to Lutsk from the northeast",
      "timestamp": "2025-08-20T09:35:30.390943Z"
    },
    {
      "original": "The missile disappeared. It was definitely a cruise missile.",
      "timestamp": "2025-08-20T09:35:30.390946Z"
    },
    {
      "original": "UPDATED: \nTensions Simmer on Bryansk Border: Another Ukrainian Sabotage Group Neutralized\nUkrainian sabotage group was discovered and eliminated in the Bryansk region, 40 kilometers from the state border. Three were killed, three surrendered, including the commander. They planned to blow up a major railway junction and take a series of photos for new media victories. The group of Special Operation Forces were detected in the Komarichi district of the Bryansk region....\nRead more: \nHERE",
      "timestamp": "2025-08-20T09:35:30.900645Z"
    },
    {
      "original": "UPDATED: \nTensions Simmer on Bryansk Border: Another Ukrainian Sabotage Group Neutralized\nUkrainian sabotage group was discovered and eliminated in the Bryansk region, 40 kilometers from the state border. Three were killed, three surrendered, including the commander. They planned to blow up a major railway junction and take a series of photos for new media victories. The group of Special Operation Forces were detected in the Komarichi district of the Bryansk region....\nRead more: \nHERE",
      "timestamp": "2025-08-20T09:35:30.900661Z"
    },
    {
      "original": "U.S. Officials Admit Failure In Stopping Arms Shipments To Yemen’s Houthis\nThe Houthis (Ansar Allah) are still arming themselves with help from Iran and efforts by the United States and its allies to cut the group’s supply lines have been ineffective, Al-Arabiya reported on August 19, citing U.S. officials.\nRecent weeks saw forces loyal to the internationally-recognized Yemeni government, which is allied to the U.S., seizing two weapons shipments en-route to the Houthis, one from Iran loaded with advanced anti-aircraft and anti-ship missiles, and another from China containing advanced drones...\nRead more: \nHERE",
      "timestamp": "2025-08-20T09:35:30.900672Z"
    },
    {
      "original": "1,000 To 19 Somber Exchange: Unspoken Language of War’s Toll\nIn the grim arithmetic of modern conflict, few events speak more plainly than the exchange of the fallen. On August 19th, Russia and Ukraine conducted another such transfer of bodies, a stark procedure that lays bare the brutal realities of the war’s human cost. The terms of the exchange were profoundly asymmetrical: Ukraine received the bodies of one thousand of its soldiers, while Russia recovered nineteen...\nRead more: \nHERE",
      "timestamp": "2025-08-20T09:35:30.900679Z"
    },
    {
      "original": "Military Situation in Palestine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T09:35:30.900683Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T09:35:30.900690Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T09:35:30.900696Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T09:35:30.900701Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T09:35:30.900705Z"
    },
    {
      "original": "ISKANDER OVER UKRAINE PUSHES ZELENSKY TO PEACE IN WASHINGTON",
      "timestamp": "2025-08-20T09:35:30.900709Z"
    },
    {
      "original": "Zelensky's Strategy. Kiev Is Betting On Dragging Out Negotiations\nVladimir Zelensky's visit to the White House showed that he had learned from his previous unsuccessful visit to Washington. The Ukrainian leader chose to avoid direct confrontation with Donald Trump in front of the cameras. The European leaders who arrived in the US capital to support Zelensky also avoided a confrontational tone. \nTheir statements to the press seemed rather vague and meaningless. Based on these statements, one might conclude that all parties want a peaceful settlement and that there has been \"incredible progress\" in the negotiations. Yet we still do not see any concrete achievements. It's clear that the Ukrainian president won't make any concessions to the Kremlin. This means that the war will continue — through Kiev's fault.\nThere is no doubt that Donald Trump intends to end the war in Ukraine. Vladimir Zelensky is equally certain in his desire to continue the fighting...\nRead more \nHERE",
      "timestamp": "2025-08-20T09:35:30.900717Z"
    },
    {
      "original": "Trump’s Diplomatic Shake-Up Gives China Advantage In Asia-Pacific\nFor a month now, a series of layoffs has been occurring at the United States State Department. This move, along with other measures implemented by President Donald Trump in foreign policy, could reduce the role of the US in the Asia-Pacific while strengthening China’s position in the region.\nPlanned since the beginning of Trump’s presidency, the State Department’s civil service layoffs were implemented last month. The layoffs included more than 1,300 employees. The State Department explained that the move was aimed at streamlining the federal bureaucracy and for the “effective use of taxpayer dollars.”\n“The problem is not a lack of money or dedicated talent, but rather a system where everything takes too much time, costs too much money, involves too many individuals, and all too often ends up failing the American people,” a State Department statement said...”\nRead more \nHERE",
      "timestamp": "2025-08-20T09:35:30.900725Z"
    }
  ],
  "script_run_time": "2025-08-20T09:35:30.901690Z"
}