{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня.",
      "timestamp": "2025-11-28T00:54:23.281831Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-28T00:54:23.281846Z"
    },
    {
      "original": "🛵\n  БпЛА на межі Чернігівщини та Сумщини на півночі, курс на південь.",
      "timestamp": "2025-11-28T00:54:23.281852Z"
    },
    {
      "original": "⚠\nУВАГА!\nПовітряна тривога в Одеській області через роботу розвідувального БпЛА  в акваторії Чорного моря, курсом на Одещину.",
      "timestamp": "2025-11-28T00:54:23.281857Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-28T00:54:23.281862Z"
    },
    {
      "original": "🛵\n  БпЛА на півдні Миколаївщини, курс на н.п. Очаків.",
      "timestamp": "2025-11-28T00:54:23.281869Z"
    },
    {
      "original": "⚠\nУВАГА!\nПовітряна тривога в Одеській області через роботу розвідувального БпЛА.",
      "timestamp": "2025-11-28T00:54:23.281874Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-28T00:54:23.281882Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-28T00:54:23.281886Z"
    },
    {
      "original": "🛵\n  БпЛА на Харків з півночі.",
      "timestamp": "2025-11-28T00:54:23.281891Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-28T00:54:23.281895Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-28T00:54:23.281900Z"
    },
    {
      "original": "В напрямку Запоріжжя! Перебувайте в укриттях!",
      "timestamp": "2025-11-28T00:54:23.281903Z"
    },
    {
      "original": "🛸\nНа південь від Запоріжжя - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження.\n🚀\nПовторно КАБ у напрямку Запоріжжя! Перебувайте в укриттях!",
      "timestamp": "2025-11-28T00:54:23.281909Z"
    },
    {
      "original": "🛵\n  БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-28T00:54:23.281914Z"
    },
    {
      "original": "🛵\n  БпЛА в напрямку Куп'янська на Харківщині з півночі.",
      "timestamp": "2025-11-28T00:54:23.281918Z"
    },
    {
      "original": "🛵\n  БпЛА поблизу н.п. Василівка на Запоріжжі, курс на захід.\n🛵\n  БпЛА на н.п. Велика Лепетиха на Херсонщині з півночі.",
      "timestamp": "2025-11-28T00:54:23.281924Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Дніпропетровщини, курс західний.",
      "timestamp": "2025-11-28T00:54:23.281928Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-28T00:54:23.281936Z"
    },
    {
      "original": "🛵\n  БпЛА курсом на Херсон з північно-східного напрямку.",
      "timestamp": "2025-11-28T00:54:23.281941Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-28T00:54:23.281945Z"
    },
    {
      "original": "🇮🇶\n🇮🇶\n💥\n❗️\n — All operations at the Khor Mor gas field have been suspended following the drone strike, which has been confirmed by the KRG Ministry of Natural Resources and Energy.\n@TabZLIVE",
      "timestamp": "2025-11-28T00:54:24.167499Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate.   The IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from…",
      "timestamp": "2025-11-28T00:54:24.167510Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank. \nIn the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant and seized a number of other explosive devices in his car.\nIn the city of Tubas, the local armed group \"Tubas Battalion\" claimed that it detonated multiple IEDs against IDF military vehicles and fired on Israeli soldiers with small arms. \nIn the towns of Tamun and Aqaba, a large-scale arrest campaign has been carried out. The mayor of Tamun is among those arrested.\nIn addition, the IDF carried out raids on the towns of Al-Yamoun and Jaba",
      "timestamp": "2025-11-28T00:54:24.167517Z"
    },
    {
      "original": "Earlier today, 2 Russian IL-76MD cargo planes landed at Rostov Airbase. The cargo consists of Iskander-M ballistic missiles, which will be delivered by road to OTRK installations near the city of Taganrog, Rostov Oblast.\nThere is an increased threat of Iskander launches from here over the next 36 hours.",
      "timestamp": "2025-11-28T00:54:24.167522Z"
    },
    {
      "original": "Multiple Ukrainian UAVs (Likely FP-1/2 drones) have impacted the \"Novoaidarska\" 110 kV electrical substation in Luhansk Oblast. Partial power outages are reported in the town of Novoaidar. \nCoordinates: 48.94245, 39.01565",
      "timestamp": "2025-11-28T00:54:24.167526Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack.\nIn general, for both sides it’s very hard to move without being spotted, even in the forest, because of the total prevalence of drones on both sides. In particular, Ukrainian drones are the ones mostly preventing Russian successes.\nIt looks like the Ukrainian command understands that fighting in the forest is much more convenient than fighting for Lyman city, which confirms my suspicions of the fact that urban warfare is not convenient anymore against infiltration tactics.",
      "timestamp": "2025-11-28T00:54:24.167531Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack. In general, for both sides it’s very hard…",
      "timestamp": "2025-11-28T00:54:24.167534Z"
    },
    {
      "original": "Also important to keep in mind is that currently, supply for Ukrainian forces trying to cross the Siverskyi Donets River into Lyman is hell.\nDespite that, significant Ukrainian reinforcements appear to have deployed there.",
      "timestamp": "2025-11-28T00:54:24.167538Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-28T00:54:24.167543Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-28T00:54:24.167551Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-28T00:54:24.167556Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-28T00:54:24.167561Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank.   In the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant…",
      "timestamp": "2025-11-28T00:54:24.167564Z"
    },
    {
      "original": "Israel's new military operation in the northern West Bank continues into its second day.\nThe IDF continues carrying out raids in settlements they deployed to earlier, and have also begun raiding the city of Qalqiya, Nablus, the eastern suburbs of Tulkarm, and the village of Kafr Thulth.\nAdditional widespread arrests have been made in various different settlements, and road closures remain in place, limiting Palestinian movement. IDF military bulldozers also demolished additional streets in the town of Tamun. \nThe centre of these operations remain in the city of Tubas, where hundreds of IDF soldiers have been deployed.",
      "timestamp": "2025-11-28T00:54:24.167569Z"
    },
    {
      "original": "The professional think tank with so-called experts working for it has resorted to the linear warfare argument.\nThey are openly lying about how attritional wars are fought, but people will just eat it up.",
      "timestamp": "2025-11-28T00:54:24.167573Z"
    },
    {
      "original": "Several Israeli airstrikes have targeted southern Lebanon. \nExplosions were heard in Al-Mahmoudiya, Al-Jarmaq, Nahr Nabaa Tasa, and Jabal Al-Rafie",
      "timestamp": "2025-11-28T00:54:24.167577Z"
    },
    {
      "original": "Several Israeli airstrikes have targeted southern Lebanon. \nExplosions were heard in Al-Mahmoudiya, Al-Jarmaq, Nahr Nabaa Tasa, and Jabal Al-Rafie",
      "timestamp": "2025-11-28T00:54:24.167581Z"
    },
    {
      "original": "Several Israeli airstrikes on the Bekaa Valley, northeastern Lebanon.",
      "timestamp": "2025-11-28T00:54:24.167584Z"
    },
    {
      "original": "Repeated Israeli airstrikes on southern Lebanon.",
      "timestamp": "2025-11-28T00:54:24.167587Z"
    },
    {
      "original": "Repeated Israeli airstrikes on southern Lebanon.",
      "timestamp": "2025-11-28T00:54:24.167591Z"
    },
    {
      "original": "Russian forces have captured the village of Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~899.\nTotal land area: ~2.29 km².\nThe 2nd battle for Shakhove lasted approximately 1 month, 10 days.",
      "timestamp": "2025-11-28T00:54:24.167596Z"
    },
    {
      "original": "Israel Says Deal With Syria ‘Not On Track,’ Claims Houthis, Islamic Jihad Are Active There\nIsrael has apparently begun to shift its policy in Syria, moving towards a more hostile stance on the country’s new Islamist-led Interim Government.\nSince the fall of the regime of President Bashar al-Assad last year, Israel has been very open about its suspicions of the country’s new Islamist rulers. Hours after the fall of the regime, the Israeli military occupied the buffer zone adjacent to the Golan Heights in southern Syria. It later went on to launch hundreds of strikes with the aim of destroying the country’s military capabilities.\nTensions mounted with Turkey, the main backer of the Syrian government, over these moves, especially when Israeli strikes hit bases where Ankara planned to deploy troops earlier this year.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898444Z"
    },
    {
      "original": "The Diplomacy Of Ultimatums: Why Kyiv Found Itself Between The Western Hammer And The European Anvil\nThe key issues to be resolved in the coming weeks—which will determine not only Ukraine’s future, but also Europe’s—are Ukraine’s future status in NATO and the European security architecture; the difficult problem of territorial concessions; and the creation of real security mechanisms, rather than declaratory ones, after a potential ceasefire. \nThe immediate future, including a potential Zelenskyy-Trump summit with European leaders present, will reveal whether the parties can overcome their profound mutual distrust and find a way to end the war sustainably. Otherwise, diplomacy could devolve into a continuation of the war by more sophisticated means. \nIn this scenario, Ukraine risks becoming a pawn in the great powers’ geopolitical game, and the principles of international law and state sovereignty could be sacrificed for short-term political interests and pragmatic calculations.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898464Z"
    },
    {
      "original": "Russian Army Clears New Parts Of Myrnograd, Begins Operations Around Pokrovsk\nOn November 27, the Russian military cleared new parts of Myrnograd, also known as Dimitrov, all while expanding its operations around the key city of Pokrovsk nearby in Donetsk.\nThe Tsentr [Center] Group of Forces advanced in the northern and eastern parts of Myrnograd, with preliminary reports indicating that the districts of Vostochny and Molodezhny have been completely secured.\nIn its daily briefing, the Russian Ministry of Defense reported gains in Vostochny, as well as in the district of Zapadny and the southern part of the large settlement. It said that more than 117 buildings were cleared by the 51st Army over the past 24 hours.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898474Z"
    },
    {
      "original": "Russian Army Clears New Parts Of Myrnograd, Begins Operations Around Pokrovsk\nOn November 27, the Russian military cleared new parts of Myrnograd, also known as Dimitrov, all while expanding its operations around the key city of Pokrovsk nearby in Donetsk.\nThe Tsentr [Center] Group of Forces advanced in the northern and eastern parts of Myrnograd, with preliminary reports indicating that the districts of Vostochny and Molodezhny have been completely secured.\nIn its daily briefing, the Russian Ministry of Defense reported gains in Vostochny, as well as in the district of Zapadny and the southern part of the large settlement. It said that more than 117 buildings were cleared by the 51st Army over the past 24 hours.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898483Z"
    },
    {
      "original": "Russian Army Opens New Front And Advances Deeper In Siversk (Videos)\nOn November 27, the Russian military made gains in the city of Siversk, close to the city of Krasny Liman and began advancing in a new direction in Donetsk.\nThe Yug [South] Group of Forces captured the entire northeastern part of Siversk, pushing Ukrainian troops to the area along and to the west of the railway splitting the city in half.\nThe advance of Russian troops in Siversk has been faster than expected. However, Kiev forces will likely show more resistance in the west part of the city. They could also fall back to the western outskirts of the city and use the Bakhmutka River as a natural barrier.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898492Z"
    },
    {
      "original": "Russian Army Opens New Front And Advances Deeper In Siversk (Videos)\nOn November 27, the Russian military made gains in the city of Siversk, close to the city of Krasny Liman and began advancing in a new direction in Donetsk.\nThe Yug [South] Group of Forces captured the entire northeastern part of Siversk, pushing Ukrainian troops to the area along and to the west of the railway splitting the city in half.\nThe advance of Russian troops in Siversk has been faster than expected. However, Kiev forces will likely show more resistance in the west part of the city. They could also fall back to the western outskirts of the city and use the Bakhmutka River as a natural barrier.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898501Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Boosts Its Missile Arsenal And Shifts To Reusable Drones\nOn November 26-27, against the backdrop of discussions about possible peace initiatives, Russia and Ukraine continued to exchange strikes of moderate intensity. According to a statement from the Russian Ministry of Defense, on the night of November 27, Russian air defense systems destroyed 137 UAVs over several regions of the country. For its part, the  Ukrainian Air Force reported that during this period, the Russian side used 142 attack UAVs.\nAt the same time, the US Army Secretary Dan Driscoll, speaking at a closed meeting in Kyiv, stated that Russia has reached a level of long-range missile production that allows it not only to carry out regular strikes on Ukraine but also to form strategic stockpiles. According to The New York Times, this factor was the key argument in Driscoll's appeal to European diplomats to accelerate the achievement of peace agreements. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898509Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Boosts Its Missile Arsenal And Shifts To Reusable Drones\nOn November 26-27, against the backdrop of discussions about possible peace initiatives, Russia and Ukraine continued to exchange strikes of moderate intensity. According to a statement from the Russian Ministry of Defense, on the night of November 27, Russian air defense systems destroyed 137 UAVs over several regions of the country. For its part, the  Ukrainian Air Force reported that during this period, the Russian side used 142 attack UAVs.\nAt the same time, the US Army Secretary Dan Driscoll, speaking at a closed meeting in Kyiv, stated that Russia has reached a level of long-range missile production that allows it not only to carry out regular strikes on Ukraine but also to form strategic stockpiles. According to The New York Times, this factor was the key argument in Driscoll's appeal to European diplomats to accelerate the achievement of peace agreements. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898517Z"
    },
    {
      "original": "ECHOES OF OPERATION MIDAS: CORRUPTION SCANDAL IN UKRAINE THREATENS PEACE TALKS",
      "timestamp": "2025-11-28T00:54:24.898521Z"
    },
    {
      "original": "Breakthrough In Dibrova: Russia Threatens Ukraine’s Control Over Road To Sloviansk\nThe Russian command claims that assault groups have entered Dibrova in the Krasny Liman sector. Russian assault units have seized control of the eastern outskirts of Siversk and advanced to the city center. Ukrainian forces have abandoned Shakhove in the Druzhkivka sector. \nSlovakian Prime Minister Robert Fico has called on the European Union to stop providing aid to Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898529Z"
    },
    {
      "original": "Breakthrough In Dibrova: Russia Threatens Ukraine’s Control Over Road To Sloviansk\nThe Russian command claims that assault groups have entered Dibrova in the Krasny Liman sector. Russian assault units have seized control of the eastern outskirts of Siversk and advanced to the city center. Ukrainian forces have abandoned Shakhove in the Druzhkivka sector. \nSlovakian Prime Minister Robert Fico has called on the European Union to stop providing aid to Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-28T00:54:24.898536Z"
    }
  ],
  "script_run_time": "2025-11-28T00:54:24.899342Z"
}