{
  "messages": [
    {
      "original": "🛵\n БпЛА на півдні Миколаївщини, курс західний.\n🛵\n БпЛА на межі Миколаївщини та Одещини, курс північний.",
      "timestamp": "2025-11-15T07:40:14.542155Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини/Миколаївщини.",
      "timestamp": "2025-11-15T07:40:14.542175Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Дніпро зі сходу та півдня.",
      "timestamp": "2025-11-15T07:40:14.542182Z"
    },
    {
      "original": "🛵\n БпЛА над Дніпром. \nПеребувайте в укриттях!",
      "timestamp": "2025-11-15T07:40:14.542189Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині повз Люботин, курс південний.",
      "timestamp": "2025-11-15T07:40:14.542196Z"
    },
    {
      "original": "🛵\n БпЛА в Кам'янському районі Дніпропетровщини, курс північний.\n🛵\n БпЛА в Павлоградському районі Дніпропетровщини, курс південний.\n🛵\n БпЛА в акваторії Чорного моря в напрямку Одещини.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину та Сумщину.",
      "timestamp": "2025-11-15T07:40:14.542210Z"
    },
    {
      "original": "🛵\n БпЛА повз Кам'янське на Дніпропетровщині, змінюють курс на  східний.\n🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2025-11-15T07:40:14.542219Z"
    },
    {
      "original": "🛵\n БпЛА повз Кам'янське на Дніпропетровщині, змінюють курс на  східний. \n🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2025-11-15T07:40:14.542227Z"
    },
    {
      "original": "🛵\n БпЛА над Дніпром. \nПеребувайте в укриттях!",
      "timestamp": "2025-11-15T07:40:14.542240Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курсом на Павлоград.\n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний.\n🛵\n БпЛА в Бериславському районі Херсонщини, курс північний.\n🛵\n БпЛА в акваторії Чорного моря, курс північно-західний.",
      "timestamp": "2025-11-15T07:40:14.542254Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курсом на Павлоград. \n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний. \n🛵\n БпЛА в Бериславському районі Херсонщини, курс північний. \n🛵\n БпЛА в акваторії Чорного моря, курс північно-західний.",
      "timestamp": "2025-11-15T07:40:14.542266Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Одесу, Затоку.\n🛵\n Миколаївщина: БпЛА \n➡️\n курсом на Очаків.",
      "timestamp": "2025-11-15T07:40:14.542279Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курсом на Павлоград. \n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний. \n🛵\n БпЛА в Бериславському районі Херсонщини, курс північний. \n🛵\n БпЛА в акваторії Чорного моря, курс північно-західний.",
      "timestamp": "2025-11-15T07:40:14.542291Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n у напрямку Лозової.",
      "timestamp": "2025-11-15T07:40:14.542298Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину",
      "timestamp": "2025-11-15T07:40:14.542305Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА з акваторії Чорного моря \n➡️\n у напрямку Одещини.",
      "timestamp": "2025-11-15T07:40:14.542313Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА з акваторії Чорного моря \n➡️\n у напрямку Одещини.",
      "timestamp": "2025-11-15T07:40:14.542321Z"
    },
    {
      "original": "🛵\n Одеса, Очаків \n➡️\n залишайтесь в укриттях!",
      "timestamp": "2025-11-15T07:40:14.542328Z"
    },
    {
      "original": "🛵\n Ще декілька груп БпЛА з акваторії Чорного моря \n➡️\n у напрямку Одещини/Миколаївщини!",
      "timestamp": "2025-11-15T07:40:14.542337Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курсом на Павлоград. \n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний. \n🛵\n БпЛА в Бериславському районі Херсонщини, курс північний. \n🛵\n БпЛА в акваторії Чорного моря, курс північно-західний.",
      "timestamp": "2025-11-15T07:40:14.542347Z"
    },
    {
      "original": "🛵\n Херсонщина: БпЛА \n➡️\nповз Архангельське у північному напрямку.\n🛵\n Миколаївщина: БпЛА \n➡️\n в районі Вознесенська.",
      "timestamp": "2025-11-15T07:40:14.542358Z"
    },
    {
      "original": "🛵\n Херсонщина: БпЛА \n➡️\nповз Архангельське у північному напрямку. \n🛵\n Миколаївщина: БпЛА \n➡️\n в районі Вознесенська.",
      "timestamp": "2025-11-15T07:40:14.542368Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА в районі Березівки \n➡️\n курсом на північ.",
      "timestamp": "2025-11-15T07:40:14.542375Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА в районі Березівки \n➡️\n курсом на північ.",
      "timestamp": "2025-11-15T07:40:14.542381Z"
    },
    {
      "original": "🛵\n Миколаївщина: БпЛА \n➡️\n курсом на Доманівку.\n🛵\n Дніпропетровщина: БпЛА \n➡️\n в передмісті Павлограду.",
      "timestamp": "2025-11-15T07:40:14.542389Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 93 ЦІЛІ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 15 листопада (з 19:00 14 листопада) противник атакував трьома аеробалістичними ракетами Х-47М2 «Кинджал» із повітряного простору Тамбовської обл., а також 135 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Орел, Приморсько-Ахтарськ, Брянськ – рф, Чауда Гвардійське – ТОТ АР Криму, близько 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено дві аеробалістичні ракети Х-47М2 «Кинджал» та 91 ворожий БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання однієї ракети та 41 ударного БпЛА на 13 локаціях, а також падіння збитих (уламки) на чотирьох локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-15T07:40:14.542410Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину",
      "timestamp": "2025-11-15T07:40:14.542415Z"
    },
    {
      "original": "A large fire is burning in Chuhuiv, Kharkiv Oblast, after the city was targeted by several Geran-2 drones.",
      "timestamp": "2025-11-15T07:40:15.185418Z"
    },
    {
      "original": "A large fire is burning in Chuhuiv, Kharkiv Oblast, after the city was targeted by several Geran-2 drones.",
      "timestamp": "2025-11-15T07:40:15.185432Z"
    },
    {
      "original": "Overnight, Cherkasy Oblast came under attack from Russian Geran-2 drones. Impacts were recorded in/near Cherkasy City, Uman (possibly at the airbase), and Zvenyhorodka. \nThe exact targets are currently unknown, but some of the drones in Cherkasy City hit on the outskirts.",
      "timestamp": "2025-11-15T07:40:15.185437Z"
    },
    {
      "original": "Overnight, Cherkasy Oblast came under attack from Russian Geran-2 drones. Impacts were recorded in/near Cherkasy City, Uman (possibly at the airbase), and Zvenyhorodka. \nThe exact targets are currently unknown, but some of the drones in Cherkasy City hit on the outskirts.",
      "timestamp": "2025-11-15T07:40:15.185442Z"
    },
    {
      "original": "Scenes from the Geran-2 drone attack on the Bila Tserkva combined heat and power plant in Kyiv Oblast. This plant was also struck by around 2 Iskander-M ballistic missiles.",
      "timestamp": "2025-11-15T07:40:15.185446Z"
    },
    {
      "original": "Scenes from the Geran-2 drone attack on the Bila Tserkva combined heat and power plant in Kyiv Oblast. This plant was also struck by around 2 Iskander-M ballistic missiles.",
      "timestamp": "2025-11-15T07:40:15.185450Z"
    },
    {
      "original": "Russia has launched a new series of attacks across the international border with Sumy Oblast, aimed at reaching the village of Myropillya. \nChechen \"Akhmat\" special forces, along with a motorised rifle battalion of the 15th Tank Division are taking part in assault operations from the village of Kucherov to the large forest just across the border. So far, no advances have been confirmed. Ukrainian drones are very active in this area.",
      "timestamp": "2025-11-15T07:40:15.185454Z"
    },
    {
      "original": "This evening, 4 Russian Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31Ks impacted Starokostyantyniv Airbase, Khmelnytskyi Oblast.",
      "timestamp": "2025-11-15T07:40:15.185458Z"
    },
    {
      "original": "Russian forces have achieved a localized breakthrough in Novopavlivka, Dnipropetrovsk Oblast, and have quickly captured most/all of this town. \nA relatively strong Ukrainian defensive line has now been completely compromised.",
      "timestamp": "2025-11-15T07:40:15.185463Z"
    },
    {
      "original": "🇺🇸\n🇻🇪\n⚡\n- BREAKING: \"I’ve made up my mind [on Venezuela]. I can’t tell you what it would be,\" - President Donald Trump.",
      "timestamp": "2025-11-15T07:40:15.185471Z"
    },
    {
      "original": "🇺🇸\n‼️\n🇻🇪\n  A map of all potential military targets in Venezuela\n📌\n With the USS Gerald R. Ford CSG now inside SOUTHCOM, the U.S. could launch land strikes at any time",
      "timestamp": "2025-11-15T07:40:15.185480Z"
    },
    {
      "original": "Russian forces have captured the village of Orestopil, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~574.\nTotal land area: ~1.68 km².",
      "timestamp": "2025-11-15T07:40:15.185485Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Sosnivka, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~206.\nTotal land area: ~1.00 km²",
      "timestamp": "2025-11-15T07:40:15.185490Z"
    },
    {
      "original": "In the Richky direction, over the past few days Russian forces have resumed attempts at regaining full control over the Glushkovsky District of Kursk Oblast. \nRussian forces began a series of attacks towards the heavily entrenched Ukrainian positions in and around the Novyi Put Tract. They attacked south down two parallel treelines, entering the tract from the northwest. Other forces improved their positions along the railway line and consolidated in the rest of a perpendicular treeline. Heavy fighting is ongoing, with Ukrainian forces using a significant number of drones to repel the attacks. \n+ ~0.19 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185495Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations aimed at recapturing previously lost positions in Sumy Oblast.\nIn the west, Ukrainian forces once again attempted to infiltrate the western part of Oleksiivka via the agricultural buildings. Russian forces then launched a series of counterattacks and cleared these buildings, before beginning a push down the road to Andriivka. At the same time, Ukrainian forces continued attempts at entering and entrenching in the eastern part of Oleksiivka.\nTo the east, multiple Russian assault groups used an underground pipeline to attack Ukrainian positions to the rear of Varachyne. Ukrainian formations stationed in the area were aware of this pipe and immediately fired on Russian soldiers emerging from it. Nevertheless, the numbers of Russian soldiers who emerged were too high for the Ukrainians to contain, forcing them to withdraw from the area. The surviving Russian soldiers established control over some treeline positions, and Ukrainian drones are trying to pick them off. Two attempts at reconnecting with other forces to the northwest failed with casualties. \nMeanwhile, due to the complicated situation for Ukraine and the disruption of their supply routes, Russia was able to enter the northern part of Varachyne relatively unopposed and consolidate in the houses there. Attempts are now underway to establish control over the rest of the village. Other forces advanced west of Varachyne, capturing new treeline positions on the tactical heights. \nIn the east, following earlier unsucessful attacks and consolidation attempts, Russian forces resumed assault operations in the village of Yunakivka and recaptured positions in the southern part of the village. They are now consolidating and attempting to accumulate additional infantry in order to establish control over the last parts of the village.\n+ ~3.97 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185503Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to advance towards the Verkhnya Dvurichkova River, capturing additional positions on the tactical heights.\nIn the southeast, after entering the large forest southeast of Dvorichanske, Russian forces were able to advance further north and establish full control over it, entrenching on the edge of the tactical heights. They then went on to capture further positions in the forested areas to the north, while other forces established control over the forests and treelines on the tactical heights to the east and northeast. Additionally, the Russians captured a small forest northeast of Dvorichanske, further approaching the village from this direction.\nTo the northwest, following earlier advances on the flanks, Russian forces improved their positions along a treeline west of Odradne, before securing the northern end of the adjacent gulley, largely levelling the frontline in this sector. \n+ ~12.39 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185509Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in Kupyansk, while Ukrainian forces are attempting to counterattack at several different points.\nIn the northeastern part of Kupyansk, after establishing a foothold in the first blocks of the city and accumulating additional infantry, Russian forces advanced further south towards the highway. They captured the rest of the high-rise buildings and a significant portion of the low-rise residential areas. They also entered the eastern industrial zone and captured the Kupyansk Railway Station. \nIn the southern part of Kupyansk, Russian forces continued widening their spearhead to Sadove. They pushed southwest from the Yuvileynyi high-rise micro-district and captured new parts of the southern low-rise residential area. \nMeanwhile, Ukrainian forces began attempts at counterattacking in the eastern residential area and industrial zone, slowing the Russian advance towards the southeastern neighbourhoods. They are also attacking through the grey-zone towards the market and city centre. On the western side of the city, the Ukrainians are attempting to infiltrate the residential areas in the grey zone where Russia hasn't consolidated in yet, while other forces continued their attacks from Moskovka and the forests southwest of Radkivka. No Ukrainian advances have been confirmed yet.\n+ ~5.04 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185516Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards the village of Novoplatonivka, and have captured new positions on the tactical heights. \nAfter capturing the treelines and forest plantations northwest of Borivska Andriivka, Russian forces advanced further down the tactical heights, capturing positions in two treelines to the west. Other forces advanced west down a third treeline, reaching a gulley.\n+ ~1.82 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185521Z"
    },
    {
      "original": "In the Borova direction and on the northwestern flank of Lyman, both Russian and Ukrainian forces have advanced.\nIn the northwest, Russian forces continued their assault operations towards the village of Korovii Yar and have captured additional positions some forested areas. Attacks are now underway on the main Ukrainian strongpoints outside the settlement.\nTo the south, Ukrainian forces built on their progress east of Yarova and captured additional positions in the forests along the western bank of the Nitrius River. They were able to entrench in the forests just outside Novoselivka, and infiltrate into the southern part of the village, where a large grey-zone has formed. Russian forces are now trying to push the Ukrainians back out of the settlement. \nTo the east, Ukrainian forces reversed some Russian progress in and around the town of Drobysheve. They advanced north through poorly consolidated Russian positions in the forests east of the Nitrius River, reaching the main Russian positions south and southeast of the fish farm. Other forces recaptured positions in the northern part of the town, pushing the Russians back to the outermost streets. \nMeanwhile, Russian forces continued their attempts at advancing from the agricultural complex on the northwestern outskirts of the town towards its centre. Other forces are attempting to infiltrate from the strongpoints in the Bogdasarov Forest to the eastern streets of Drobysheve, where a grey zone has formed. \nIn the east, Russian forces continued to slowly advance near Stavky, capturing the western agricultural complex on the western outskirts of the village. \n+ ~2.80 km² in favour of Ukraine.\n+ ~2.77 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185530Z"
    },
    {
      "original": "On the eastern flank of Lyman and on the northern flank of Siversk, both Russian and Ukrainian forces have advanced.\nIn the west, after bringing in new reinforcements, Ukrainian forces cleared the Kommunal'nyy district of Lyman from Russian DRGs, as well as the western part of the Masliakivka District. Russian forces have refocused their efforts on the eastern part of Masliakivka, and the forests east of the Pivdennyi District.\nTo the east, Russian forces resumed their assault operations in Yampil. They pushed southwest from the northern and northeastern parts of the village, recapturing previously lost positions in the western, central, northern, and eastern streets. Ukrainian forces have since withdrawn from most of the village and are maintaining their main presence in the southernmost streets.\nFurther east, Russian forces infiltrated from the forest east on Yampil, across the wetlands to the forests further south, capturing positions there. Other forces advanced from the forests west of Dronivka, securing their presence in this new area.\n+ ~5.57 km² in favour of Russia.\n+ ~1.26 km² in favour of Ukraine.",
      "timestamp": "2025-11-15T07:40:15.185541Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued to advance towards Siversk and have captured most of the rest of the fortifications east of the city. \nIn the north, Russian forces broke through Ukrainian positions in the treelines southwest of Verkhnokamyanske, capturing numerous new positions and strongpoints on the tactical heights. Some assault groups were able to reach the fortifications right outside the city, where fighting is now ongoing. Additionally, Russian forces infiltrated to the northeastern part of the city, where they are now fighting for the trench strongpoints there.\nIn the south, Russian forces began advancing west of the railway line towards Zvanivka. They were able to capture new positions in 7 different treelines on the tactical heights.  \n+ ~9.49 km² in favour of Russia.",
      "timestamp": "2025-11-15T07:40:15.185547Z"
    },
    {
      "original": "Explosive Night: Russia and Ukraine Exchange Massive Strikes\nOn the night of November 13-14, Russia and Ukraine exchanged a series of large-scale strikes, accompanied by active operations of air defense systems. According to a statement from the Russian Ministry of Defense, Russian air defense forces destroyed \n216 \nUkrainian unmanned aerial vehicles. The largest number of drones were intercepted over Krasnodar Krai (66), Saratov Region (45), and the airspace above the Black Sea (59).\nAccording to the Ukrainian Air Force, Russian forces used \n449\n means of air attack against Ukrainian territory, of which 419 were successfully destroyed. Specifically, 14 out of 19 missiles and 405 out of 430 drones were shot down.\nThe capital suffered the most severe damage. In Kyiv and the Kyiv region, air defense systems, command posts, and facilities of the Ministry of Defense were hit, along with warehouses, repair bases, transport hubs, UAV bases, and an aircraft repair plant. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.786967Z"
    },
    {
      "original": "Explosive Night: Russia and Ukraine Exchange Massive Strikes\nOn the night of November 13-14, Russia and Ukraine exchanged a series of large-scale strikes, accompanied by active operations of air defense systems. According to a statement from the Russian Ministry of Defense, Russian air defense forces destroyed \n216 \nUkrainian unmanned aerial vehicles. The largest number of drones were intercepted over Krasnodar Krai (66), Saratov Region (45), and the airspace above the Black Sea (59).\nAccording to the Ukrainian Air Force, Russian forces used \n449\n means of air attack against Ukrainian territory, of which 419 were successfully destroyed. Specifically, 14 out of 19 missiles and 405 out of 430 drones were shot down.\nThe capital suffered the most severe damage. In Kyiv and the Kyiv region, air defense systems, command posts, and facilities of the Ministry of Defense were hit, along with warehouses, repair bases, transport hubs, UAV bases, and an aircraft repair plant. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.786988Z"
    },
    {
      "original": "Russian Army Captures Rog, Clears More Parts Of Pokrovsk And Myrnohrad\nOn November 14, the Russian military captured Rog to the east of the city of Pokrovsk and expanded its control in Myrnohrad nearby in Donetsk.\nThe capture of Rog, also known as Rih, by the Tsentr [Center] Group of Forces was announced by the Russian Ministry of Defense, which later said in its weekly briefing that the 2nd Army carried out more attacks against Ukrainian troops trapped in the western part of Pokrovsk, in the northwestern and eastern quarters of the Central District, as well as in the city’s western industrial area.\nIn addition, the ministry said that seven attacks by Ukraine’s 32nd Mechanized Brigade, the 425th Skala Assault Regiment, and the 1st Assault Regiment were repelled by Russian troops near Grishino.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.786999Z"
    },
    {
      "original": "Russian Army Captures Rog, Clears More Parts Of Pokrovsk And Myrnohrad\nOn November 14, the Russian military captured Rog to the east of the city of Pokrovsk and expanded its control in Myrnohrad nearby in Donetsk.\nThe capture of Rog, also known as Rih, by the Tsentr [Center] Group of Forces was announced by the Russian Ministry of Defense, which later said in its weekly briefing that the 2nd Army carried out more attacks against Ukrainian troops trapped in the western part of Pokrovsk, in the northwestern and eastern quarters of the Central District, as well as in the city’s western industrial area.\nIn addition, the ministry said that seven attacks by Ukraine’s 32nd Mechanized Brigade, the 425th Skala Assault Regiment, and the 1st Assault Regiment were repelled by Russian troops near Grishino.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787009Z"
    },
    {
      "original": "Russian Army Captures Orestopol, Expands Breakthrough In Dnepropetrovsk\nOn November 14, the Russian military captured another settlement in Dnepropetrovsk and expanded its breakthrough towards the Haichur River.\nThe Russian Ministry of Defense said that the 9th Combined Arms Army’s 36th Guards Motorized Rifle Brigade, a part of the Vostok [East] Group of Forces, captured Orestopol after advancing more than four kilometers in Dnepropetrovsk.\n“Despite heavy fire and counter-attack attempts, assault groups moved forward in fits and starts holding the pace of combat actions and preventing the enemy from gaining a foothold. Servicemen from Transbaikal acted in a clear and cohesive manner: soldiers quickly took up strongholds, cut off defensive posts, and opened the way for other units,” the ministry said in a statement.\n“A vast area of defense of more than 12 square kilometres was brought under control, and more than 250 buildings were mopped up,” it added.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787020Z"
    },
    {
      "original": "Russian Army Captures Orestopol, Expands Breakthrough In Dnepropetrovsk\nOn November 14, the Russian military captured another settlement in Dnepropetrovsk and expanded its breakthrough towards the Haichur River.\nThe Russian Ministry of Defense said that the 9th Combined Arms Army’s 36th Guards Motorized Rifle Brigade, a part of the Vostok [East] Group of Forces, captured Orestopol after advancing more than four kilometers in Dnepropetrovsk.\n“Despite heavy fire and counter-attack attempts, assault groups moved forward in fits and starts holding the pace of combat actions and preventing the enemy from gaining a foothold. Servicemen from Transbaikal acted in a clear and cohesive manner: soldiers quickly took up strongholds, cut off defensive posts, and opened the way for other units,” the ministry said in a statement.\n“A vast area of defense of more than 12 square kilometres was brought under control, and more than 250 buildings were mopped up,” it added.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787030Z"
    },
    {
      "original": "Iran Seized Oil Tanker In Strait Of Hormuz As U.S. Navy Watched\nThe United States on November 14 accused Iran of seizing a crude oil tanker as it traveled through the narrow Strait of Hormuz.\nThe seizure was first noted by the British maritime security firm Ambrey, which said that a Marshall Islands-flagged Talara tanker, en route from the United Arab Emirates to Singapore, made a sudden course deviation while transiting the Gulf of Oman and headed towards Iranian territorial waters. Shortly afterward, Ambrey described what happened with the Talara as an assault involving at least three small boats.\nThe incident was also reported by the British military’s United Kingdom Maritime Trade Operations center, which said that a possible “state activity” forced the Talara to turn into Iranian territorial waters.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787039Z"
    },
    {
      "original": "Without Preparation, Without a Mission\": Testimony of a Captured Ukrainian GUR Serviceman on the Landing Near Pokrovsk\nA serviceman of the Ukrainian GUR special forces, Ruslan Shakhun, born in 1995, was captured by Russian forces. He was a member of the \"Black Winter\" unit, part of the \"Timur Special Unit,\" and was captured during a helicopter landing on the outskirts of Pokrovsk on October 31. The operation was carried out on the orders of GUR head Kyrylo Budanov under conditions where Russian forces had established control over a significant part of the city.\nAccording to Shakhun's testimony, the preparation was conducted in a short timeframe and raised many questions for him. The fighter described the preparation process, noting the presence of senior leadership and three training landings. However, he expressed doubts about their effectiveness: \"You are ready. Ready for what? Who the hell knows. Without preparation. Without any means. Without a specific task.\" \n👉\n Read more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787048Z"
    },
    {
      "original": "UKRAINE'S DEFENSIVE CRISIS: LACK OF RESERVES THREATENS FRONTLINE COLLAPSE",
      "timestamp": "2025-11-15T07:40:15.787052Z"
    },
    {
      "original": "Fire Pocket In Myrnohrad: Ukrainian Forces Take Heavy Losses in Molodezhny And Vostochny Districts\nThree counterattacks by Ukrainian formations on the Kupyansk front were thwarted. Russian assault units established control over Orestopol in the Zaporizhzhia region. \nFlorian Philippot, leader of the «Patriots» party, called Zelensky's visit to Paris a «reward for corruption».\nRead more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787059Z"
    },
    {
      "original": "Fire Pocket In Myrnohrad: Ukrainian Forces Take Heavy Losses in Molodezhny And Vostochny Districts\nThree counterattacks by Ukrainian formations on the Kupyansk front were thwarted. Russian assault units established control over Orestopol in the Zaporizhzhia region. \nFlorian Philippot, leader of the «Patriots» party, called Zelensky's visit to Paris a «reward for corruption».\nRead more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787067Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 14, 2025\nOn November 14, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-15T07:40:15.787078Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 14, 2025\nOn November 14, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-15T07:40:15.787085Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787094Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-15T07:40:15.787102Z"
    }
  ],
  "script_run_time": "2025-11-15T07:40:15.788002Z"
}