{
  "messages": [
    {
      "original": "🛵\n Декілька груп ворожих ударних БпЛА в Чорному морі, рух переважно у напрямку Одеси.",
      "timestamp": "2025-12-14T07:38:47.517429Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на сході Дніпропетровщини на межі з Донеччиною, курс південний.",
      "timestamp": "2025-12-14T07:38:47.517449Z"
    },
    {
      "original": "🛵\n Частина БпЛА в акваторії Чорного моря зміни курс у напрямку  Затоки/Сергієвки",
      "timestamp": "2025-12-14T07:38:47.517455Z"
    },
    {
      "original": "🚀\nШвидкісна ціль пройшла Південне, рухається у північному напрямку",
      "timestamp": "2025-12-14T07:38:47.517459Z"
    },
    {
      "original": "🚨\n Увага ракетна небезпека для Черкаської, Кіровоградської, Вінницької.",
      "timestamp": "2025-12-14T07:38:47.517464Z"
    },
    {
      "original": "🚀\nКАБ у напрямку Затоки.",
      "timestamp": "2025-12-14T07:38:47.517468Z"
    },
    {
      "original": "🛵\n Декілька груп ударних ворожих БпЛА в районі Національного природнього парку \"Тузловські лимани\" курс північно-західний",
      "timestamp": "2025-12-14T07:38:47.517473Z"
    },
    {
      "original": "🛵\n Ще декілька груп БпЛА прямують у напрямку Сергіївки та Затоки з південного сходу та сходу.",
      "timestamp": "2025-12-14T07:38:47.517477Z"
    },
    {
      "original": "🛵\n Повторні пуски КАБ у напрямку Затоки.",
      "timestamp": "2025-12-14T07:38:47.517482Z"
    },
    {
      "original": "🚀\nШвидкісна ціль у Чорному морі у напрямку Затоки.",
      "timestamp": "2025-12-14T07:38:47.517486Z"
    },
    {
      "original": "🚀\nШвидкісна ціль змінила курс на Південне/Чорноморське.",
      "timestamp": "2025-12-14T07:38:47.517490Z"
    },
    {
      "original": "🚀\nЩе КАБ на Затоку",
      "timestamp": "2025-12-14T07:38:47.517495Z"
    },
    {
      "original": "📢\n Відбій загрози для Черкаської, Кіровоградської, Вінницької областей.",
      "timestamp": "2025-12-14T07:38:47.517499Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ у напрямку Затоки.",
      "timestamp": "2025-12-14T07:38:47.517503Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА з Чорного моря наближаються до Сергіївки, Затоки, Чорноморського та Одеси.",
      "timestamp": "2025-12-14T07:38:47.517508Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку.",
      "timestamp": "2025-12-14T07:38:47.517512Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Дніпропетровщину/Донеччину.",
      "timestamp": "2025-12-14T07:38:47.517518Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА з Чорного моря продовжують рух в напрямку Затоки, Сергіївки.",
      "timestamp": "2025-12-14T07:38:47.517522Z"
    },
    {
      "original": "🛵\n Одеса - БпЛА в напрямку міста з моря.",
      "timestamp": "2025-12-14T07:38:47.517527Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 110 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 14 грудня (з 19:00 13 грудня) противник атакував балістичною ракетою Іскандер-М (пуски із Ростовської області - рф), та 138-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Курськ, Міллєрово, Приморсько-Ахтарськ, Шаталово – рф, Гвардійське - ТОТ АР Крим, близько 85 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 110 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання ракети та 10 ударних БпЛА на 6 локаціях. \nАтака триває, в повітряному просторі знаходиться близько 18 ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги.",
      "timestamp": "2025-12-14T07:38:47.517546Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Pryluky, Chernihiv Oblast. Widespread power outages were reported in the area.\nCoordinates: 50.57656, 32.35493",
      "timestamp": "2025-12-14T07:38:48.221668Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Pryluky, Chernihiv Oblast. Widespread power outages were reported in the area.\nCoordinates: 50.57656, 32.35493",
      "timestamp": "2025-12-14T07:38:48.221682Z"
    },
    {
      "original": "Russian forces have captured the city of Siversk, Siversk direction, Donetsk Oblast.  Pre-war population: ~12,400. Total land area: ~9.64 km².  The most recent fighting for Siversk lasted approximately 25 days, with the main part of the battle lasting just…",
      "timestamp": "2025-12-14T07:38:48.221686Z"
    },
    {
      "original": "Siversk direction \n➡️\n Rai-Oleksandrivka direction",
      "timestamp": "2025-12-14T07:38:48.221691Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Radkivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~39.\nTotal land area: ~0.15 km².\nThe fighting for Radkivka lasted approximately 6 months, 15 days.",
      "timestamp": "2025-12-14T07:38:48.221697Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Kindrashivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~836.\nTotal land area: ~2.44 km².\nThe fighting for Kindrashivka lasted approximately 6 months, 20 days.",
      "timestamp": "2025-12-14T07:38:48.221703Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their assault operations and have broken through the main Ukrainian defences in Hulyaipole.\nAs a result of over a week of intense fighting, Russian forces managed to grind down the Ukrainian defences in the northeastern streets of the city, capturing the main fortified points there and reaching the Haichur River. They expanded to the streets to the northwest and southeast, and managed to cross the river via the destroyed road bridge, establishing a foothold in the city centre in the court buildings, auto repair shop, and towards the city hospital complex. \nIn the eastern part of Hulyaipole, Russian forces finally managed to consolidate in the easternmost streets and in the animal farms, and crossed the Haichur River from Krasna Street, linking up with assault groups from the east. From there, they pushed west along Velyka Street and Vrozhaina Street, reaching the local university. \nTo the northwest, Russian forces advanced down the treelines to the wastewater treatment plant and landfill, before pushing west and entering the northernmost streets of Hulyaipole. They were able to consolidate there and push the Ukrainians across the Haichur River. A number of Ukrainian formations are still present north of the river in the area of Naberezhna Street, however, but are surrounded on 3 sides.\nTo the north, Russian forces continued to incrementally advance towards Varvarivka and captured additional treeline positions on the western face of the tactical heights. \n+ ~19.58 km² in favour of Russia.",
      "timestamp": "2025-12-14T07:38:48.221710Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.  Missiles launched:  ~8 Kalibr cruise missiles launched from 1 \"Buyan-M\" corvette in Novorossiysk Bay, Krasnodar Krai.   ~6 Iskander-M ballistic…",
      "timestamp": "2025-12-14T07:38:48.221713Z"
    },
    {
      "original": "Well, the numbers detected in this attack were indeed lower than reality.\n16 Kalibrs were used, not 8, and 5-6 Iskander-Ks were used, not 4.",
      "timestamp": "2025-12-14T07:38:48.221717Z"
    },
    {
      "original": "A Su-35 just launched a Kh-59 cruise missile at Zatoka, Oddesa Oblast.",
      "timestamp": "2025-12-14T07:38:48.221721Z"
    },
    {
      "original": "A Russian recon drone is operating just off the coast of Odesa Oblast.",
      "timestamp": "2025-12-14T07:38:48.221728Z"
    },
    {
      "original": "Where are the sirens in Odesa????",
      "timestamp": "2025-12-14T07:38:48.221731Z"
    },
    {
      "original": "It was a Kh-31P anti-radar missile. It disappeared on approach to Zatoka/Serhiivka.",
      "timestamp": "2025-12-14T07:38:48.221734Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to clear the besieged city of Myrnohrad, breaking through the last major Ukrainian defences there.\nIn the central part of Myrnohrad, Russian forces built on their success north of the Zapadny District and entered the high-rise buildings of the 40th District, quickly establishing full control over them, and beginning the battles for the 3-story-buildings. They also bypassed the 40th District from the west via the low-rise residential areas and are attempting to link up with assault groups in the northwestern streets of Myrnohrad.\nIn the northeastern part of Myrnohrad, Russian forces broke through to the terykon, captured the garage cooperatives, and linked up with assault groups in District 5-23, who cleared additional high-rise buildings and the fire station. As a result, a few dozen Ukrainian soldiers have been cut off from the main encirclement and are trapped in several apartment buildings in the Svetlyy District. Additionally, the Russians entered the city centre from the south and are clearing the first 3-story-buildings there. They also consolidated in the treeline and the terykon in the fields east of Myrnohrad\nIn the northern part of Myrnohrad, Russian forces continued to advance from the 8th District and captured a large residential area just east of the city centre, where they reached the paintball field. They also secured the low-rise residential area just west/northwest of the Svetlyy District.\nNorthwest of Myrnohrad, Russian forces consolidated in forests on either side of the railway line and entered the former Novator Mine from the west, which remains in the grey-zone.\nSouthwest of Myrnohrad, Russian forces continued to clear out isolated pockets of Ukrainian soldiers in the fields and consolidated in additional treeline positions there.\n+ ~9.83 km² in favour of Russia.",
      "timestamp": "2025-12-14T07:38:48.221742Z"
    },
    {
      "original": "Update from the Kupyansk direction: \nBoth Russian and Ukrainian forces are continuing their assault operations, each advancing on a different side of the Oskil River.\nIn the southwestern part of Kupyansk, Ukrainian forces continued their clearing operations and recaptured additional positions on Levadna and Dmytriyivska Streets and in the garage cooperative. They also recaptured the rest of the houses west of the Yuvileynyi high-rise micro-district and entered its southern apartment buildings as well as the boarding school. Other forces are now trying to bypass it from the north and enter another garage cooperative, in an attempt to encircle the remaining Russian soldiers in the northern high-rise buildings. \nIn the western part of Kupyansk, the Ukrainians continued to clear the residential blocks west of the railway line and reached the highway. Some assault groups are pushing further east towards the city centre, reaching the gymnasium and the furniture factory. They also managed to advance north from the grain elevators, entering the City Central Hospital and capturing additional positions in the blocks to the west, forcing the remaining Russian formations stations to the northwestern streets to withdraw to the city centre.\nIn the northwestern part of Kupyansk, following the Russian withdrawal, Ukrainian forces quickly established control over large parts of the residential areas there and are now attempting to clear the area of the bread factory and a number of nearby enterprises. Fighting is also ongoing for the \"Comb\" stronghold, which contains 19 high-rise buildings and several other smaller buildings. \nIn the northern part of Kupyansk, Ukrainian forces continued their assault operations and finally managed to consolidate on Michurina and Mechnikova Streets, thereby physically cutting all Russian ground supply into the western part of the city. Additionally, they were able to consolidate in new residential areas in and around Lenina Street and entered the city centre from the north where they are trying to clear the Spartak Stadium, School No. 6, and a number of surrounding apartment buildings.\nNorth of Kupyansk, Ukrainian forces captured the rest of the enterprises on the northern outskirts of the city and entered the nearby forests. Additionally, at some point recently, they re-established full control over the village of Radkivka.\nFurther north, Ukrainian forces consolidated in the western streets of Kindrashivka, which were already in the grey-zone. They then consolidated in the treelines north of Kindrashivka and entered the eastern part of the village, forcing the Russian formations stationed there to withdraw east and allowing for the settlement to be brought back under full Ukrainian control. From there, the Ukrainians began a push to the north, recapturing two large forests on either side of the R-79 Highway. \nEast of Kupyansk, over the last week, Russian forces have been carrying out a series of assault operations aimed at eliminating the Ukrainian presence northeast of Kupyansk. They were able to capture the remaining industrial buildings on the eastern edge of the city and began pushing through Ukrainian positions in the forests further east. As a result, the Russians entered the southwestern houses of Kucherivka and captured a large part of the settlement. \nThis forced the remaining Ukrainian formations to withdraw from Synkivka and the nearby areas, officially ending a nearly 2.5-year-long battle for this village, and allowing for the Russians to nearly fully secure the area north of the Hnylytsya River. Additionally, Russian forces managed to consolidate the remaining parts of northern Petropavlivka, while clearing operations continue in the northwestern houses where Ukrainian forces have withdrawn through from Synkivka. \n+ ~13.23 km² in favour of Ukraine.\n+ ~9.97 km² in favour of Russia.",
      "timestamp": "2025-12-14T07:38:48.221754Z"
    },
    {
      "original": "Grom-E1 rocket-powered glide-bomb in the direction of Zatoka, Odesa Oblast.",
      "timestamp": "2025-12-14T07:38:48.221757Z"
    },
    {
      "original": "Grom-E1 rocket-powered glide-bomb in the direction of Zatoka, Odesa Oblast.",
      "timestamp": "2025-12-14T07:38:48.221760Z"
    },
    {
      "original": "Explosion in Zatoka. Another one is flying in.",
      "timestamp": "2025-12-14T07:38:48.221765Z"
    },
    {
      "original": "Another in Zatoka.",
      "timestamp": "2025-12-14T07:38:48.221769Z"
    },
    {
      "original": "2 Kh-59 cruise missiles were launched, flying to Zatoka.",
      "timestamp": "2025-12-14T07:38:48.221772Z"
    },
    {
      "original": "2 Kh-59 cruise missiles were launched, flying to Zatoka.",
      "timestamp": "2025-12-14T07:38:48.221775Z"
    },
    {
      "original": "These were both Grom-E1s. Repeated explosions were heard.",
      "timestamp": "2025-12-14T07:38:48.221778Z"
    },
    {
      "original": "2 more Grom-E1s have impacted. Gerans are now also attacking the same area.",
      "timestamp": "2025-12-14T07:38:48.221781Z"
    },
    {
      "original": "Russian forces have captured the village of Sviato-Pokrovske, Rai-Oleksandrivka direction, Donetsk Oblast.\nPre-war population: ~426.\nTotal land area: ~1.96 km².\nThe fighting for Sviato-Pokrovske lasted approximately 18 days.",
      "timestamp": "2025-12-14T07:38:48.221786Z"
    },
    {
      "original": "Dead And Wounded Reported In Attack On U.S. Troops In Syria’s Palmyra (Videos, Photos)\nOn September 13, a delegation from the United States-led coalition concluding a patrol with Syrian security forces came under fire in the central city of Palmyra, according to the Syrian Arab News Agency (SANA).\nThe state-run news agency said in separate posts to Telegram that two Syrian security personnel and “several” U.S. troops were wounded, noting that the shooter was killed.\nSaleh al-Hamoui, a former commander of Hay’at Tahrir al-Sham (HTS) - the Islamist rebel group that overthrew the Assad regime last year and established the current government, military and security forces in Syria before dissolving - provided a completely different story of what happened in Palmyra.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949296Z"
    },
    {
      "original": "Dead And Wounded Reported In Attack On U.S. Troops In Syria’s Palmyra (Videos, Photos)\nOn September 13, a delegation from the United States-led coalition concluding a patrol with Syrian security forces came under fire in the central city of Palmyra, according to the Syrian Arab News Agency (SANA).\nThe state-run news agency said in separate posts to Telegram that two Syrian security personnel and “several” U.S. troops were wounded, noting that the shooter was killed.\nSaleh al-Hamoui, a former commander of Hay’at Tahrir al-Sham (HTS) - the Islamist rebel group that overthrew the Assad regime last year and established the current government, military and security forces in Syria before dissolving - provided a completely different story of what happened in Palmyra.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949312Z"
    },
    {
      "original": "Military Situation In Syria On December 13, 2025 (Map Update)",
      "timestamp": "2025-12-14T07:38:48.949317Z"
    },
    {
      "original": "Ukraine Loses Half Of Huliaipole As Russian Army Presses On (Videos) \nOn December 13, the Russian military expanded its control in Huliaipole in Zaporozhye to around half of the city amid what appears to be a complete collapse of Kiev forces there.\nAdvancing from the eastern part of Huliaipole, the Vostok [East] Group of Forces captured much of the city of the center. Russian troops also begin advancing in the southern part of the city, imposing control of most of the urban areas located there.\nThe Vostok Group of Forces also broke through Ukrainian defenses to the north of Huliaipole, physically blocking the main road along the Haichur River.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949326Z"
    },
    {
      "original": "Ukraine Loses Half Of Huliaipole As Russian Army Presses On (Videos) \nOn December 13, the Russian military expanded its control in Huliaipole in Zaporozhye to around half of the city amid what appears to be a complete collapse of Kiev forces there.\nAdvancing from the eastern part of Huliaipole, the Vostok [East] Group of Forces captured much of the city of the center. Russian troops also begin advancing in the southern part of the city, imposing control of most of the urban areas located there.\nThe Vostok Group of Forces also broke through Ukrainian defenses to the north of Huliaipole, physically blocking the main road along the Haichur River.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949334Z"
    },
    {
      "original": "After Harsh Defeat In Siversk, Ukrainian Defenses Around City Are Collapsing (Videos)\nOn December 13, the Russian military began advancing from Siversk to nearby areas taking advantage of the chaos that emerged in the ranks of Kiev forces after losing the key city in Donetsk.\nAs Kiev forces fled their last positions in the western part of Siversk, the Yug [South] Group of Forces pressed forward without taking a pause, breaking through Ukrainian defenses to the south of the chalk quarry located right to the west of the city.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949341Z"
    },
    {
      "original": "After Harsh Defeat In Siversk, Ukrainian Defenses Around City Are Collapsing (Videos)\nOn December 13, the Russian military began advancing from Siversk to nearby areas taking advantage of the chaos that emerged in the ranks of Kiev forces after losing the key city in Donetsk.\nAs Kiev forces fled their last positions in the western part of Siversk, the Yug [South] Group of Forces pressed forward without taking a pause, breaking through Ukrainian defenses to the south of the chalk quarry located right to the west of the city.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949348Z"
    },
    {
      "original": "Military Situation In Ukraine On December 13, 2025 (Maps Update)",
      "timestamp": "2025-12-14T07:38:48.949352Z"
    },
    {
      "original": "Military Situation In Ukraine On December 13, 2025 (Maps Update)",
      "timestamp": "2025-12-14T07:38:48.949357Z"
    },
    {
      "original": "Attacker Who Killed Three Americans In Palmyra Was Member Of Syrian Security Forces\nTwo United States Army soldiers and a civilian interpreter were killed and three other soldiers were wounded on December 13 in an attack in the central Syrian city of Palmyra, the Central Command (CENTCOM) confirmed.\nIn a statement, the command said the attack by a lone gunman occurred \"as the soldiers were conducting a key leader engagement\" with Syrian security forces.\nReuters later reported, citing three local officials, that the gunman who carried out the attack was a member of the Syrian security forces.\nSaleh al-Hamoui, a former commander of Hay’at Tahrir al-Sham (HTS) – the Islamist rebel group that overthrew the Assad regime last year and established the current government – was the first to reveal this.\nIn a post to Telegram, al-Hamoui said that the gunman was the bodyguard of Palmyra’s security chief, Abu Jaber “Sufyan”. He was identified by other Islamist activists as “Tariq Satouf al-Hamad”.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949366Z"
    },
    {
      "original": "Sloviansk-Kramatorsk Front: Situation In Konstantynivka And Larger Ukrainian Defensive Area In Donbass\nRussian forces are still on the offensive, pushing Ukrainian troops toward Sloviansk and Kramatorsk. In the Siversk sector, Russian troops entered the village of Ozerne and blocked two roads leading to Dibrova. \nHungarian Prime Minister Viktor Orbán strongly criticized the European Union's plans to seize frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949374Z"
    },
    {
      "original": "Sloviansk-Kramatorsk Front: Situation In Konstantynivka And Larger Ukrainian Defensive Area In Donbass\nRussian forces are still on the offensive, pushing Ukrainian troops toward Sloviansk and Kramatorsk. In the Siversk sector, Russian troops entered the village of Ozerne and blocked two roads leading to Dibrova. \nHungarian Prime Minister Viktor Orbán strongly criticized the European Union's plans to seize frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-14T07:38:48.949381Z"
    }
  ],
  "script_run_time": "2025-12-14T07:38:48.950221Z"
}