{
  "messages": [
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Харків.",
      "timestamp": "2025-07-21T17:01:22.255340Z"
    },
    {
      "original": "🚀\n КАБи на Донецьку область!",
      "timestamp": "2025-07-21T17:01:22.255354Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину.",
      "timestamp": "2025-07-21T17:01:22.255360Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 224 ЦІЛІ, 203 БПЛА НЕ ДОСЯГЛИ ЦІЛЕЙ – ЛОКАЦІЙНО ВТРАЧЕНІ/ПОДАВЛЕНІ РЕБ    \n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 21 липня (із 21.00 20 липня) противник атакував 450-ма засобами повітряного нападу:\n- 426 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Брянськ, Орел, Міллєрово, Шаталово, Приморсько-Ахтарськ, рф;\n- 5 аеробалістичними ракетами Х-47 М2 “Кинджал” (із повітряного простору Тамбовської обл. рф);\n- 4 крилатими ракетами “Калібр” (із акваторії Чорного моря);\n- 1 крилатою ракетою Іскандер-К (район пусків - Міллєрово, рф);\n- 14 крилатими ракетами Х-101 (із повітряного простору Саратовської обл., рф).\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.30 протиповітряною обороною збито/подавлено 224 засоби повітряного нападу противника:\n- 200 ударних БпЛА типу Shahed;\n- переважну більшість ракет збито вогневими засобами протиповітряної оборони, решта – подавлена РЕБ/локаційно втрачені (інформація щодо влучань не надходила).\n* Крім того, 203 дрони-імітатори не досягли цілей – локаційно втрачені (імовірно подавлені РЕБ).\nЗафіксовано влучання 23 ударних БпЛА у 3 локаціях, а також падіння збитих – на 12 локаціях.\nВорожа атака триває! Нова група росіських БпЛА зайшла із півночі. Дотримуйтесь заходів безпеки! \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-07-21T17:01:22.255387Z"
    },
    {
      "original": "🛵\nХарківщина: БпЛА \n➡️\n курсом на Полтавщину.",
      "timestamp": "2025-07-21T17:01:22.255394Z"
    },
    {
      "original": "🛵\n Дніпропетровська область ( Самарський, Камянський, Дніпропетровський райони) - загроза застосування ворогом ударних БпЛА!",
      "timestamp": "2025-07-21T17:01:22.255398Z"
    },
    {
      "original": "🛵\n БпЛА на  Полтавщині, курс південно-західний.",
      "timestamp": "2025-07-21T17:01:22.255402Z"
    },
    {
      "original": "🛵\n Черкаська область (Золотоніський та Черкаський р-ни) - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-21T17:01:22.255407Z"
    },
    {
      "original": "🛵\n БпЛА на  Полтавщині, курс Київщина.",
      "timestamp": "2025-07-21T17:01:22.255411Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня.",
      "timestamp": "2025-07-21T17:01:22.255415Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Кропивницький",
      "timestamp": "2025-07-21T17:01:22.255420Z"
    },
    {
      "original": "🛵\n Чернігівська область  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-21T17:01:22.255424Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область  - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-21T17:01:22.255430Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-07-21T17:01:22.255434Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-21T17:01:22.255441Z"
    },
    {
      "original": "⚡️\n Вітаємо Благодійний фонд Сергія Притули з 5-ю річницею!\nДякуємо за підтримку та посилення Повітряних Сил і протиповітряної оборони!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-07-21T17:01:22.255448Z"
    },
    {
      "original": "🚀\n КАБи на Донецьку область!",
      "timestamp": "2025-07-21T17:01:22.255452Z"
    },
    {
      "original": "🛵\n Харківська  область  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-21T17:01:22.255458Z"
    },
    {
      "original": "Several large fires are burning in Kyiv from the dozens of Geran-2 drone strikes. The main targets were reportedly the Artem Defence Plant and the Zhulyany Airbase, this can be confirmed with NASA FIRMS data which will be released soon.",
      "timestamp": "2025-07-21T17:01:22.838190Z"
    },
    {
      "original": "Several large fires are burning in Kyiv from the dozens of Geran-2 drone strikes. The main targets were reportedly the Artem Defence Plant and the Zhulyany Airbase, this can be confirmed with NASA FIRMS data which will be released soon.",
      "timestamp": "2025-07-21T17:01:22.838202Z"
    },
    {
      "original": "Footage showing some of the Geran-2 drone strikes on Kyiv.",
      "timestamp": "2025-07-21T17:01:22.838207Z"
    },
    {
      "original": "Footage showing some of the Geran-2 drone strikes on Kyiv.",
      "timestamp": "2025-07-21T17:01:22.838211Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-21T17:01:22.838214Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-21T17:01:22.838218Z"
    },
    {
      "original": "2 MiG-31Ks just conducted launch maneuvers",
      "timestamp": "2025-07-21T17:01:22.838221Z"
    },
    {
      "original": "2 MiG-31Ks just conducted launch maneuvers",
      "timestamp": "2025-07-21T17:01:22.838224Z"
    },
    {
      "original": "Kinzhals to Zhytomyr Oblast",
      "timestamp": "2025-07-21T17:01:22.838227Z"
    },
    {
      "original": "Kinzhals to Zhytomyr Oblast",
      "timestamp": "2025-07-21T17:01:22.838230Z"
    },
    {
      "original": "Flying to Starokostyantyniv, Khmelnytskyi Oblast.",
      "timestamp": "2025-07-21T17:01:22.838234Z"
    },
    {
      "original": "Flying to Starokostyantyniv, Khmelnytskyi Oblast.",
      "timestamp": "2025-07-21T17:01:22.838237Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-21T17:01:22.838240Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-21T17:01:22.838243Z"
    },
    {
      "original": "2 impacts to the same target that the Kh-101s and Kalibrs hit earlier.",
      "timestamp": "2025-07-21T17:01:22.838246Z"
    },
    {
      "original": "I think one thing that a lot of people underestimate is how many civilians remain in the Pokrovsk area. Pokrovsk alone has thousands of residents still holding out, while Myrnohrad, Rodynske and Hryshyne's residents combined also number in the thousands. I'd estimate over 5,000 in total remain across the 4 settlements. \nThe last shops and convenience stores closed in Rodynske last week, giving away all of their stock to civilians, but only after the Russians broke through towards the city's eastern outskirts. As of roughly two months ago, a few local shops in Pokrovsk City Centre were still selling basic supplies including food, water, antibiotics, and other medicines, although it's possible that these have since finally closed considering the deteriorating situation on the flanks and intensified Russian bombardment. \nOn average, 1 civilian in Pokrovsk is killed daily from the Russian artillery, MLRS, drone and FAB bombardment. This is despite its population still numbering in the thousands, its proximity to the frontline, the heavy Ukrainian presence in the city, and its strategic importance to the Russians.\nPokrovsk - as far as I know - was more Anti-Russia than most cities in the Donbas, especially Kramatorsk, Slovyansk, Bakhmut and Donetsk City. Nevertheless, people choose to stay behind, usually because they are waiting for \"liberation\" or because they have grown up there and lived in the city for their whole lives. It's all they have ever known, so it makes it more difficult to leave to cities further west. \nAdditionally, many residents who were evacuated from cities such as Avdiivka moved to Pokrovsk and Myrnohrad, yet less than a year later these cities were practically on the frontlines and under heavy Russian bombardment. Many people, especially elderly, do not want to have to go through the struggle or uprooting their lives and relocating once, let alone twice within a year. \nToday, a large portion of Pokrovsk, Myrnohrad, Rodynske and Hryshyne's populations are elderly, although many are middle-aged or younger. Most men between the ages of 18 and 60 either escaped or were mobilised. Localised mobilisation efforts were still ongoing in Pokrovsk-Myrnohrad up until 1-2 weeks ago, which had previously been ramped up when extra police and TCC units from other regions were sent to bolster Donetsk's police and TCC force, although I expect these efforts have since halted considering recent events.",
      "timestamp": "2025-07-21T17:01:22.838253Z"
    },
    {
      "original": "The Lukyanovskaya Metro Station in Kyiv was damaged during last night's Geran-2 drone strikes on the city. The Artem Defence plant was the target here, as it is across the road from the metro station.",
      "timestamp": "2025-07-21T17:01:22.838256Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-21T17:01:22.838259Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-21T17:01:22.838262Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-21T17:01:22.838265Z"
    },
    {
      "original": "Additional FIRMS data shows that a fire is burning from Geran impacts at the Kharkiv State Aircraft Manufacturing Company in the north of the city.",
      "timestamp": "2025-07-21T17:01:22.838270Z"
    },
    {
      "original": "I'd like to make this clear now as I see people talking about this quite a bit - the monitoring channels I use to help track Russian missiles and aircraft movements live are almost always unaffiliated with the Ukrainian government. There are ways to get extremely specific intel through OSINT and insider information. You have to remember, this war has been ongoing for over 3 years, and Russian air tactics remain largely the same. This allows for significant development in knowledge and ability to produce reliable reports as you don't have to account for many other variables. I will probably make a post on this in the near future outlining some channels and how I personally think they gather their data.",
      "timestamp": "2025-07-21T17:01:22.838273Z"
    },
    {
      "original": "An Iskander-M ballistic missile just impacted Kropyvnytskyi City, Kirovohrad Oblast.",
      "timestamp": "2025-07-21T17:01:22.838276Z"
    },
    {
      "original": "Ukraine Defies Trump, Strikes Moscow: Chronicle Of The Four-Day Aerial Confrontation \nDespite statements from the U.S. administration deeming attacks on the Russian capital unacceptable, Ukrainian drones have persisted in attempting to breach Moscow's defenses for the fourth consecutive day. Moscow's airports have activated the “Carpet” security protocol, resulting in the delay of hundreds of flights and train services. Meanwhile, a German general, Christian Freuding, has publicly called for continued strikes on Russian airfields and defense industry facilities.\nFrom the evening of July 17 to Sunday, July 20, the Russia-Ukraine conflict saw a sharp escalation in mutual strikes. Ukraine launched drone attacks on Moscow and surrounding areas for several consecutive nights, marking the most significant assault on the capital region since the conflict began. Simultaneously, Russian forces executed large-scale missile and drone attacks on Ukrainian cities and infrastructure.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-21T17:01:23.429340Z"
    },
    {
      "original": "Ukraine Defies Trump, Strikes Moscow: Chronicle Of The Four-Day Aerial Confrontation \nDespite statements from the U.S. administration deeming attacks on the Russian capital unacceptable, Ukrainian drones have persisted in attempting to breach Moscow's defenses for the fourth consecutive day. Moscow's airports have activated the “Carpet” security protocol, resulting in the delay of hundreds of flights and train services. Meanwhile, a German general, Christian Freuding, has publicly called for continued strikes on Russian airfields and defense industry facilities.\nFrom the evening of July 17 to Sunday, July 20, the Russia-Ukraine conflict saw a sharp escalation in mutual strikes. Ukraine launched drone attacks on Moscow and surrounding areas for several consecutive nights, marking the most significant assault on the capital region since the conflict began. Simultaneously, Russian forces executed large-scale missile and drone attacks on Ukrainian cities and infrastructure.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-21T17:01:23.429355Z"
    },
    {
      "original": "Pro-Government Forces Violate Ceasefire In Al-Suwayda With New Offensive (Videos)\nTribal forces loyal to Syria’s Islamist-led government launched a new offensive against Druze fighters in the southern governorate of al-Suwayda on July 20 afternoon, violating a ceasefire brokered by the United States just two days earlier.\nThe forces, which reportedly include government troops, attacked the town of Ariqah and nearby areas in the northern countryside of al-Suwayda. Heavy weapons, including mortars, rockets and large-caliber guns, were reported used by the attackers. Still, Druze fighters shield onto their positions in the town and managed to capture some tribesmen.\nThe attack started around the same time the tribes and the Druze were supposed to exchange captives, one of the key terms of the ceasefire announced by the U.S. after talks with both Syria and Israel, which has been backing Druze fighters.\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429364Z"
    },
    {
      "original": "Pro-Government Forces Violate Ceasefire In Al-Suwayda With New Offensive (Videos)\nTribal forces loyal to Syria’s Islamist-led government launched a new offensive against Druze fighters in the southern governorate of al-Suwayda on July 20 afternoon, violating a ceasefire brokered by the United States just two days earlier.\nThe forces, which reportedly include government troops, attacked the town of Ariqah and nearby areas in the northern countryside of al-Suwayda. Heavy weapons, including mortars, rockets and large-caliber guns, were reported used by the attackers. Still, Druze fighters shield onto their positions in the town and managed to capture some tribesmen.\nThe attack started around the same time the tribes and the Druze were supposed to exchange captives, one of the key terms of the ceasefire announced by the U.S. after talks with both Syria and Israel, which has been backing Druze fighters.\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429372Z"
    },
    {
      "original": "Russian Forces Press Multi-Front Offensive: Ukraine’s Defenses Stretched to Breaking Point\nRussian troops have intensified offensive operations along several key axes in Ukraine, making tactical advances while stretching Ukrainian defenses. From the Sumy and Kharkiv regions to the embattled Donbass and Zaporozhzhie fronts, Moscow’s forces are leveraging superior firepower and maneuver warfare to seize territory and destabilize Kyiv’s defensive lines. Ukrainian forces, though resisting fiercely, face mounting pressure as Russian units exploit weak points, force reserve deployments, and gradually encircle strategic settlements. The situation remains highly dynamic near Pokrovsk, Konstantinovka, and northern border frontlines, where Russian advances threaten to unbalance Ukraine’s defensive posture...\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429378Z"
    },
    {
      "original": "Russian Forces Press Multi-Front Offensive: Ukraine’s Defenses Stretched to Breaking Point\nRussian troops have intensified offensive operations along several key axes in Ukraine, making tactical advances while stretching Ukrainian defenses. From the Sumy and Kharkiv regions to the embattled Donbass and Zaporozhzhie fronts, Moscow’s forces are leveraging superior firepower and maneuver warfare to seize territory and destabilize Kyiv’s defensive lines. Ukrainian forces, though resisting fiercely, face mounting pressure as Russian units exploit weak points, force reserve deployments, and gradually encircle strategic settlements. The situation remains highly dynamic near Pokrovsk, Konstantinovka, and northern border frontlines, where Russian advances threaten to unbalance Ukraine’s defensive posture...\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429384Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429391Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-21T17:01:23.429399Z"
    }
  ],
  "script_run_time": "2025-07-21T17:01:23.429939Z"
}