{
  "messages": [
    {
      "original": "🛵\n Донеччина - група БпЛА в районі Добропілл, Білицького.\n🛵\n Група БпЛА на межі Донеччини та Запоріжжя \n➡️\n північно-західним курсом.",
      "timestamp": "2025-12-26T04:49:39.303034Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину, Дніпропетровщину, Запоріжжя.",
      "timestamp": "2025-12-26T04:49:39.303051Z"
    },
    {
      "original": "🛵\n Одещина - БпЛА в напрямку Лиманки.\n🛵\n Житомирщина - БпЛА з Київщини, курсом на Малин.",
      "timestamp": "2025-12-26T04:49:39.303058Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-26T04:49:39.303064Z"
    },
    {
      "original": "⚠\n Увага!\n🚀\nЗафіксовано пуски крилатих ракет \"Калібр\" з акваторії Чорного моря.\n🚨\n Не ігноруйте сигнал повітряної тривоги.",
      "timestamp": "2025-12-26T04:49:39.303072Z"
    },
    {
      "original": "🛵\n Декілька груп ворожих ударних БпЛА в акваторії Чорного моря, вектор руху Татарбунари (Одещина)",
      "timestamp": "2025-12-26T04:49:39.303077Z"
    },
    {
      "original": "⚠\n Увага!\n🚀\nРакетна небезпека в областях, де оголошена тривога!",
      "timestamp": "2025-12-26T04:49:39.303083Z"
    },
    {
      "original": "🛵\n Одещина - група БпЛА курсом на Катлабуг, Ізмаїл, Рені.",
      "timestamp": "2025-12-26T04:49:39.303087Z"
    },
    {
      "original": "🛵\n Ізмаїл - група БпЛА в напрямку міста.",
      "timestamp": "2025-12-26T04:49:39.303092Z"
    },
    {
      "original": "🛵\n Одещина - група БпЛА  з акваторії Чорного моря \n➡️\n курсом на Вилкове;",
      "timestamp": "2025-12-26T04:49:39.303098Z"
    },
    {
      "original": "🛵\n група БпЛА  з акваторії Чорного моря \n➡️\n курсом на Одесу/Чорноморське.",
      "timestamp": "2025-12-26T04:49:39.303104Z"
    },
    {
      "original": "⚠\n Увага! \n🚀\nЗафіксовано пуски крилатих ракет \"Калібр\" з акваторії Чорного моря. \n🚨\n Не ігноруйте сигнал повітряної тривоги.",
      "timestamp": "2025-12-26T04:49:39.303111Z"
    },
    {
      "original": "📢\n Відбій ракетної небезпеки.",
      "timestamp": "2025-12-26T04:49:39.303115Z"
    },
    {
      "original": "🛵\n Ізмаїл - група БпЛА в напрямку міста.",
      "timestamp": "2025-12-26T04:49:39.303120Z"
    },
    {
      "original": "🛵\n група БпЛА  з акваторії Чорного моря \n➡️\n курсом на Одесу",
      "timestamp": "2025-12-26T04:49:39.303126Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на південно-східному та північно-східному напрямках! \n🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-26T04:49:39.303131Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-26T04:49:39.303139Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-12-26T04:49:39.303143Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА  в р-ні. Шостки, курс східний.",
      "timestamp": "2025-12-26T04:49:39.303148Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА  у напрямку н.п. Мена (Чернігівщина) з півночі.",
      "timestamp": "2025-12-26T04:49:39.303154Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА  у напрямку Києва з півночі.",
      "timestamp": "2025-12-26T04:49:39.303159Z"
    },
    {
      "original": "The missiles are flying in the direction of the Sea of Azov.\nThe Kerch Bridge has been temporarily closed.",
      "timestamp": "2025-12-26T04:49:39.798305Z"
    },
    {
      "original": "Sirens in:\nRostov Oblast\nCrimea\nZaporizhzhia Oblast\nKherson Oblast\nKrasnodar Krai\nSevastopol",
      "timestamp": "2025-12-26T04:49:39.798321Z"
    },
    {
      "original": "As many as 2 interceptions may have taken place.",
      "timestamp": "2025-12-26T04:49:39.798325Z"
    },
    {
      "original": "2-4 Storm Shadows are now over the Sea of Azov, ~100 km from the Kerch Bridge.",
      "timestamp": "2025-12-26T04:49:39.798328Z"
    },
    {
      "original": "S-400 launches from Taganrog, Rostov Oblast.",
      "timestamp": "2025-12-26T04:49:39.798331Z"
    },
    {
      "original": "~2 more storm shadows are flying past Debaltseve, Luhansk Oblast to Rostov Oblast.",
      "timestamp": "2025-12-26T04:49:39.798335Z"
    },
    {
      "original": "2 missiles in Luhansk Oblast changed course to the south/southeast, flying past Rovenky to Rostov-on-Don",
      "timestamp": "2025-12-26T04:49:39.798338Z"
    },
    {
      "original": "2-4 missiles are flying to Temyruk, Krasnodar Krai. The port there was under attack from UAVs earlier. Russian air defence is working from Krasnodar Krai.\n2 missiles changed course to the east, flying past Novocherkassk, Rostov Oblast.",
      "timestamp": "2025-12-26T04:49:39.798342Z"
    },
    {
      "original": "Missile strikes were carried out on the Novoshakhtinsk Oil Refinery, Rostov Oblast.",
      "timestamp": "2025-12-26T04:49:39.798346Z"
    },
    {
      "original": "Missile strikes were carried out on the Novoshakhtinsk Oil Refinery, Rostov Oblast.",
      "timestamp": "2025-12-26T04:49:39.798349Z"
    },
    {
      "original": "The fire at the Novoshakhtinsk Oil Refinery is growing",
      "timestamp": "2025-12-26T04:49:39.798353Z"
    },
    {
      "original": "It seems to be all clear for Crimea and Krasnodar Krai. The missiles flying to attack Temryuk were likely all shot down.",
      "timestamp": "2025-12-26T04:49:39.798356Z"
    },
    {
      "original": "More from Novoshakhtinsk Oil Refinery, Rostov Oblast.\nRussian censorship sucks lol",
      "timestamp": "2025-12-26T04:49:39.798360Z"
    },
    {
      "original": "Approximate routes of the Storm Shadow cruise missiles used by Ukraine during this attack.\n~8 missiles were used in total, likely launched from 2 Su-24s near Kryvyi Rih, Dnipropetrovsk Oblast, and 2 Su-24s near Slovyansk, Donetsk Oblast.\n2 impacts were recorded to the Novoshakhtinsk Oil Refinery in Rostov Oblast. \nThe other 6 missiles were likely shot down (2 over Russian-controlled Kherson Oblast, 2 over Russian-controlled Luhansk Oblast, and 2 over the Sea of Azov).",
      "timestamp": "2025-12-26T04:49:39.798366Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued their assault operations and have made additional progress over the last 10 days.\nIn the west, Russian forces consolidated in the rest of Nove Shakhove following earlier infiltrations, allowing for them to accumulate and begin attacks on Vilne. They subsequently advanced north up three parallel treelines, capturing new positions there. Unsuccesful attacks were then then carried out on Vilne. \nIn the east, Russian forces began pushing northwest from the gulley west of Shakhove and captured new positions in the forested areas in the direction of the clay quarries. \n+ ~3.54 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T04:49:39.798373Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to rapidly advance over the last week, further collapsing Ukrainian defences. \nIn the west, Russian forces consolidated in the remaining parts of southern Prymorske dachas and continued advancing in southern Prymorske. They captured the entirety of the residential area south of the first gulley, while DRGs advanced further north to the second gulley and the village centre. The Russians then advanced west along the first gulley towards the pumping station, linking up with other assault groups who consolidated along the E-105 Highway. DRGs then infiltrated further along the highway and reached the large forest east of Prymorske.\nTo the east, Russian forces managed to consolidate in the treelines north of Stepnohirsk following earlier attacks and are attempting to infiltrate further north. They also captured the rest of the treeline stretching west from the solar field. \nIn the east, Russian forces consolidated in the treelines southwest of Lukyanivske following earlier attacks and began advancing further west down the treelines in the direction of Pavlivka. This was done in coordination with attacks along the treelines on the tactical heights north of Stepove. \n+ ~26.13 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T04:49:39.798381Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces resumed their assault operations and have made new progress in two different areas.\nIn the west, Russian forces began pushing northwest from the area of Nesteryanka and captured a series of fortifications along six parallel treelines which had held since 2023. \nTo the east, Russian forces resumed their assault operations in Mala Tokmachka. They recaptured the railway station and positions in the nearby streets and began attacking the ruins of the prison. \n+ ~3.79 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T04:49:39.798388Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance in Hulyaipole and are coming closer to completely capturing the city.\nIn the south, Ukrainian forces continued to incrementally withdraw from the 2023 fortifications due to the threat of encirclement, allowing for the Russians to secure additional positions in two different treelines. They also improved their positions in the nearby forest plantations.\nTo the north, Russian forces captured additional positions in the low-rise residential areas on Nova and Petrovskoho Streets. They also continued clearing the city centre and captured the remaining three-story apartment buildings there.\nTo the northwest, the Russians bypassed the rest of the city centre from the north and entrenched along the eastern part of Travnya 1st street, and in the surrounding areas. They also continued expanding their zone of control in the northwestern part of Hulyaipole, and broke through Ukrainian positions on Ally Onoshko Street towards the westernmost edge of the city.\n+ ~4.96 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T04:49:39.798395Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance in Hulyaipole and are coming closer to completely capturing the city.  In the south, Ukrainian forces continued to incrementally withdraw from the 2023 fortifications due to the threat of encirclement…",
      "timestamp": "2025-12-26T04:49:39.798399Z"
    },
    {
      "original": "Russian forces now control approximately 83% of Hulyaipole.",
      "timestamp": "2025-12-26T04:49:39.798402Z"
    },
    {
      "original": "Cracks In Ukraine's Foundation Grow: Citizens Clash With Draft Offices As Zelensky's Inner Circle Thrives\nThe inhumane Ukrainian forced mobilization machine is treating its own citizens with increasing harshness. The segregation of society into \"untouchables\" and \"cannon fodder\" is raising social tensions to unprecedented levels. Citizens' growing resistance to conscription officers is prompting Kyiv to take radical new steps.\nDespite the prevailing societal tension, the Ukrainian elite is in no hurry to restrict themselves or their loved ones from enjoying life. Most officials send their children to elite foreign schools and can freely cross the border. Their parents frequent expensive establishments and drive luxury cars. Meanwhile, potential conscripts try to secretly cross the snow-covered Carpathian Mountains or swim across the icy Tisa River to escape. They do this to avoid falling into the hands of territorial recruitment center (TRC) employees.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334448Z"
    },
    {
      "original": "Cracks In Ukraine's Foundation Grow: Citizens Clash With Draft Offices As Zelensky's Inner Circle Thrives\nThe inhumane Ukrainian forced mobilization machine is treating its own citizens with increasing harshness. The segregation of society into \"untouchables\" and \"cannon fodder\" is raising social tensions to unprecedented levels. Citizens' growing resistance to conscription officers is prompting Kyiv to take radical new steps.\nDespite the prevailing societal tension, the Ukrainian elite is in no hurry to restrict themselves or their loved ones from enjoying life. Most officials send their children to elite foreign schools and can freely cross the border. Their parents frequent expensive establishments and drive luxury cars. Meanwhile, potential conscripts try to secretly cross the snow-covered Carpathian Mountains or swim across the icy Tisa River to escape. They do this to avoid falling into the hands of territorial recruitment center (TRC) employees.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334466Z"
    },
    {
      "original": "Military Situation In Syria On December 25, 2025 (Map Update)",
      "timestamp": "2025-12-26T04:49:40.334471Z"
    },
    {
      "original": "As Ukrainian Defeat In Myrnohrad Nears, Russian Advance To Dobropillya Begins (Videos)\nOn December 25, the Russian military expanded its control in the city of Myrnohrad, also known as Dimitrov, and nearby areas, moving closer to a decisive victory there, all while preparing to attack the city of Dobropillya to the north in Donetsk.\nThe Tsentr [Center] Group of Forces advanced in the eastern part of Myrnohrad, one of two areas in the city where Ukrainian troops are still holding up in pockets, with the other being in the northwestern part. Russian troops cleared several high-rise buildings there, mainly in the Youth and Eastern district.\nThe drone units of the Tsentr Group of Forces have largely restricted the movement within the Ukrainian pockets inside Myrnohrad. With the city under siege, drones are the only way left for Kiev to try to send some supplies for its troops there.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334480Z"
    },
    {
      "original": "As Ukrainian Defeat In Myrnohrad Nears, Russian Advance To Dobropillya Begins (Videos)\nOn December 25, the Russian military expanded its control in the city of Myrnohrad, also known as Dimitrov, and nearby areas, moving closer to a decisive victory there, all while preparing to attack the city of Dobropillya to the north in Donetsk.\nThe Tsentr [Center] Group of Forces advanced in the eastern part of Myrnohrad, one of two areas in the city where Ukrainian troops are still holding up in pockets, with the other being in the northwestern part. Russian troops cleared several high-rise buildings there, mainly in the Youth and Eastern district.\nThe drone units of the Tsentr Group of Forces have largely restricted the movement within the Ukrainian pockets inside Myrnohrad. With the city under siege, drones are the only way left for Kiev to try to send some supplies for its troops there.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334489Z"
    },
    {
      "original": "Russian Troops Capture Ukrainian Headquarters At Heart Of Huliaipole (Videos)\nOn December 25, the Russian military made additional gains in the city of Huliaipole, and broke through Ukrainian defenses in two other areas in Zaporizhzhia.\nThe Vostok [East] Group of Forces advanced in the heart of Huliaipole, mainly in Sobornaya Street where Russian troops reportedly managed to capture the headquarters of Ukraine’s 102nd Territorial Defense Brigade. The troops also expanded their control in the northern part of the city.\nMeanwhile to the south of the city, the troops advanced in the outskirts, capturing a large strip of the T-0401 to the north of Dorozhnianka.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334499Z"
    },
    {
      "original": "Russian Troops Capture Ukrainian Headquarters At Heart Of Huliaipole (Videos)\nOn December 25, the Russian military made additional gains in the city of Huliaipole, and broke through Ukrainian defenses in two other areas in Zaporizhzhia.\nThe Vostok [East] Group of Forces advanced in the heart of Huliaipole, mainly in Sobornaya Street where Russian troops reportedly managed to capture the headquarters of Ukraine’s 102nd Territorial Defense Brigade. The troops also expanded their control in the northern part of the city.\nMeanwhile to the south of the city, the troops advanced in the outskirts, capturing a large strip of the T-0401 to the north of Dorozhnianka.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334508Z"
    },
    {
      "original": "Russia Systematically Dismantles Ukraine's Energy Infrastructure Amid Mutual Strikes\nThe Ukrainian Air Force reported that on the night of December 25, Russian forces launched 131 attack drones, of which 106 were intercepted or suppressed by air defense systems. At the same time, the Russian side stated that it had destroyed 141 Ukrainian drones\n.\nReports indicate that the dynamics of strikes on Ukrainian territory continue to demonstrate Russia's strategic goal: the systematic dismantling of Ukraine's energy system, particularly in northern regions. In recent days, key substations in Chernihiv and Sumy regions have been targeted. This tactic pursues a pragmatic objective — isolating the combat zone by disrupting energy supply. The northern corridor is critically important for the Ukrainian army as a route for deploying reserves. Strikes on energy facilities aim to narrow this window of opportunity, complicate logistics, and deprive regions of resilience.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334517Z"
    },
    {
      "original": "Russia Systematically Dismantles Ukraine's Energy Infrastructure Amid Mutual Strikes\nThe Ukrainian Air Force reported that on the night of December 25, Russian forces launched 131 attack drones, of which 106 were intercepted or suppressed by air defense systems. At the same time, the Russian side stated that it had destroyed 141 Ukrainian drones\n.\nReports indicate that the dynamics of strikes on Ukrainian territory continue to demonstrate Russia's strategic goal: the systematic dismantling of Ukraine's energy system, particularly in northern regions. In recent days, key substations in Chernihiv and Sumy regions have been targeted. This tactic pursues a pragmatic objective — isolating the combat zone by disrupting energy supply. The northern corridor is critically important for the Ukrainian army as a route for deploying reserves. Strikes on energy facilities aim to narrow this window of opportunity, complicate logistics, and deprive regions of resilience.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334526Z"
    },
    {
      "original": "ALL HELL ABOUT TO BREAK LOOSE IN SYRIA",
      "timestamp": "2025-12-26T04:49:40.334530Z"
    },
    {
      "original": "From Siversk To Slaviansk: Russian Army Fights Ukrainian Forces For Reznykivka And Zakotne\nIn the Sumy sector, Russian units are advancing on a broad front up to 700 meters deep. After seizing control of the center and eastern part of Andriivka, they expanded their sphere of influence in the Krasnopillia district. \nAnd in the Slaviansk sector, Russian units established full control over Sviato-Pokrovske, paving the way for a further advance to the west. Heavy fighting continues in Zakotne, where Ukrainian forces, capturing the high ground, are trying to impede the advance. \nMeanwhile, in the Zaporizhzhia sector, Russian assault units are consolidating bridgeheads on the left bank of the Haichur River. They fully control Andriivka and are fighting for Bratske and Huliaipole.\nThese military successes unfold against a backdrop of mounting criticism of the European strategy. Some politicians deem it a \"dangerous path\" that prolongs the conflict and refuses dialogue.\nRead more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334539Z"
    },
    {
      "original": "From Siversk To Slaviansk: Russian Army Fights Ukrainian Forces For Reznykivka And Zakotne\nIn the Sumy sector, Russian units are advancing on a broad front up to 700 meters deep. After seizing control of the center and eastern part of Andriivka, they expanded their sphere of influence in the Krasnopillia district. \nAnd in the Slaviansk sector, Russian units established full control over Sviato-Pokrovske, paving the way for a further advance to the west. Heavy fighting continues in Zakotne, where Ukrainian forces, capturing the high ground, are trying to impede the advance. \nMeanwhile, in the Zaporizhzhia sector, Russian assault units are consolidating bridgeheads on the left bank of the Haichur River. They fully control Andriivka and are fighting for Bratske and Huliaipole.\nThese military successes unfold against a backdrop of mounting criticism of the European strategy. Some politicians deem it a \"dangerous path\" that prolongs the conflict and refuses dialogue.\nRead more \nHERE",
      "timestamp": "2025-12-26T04:49:40.334548Z"
    }
  ],
  "script_run_time": "2025-12-26T04:49:40.335397Z"
}