{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-27T04:49:22.428946Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курс на захід (н.п. Сновськ/Ріпки)\n🛵\n БпЛА на Харківщині \n➡️\n курсом на схід.\n🛵\n БпЛА на Дніпропетровщині (н.п. Олександрівка) \n➡️\n курсом на північний схід.",
      "timestamp": "2025-11-27T04:49:22.428969Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на Донеччині \n➡️\n в північно-західному напрямку.",
      "timestamp": "2025-11-27T04:49:22.428976Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-27T04:49:22.428980Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n Група БпЛА на півдні Харківщини \n➡️\n курсом на Донеччину.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на сході Дніпропетровщині \n➡️\n курсом на Донеччину.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на Донеччині \n➡️\n в напрямку на північ/схід.\n🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину.\n🛵\n БпЛА на Миколаївщині \n➡️\n в західному напрямку.",
      "timestamp": "2025-11-27T04:49:22.429005Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА у Чорному морі у напрямку Чорноморська.",
      "timestamp": "2025-11-27T04:49:22.429009Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА з Чернігівщини в Броварський р-н.",
      "timestamp": "2025-11-27T04:49:22.429016Z"
    },
    {
      "original": "🛵\n Велика група БпЛА у Чорному морі у напрямку Одещини.\n🛵\n Група БпЛА на Київщині в західному напрямку.\n🛵\n Група БпЛА на Чернігівщині курсом на Київщину.",
      "timestamp": "2025-11-27T04:49:22.429023Z"
    },
    {
      "original": "🛵\n  група БпЛА на Одещині повз Чорноморськ, в північно-західному напрямку.",
      "timestamp": "2025-11-27T04:49:22.429028Z"
    },
    {
      "original": "🛵\n  група БпЛА на Київщині, продовжують рух на Житомирщину.",
      "timestamp": "2025-11-27T04:49:22.429032Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Полтавщину/ Київщину.\n🛵\n Група БпЛА на Київщині \n➡️\n курсом на Житомирщину.\n🛵\n Група БпЛА на півночі Чернігівщини поблизу н.п. Сновськ, Мена, Корюківка.",
      "timestamp": "2025-11-27T04:49:22.429042Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини \n➡️\n в південному напрямку.",
      "timestamp": "2025-11-27T04:49:22.429047Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-27T04:49:22.429052Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на Сумщині \n➡️\n повз Білопілля.\n🛵\n БпЛА на Донеччині \n➡️\n в районі Добропілля.",
      "timestamp": "2025-11-27T04:49:22.429060Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на Сумщині \n➡️\n повз Білопілля. \n🛵\n БпЛА на Донеччині \n➡️\n в районі Добропілля.",
      "timestamp": "2025-11-27T04:49:22.429068Z"
    },
    {
      "original": "🛵\n Сумщина: групи БпЛА через Улянівку, Недригайлів \n➡️\n в напрямку Полтавщини.",
      "timestamp": "2025-11-27T04:49:22.429075Z"
    },
    {
      "original": "🛵\n Сумщина: групи БпЛА через Улянівку, Недригайлів \n➡️\n в напрямку Полтавщини.",
      "timestamp": "2025-11-27T04:49:22.429081Z"
    },
    {
      "original": "🛵\n Полтавщина:БпЛА \n➡️\n через Зіньків, Котельву.",
      "timestamp": "2025-11-27T04:49:22.429086Z"
    },
    {
      "original": "🛵\n Київщина:БпЛА повз Бориспіль\n➡️\n в напрямку Києва.",
      "timestamp": "2025-11-27T04:49:22.429092Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА із Донеччини \n➡️\n на Дніпропетровщину.",
      "timestamp": "2025-11-27T04:49:22.429097Z"
    },
    {
      "original": "🛵\n Полтавщина:БпЛА \n➡️\n через Зіньків, Котельву.",
      "timestamp": "2025-11-27T04:49:22.429102Z"
    },
    {
      "original": "🛵\n Групи БпЛА через Полтавщину \n➡️\nна Харківщину.\n🛵\n Дніпропетровщина: БпЛА \n➡️\n на Павлоград, Кам'янське/Дніпро.",
      "timestamp": "2025-11-27T04:49:22.429111Z"
    },
    {
      "original": "🛵\n Групи БпЛА через Полтавщину \n➡️\nна Харківщину. \n🛵\n Дніпропетровщина: БпЛА \n➡️\n на Павлоград, Кам'янське/Дніпро.",
      "timestamp": "2025-11-27T04:49:22.429119Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини продовжують рух на Дніпропетровщину/Донеччину.",
      "timestamp": "2025-11-27T04:49:22.429123Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast.   Taganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-27T04:49:23.244703Z"
    },
    {
      "original": "No missiles were detected flying towards Crimea/Kherson Oblast. Its possible that this was mixed up with launches of UAVs or something else.",
      "timestamp": "2025-11-27T04:49:23.244710Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka and on the southern flank of Siversk, Russian forces continued to slowly advance and have captured new positions on the tactical heights in two areas.\nIn the southwest, Russian forces entered the village of Maiske from their newly captured positions in the treelines to the south. After a few days of fighting, they were able to establish full control over the settlement and the surrounding positions. They also improved their positions in the forested areas south of Markove.\nIn the northeast, Russian forces continued their assault operations northeastern of Orikhovo-Vasylivka, but this time in a new area. They were able to capture new positions along two parallel treelines on the tactical heights and gained a foothold at the intersection of another two treelines to the east, expanding their presence northwest of Zaliznyanske. \n+ ~5.45 km² in favour of Russia.",
      "timestamp": "2025-11-27T04:49:23.244717Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued their assault operations in and around Siversk, and have made further progress towards capturing the remaining Ukrainian fortifications outside the city.\nIn the north, following earlier infiltrations from north of the reservoirs, Russian forces advanced west through the forests towards the northeastern outskirts of Siversk, and captured several trench fortifications there, from which assault groups are now infiltrating the city. Heavy fighting is currently ongoing for the low-rise residential areas and the northeastern high-rise buildings.\nIn the south, Russian forces were finally able to break through the strong Ukrainian defences on the tactical heights southeast of Siversk, capturing a series of strongpoints along three different treelines. Heavy fighting continues for the remaining fortifications in the operational encirclement area. \n+ ~2.93 km² in favour of Russia.",
      "timestamp": "2025-11-27T04:49:23.244723Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced, each attempting to capture various positions in different areas.\nIn the northwest, Russian forces continued their attempts at regaining full control over the village of Novoselivka. They were able to improve their positions further in the southern part of the village, and broke through Ukrainian positions in the southeastern streets, exiting the settlement and advancing further southwest through the forests towards Yarova.\nTo the east, Ukrainian forces entered and re-established control over the southernmost houses of Stavky. Fighting is now ongoing for areas closer towards the centre of the village. \nTo the south, Ukrainian forces continued to advance on the eastern approaches to Lyman, recapturing new positions in the forests there. Small groups of soldiers are attempting to advance further east through the forests, and northeast towards the southern part of the Masliakivka District of eastern Lyman but are constantly targeted by Russian FPV drones. Heavy fighting continues in this area.\nIn the southeast, Russian forces slightly improved their positions in the forests southwest of Yampil, continuing the assault on the Ukrainian strongpoints in the area of the Lyman - Siversk Highway.\n+ ~1.58 km² in favour of Ukraine.\n+ ~1.03 km² in favour of Russia.",
      "timestamp": "2025-11-27T04:49:23.244731Z"
    },
    {
      "original": "A large-scale Ukrainian drone attack is underway on Russia. \nOver 100 long-range UAVs and jet drones are flying to targets right now. The city of Taganrog, Rostov Oblast, is once again under attack, and several drones - including jet-powered ones - are flying in the direction of Moscow Oblast. \nAdditionally, drones are attacking Russian-controlled Donetsk Oblast, with one impact recorded so far, as seen in the attached video. Russian air defence is active in Donetsk City, Makiivka, and Luhansk Oblast.\nAll flights in and out of Kaluga City airport have been temporary suspended due to the threat of UAVs. Additional closures will likely take place later on in the night.",
      "timestamp": "2025-11-27T04:49:23.244737Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border. \nClarifying.",
      "timestamp": "2025-11-27T04:49:23.244741Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border.   Clarifying.",
      "timestamp": "2025-11-27T04:49:23.244744Z"
    },
    {
      "original": "Missile threat in place for Tula, Moscow, and Ryazan Oblasts.",
      "timestamp": "2025-11-27T04:49:23.244747Z"
    },
    {
      "original": "Another target was detected flying from Kaluga Oblast towards Moscow Oblast. \nUnclear if this is a jet-drone or a cruise missile.",
      "timestamp": "2025-11-27T04:49:23.244751Z"
    },
    {
      "original": "Both targets detected were jet-powered drones. There are no cruise missiles in Russian airspace.",
      "timestamp": "2025-11-27T04:49:23.244758Z"
    },
    {
      "original": "In the Kupyansk direction, over the past few weeks, Ukrainian forces have launched a series of counterattacks east of the Oskil River. \nFollowing a large Russian advance along the railway line to Pishchane and DRG infiltrations into Kurylivka, Ukrainian forces deployed reinforcements to begin pushing them back. They were able to clear Kurilivka of Russian DRGs and begin a push eastward down the railway line.\nThen, in coordination with assault groups pushing down the highway to the north, the limited Russian presence in Pishchane was eliminated, with Ukrainian forces retaking full control over the village. From there, they recaptured additional positions along the railway line further east, while other forces captured positions in the forest plantations east of the highway and infiltrated the treeline directly west of Stepova Novosilka. \n+ ~24.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-27T04:49:23.244764Z"
    },
    {
      "original": "⚡️\n🇮🇶\n☀️\n Additional footage of the alleged drone attack against the Khor Mor gas field in the Sulaymaniyah Governorate of the Kurdistan Region of Iraq.\nThe gas field is operated by the UAE-owned \"Dana Gas\" company and has a daily production capacity of 750 million cubic feet per day.\n@wfwitness",
      "timestamp": "2025-11-27T04:49:23.244775Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in the vicinity of Vovchansk, making significant progress on a wide front.\nFollowing the fall of Synelnykove and the Tsehelne Industrial Facilities, Russian forces began a series of attacks on the village of Lyman. They advanced south from Synelnykove, entering the northern part of the village where they consolidated. From there, they pushed towards the centre of the village, while other assault groups secured new positions in the surrounding forests. \nTo the east, Russian forces began a series of attacks on the town of Vilcha. They advanced east down the road from the Tsehelne Industrial Facilities, capturing new treeline positions, and entering the western streets of Vilcha. Other forces advanced east down a treeline to the north and are carrying out assault operations towards Vilcha from here too. \nAdditionally, Russian forces advanced from the industrial zone in southern Vovchansk to the nearby warehouse complex, establishing control over it and the adjacent windbreaks on either side of the railway tracks.\n+ ~4.70 km² in favour of Russia.",
      "timestamp": "2025-11-27T04:49:23.244782Z"
    },
    {
      "original": "🇮🇶\n🇮🇶\n💥\n❗️\n — All operations at the Khor Mor gas field have been suspended following the drone strike, which has been confirmed by the KRG Ministry of Natural Resources and Energy.\n@TabZLIVE",
      "timestamp": "2025-11-27T04:49:23.244790Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate.   The IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from…",
      "timestamp": "2025-11-27T04:49:23.244794Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank. \nIn the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant and seized a number of other explosive devices in his car.\nIn the city of Tubas, the local armed group \"Tubas Battalion\" claimed that it detonated multiple IEDs against IDF military vehicles and fired on Israeli soldiers with small arms. \nIn the towns of Tamun and Aqaba, a large-scale arrest campaign has been carried out. The mayor of Tamun is among those arrested.\nIn addition, the IDF carried out raids on the towns of Al-Yamoun and Jaba",
      "timestamp": "2025-11-27T04:49:23.244800Z"
    },
    {
      "original": "Earlier today, 2 Russian IL-76MD cargo planes landed at Rostov Airbase. The cargo consists of Iskander-M ballistic missiles, which will be delivered by road to OTRK installations near the city of Taganrog, Rostov Oblast.\nThere is an increased threat of Iskander launches from here over the next 36 hours.",
      "timestamp": "2025-11-27T04:49:23.244804Z"
    },
    {
      "original": "Multiple Ukrainian UAVs (Likely FP-1/2 drones) have impacted the \"Novoaidarska\" 110 kV electrical substation in Luhansk Oblast. Partial power outages are reported in the town of Novoaidar. \nCoordinates: 48.94245, 39.01565",
      "timestamp": "2025-11-27T04:49:23.244810Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack.\nIn general, for both sides it’s very hard to move without being spotted, even in the forest, because of the total prevalence of drones on both sides. In particular, Ukrainian drones are the ones mostly preventing Russian successes.\nIt looks like the Ukrainian command understands that fighting in the forest is much more convenient than fighting for Lyman city, which confirms my suspicions of the fact that urban warfare is not convenient anymore against infiltration tactics.",
      "timestamp": "2025-11-27T04:49:23.244814Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack. In general, for both sides it’s very hard…",
      "timestamp": "2025-11-27T04:49:23.244818Z"
    },
    {
      "original": "Also important to keep in mind is that currently, supply for Ukrainian forces trying to cross the Siverskyi Donets River into Lyman is hell.\nDespite that, significant Ukrainian reinforcements appear to have deployed there.",
      "timestamp": "2025-11-27T04:49:23.244821Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T04:49:23.244826Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T04:49:23.244833Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116315Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116328Z"
    },
    {
      "original": "Military Situation In Syria On November 26, 2025 (Map Update)",
      "timestamp": "2025-11-27T04:49:24.116332Z"
    },
    {
      "original": "Hungary Opposes Funding For Ukraine's \"Military Mafia\"\nHungarian Prime Minister Viktor Orbán gave a sharp response to European Commission President Ursula von der Leyen's request for additional funds for Ukraine, comparing the request to trying to help an alcoholic by sending them another crate of vodka.\nIn her letter, von der Leyen indicated that Ukraine is facing a serious funding shortfall and asked EU member states to increase their support. Orbán stated: \"Giving money to the Ukrainian mafia is like trying to cure an alcoholic by giving them a crate of vodka\", adding that the \"military mafia is siphoning off European taxpayers' money for God knows what\", and that instead of demanding audits and restricting payments, Brussels is proposing to send even more funds. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116341Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-27T04:49:24.116345Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-27T04:49:24.116349Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116368Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116377Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116386Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116394Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116405Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116415Z"
    },
    {
      "original": "THE RACE FOR GULYAIPOLE: HOW UKRAINIAN RESERVE MOVEMENTS MAY DECIDE THE NEXT PHASE OF THE CONFLICT",
      "timestamp": "2025-11-27T04:49:24.116418Z"
    },
    {
      "original": "Novopavlovka Battle: Russian Army Flanks Ukrainian Forces And Advances Across Solenaya River \nPreparing for the Assault on Gulyaypole: Russian units begin encircling the city from multiple sides. The Ukrainian command deploys additional forces to stabilize the situation in the Novopavlovka area. \nCorruption scandals in Ukraine have a demoralizing effect on the Ukrainian Army and their weapon supplies from the US.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116426Z"
    },
    {
      "original": "Novopavlovka Battle: Russian Army Flanks Ukrainian Forces And Advances Across Solenaya River \nPreparing for the Assault on Gulyaypole: Russian units begin encircling the city from multiple sides. The Ukrainian command deploys additional forces to stabilize the situation in the Novopavlovka area. \nCorruption scandals in Ukraine have a demoralizing effect on the Ukrainian Army and their weapon supplies from the US.\nRead more \nHERE",
      "timestamp": "2025-11-27T04:49:24.116436Z"
    }
  ],
  "script_run_time": "2025-11-27T04:49:24.116841Z"
}