{
  "messages": [
    {
      "original": "🛵\n Запорізька область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-31T09:01:00.360490Z"
    },
    {
      "original": "🛵\n Запоріжжя - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-31T09:01:00.360505Z"
    },
    {
      "original": "🛸\n У Чернігівській області  -активність розвідувального БпЛА! Залучено засоби щодо їх збиття. У разі оголошення тривоги - прямуйте в укриття!",
      "timestamp": "2025-08-31T09:01:00.360510Z"
    },
    {
      "original": "🛵\n Суми- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-31T09:01:00.360517Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T09:01:00.360525Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Сум, в Харківській та Запорізькій області! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!\n🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-08-31T09:01:00.360531Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!\n🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-08-31T09:01:00.360539Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини \n➡️\n курсом на південно-західний напрямок.",
      "timestamp": "2025-08-31T09:01:00.360545Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину!",
      "timestamp": "2025-08-31T09:01:00.360549Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-08-31T09:01:00.360553Z"
    },
    {
      "original": "🛸\n На Запоріжжі та Чернігівщині ворожі БпЛА.  Залучено засоби для їх збиття.",
      "timestamp": "2025-08-31T09:01:00.360558Z"
    },
    {
      "original": "🛸\n На Запоріжжі та Чернігівщині ворожі БпЛА.  Залучено засоби для їх збиття.",
      "timestamp": "2025-08-31T09:01:00.360565Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 126 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 31 серпня (із 21.00 30 серпня) противник атакував 142-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Міллерово, Приморсько-Ахтарськ – рф., Чауда – ТОТ Криму.\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 126 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі, півдні та сході країни.\nЗафіксовано влучання 16 ударних БпЛА на 10 локаціях, падіння збитих (уламки) на 6 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-31T09:01:00.360586Z"
    },
    {
      "original": "Сумщина, Полтавщина - ракетна небезпека!",
      "timestamp": "2025-08-31T09:01:00.360590Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі південного-сходу, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-08-31T09:01:00.360594Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі південного-сходу, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-08-31T09:01:00.360598Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-31T09:01:00.360604Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА в акваторії Чорного моря в напрямку Одещини",
      "timestamp": "2025-08-31T09:01:00.360609Z"
    },
    {
      "original": "Запорізька, Харківська, Дніпропетровська, Донецька області - ракетна небезпека!",
      "timestamp": "2025-08-31T09:01:00.360612Z"
    },
    {
      "original": "🛸\n на Сумщині та Чернігівщині ворожі БпЛА.\nЗалучено засоби для їх збиття.",
      "timestamp": "2025-08-31T09:01:00.360617Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T09:01:00.360624Z"
    },
    {
      "original": "Iskander threat from Bryansk. Threat to Kyiv/Chernihiv Oblasts.",
      "timestamp": "2025-08-31T09:01:00.853638Z"
    },
    {
      "original": "Iskander launches from Bryansk",
      "timestamp": "2025-08-31T09:01:00.853649Z"
    },
    {
      "original": "Iskander launches from Bryansk",
      "timestamp": "2025-08-31T09:01:00.853653Z"
    },
    {
      "original": "No missiles are recorded in Ukrainian airspace. Likely the work of electronic warfare.",
      "timestamp": "2025-08-31T09:01:00.853656Z"
    },
    {
      "original": "🇺🇦\n⚡\n- BREAKING: Andriy Parubiy, former Ukrainian Chairman of the Rada, has been assassinated in Lvov, western Ukraine.\nParubiy was regarded as one of the most pro-Maidan Ukrainian politicians.",
      "timestamp": "2025-08-31T09:01:00.853664Z"
    },
    {
      "original": "There are unconfirmed reports from Israeli sources that the strikes were targeted assassination attempts against Houthi officials.",
      "timestamp": "2025-08-31T09:01:00.853667Z"
    },
    {
      "original": "The Israeli airstrikes on the Houthi-controlled Yemeni capital of Sana'a have confirmed to have killed the following:\nHouthi Prime Minister Ahmed al-Rahawi\nThe Minister of Information \nThe Minister of Justice \nThe Minister of Electricity \nThe Minister of Foreign Affairs \nThe Minister of Youth and Sports \nThe Minister of Local Administration",
      "timestamp": "2025-08-31T09:01:00.853674Z"
    },
    {
      "original": "Ukrainian MLRS are targeting the city of Selydove, Donetsk Oblast. Russian S-300 air defence missiles were launched from the vicinity of Donetsk City.",
      "timestamp": "2025-08-31T09:01:00.853678Z"
    },
    {
      "original": "Ukrainian MLRS are targeting the city of Selydove, Donetsk Oblast. Russian S-300 air defence missiles were launched from the vicinity of Donetsk City.",
      "timestamp": "2025-08-31T09:01:00.853682Z"
    },
    {
      "original": "Possible Iskander launch to Dnipro",
      "timestamp": "2025-08-31T09:01:00.853685Z"
    },
    {
      "original": "Possible Iskander launch to Dnipro",
      "timestamp": "2025-08-31T09:01:00.853688Z"
    },
    {
      "original": "The reported launch took place from Taganrog, Rostov Oblast. A Russian recon drone is operating over Dnipro.",
      "timestamp": "2025-08-31T09:01:00.853691Z"
    },
    {
      "original": "Possible Iskander launch to Dnipro",
      "timestamp": "2025-08-31T09:01:00.853694Z"
    },
    {
      "original": "No missiles have been recorded in Ukrainian airspace. The Orlan-10 drone continues to operate over Dnipro.",
      "timestamp": "2025-08-31T09:01:00.853697Z"
    },
    {
      "original": "Explosion in Dnipro",
      "timestamp": "2025-08-31T09:01:00.853700Z"
    },
    {
      "original": "Explosion in Dnipro",
      "timestamp": "2025-08-31T09:01:00.853703Z"
    },
    {
      "original": "An Iskander impacted the city of Kamyanske. The explosion was heard from Dnipro.",
      "timestamp": "2025-08-31T09:01:00.853706Z"
    },
    {
      "original": "Something was intercepted above the Dnipro area. Unclear if it was the Iskander or the Orlan-10 reconnaissance drone.",
      "timestamp": "2025-08-31T09:01:00.853709Z"
    },
    {
      "original": "Something was intercepted above the Dnipro area. Unclear if it was the Iskander or the Orlan-10 reconnaissance drone.",
      "timestamp": "2025-08-31T09:01:00.853712Z"
    },
    {
      "original": "This appears to have been the Orlan-10 drone. It was intercepted after the Iskander impacted Kamyanske.",
      "timestamp": "2025-08-31T09:01:00.853715Z"
    },
    {
      "original": "Russian forces have captured the village of Hlushchenkove, Borova direction, Kharkiv Oblast.\nPre-war population: ~36.\nTotal land area: ~0.25km².",
      "timestamp": "2025-08-31T09:01:00.853720Z"
    },
    {
      "original": "Russian forces have captured the village of Komyshuvakha, Pokrovske direction, Donetsk Oblast.\nPre-war population: ~188.\nTotal land area: ~0.54km².",
      "timestamp": "2025-08-31T09:01:00.853728Z"
    },
    {
      "original": "Russian forces continued to advance in the Borova direction, building on previous successes.\nAdvances occurred in two areas. In the east, Russian forces resumed their attacks in Luhansk Oblast, advancing north along the tactical heights towards the Kharkiv-Luhansk regional border. They moved along a treeline and a chain of forests, establishing control over previously lost positions there. From there, they advanced downhill and east to the outskirts of Hrekivka, recapturing the positions in the low-lying ground there. The Russians were also able to recapture the western edge of the forest towards the swamp on the Kharkiv-Luhansk-Donetsk tri-border point.\nIn the west, Russian forces managed to break through Ukrainian positions west of the Nitrius River, significantly expanding their small bridgehead on its western bank. They pushed north through the rest of Hlushchenkove, completing the capture of the village, and began propelling northwards towards Andriivka, threatening to cut off Azov in the salient to the east. Russian forces also advanced west to the tactical heights, seizing new treeline positions and pushing towards the village of Maliivka.\nMeanwhile, Ukrainian forces continued their assault operations in Novomykhailivka and Ridkodub, without making any confirmed progress. \n+ ~14.27km² in favour of Russia.",
      "timestamp": "2025-08-31T09:01:00.853734Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have further developed their breakthrough to the Nitrius River.\nFollowing the series of failed attacks on Shandryholove, and a withdrawal from its northern outskirts, Russian forces have been carrying out new attacks aimed at bypassing the village and reaching the Nitrius River. As a result of recent actions, this goal has been achieved, and the remaining road east of the river resupplying Shandryholove has been physically cut. \nRussian forces advanced from their newly captured positions on the tactical heights northeast of Derylove, as well as from the eastern outskirts of Shandryholove, to the forest plantations southeast of the village. They continued to bypass it, moving further west to the next set of forest plantations, before reaching and cutting the road, and entrenching on the eastern bank of the Nitrius River. \nAs a result, Shandryholove has now been taken into an operational encirclement, as there are no bridges connecting the Ukrainian salient to the western bank of the river. We will likely see attempts be carried out by Ukrainian forces to unblock the road in the near future. \n+ ~4.56 km² in favour of Russia.",
      "timestamp": "2025-08-31T09:01:00.853740Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance west of the Zherebets River and have made important progress over the past week.\nRussian forces advanced in three areas. In the north, they continued their assault operations to recapture the village of Myrne, advancing south and downhill to the next set of forest plantations. Other forces moved further west, capturing a small farm and gaining a foothold on the southern end of a forested area. Fighting is currently ongoing for the forests west of Myrne, where Ukrainian forces are surrounded on three sides.\nTo the southeast, Russian forces continued their assault on Zarichne, and managed to recapture the Torske Fish Farm after Ukrainian forces withdraw over the Zherebets River. Russian forces then crossed the river at this section, gaining a foothold in the northern part of Zarichne and linking up with their bridgehead in the centre of the village. Fighting is now ongoing for Ozerna Street, which is partially in the grey zone.\nIn the south, after repeated DRG activities, Russian forces were able to cross the Zherebets River at a third point and entered the southern part of Zarichne. They established a foothold at the eastern end of Spartaka and Bulvarna Streets. At the same time, other forces from the central bridgehead advanced south down Poshtova Street, approaching a tributary of the Zherebets River where other Russian formations are entrenched. \n+ ~9.06km² in favour of Russia.",
      "timestamp": "2025-08-31T09:01:00.853746Z"
    }
  ],
  "script_run_time": "2025-08-31T09:01:01.235384Z"
}