{
  "messages": [
    {
      "original": "🛵\n Житомирщина - БпЛА повз Коростень, західним курсом.\n🛵\n БпЛА на півночі Житомирщини - на південний захід.",
      "timestamp": "2026-01-11T14:10:03.340232Z"
    },
    {
      "original": "🛵\n Запоріжжя - БпЛА курсом на місто з півночі.",
      "timestamp": "2026-01-11T14:10:03.340249Z"
    },
    {
      "original": "🛵\n Житомирщина - БпЛА повз Коростень, західним курсом. \n🛵\n БпЛА на півночі Житомирщини - на південний захід.",
      "timestamp": "2026-01-11T14:10:03.340256Z"
    },
    {
      "original": "🛵\n Житомирщина: БпЛА повз Олевськ \n➡️\n у напрямку Рівненщини. \n🛵\n Чернігівщина: нові групи БпЛА на півночі в районі Городні \n➡️\nкурсом на захід.",
      "timestamp": "2026-01-11T14:10:03.340265Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Київщини західним курсом.",
      "timestamp": "2026-01-11T14:10:03.340273Z"
    },
    {
      "original": "🛵\n БпЛА на Рівенщині курсом на Сарни, Дубровиця.",
      "timestamp": "2026-01-11T14:10:03.340278Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2026-01-11T14:10:03.340282Z"
    },
    {
      "original": "🛵\n Житомирщина. БпЛА на Овруч.",
      "timestamp": "2026-01-11T14:10:03.340286Z"
    },
    {
      "original": "🛵\n БпЛА з Рівенщини курсом на Волинь, напрямок Камень Каширський район.",
      "timestamp": "2026-01-11T14:10:03.340291Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-11T14:10:03.340299Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2026-01-11T14:10:03.340304Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину.",
      "timestamp": "2026-01-11T14:10:03.340308Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-11T14:10:03.340316Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-11T14:10:03.340320Z"
    },
    {
      "original": "🛵\n БпЛА на заході Чернігівщини, курс на Київщину.",
      "timestamp": "2026-01-11T14:10:03.340327Z"
    },
    {
      "original": "🛵\nСумщина, БпЛА в напрямку м.Суми з півночі.",
      "timestamp": "2026-01-11T14:10:03.340331Z"
    },
    {
      "original": "🛵\n Рівненщина: БпЛА \n➡️\n курсом на Сарни.",
      "timestamp": "2026-01-11T14:10:03.340337Z"
    },
    {
      "original": "🛸\n Активність ворожих розвідувальних БпЛА на півночі та сході Сумщини.",
      "timestamp": "2026-01-11T14:10:03.340341Z"
    },
    {
      "original": "🛵\n Рівненщина: БпЛА \n➡️\n курсом на Сарни.",
      "timestamp": "2026-01-11T14:10:03.340348Z"
    },
    {
      "original": "🛵\n Рівненщина: БпЛА \n➡️\n в районі Добровиці, Сарнів.\n🛵\n Чернігівщина: БпЛА \n➡️\n в районі Городні, курс на Київщину.",
      "timestamp": "2026-01-11T14:10:03.340357Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2026-01-11T14:10:03.340361Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n на півночі Чернігівщини, курсом на захід.",
      "timestamp": "2026-01-11T14:10:03.340367Z"
    },
    {
      "original": "Explosions in Kyiv",
      "timestamp": "2026-01-11T14:10:04.137205Z"
    },
    {
      "original": "The missile attack appears to be over. More than 40 missiles of various types, including an Oreshnik IRBM, were used. I will publish a full report + the consequences later on. \nIf you wish to support my work, you can do so here: \nhttps://buymeacoffee.com/amk_mapping\n. \nThank you for following along.",
      "timestamp": "2026-01-11T14:10:04.137218Z"
    },
    {
      "original": "Additionally, at least 100 Geran-2 drones are flying in the direction of Kyiv. There is a high likelihood of additional missiles being used (not Oreshnik or Kh-101).",
      "timestamp": "2026-01-11T14:10:04.137222Z"
    },
    {
      "original": "Last night, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~10 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~2 Iskander-M ballistic missiles launched from an OTRK installation in the vicinity of Bryansk City, Bryansk Oblast.\n~8 Kalibr cruise missiles launched from 1 \"Admiral Makarov\" Frigate at Novorossiysk Bay, Krasnodar Krai.\n~8 Kalibr cruise missiles launched from 1 \"Admiral Essen\" Frigate at Novorossiysk Bay, Krasnodar Krai.\n~6 Kalibr cruise missiles launched from 1 \"Varshavyanka\" Submarine in the waters of the Black Sea, off the coast of Cape Myshkako, Krasnodar Krai. \n~1 Oreshnik IRBM launched from the Kapustin Yar Testing Ground, Astrakhan Oblast.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 3 Kalibr cruise missiles.\n-----------------------\nThe main targets for this strike was Ukrainian energy infrastructure in Kyiv. The following was targeted:\nCHP-5 Power & Heat Plant, Kyiv Oblast (50.39403, 30.56928) by ~6 Kalibrs & ~4 Iskander-Ms.\nCHP-4 Power and Heat Plant, Kyiv Oblast (50.44693, 30.64255) by ~2 Kalibrs.\nCHP-6 Power and Heat Plant, Kyiv Oblast (50.53188, 30.66309) by ~5 Kalibrs and ~6 Iskander-Ms.\nUnderground gas infrastructure in Lviv Oblast by 1 Oreshnik IRBM. \nUnknown target near the Kherson-Mykolaiv regional border by ~6 Kalibrs.\nUnknown target southwest of Kyiv by ~2 Iskander-Ms.\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2026-01-11T14:10:04.137242Z"
    },
    {
      "original": "Clearer footage of the Oreshnik strike.  Reportedly, this was not the Stryi underground gas facility. I'm working to confirm this now.",
      "timestamp": "2026-01-11T14:10:04.137245Z"
    },
    {
      "original": "Based on a geolocation of the POV of footage showing the Oreshnik IRBM strike on Lviv, we can determine that the target was the Lviv State Aviation Repair Plant.\nThe plant, which repairs MiG-29 fighter jets, appears to have still be in operation prior to the strike. It was hit by 36 MIRVs from the Oreshnik missile. \nPOV coordinates: 49.79611, 23.94444\nPlant coordinates: 49.81721, 23.9351",
      "timestamp": "2026-01-11T14:10:04.137251Z"
    },
    {
      "original": "Under heavy artillery cover, STG government forces have launched their full-scale ground offensive against the SDF-held Kurdish-majority Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo.  The two main epicentres of fighting right now are in…",
      "timestamp": "2026-01-11T14:10:04.137255Z"
    },
    {
      "original": "Approximate situation in northern Aleppo:\nAfter around 36 hours of intense fighting, STG government forces have managed to clear around 75% of SDF-held territory in the Kurdish-majority neighbourhoods, and is beginning its final assault on the central Sheikh Maqsoud District. \nSo far during the offensive, they were able to capture the industrial district (very quickly) and the youth housing district in the north, reaching the northern edge of Sheikh Maqsoud. \nIn the east, the STG secured the rest of the Ayn at-Tal Industrial Zone, the Hulluk District, and the Bustan al-Pasha District, which lie east of the river and previously acted as a buffer for Sheikh Maqsoud. From there, they crossed the river and entered the Farouj Ammar Neighbourhood in the southeastern part of Sheikh Maqsoud, which contains one of the highest elevation points in the area. Due to heavy shelling, the SDF largely withdrew from the exposed areas towards the centre of Sheikh Maqsoud, while STG soldiers are attempting to accumulate in the large grey-zone. \nIn the south, following earlier setbacks, STG forces captured the entirety of the Ashrafiyeh and Assyrian Quarter Districts, reaching Sheikh Maqsoud from the south.\nIn the west, the STG captured the entirety of the Bani Zaid District, and began attacking STG defences in western Sheikh Maqsoud.",
      "timestamp": "2026-01-11T14:10:04.137262Z"
    },
    {
      "original": "Based on a geolocation of the POV of footage showing the Oreshnik IRBM strike on Lviv, we can determine that the target was the Lviv State Aviation Repair Plant.  The plant, which repairs MiG-29 fighter jets, appears to have still be in operation prior to…",
      "timestamp": "2026-01-11T14:10:04.137266Z"
    },
    {
      "original": "I'm seeing a lot of people claim that this is the wrong location, so I've lined up the two houses to show that they are exactly the same.\nThe issue with the security camera footage is that its warped to show a larger area, and is much more blurry. But this is the exact POV.",
      "timestamp": "2026-01-11T14:10:04.137274Z"
    },
    {
      "original": "I'm seeing a lot of people claim that this is the wrong location, so I've lined up the two houses to show that they are exactly the same.  The issue with the security camera footage is that its warped to show a larger area, and is much more blurry. But this…",
      "timestamp": "2026-01-11T14:10:04.137278Z"
    },
    {
      "original": "People are still denying that it's the correct place... I don't know how that is even possible.",
      "timestamp": "2026-01-11T14:10:04.137281Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Novoselivka, Svyatohirsk direction, Donetsk Oblast.\nPre-war population: ~1,390.\nTotal land area: ~3.06 km².\nThe second battle for Novoselivka lasted approximately 60 days.",
      "timestamp": "2026-01-11T14:10:04.137287Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made additional progress towards the large forests north of Sumy.\nIn the west, after repelling a Ukrainian counterattack towards Andriivka, Russian forces began pushing southeast from the village, advancing along the gulley and capturing positions in the adjacent forest plantations and treelines. Ukrainian forces are responding by intensifying their FPV drone strikes and artillery shelling of Russian units, in an attempt to contain their advance. \nIn the east, Russian forces continued advancing southwest of Yablunivka, improving their positions further in the forested areas east of the Snahist River.\n+ ~3.30 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137294Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued incrementally advancing, and have made new progress in three different areas.\nIn the west, Russian forces continued slowly dislodging the Ukrainians from Starytsya, and are approaching the centre of the village from the east.\nTo the southeast, the Russians advanced on a wide front from the northern approaches to Hrafskse to Symynivka, improving their positions in the forests and reaching the Hrafske - Symynivka Road.\nIn the northeast, Russian forces continued incrementally advancing in Vovchanski-Khutory, and captured the last parts of the central section of the village.\n+ ~1.12 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137302Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing on both sides of the Oskil River.\nIn the north, following the arrival of additional reinforcements from the 47th Tank Division, Russian forces resumed their assault operations from the Holubivka area and have captured new positions in the forests east of Radkivka. Attacks are now underway in the direction of the village. Other assault groups managed to consolidate in part of northern Kindrashivka, before infiltrating further west past poorly consolidated Ukrainian positions into Tyshchenivka, which currently resides in the grey-zone. \nTo the southeast, Russian forces began counterattacking east of Kupyansk and recaptured a number of industrial buildings in the northeastern part of the city. From there, a number of Russian soldiers infiltrated down the road to the eastern part of Podoly.\nIn the south, Ukrainian forces managed to clear the last parts of southwestern Kupyansk, including the Yuvileynyi high-rise micro-district, and captured the city central market. Clearing operations continue in other parts of the city centre, while airstrikes are being carried out on encircled Russian formations in the Kupyansk Central Hospital. \n+ ~5.10 km² in favour of Russia.\n+ ~1.75 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137310Z"
    },
    {
      "original": "In the Borova direction, both Ukrainian and Russian forces are advancing in western Luhansk Oblast, each making progress in the area of the regional border with Donetsk Oblast.\nIn the east, Ukrainian forces re-entered the village of Hrekivka from the north and recaptured the northern part of the village. Fighting continues in the southern houses, which are partly in the grey-zone.\nIn the west, after entering the forest northwest of Hrekivka, Russian forces expanded their foothold and began pushing west, establishing control over most of the forest.\n+ ~0.56 km² in favour of Russia. \n+ ~0.85 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137318Z"
    },
    {
      "original": "In the Borova and Svyatohirsk directions, Russian forces intensified their assault operations and have made significant progress across multiple areas.\nIn the north, Russian forces captured multiple Ukrainian strongpoints east of Korovii Yar allowing for them to break through to the north, physically cutting the Korovii Yar - Karpivka Road and capturing positions in several different treelines further north. \nTo the southwest, the Russians advanced further west down the gulley from Seredjne, capturing positions in the forest plantations there. Other assault groups captured positions in two different treelines and entered the eastern part of Oleksandrivka. \nTo the south, the Russians captured the remaining parts of the forests northwest of Yarova. From there, DRGs infiltrated the western part of the village and continued moving southwest to the Siverskyi Donets River, entering the eastern part of the city of Svyatohirsk. \nTo the east, Russian forces continued clearing the forests north of Yarova and captured the northeastern streets of the village. Other assault groups broke through Ukrainian positions further east, forcing the remaining Ukrainian formations to withdraw from southern Novoselivka due to the risk of encirclement, allowing Russia to bring the settlement, as well as some of the forests to the south, under their full control. \n+ ~16.59 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137326Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced, each making progress across four different areas.\nIn the north, following earlier penetrations by Russian DRGs, Russian forces advanced further down the treelines north of Lyman and captured the agricultural buildings on the northern outskirts of Lyman. \nTo the south, Ukrainian forces cleared central and eastern Lyman from Russian DRGs and recaptured School No. 2, allowing for them to advance further east through the treelines. Additionally, they managed to re-enter the Masliakivka District in the easternmost part of the city, recapturing around half of it. Fighting is ongoing for its eastern streets. \nIn the south, Russian forces began advancing north from their spearhead south of Lyman, where they managed to capture a large section of the forest and reach the Lyman - Raihorodok Highway. Other assault groups continued to strengthen the southern flank of this spearhead and further improved their positions in the forests there. \n+ ~4.33 km² in favour of Ukraine.\n+ ~4.03 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-11T14:10:04.137335Z"
    },
    {
      "original": "A Russian IL-76MD cargo plane landed at Baltimore Airbase, Voronezh Oblast, this morning. \nThe cargo consists of Iskander-M ballistic missiles for OTRK installations near Liski, Voronezh Oblast.",
      "timestamp": "2026-01-11T14:10:04.137339Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time. \nThe Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2). \nAccording to the Ukrainian Main Intelligence Directorate, Geran-5 drones will likely be launched from Su-25 aircraft in the future, and it may be equipped with R-73 air-to-air missiles as a counter-meausure at some point too. \nIt was used to strike a target in the vicinity of Kryvyi Rih, Dnipropetrovsk Oblast, yesterday afternoon.",
      "timestamp": "2026-01-11T14:10:04.137344Z"
    },
    {
      "original": "Russia is reportedly planning to carry out tests with new missiles launched from strategic bombers in the near future. \nThese include:\nKh-BD-K cruise missile, which are carried by Tu-95MS bombers. They are similar to Kh-101s, but have an improved guidance system and can fly at higher altitudes of 30-70 metres. \nKh-99 hypersonic cruise missiles, which are carried by Tu-160M bombers. They can fly at speeds of up to 6,600 km/h and have a range of up to 5,500 km. \nKh-MC supersonic anti-ship missiles, which are carried by all strategic bombers. They can fly at speeds of up to 4,200 km/h and have a range of 900 km. These are very similar to Kh-22 missiles.",
      "timestamp": "2026-01-11T14:10:04.137351Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time.   The Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2).   According to…",
      "timestamp": "2026-01-11T14:10:04.137354Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-11T14:10:04.137357Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-11T14:10:04.137361Z"
    },
    {
      "original": "Breakthrough To Svyatohirsk: Russia Develope Offensive Against Ukrainian Forces In Slaviansk Sector \nIn the Kharkiv sector, Russian units advanced on several sections in the Staritsa settlement area and the Liman forests, overcoming resistance and capturing strongpoints of the Ukrainian 57th Separate Motorized Infantry Battalion. \nIn the Krasnyi Liman sector, Russian 20th Combined Arms Army units expanded their control of the forested area near Novoselivka, consolidating their position in Yarovaya. They continued their offensive along the Siverskyi Donets River towards Svyatohirsk.\nIn the Slaviansk sector, Russian 20th Combined Arms Army assault groups made a significant breakthrough when they reached the eastern outskirts of Svyatohirsk via the Martynenkove swamp. They established control over a section of the Siverskyi Donets riverbank, threatening to envelop the city. \nRead more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933529Z"
    },
    {
      "original": "Breakthrough To Svyatohirsk: Russia Develope Offensive Against Ukrainian Forces In Slaviansk Sector \nIn the Kharkiv sector, Russian units advanced on several sections in the Staritsa settlement area and the Liman forests, overcoming resistance and capturing strongpoints of the Ukrainian 57th Separate Motorized Infantry Battalion. \nIn the Krasnyi Liman sector, Russian 20th Combined Arms Army units expanded their control of the forested area near Novoselivka, consolidating their position in Yarovaya. They continued their offensive along the Siverskyi Donets River towards Svyatohirsk.\nIn the Slaviansk sector, Russian 20th Combined Arms Army assault groups made a significant breakthrough when they reached the eastern outskirts of Svyatohirsk via the Martynenkove swamp. They established control over a section of the Siverskyi Donets riverbank, threatening to envelop the city. \nRead more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933546Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-11T14:10:04.933553Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-11T14:10:04.933559Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933569Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933579Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933588Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-11T14:10:04.933598Z"
    }
  ],
  "script_run_time": "2026-01-11T14:10:04.934346Z"
}