{
  "messages": [
    {
      "original": "🛵\n БпЛА з Донеччини, курсом на Дніпропетровщину.",
      "timestamp": "2025-09-29T21:51:20.315643Z"
    },
    {
      "original": "🛵\n БпЛА в Павлоградському районі Дніпропетровщини, курс західний.\n🛵\n БпЛА на сході Харківщини, курс західний.\n🛵\n БпЛА в південній частині Чернігівщини, курсом на Київщину.",
      "timestamp": "2025-09-29T21:51:20.315663Z"
    },
    {
      "original": "🛵\n БпЛА в західній частині Харківщини, курсом на Полтавщину.\n🛵\n БпЛА на межі Харківщини та Дніпропетровщини, курс західний.\n🛵\n БпЛА в Ніжинському районі Чернігівщини, курс південно-західний.\n🛵\n БпЛА в північній частині Чернігівщини, курс західний.",
      "timestamp": "2025-09-29T21:51:20.315674Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з півночі!",
      "timestamp": "2025-09-29T21:51:20.315678Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини на Київщині, курсом на столицю.",
      "timestamp": "2025-09-29T21:51:20.315683Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на сході Харківщини, курс західний!",
      "timestamp": "2025-09-29T21:51:20.315687Z"
    },
    {
      "original": "ПОРЯТУНОК ЕКІПАЖУ СУ-24М. ЯК ВОЇНИ 59-ОЇ РЯТУВАЛИ ПІЛОТІВ БОМБАРДУВАЛЬНИКА\n====================\nРівно три роки тому 29 вересня 2022 року бійці 59-ї мотопіхотної бригади імені Якова Гандзюка (нині – 59 окрема штурмова бригада безпілотних систем ім. Якова Гандзюка) врятували екіпаж бомбардувальника Су-24М. Того дня українські пілоти виконували надзвичайно складне і ризиковане завдання. Літак було уражено ворожою ракетою. Довелось катапультуватись.\nПілотів побачили бійці 59-ї, вони зав’язали бій із ворогом і витягли наших льотчиків фактично з ворожої території.\nХронологію подій з вуст самих героїв та унікальні кадри порятунку екіпажу дивіться у нашому \nсюжеті\n.",
      "timestamp": "2025-09-29T21:51:20.315695Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Київщини  в р-ні. Попільні (Житомирщина), вектор руху на Вінниччину.",
      "timestamp": "2025-09-29T21:51:20.315703Z"
    },
    {
      "original": "🛵\n БпЛА з Полтавщини у напрямку Черкас.",
      "timestamp": "2025-09-29T21:51:20.315708Z"
    },
    {
      "original": "🛵\n Щодо руху ворожих БпЛА:\n1. БпЛА в р-ні. Калинівки (Вінниччина), курс західний;\n2. БпЛА у центральній частині Черкащини, курс західний;\n3.  БпЛА у центральній частині Полтавщини, курс західний;\n4.  Групи ворожих БпЛА у центральній частині Чернігівщини, курс східний;\n5. Декілька груп  ворожих БпЛА у центрі та на півдні Харківщини, курс західний.",
      "timestamp": "2025-09-29T21:51:20.315716Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у напрямку Дніпра з північного-сходу.",
      "timestamp": "2025-09-29T21:51:20.315722Z"
    },
    {
      "original": "🛵\n Оновлення щодо руху ворожих БпЛА:\n1. Групи БпЛА на Чернігівщині продовжують у центральній частині;\n2. БпЛА на сході та півдні Сумщини, курс західний;\n3. БпЛА наближається до Харкова з південного сходу;\n4. Декілька БпЛА в р-ні Кам'янського (Дніпропетровщина), вектор руху Кривий Ріг;\n5. БпЛА на Вінниччині наближається до Немирова зі сходу, курс західний.",
      "timestamp": "2025-09-29T21:51:20.315730Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  в акваторії Азовського моря.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-09-29T21:51:20.315736Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-29T21:51:20.315740Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Херсонщині.",
      "timestamp": "2025-09-29T21:51:20.315744Z"
    },
    {
      "original": "🛵\n Щодо руху ворожих БпЛА:\n1. Групи БпЛА на північному заході Херсонщини, заходять на Миколаївщину, курс північно-західний;\n2. БпЛА на півдні Чернігівщини, рухаються на південь (Київщина);\n3.  БпЛА на заході Харківщини, курс північний;\n4. БпЛА на заході Сумщини, курс східний.",
      "timestamp": "2025-09-29T21:51:20.315751Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА з Херсонщини наближаються до Кривого Рогу з півдня.",
      "timestamp": "2025-09-29T21:51:20.315756Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-09-29T21:51:20.315762Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Київщину з північного сходу;\n🛵\n Групи Дніпропетровщині (н.п. Солоне) рухаються у напрямку Дніпра;\n🛵\n БпЛА південно-східніше Кременчука рухається у західному напрямку;\n🛵\n Групи БпЛА на заході Харківщини, курс західний;\n🛵\n БпЛА східніше Харкова, наближаються до міста.",
      "timestamp": "2025-09-29T21:51:20.315772Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півдня.",
      "timestamp": "2025-09-29T21:51:20.315776Z"
    },
    {
      "original": "They may have received a new batch of HIMARS GMLRS and ATACMS missiles",
      "timestamp": "2025-09-29T21:51:20.852036Z"
    },
    {
      "original": "Absolutely",
      "timestamp": "2025-09-29T21:51:20.852048Z"
    },
    {
      "original": "They likely waited for the next big Russian missile attack to launch them after in \"retaliation\".",
      "timestamp": "2025-09-29T21:51:20.852052Z"
    },
    {
      "original": "Reflections:\nA year ago, Israel assassinated Hezbollah leader Sayyed Hassan Nasrallah (along with several civilians), dealing a brutal blow to the organisation after several setbacks in military and intelligence operations.\nThe Syrian resistance commemorated the anniversary of his martyrdom, emphasising Hezbollah's work in its fight against the Zionist entity over the years, highlighting Israel's defeat in southern Lebanon at the beginning of the 20th century.\nNasrallah's death marked a turning point in the power of Hezbollah and Iran in Lebanon. A few months later, the fall of the previous Syrian political regime made this setback even more visible. Hezbollah is currently undergoing a process of reconstruction, facing external and internal pressures to the point of displaying a passive attitude towards the Syrian terrorist authorities, something that would have been unthinkable ten years ago.\nThe Syrian resistance is now seeking to take over from Hezbollah as the main opposition to the state of Israel in the Levant, emphasising solidarity with the Palestinian cause and normalisation with Jolani, who has been Syria's main enemy in recent decades.\nHowever, I believe that this position is neither correct nor favourable for a successful movement in Syria. The regional situation has changed completely. December 2024 marked the end of any Arab nationalist project and the Arab League's complete passivity towards Israel prevailed, leaving Iran as the as the only state opposing Tel Aviv. The tragic events we have witnessed in Syria in recent months have completely fractured Syrian society along identity lines, leading to the proliferation of self-determination movements on the coast & Suwayda (concretely here when under the previous political regime the Druze sought only more autonomy) with the aim of freeing themselves from the yoke of those who seek to eradicate them on sectarian grounds.\nThe only solution that could solve the problem (if there is a solution) is the creation of a Syrian (not Arab) civic nationalist movement capable of uniting the different confessions under a single identity. The priority of the Syrian resistance should be to continue liberating the country from terrorist groups and not to embark on external ventures such as Palestine, whose future unfortunately seems doomed.\nIn other words, the Syrian resistance should take as its model the liberation of southern Lebanon in 2000 & the liberation of Mount Hermon in 1973 & not the liberation of al-Quds nor the creation of a new Sunni of Shia axis. Nothing beyond Lake Tiberias should be a priority.",
      "timestamp": "2025-09-29T21:51:20.852060Z"
    },
    {
      "original": "Threat of Storm Shadow cruise missile launches for Zaporizhzhia, Voronezh, Donetsk, Luhansk, Kherson, Rostov, eastern Crimea, and Krasnodar Krai. The Kerch Bridge has been temporarily closed. Ukrainian tactical aircraft are flying near their launch lines.",
      "timestamp": "2025-09-29T21:51:20.852066Z"
    },
    {
      "original": "The Ukrainian aircraft flew away from the launch zones without launching anything.",
      "timestamp": "2025-09-29T21:51:20.852070Z"
    },
    {
      "original": "One of the only people I know of who is truly committed to free-speech, not just free speech from people on the same side as you (which is what most people from the left and right do).",
      "timestamp": "2025-09-29T21:51:20.852073Z"
    },
    {
      "original": "Deepstate confirms Russian control over parts of Pokrovsk for the first time ever. \nAs of now, my map shows that around 11.3% of Pokrovsk is under Russian control, however their presence goes further than that.",
      "timestamp": "2025-09-29T21:51:20.852077Z"
    },
    {
      "original": "Deepstate confirms Russian control over parts of Pokrovsk for the first time ever.   As of now, my map shows that around 11.3% of Pokrovsk is under Russian control, however their presence goes further than that.",
      "timestamp": "2025-09-29T21:51:20.852080Z"
    },
    {
      "original": "I present to you: Deepstate's spiky front. \nA true work of art.",
      "timestamp": "2025-09-29T21:51:20.852084Z"
    },
    {
      "original": "Russian forces have captured the village of Serebryanka, northern flank of Siversk, Donetsk Oblast.\nPre-war population: ~1,110.\nTotal land area: ~3.57 km²",
      "timestamp": "2025-09-29T21:51:20.852089Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-29T21:51:20.852093Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-29T21:51:20.852096Z"
    },
    {
      "original": "Preparations for the next large-scale, combined Russian missile attack on Ukraine have begun.\n 3 Tu-160M strategic bombers have redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast. They are now being equipped with Kh-101 cruise missiles. \n2 Tu-22M3 strategic bombers redeployed from Diaghilev Airbase, Ryazan Oblast, to Olenya Airbase, Murmansk Oblast. These were already equipped with Kh-22 cruise missiles at Engels-2.\n1 Tu-95MS strategic bomber redeployed from Olenya Airbase to Engels-2 Airbase to be equipped with Kh-101 cruise missiles.\n1 Tu-95MS strategic bomber redeployed from Diaghilev Airbase to Engels-2 Airbase. It will likely be equipped with missiles, although there is a possibility that it will only take part in training missions. \n1 IL-76MD military transport aircraft landed at Baltimore Airbase, Voronezh Oblast. The cargo likely consists of Iskander-M ballistic missiles for OTRK installations near Liski, Voronezh Oblast. \n1 IL-78 tanker aircraft landed at Olenya Airbase. It will likely assist with redeployments/combat sorties of Tu-95MS. \nAccumulation of Geran-2/3 and Gerbera drones has begun at all of the major launch sites. These drones will take part in the next major missile attack.",
      "timestamp": "2025-09-29T21:51:20.852105Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-29T21:51:20.852108Z"
    },
    {
      "original": "Preparations for the next large-scale, combined Russian missile attack on Ukraine have begun.   3 Tu-160M strategic bombers have redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast. They are now being equipped with Kh-101 cruise…",
      "timestamp": "2025-09-29T21:51:20.852111Z"
    },
    {
      "original": "Additionally, 2 Tu-95MS bombers from Olenya and 2 Tu-95MS bombers from Engels-2 redeployed to Ukrainka Airbase, Amur Oblast. The 2 bombers from Engels-2 were already equipped with missiles prior to taking off.",
      "timestamp": "2025-09-29T21:51:20.852116Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-29T21:51:20.852120Z"
    },
    {
      "original": "Correction: Based on the nose, I'm pretty sure this is an Mi-8.",
      "timestamp": "2025-09-29T21:51:20.852122Z"
    },
    {
      "original": "Ukrainian Commander-in-chief Oleksandr Syrskyi has made a claim stating that Ukraine has recaptured around 175 km² and cleared an additional 195 km² from Russian DRGs in the \"Dobropillya Counteroffensive\".  \nI can personally confirm that approximately 110 km² were recaptured by Ukrainian forces, not including areas cleared by DRGs or areas since recaptured by Russian forces.",
      "timestamp": "2025-09-29T21:51:20.852127Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-29T21:51:20.852130Z"
    },
    {
      "original": "POV of the Ukrainian FPV drone strike on a Russian Mi-8 helicopter.",
      "timestamp": "2025-09-29T21:51:20.852133Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it. \nThe plan includes the following main points:\n1: Gaza will be a \"terror-free\" zone, meaning that militants from Hamas, and organisations fighting alongside Hamas such as the PIJ, PFLP, DFLP, Al-Aqsa Martyrs Brigades, etc, would have to leave the strip.\n2. Gaza will be \"redeveloped for the benefit of the people of Gaza\". \n3. The war will immediately end in all sectors, including artillery and air bombardment. IDF forces will withdraw to the yellow line shown on the map. (Please note that the current control line shown on Trump's map is completely wrong). A staged withdrawal will begin once conditions are met. \n4. 72 hours later, all hostages, alive and deceased, will be handed over to Israel.\n5. After the hostages are released, Israel will release 250 life sentence prisoners, as well as 1700 Gazans who were detained after October 7th, 2023, including all women and children. Additionally, for every Israeli hostage whose body is released, Israel will release the bodies of 15 deceases Gazans. \n6. After the hostage exchanges, all Hamas members who commit to \"peaceful co-existence\" and to decommission their weapons will be allowed safe passage out of the Gaza Strip to receiving countries. It is unknown if this will include members from other, Hamas-aligned organisations in Gaza. \n7. Full aid will then be sent to the Gaza Strip without interference, through the UN and its agencies, the red crescent, and other international institutions not associated with either party. The Rafah Border Crossing will also be opened, which the map below shows would be under IDF occupation.\n8. Gaza will be governed under a temporary, transitional government. It will be made up of \"qualified Palestinians\" and international experts and supervised by a new international transitional body headed by Trump. \n9. The Palestinian Authority will undergo a reform program. Once it has completed this, it will regain control over the Gaza Strip.\n10. No one will be forced to leave Gaza, but those who wish to can move to and from the strip.\n11. All military-related infrastructure in the Gaza Strip will be demolished and not rebuilt. \n12. The UN will work with Arab and international partners to develop a temporary International Stabilisation Force to immediately deploy to Gaza. It will train and provide support to Palestinian police forces in Gaza, as well as help secure Gaza's borders. \n13. The IDF will remain in the small perimeter zone shown on the map until Gaza is properly secured from any resurgence. \n14. An \"interfaith dialogue\" process will be established to change the mindsets of Palestinians and Israelis towards peace and co-existence. \n15. While Gaza is redeveloping and the PA is carrying out its reform program, there is a possibility for the recognition of a Palestinian state.",
      "timestamp": "2025-09-29T21:51:20.852149Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment.   The…",
      "timestamp": "2025-09-29T21:51:20.852153Z"
    },
    {
      "original": "The Ukrainian Navy reports that four Neptune cruise missiles were used to strike Karachev, Bryansk Oblast, rather than ATACMs.",
      "timestamp": "2025-09-29T21:51:20.852156Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it.   The plan includes the following main points:  1: Gaza will be a \"terror-free\" zone, meaning that militants from…",
      "timestamp": "2025-09-29T21:51:20.852159Z"
    },
    {
      "original": "Hamas and PIJ have denounced the U.S. peace plan as an \"American-Israeli agreement\" and a \"recipe for the continuation of aggression against the Palestinian people\". \nHamas stated that the plan is vague and not guaranteed, and that they will not accept any proposal that does not include self-determination for the Palestinian people.",
      "timestamp": "2025-09-29T21:51:20.852163Z"
    },
    {
      "original": "Russian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.47 km².",
      "timestamp": "2025-09-29T21:51:20.852167Z"
    }
  ],
  "script_run_time": "2025-09-29T21:51:21.253275Z"
}