{
  "messages": [
    {
      "original": "🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на Полтавщину.\n🛵\n БпЛА на північному сході Донеччини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-11-11T15:20:30.244009Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф \n➡️\n на південь Сумщини, північ Харківщини.",
      "timestamp": "2025-11-11T15:20:30.244027Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині:\n- на захід від н.п. Гути, курсом на Сумщину;\n- над н.п. Краснокутськ, курсом на південь;\n- поблизу н.п. Нова Водолага, на південно-східний напрямок.",
      "timestamp": "2025-11-11T15:20:30.244035Z"
    },
    {
      "original": "🛵\n Група БпЛА зі сходу \n➡️\n на південь Запорізької області.",
      "timestamp": "2025-11-11T15:20:30.244042Z"
    },
    {
      "original": "🛵\n Група БпЛА з акваторії Чорного моря \n➡️\n курсом на Одесу.",
      "timestamp": "2025-11-11T15:20:30.244048Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря \n➡️\n курсом на Південне, Чорноморське.",
      "timestamp": "2025-11-11T15:20:30.244054Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря \n➡️\n курсом на Південне, Чорноморське.",
      "timestamp": "2025-11-11T15:20:30.244060Z"
    },
    {
      "original": "На Одесу, перебувайте в укриттях!",
      "timestamp": "2025-11-11T15:20:30.244063Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря \n➡️\n курсом на Чорноморськ.\n🛵\n БпЛА із Запорізької області \n➡️\n на Дніпропетровщину, курсом на Нікополь.\n🛵\n БпЛА на півночі, заході,півдні Харківщини \n➡️\n курсом на Краснокутськ, Слобожанське, Краснопілку, Лозову.",
      "timestamp": "2025-11-11T15:20:30.244076Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T15:20:30.244080Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T15:20:30.244084Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф \n➡️\n на південь Сумщини, північ Харківщини.",
      "timestamp": "2025-11-11T15:20:30.244090Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Херсонщини \n➡️\n курсом на Берислав.\n🛵\n БпЛА із Запорізької області \n➡️\n на Дніпропетровщину, курсом на Нікополь.\n🛵\n БпЛА на півночі, заході, півдні Харківщини \n➡️\n курсом на Краснопавлівку, Лозову.",
      "timestamp": "2025-11-11T15:20:30.244100Z"
    },
    {
      "original": "🛵\n Група БпЛА з ТОТ Донецької області \n➡️\n на південь Дніпропетровської, північ Запорізької областей.",
      "timestamp": "2025-11-11T15:20:30.244106Z"
    },
    {
      "original": "🛵\n БпЛА на н.п. Нікополь Дніпропетровщини зі сходу.",
      "timestamp": "2025-11-11T15:20:30.244111Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-11T15:20:30.244115Z"
    },
    {
      "original": "🛵\n БпЛА на Херсон зі сходу.",
      "timestamp": "2025-11-11T15:20:30.244118Z"
    },
    {
      "original": "🛵\n Група БпЛА на н.п. Коломак на заході Харківщини.",
      "timestamp": "2025-11-11T15:20:30.244124Z"
    },
    {
      "original": "🛵\n Схід Полтавщини - загроза застосування ударних БпЛА.",
      "timestamp": "2025-11-11T15:20:30.244128Z"
    },
    {
      "original": "🛵\n Ударний БпЛА на півночі Чернігівщини, курсом на захід.",
      "timestamp": "2025-11-11T15:20:30.244132Z"
    },
    {
      "original": "🛵\n БпЛА поблизу н.п. Лиманівка та Лозова на Харківщині, курсом на захід та на схід.",
      "timestamp": "2025-11-11T15:20:30.244136Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saratov Oil Refinery. Two impacts were recorded, resulting in a large fire breaking out. \nCoordinates: 51.456652, 45.936631",
      "timestamp": "2025-11-11T15:20:30.964833Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saratov Oil Refinery. Two impacts were recorded, resulting in a large fire breaking out. \nCoordinates: 51.456652, 45.936631",
      "timestamp": "2025-11-11T15:20:30.964846Z"
    },
    {
      "original": "Before and after of a treeline near Vuhledar, Donetsk Oblast.",
      "timestamp": "2025-11-11T15:20:30.964849Z"
    },
    {
      "original": "As everyone focuses on the final battles taking place for Pokrovsk, think I should highlight the sheer intensity of battles ongoing in Rodynske right now, just north of Pokrovsk.  Ukrainian forces who infiltrated the city around six days ago have entrenched…",
      "timestamp": "2025-11-11T15:20:30.964853Z"
    },
    {
      "original": "The fighting in Rodynske right now is so heavy that even with the thick fog and clouds covering the Donbas, combat related fires can still be seen on NASA's satellites. Combat fires often don't show up even when its sunny.\nFor reference, the only other heat signature seen in Ukraine right now is heat coming from a large factory in Ivano-Frankivsk, western Ukraine.",
      "timestamp": "2025-11-11T15:20:30.964858Z"
    },
    {
      "original": "Only a couple of streets of Pokrovsk remain until the city is captured by Russia.",
      "timestamp": "2025-11-11T15:20:30.964861Z"
    },
    {
      "original": "In the Stepnohirsk direction, over the past week Russian forces have intensified their assault operations, recapturing key positions.\nRussian forces continued to advance north through the village of Prymorske, recapturing the rest of the southern dachas and entering the main southern residential area. Forward assault groups reached and crossed the first gulley where fighting is now ongoing.\nTo the southeast, Russian forces advanced east towards the Kollektivnyye, Elektrovoznik-2, and Ogorody Dachas, capturing positions along the northern bank of the dried-up Zaliv Inlet. They were also able to capture the Stepnohirsk overpass, south of the Sukhaya River, and positions in the surrounding forested areas.\n+ ~2.99 km² in favour of Russia.",
      "timestamp": "2025-11-11T15:20:30.964867Z"
    },
    {
      "original": "Russian artillery shelling has resulted in power outages in large parts of Kherson City. The trolleybus lines have been halted, and disruptions in water supply are reported.",
      "timestamp": "2025-11-11T15:20:30.964870Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-11T15:20:30.964873Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-11T15:20:30.964876Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-11T15:20:30.964878Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-11T15:20:30.964881Z"
    },
    {
      "original": "Probably Russian S-300/400 air defence activity",
      "timestamp": "2025-11-11T15:20:30.964884Z"
    },
    {
      "original": "In the Hulyaipole direction, the situation continues to deteriorate for Ukraine, as Russian forces continue to rapidly advance.\nIn the south, Russian forces continued to advance west of Poltavka and began bypassing Vesele from the north, capturing new treeline positions on the tactical heights. Further north, after entering Novouspenivske from the south, the Russians established full control over the village and its surrounding positions. Simultaneously, the Russians consolidated to the north in Nove and quickly captured the rest of the village. Before this, any remaining Ukrainian soldiers withdrew from the areas east of Nove and Novouspenivske to avoid being encircled.\nAs these two villages were being captured, Russian DRGs began infiltrated to the villages of Rivnopillya and Yablukove, engaging in clashes with Ukrainian units sent to the area to clear them out. Assault groups, taking advantage of the complicated situation for Ukraine, then broke through Ukrainian positions west of Nove by advancing southwest down the road for over 5.6 km, capturing positions in numerous different treelines. Some forces were able to enter and entrench in eastern Yablukove, while others advanced to the west towards Rivnopillya, capturing the eastern street of the settlement. \nFurther north, taking advantage of the local collapse of Ukrainian defences near Solodke, Russian forces advanced west from Uspenivka for over 4 km, capturing numerous new treelines on the tactical heights and levelling the frontline between the newly captured village of Solodke and the breakthroughs further south. \nIn the north, Russian forces continued to advance around Zlahoda. They pushed south from the village to the next treelines, capturing them and entering the village of Rybne, which was quickly brought under control. They then advanced further south to the treelines on the tactical heights, capturing them and linking up their bridgehead over the Yanchur River with the rest of the Hulyaipole direction.\n+ ~46.27 km² in favour of Russia.",
      "timestamp": "2025-11-11T15:20:30.964891Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to advance and have established a foothold in the village of Orestopil.\nAfter DRGs infiltrated the village earlier, and Russian assault groups reached its southwestern outskirts, Russian forces entered the western part of the village, establishing control over positions on two streets. DRGs continue to operate further east, with the rest of the village now falling into the grey zone.\n+ ~0.60 km² in favour of Russia.",
      "timestamp": "2025-11-11T15:20:30.964896Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continue to advance in the salient south of Novopavlivka and have captured new key positions.\nFollowing the Ukrainian withdrawal from the southern part of the salient north of Dachne, Russian forces crossed the Kalmychkova Gulley along the highway and captured positions in the treelines on the tactical heights to the north. Other forces pushed west from already-established positions north of the gulley, making new progress along additional treelines. \nMeanwhile, in Novopavlivka, assault operations continue in the southern part of the town, with Russian soldiers attempting to make additional progress in the direction of the centre.\n+ ~3.94 km² in favour of Russia.",
      "timestamp": "2025-11-11T15:20:30.964901Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 1): \nOver the past few days, Russian forces have made substantial progress on the tactical heights west of Pokrovsk, while the last streets of the city begin to come under Russian control.\nNorth of Udachne, Russian forces advanced from the western part of the town to the western approaches to the Pokrovsk Coal Mine, capturing new positions along a treeline and a gulley. Other forces improved their positions along the treeline towards the eastern part of the mine. Heavy fighting continues on the approaches of this very important fortified node.\nWest of Pokrovsk, Russian forces broke through Ukrainian defences north of Kotlyne, capturing positions in the treelines to the north and northwest. They then went on to advance further northeast to the next treelines over on the tactical heights, while other forces pushed north from the railway line. Additionally, Russian forces captured numerous new treeline positions closer to Pokrovsk and made additional progress along the railway line to the south of Hryshyne, where they are beginning to outflank the Ukrainian positions in the rest of those treelines. \nIn northern Pokrovsk, under the cover of fog, additional Russian reinforcements were brought from the city centre to help the units who were struggling to consolidate in the northern residential areas of the 8th District. The remaining Ukrainian assault groups were forced to retreat from this part of the city, allowing for the Russians to establish full control over the district. Additionally, Russian forces advanced northwest from the low-rise part of the Dinas District to the nearby forested areas, while other forces in the 8th District advanced north to the forested areas just outside the city, forcing most Ukrainian formations to withdraw much further west - away from the Myrnohrad Pocket. \nIn northwestern Pokrovsk, after establishing control over and consolidating in the Shcherbakova District, Russian soldiers began infiltrating north across the Hryshinka River to the northernmost street of Pokrovsk and the Druzhba Dachas, where they are now trying to consolidate. Fighting is ongoing as Ukrainian forces attempt to prevent the Russians from securing this area as it would build a buffer outside the main part of the city and help develop the eastern flank to Hryshyne. \nNorth of Pokrovsk, Russian forces continued advancing down the road to Hryshyne and have captured additional positions there. They also advanced down a perpendicular treeline to the north. Assault groups then began attacking towards the next pig farm over, while DRGs infiltrated towards the third pig farm. DRGs also began infiltrating southwest through the treelines towards the northern outskirts of Pokrovsk\nNortheast of the city, Russian forces continued their assault operations in southern Rivne, attacking along the highway in the direction of northwestern Myrnohrad. In eastern Pokrovsk, other they began attacks from the Sobachivka District to the \"Kohozhkine\" street of Pokrovsk - the last street in the eastern part of the city. \nSouth of Myrnohrad, after capturing the last parts of Lysivka, Russian forces were able to capture the rest of the forests north of the village. They also consolidated in a large trench fortification further north and are attacking east down a treeline to the other one. Additionally, the Russians began attacks north up a treeline from eastern Lysivka to the western part of Sukhyi Yar. \nIn southeastern Myrnohrad, Russian forces continued assault operations from the area of the terykon to residential areas in the area of Dymytrov Park. They are also attacking towards the area of the high-rise buildings in the Zapadny District.\n(Part 2 is below)",
      "timestamp": "2025-11-11T15:20:30.964912Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 1):   Over the past few days, Russian forces have made substantial progress on the tactical heights west of Pokrovsk, while the last streets of the city begin to come under Russian control.  North of Udachne, Russian…",
      "timestamp": "2025-11-11T15:20:30.964916Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 2): \nIn Rodynske, extremely heavy fighting continues. The Ukrainians are attempting to exploit poorly consolidated Russian positions in the city centre to reach the southeastern high-rise micro-district, while Russian forces continue attempts to counterattack from the flanks. Both sides are using extensive heavy weaponry to strike each other's positions. Ukraine is using MiG-29s and F-16s to launch glide-bombs at Russian positions in the city, while Russia continues to strike the Ukrainian positions in the city along with its main supply line with FAB glide-bombs.",
      "timestamp": "2025-11-11T15:20:30.964920Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-11T15:20:30.964923Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-11T15:20:30.964930Z"
    },
    {
      "original": "Do you guys think Zelensky is aware of his curse?",
      "timestamp": "2025-11-11T15:20:30.964933Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-11T15:20:30.964939Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-11T15:20:30.964943Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591309Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591327Z"
    },
    {
      "original": "Radar Hit: Summary Of Russian Combat Footage From November 10, 2025\nOn November 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-11T15:20:31.591342Z"
    },
    {
      "original": "Radar Hit: Summary Of Russian Combat Footage From November 10, 2025\nOn November 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-11T15:20:31.591349Z"
    },
    {
      "original": "Another Israeli-Iranian War Is ‘Only Matter Of Time’ – Report\nAnother war between Israel and Iran is “only a matter of time,” according to a report published by The New York Times on November 9.\nThe report casts serious doubt on the idea that the 12-day war between the countries in June neutralized Iran’s nuclear program.\nIt claims that Middle East officials and experts increasingly believe Israeli and United States strikes caused less damage to the Islamic Republic’s nuclear facilities than previously thought, and that both countries are preparing for the prospect of another attack.\n“Iran’s stockpile of highly enriched uranium, enough to make 11 nuclear weapons, is either buried under rubble, as Iran claims, or has been spirited away to a safe place, as Israeli officials believe,” the report said.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591359Z"
    },
    {
      "original": "Ukrainian Troops Abandoning Front In Large Numbers\nThe number of desertions in Ukraine has been growing for a long time. As a natural consequence of the brutal process of forced mobilization and the high intensity of hostilities on the battlefield, more and more Ukrainians are simply fleeing their ranks as soon as they have the chance to evade the authorities. This is a clear sign of the decline of the Ukrainian military and the inability of the Kiev neo-Nazi regime to maintain the war effort in the long term.\nRecently, Western media reported that more than \n21,000 Ukrainian soldiers\n abandoned their country's armed forces in October alone. This number is massive for such a short period of time and shows the profound level of crisis within the Ukrainian military. In fact, this is the highest number of desertions reported in a single month since the beginning of the conflict, which also indicates that more recently the conditions of the war have become increasingly intolerable...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591369Z"
    },
    {
      "original": "Russia Foils Ukrainian-British Plot To Hijack Kinzhal-Armed MiG-31 Jet, Strikes Back (Videos)\nThe Russian Federal Security Service (FSB) announced on November 11 that it had foiled an elaborate Ukrainian-British plot to hijack a MiG-31 fighter jet armed with a Kinzhal hypersonic ballistic missile.\n\"In order to hijack the aircraft, Ukrainian military intelligence officers tried to recruit Russian pilots, offering $3 million. The special services then planned to send the jet with the Kinzhal missile to the area where NATO's largest airbase in southeastern Europe is located, in the Romanian city of Constanta, where it could be shot down by air defenses,\" the FSB said in a statement. \"The measures taken have thwarted the plans of the Ukrainian and UK intelligence services to carry out a large-scale provocation.\"\nThe MiG-31 pilot said that he was contacted last year by a man who introduced himself as Sergey Lugovsky, a researcher for the investigative group Bellingcat.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591377Z"
    },
    {
      "original": "Russia Foils Ukrainian-British Plot To Hijack Kinzhal-Armed MiG-31 Jet, Strikes Back (Videos)\nThe Russian Federal Security Service (FSB) announced on November 11 that it had foiled an elaborate Ukrainian-British plot to hijack a MiG-31 fighter jet armed with a Kinzhal hypersonic ballistic missile.\n\"In order to hijack the aircraft, Ukrainian military intelligence officers tried to recruit Russian pilots, offering $3 million. The special services then planned to send the jet with the Kinzhal missile to the area where NATO's largest airbase in southeastern Europe is located, in the Romanian city of Constanta, where it could be shot down by air defenses,\" the FSB said in a statement. \"The measures taken have thwarted the plans of the Ukrainian and UK intelligence services to carry out a large-scale provocation.\"\nThe MiG-31 pilot said that he was contacted last year by a man who introduced himself as Sergey Lugovsky, a researcher for the investigative group Bellingcat.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591386Z"
    },
    {
      "original": "Under The Guise Of Fog, Russian Troops Pour Into Pokrovsk (Videos)\nOn November 11, the Russian military expanded its control in Pokrovsk in Donetsk after taking advantage of fog to move more troops to the city and nearby areas.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army of the Tsentr [Center] Group of Forces conducted “intensive offensive actions” in the northwestern and eastern quarters of the Pokrovsk’s Central District, as well as in the nearby train station's depot.\nRussian troops cleared 256 buildings in these parts of the city and mopped up Rog, also known as Rih, to the east, clearing an additional 98 buildings there, over the past 24 hours, according to the ministry.\nVideos that emerged from Pokrovsk and nearby areas in the last 24 hours indicate that Kiev forces have been already defeated there.\nOne of the videos shows dozens of Russian troops pouring into the city from its southern entrance along the E50 highway under the guise of fog.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591395Z"
    },
    {
      "original": "Under The Guise Of Fog, Russian Troops Pour Into Pokrovsk (Videos)\nOn November 11, the Russian military expanded its control in Pokrovsk in Donetsk after taking advantage of fog to move more troops to the city and nearby areas.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army of the Tsentr [Center] Group of Forces conducted “intensive offensive actions” in the northwestern and eastern quarters of the Pokrovsk’s Central District, as well as in the nearby train station's depot.\nRussian troops cleared 256 buildings in these parts of the city and mopped up Rog, also known as Rih, to the east, clearing an additional 98 buildings there, over the past 24 hours, according to the ministry.\nVideos that emerged from Pokrovsk and nearby areas in the last 24 hours indicate that Kiev forces have been already defeated there.\nOne of the videos shows dozens of Russian troops pouring into the city from its southern entrance along the E50 highway under the guise of fog.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591404Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – November 11, 2025",
      "timestamp": "2025-11-11T15:20:31.591412Z"
    },
    {
      "original": "Russian Army Takes Over Eastern Kupyansk (Videos)\nOn November 11, the Russian military advanced in the city of Kupyansk in Kharkiv as Kiev forces launched more desperate counterattacks.\nThe Russian Ministry of Defense announced in a brief statement that the 6th Army, a part of the Zapad [West] Group of Forces, had imposed full control of the eastern part of Kupyansk.\nEarlier, a commander, who gave his call sign as \"Hunter\" and identified himself as being in charge of Russia's 1486th Motorized Rifle Regiment's assault detachment, said his forces had taken control of an oil depot in the eastern part of Kupyansk.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591419Z"
    },
    {
      "original": "Russian Army Takes Over Eastern Kupyansk (Videos)\nOn November 11, the Russian military advanced in the city of Kupyansk in Kharkiv as Kiev forces launched more desperate counterattacks.\nThe Russian Ministry of Defense announced in a brief statement that the 6th Army, a part of the Zapad [West] Group of Forces, had imposed full control of the eastern part of Kupyansk.\nEarlier, a commander, who gave his call sign as \"Hunter\" and identified himself as being in charge of Russia's 1486th Motorized Rifle Regiment's assault detachment, said his forces had taken control of an oil depot in the eastern part of Kupyansk.\nRead more \nHERE",
      "timestamp": "2025-11-11T15:20:31.591427Z"
    }
  ],
  "script_run_time": "2025-11-11T15:20:31.592228Z"
}