{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-18T11:44:59.965757Z"
    },
    {
      "original": "🛵\n БпЛА в Павлоградському районі Дніпропетровської області , напрямок м.Павлоград.",
      "timestamp": "2025-11-18T11:44:59.965771Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину та Донеччину.",
      "timestamp": "2025-11-18T11:44:59.965776Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину",
      "timestamp": "2025-11-18T11:44:59.965781Z"
    },
    {
      "original": "🛫\n \n🚀\n Одещина -  загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-11-18T11:44:59.965787Z"
    },
    {
      "original": "🛫\n \n🚀\n Одещина -  загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-11-18T11:44:59.965792Z"
    },
    {
      "original": "Відбій загрози",
      "timestamp": "2025-11-18T11:44:59.965796Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на сході Харківщини.",
      "timestamp": "2025-11-18T11:44:59.965800Z"
    },
    {
      "original": "🛫\n Донеччина та Дніпропетровщина - загроза застосування авіаційних засобів ураження.\n🛵\n Харківщина - загроза застосування ударних БпЛА",
      "timestamp": "2025-11-18T11:44:59.965807Z"
    },
    {
      "original": "КАБ на Дніпропетровщині",
      "timestamp": "2025-11-18T11:44:59.965810Z"
    },
    {
      "original": "Пуски КАБів у напрямку Донеччини!",
      "timestamp": "2025-11-18T11:44:59.965813Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 101 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 18 листопада (з 20:00 17 листопада) противник атакував чотирма балістичними ракетами Іскандер-М із Ростовської та Воронезької обл. – рф, та 114-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллєрово, Приморсько-Ахтарськ, – рф, Чауда - ТОТ АР Крим, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 101 ворожий БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 4 ракет та 13 ударних БпЛА на 15 локаціях, а також падіння збитих (уламки) на 2 локаціях. \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-18T11:44:59.965833Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-18T11:44:59.965838Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-11-18T11:44:59.965846Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Сум з  північно-східного напрямку.",
      "timestamp": "2025-11-18T11:44:59.965851Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-11-18T11:44:59.965855Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-18T11:44:59.965860Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-18T11:44:59.965864Z"
    },
    {
      "original": "🛵\n БпЛА на межі Харківщини та Сумщини, курс південно-західний.",
      "timestamp": "2025-11-18T11:44:59.965868Z"
    },
    {
      "original": "🚀\n Запорізька область - ракетна небезпека.",
      "timestamp": "2025-11-18T11:44:59.965872Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА в напрямку Сум зі  сходу.",
      "timestamp": "2025-11-18T11:44:59.965877Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to slowly advance in the area of Synelnykove, and have entered the main part of the village. \nFollowing earlier failed attempts at capturing positions in the northern part of Synelnykove, Russian forces began attacks from the forests to the west, into the western street of the village. As a result, they were able to establish control over it, allowing for other assault groups to enter the settlement from the north, and capture the houses there too.\n+ ~0.37 km² in favour of Russia.",
      "timestamp": "2025-11-18T11:45:00.582631Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.\nAt least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation at 45.35423, 28.80395, resulting in a large fire breaking out and widespread power outages for Izmail and the surrounding areas.",
      "timestamp": "2025-11-18T11:45:00.582651Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.\nAt least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation at 45.35423, 28.80395, resulting in a large fire breaking out and widespread power outages for Izmail and the surrounding areas.",
      "timestamp": "2025-11-18T11:45:00.582657Z"
    },
    {
      "original": "Last night, a combined Russian missile and drone attack was carried out on Kharkiv Oblast.\n2 Iskander-M ballistic missiles impacted target in the centre of Balakliya, somewhere near 49.45555, 36.83722, while at least 5 Geran-2 drones targeted energy infrastructure in the vicinity of the city. Widespread power outages were reported in the entirety Balakliya and the surrounding settlements. 1 civilian was killed, and 7 others were injured. [Media 1 & 2]\nAt least 6 Gerans targeted energy infrastructure near Izyum. Widespread power outages were reported in the entirety of the city and surrounding settlements. \nAt least 6 Gerans impacted an unknown target in Lozova, possibly the railway station. \nAdditionally, one Molniya FPV drone struck a target in the Kholodnohirs'kyi District of Kharkiv City",
      "timestamp": "2025-11-18T11:45:00.582664Z"
    },
    {
      "original": "Last night, a combined Russian missile and drone attack was carried out on Kharkiv Oblast.\n2 Iskander-M ballistic missiles impacted target in the centre of Balakliya, somewhere near 49.45555, 36.83722, while at least 5 Geran-2 drones targeted energy infrastructure in the vicinity of the city. Widespread power outages were reported in the entirety Balakliya and the surrounding settlements. 1 civilian was killed, and 7 others were injured. [Media 1 & 2]\nAt least 6 Gerans targeted energy infrastructure near Izyum. Widespread power outages were reported in the entirety of the city and surrounding settlements. \nAt least 6 Gerans impacted an unknown target in Lozova, possibly the railway station. \nAdditionally, one Molniya FPV drone struck a target in the Kholodnohirs'kyi District of Kharkiv City",
      "timestamp": "2025-11-18T11:45:00.582671Z"
    },
    {
      "original": "Overnight, a combined Russian missile and drone attack was carried out on Sumy Oblast. \nOne Iskander-M ballistic missile launched from Kursk Oblast, along with 2-3 Geran-2 drones impacted a target near the village of Boromlya, Sumy Oblast. \nAdditionally, at least five Geran-2 drones attacked a target northeast of Sumy City, in the area of Khomyne [attached video].",
      "timestamp": "2025-11-18T11:45:00.582676Z"
    },
    {
      "original": "In the evening, at least 8 Russian Geran-2 drones attacked an unknown target in the cities of Novohorod-Siverskyi and Mena, Chernihiv Oblast",
      "timestamp": "2025-11-18T11:45:00.582679Z"
    },
    {
      "original": "In the evening, at least 8 Russian Geran-2 drones attacked an unknown target in the cities of Novohorod-Siverskyi and Mena, Chernihiv Oblast",
      "timestamp": "2025-11-18T11:45:00.582683Z"
    },
    {
      "original": "Additionally, during the attacks on Dnipropetrovsk Oblast, one Iskander-M ballistic missile launched from the vicinity of Yeysk, Krasnodar Krai, impacted the town of Mykolaivka. A strong explosion was reported and heard from neighbouring cities.",
      "timestamp": "2025-11-18T11:45:00.582690Z"
    },
    {
      "original": "Following the Russian KAB strikes on energy infrastructure west of Mykolaivka, Donetsk Oblast, at least three Russian Geran-2 drones attacked an unknown target in the city of Slovyansk.\nSeveral Geran strikes were also once again recorded close to the frontline in Pokrovsk'e, Dnirpopetrovsk Oblast. A few drones also attacked the city of Pavlohrad.",
      "timestamp": "2025-11-18T11:45:00.582696Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.  At least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation…",
      "timestamp": "2025-11-18T11:45:00.582700Z"
    },
    {
      "original": "Additionally, the Izmail port was struck by as many as a dozen drones, rather than all of them targeting the substation.",
      "timestamp": "2025-11-18T11:45:00.582705Z"
    },
    {
      "original": "Sounding the alarms \n😱\nEdit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-18T11:45:00.582711Z"
    },
    {
      "original": "Sounding the alarms \n😱\n  Edit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-18T11:45:00.582716Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-18T11:45:00.582719Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-18T11:45:00.582722Z"
    },
    {
      "original": "This is what happens when you lie to your audience for nearly four years straight, while believing the opposite of what you say behind closed doors.",
      "timestamp": "2025-11-18T11:45:00.582726Z"
    },
    {
      "original": "🇵🇸\n🇮🇱\n⚡️\n- \"If the United Nations pushes for recognition of Palestine, I will order targeted assassinations of senior Palestinian Authority terrorists and the arrest of Mahmoud Abbas himself.\" - Israeli National Security Minister Ben Gvir.",
      "timestamp": "2025-11-18T11:45:00.582732Z"
    },
    {
      "original": "Last night, Russia carried out a combined missile and drone attack on the city of Berestyn, Kharkiv Oblast. \nAt least five Geran-2 drones and four Iskander-M ballistic missiles attacked an unknown target within the city limits.",
      "timestamp": "2025-11-18T11:45:00.582736Z"
    },
    {
      "original": "Over the last week, I've seeing a lot of Pro-Ukraine accounts beginning to doom about the war. People are highlighting the massive issues plaguing the Armed Forces of Ukraine, and the Russian superiority in all the different fields of war.\nBut I guarantee you, that at some point towards the end of 2025 and into 2026, Ukraine will carry out some sort of PR-related operation like Spiderweb or Kursk which will \"win back\" these supporters. And sure enough, they will follow like sheep and good lil' patriots, changing up the presumed narrative, and shifting the goal posts back, once again, to restoring the 2014, or even 1991 borders. \nWe saw a similar phenomenon last year. After Russia entered northern Kharkiv Oblast and attacked the cities of Vovchansk and Lyptsi, and Ukraine redeployed units away from the Donbas, Russia began rapidly advancing in the directions of Pokrovsk, Vuhledar, Ukrainsk, and Kurakhove. Pro-Ukrainians began sounding the alarms, with these rapid advances massively contrasting the prolonged and difficult battle for Avdiivka. Then, in early August, Ukraine launched their Kursk operation, and everything changed back. \nIt's just the ebb and flow of the uninformed parts of the information space. But slowly, the goal posts are shifting. It's not linear, but the goal posts are trending in favour of Russia, and away from the original goal which was set of restoring the 1991 borders. This will only accelerate, but of course with a delay to Russian progress as we have seen in the past.",
      "timestamp": "2025-11-18T11:45:00.582742Z"
    },
    {
      "original": "I cannot believe this. \nUkraine's train stations get hit by 4 ballistic missiles and half a dozen Geran-2 drones, and only result in some rerouting and delays of up to 1 hour. \nMy train lines get COMPLETELY CANCELLED for the entire day for an average of 4 days per week due to \"track repairs\". You're repairing tracks four times per week??? How is that even possible?",
      "timestamp": "2025-11-18T11:45:00.582746Z"
    },
    {
      "original": "🇱🇧\n🇮🇱\n - Israel has now killed 367 Hezbollah members since the Israel-Hezbollah ceasefire 356 days ago. \nHezbollah has responded 0 times.",
      "timestamp": "2025-11-18T11:45:00.582752Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:\nYesterday, 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. It is unlikely to be equipped with Kh-101 cruise missiles, as another Tu-160 redeployed from Engels-2 Airbase to Ukrainka Airbase, suggesting a rotation was carried out for training purposes, as this bomber has been stationed at Engels-2 for a long time and was only ever used for training.\n2 Tu-95MS and 1 Tu-160 landed at Engels-2 Airbase just now after redeploying from Ukrainka airbase and will also be equipped with Kh-101 missiles. The 2 Tu-95MS will likely make a flight to Olenya Airbase, Murmansk Oblast, in the next 36 hours. \nAnother IL-76MD cargo plane, along with an An-26 cargo plane landed at Rostov Airbase. The cargo consists of additional Iskander-M ballistic missiles, which will be delivered to OTRK installations near Taganrog, Rostov Oblast. \nRemember, 2 Iskanders were launched from Taganrog last night at a target in Berestyn, Kharkiv Oblast. It's also possible (but unlikely in my opinion) that a portion of these Iskanders from Rostov Airbase are being delivered to OTRK installations at Millerovo Airbase, Rostov Oblast.\nNew deliveries of at least 150 Geran-2 drones have been made to the launch sites at Millerovo Airbase, Rostov Oblast, and Navlya Test Site, Bryansk Oblast, via rail. Accumulation of drones at launch points surrounding Ukraine that have been allocated for this upcoming attack will be over 400 now. \nOne \"Buyan-M\" Corvette was equipped with up to 8 Kalibr cruise missiles at Novorossiysk Naval Base, Krasnodar Krai. No other Kalibr carriers are known to be equipped with missiles, so if the upcoming attack occurs in the next two days, it's unlikely that Kalibrs will be used\nOne MiG-31K fighter carried out rare, long-range training from Savasleika Airbase, Nizhny Novgorod Oblast. An IL-76M tanker from Diaghilev Airbase, Ryazan Oblast, took part in refueling the aircraft. \nCurrently, there are 8 MiG-31Ks stationed at Savasleika Airbase. Their equipment status is unknown, but likely only a portion are equipped with Kinzhal missiles. The 2 MiG-31Ks at Akhtubinsk Airbase, Astrakhan Oblast, are not equipped with missiles.\nRight now, there are 3 Tu-95MS at Olenya Airbase, 3 Tu-95MS at Engels-2 Airbase, and 5 Tu-160s at Engels-2 Airbase. Currently confirmed to be equipped / are being equipped with missiles are: 6 Tu-95MS and 3 Tu-160s. \nThe next large-scale missile attack is unlikely to take place tonight, but there is an increased threat for Wednesday night / Thursday morning, and the three nights after that.",
      "timestamp": "2025-11-18T11:45:00.582763Z"
    },
    {
      "original": "Military Situation In Ukraine On November 17, 2025 (Maps Update)",
      "timestamp": "2025-11-18T11:45:01.182529Z"
    },
    {
      "original": "Military Situation In Ukraine On November 17, 2025 (Maps Update)",
      "timestamp": "2025-11-18T11:45:01.182543Z"
    },
    {
      "original": "Russia's Massive Strike On Odesa Targets Port Infrastructure And NATO Supplies For The Ukrainian Armed Forces\nOn the night of November 16-17, Russia and Ukraine exchanged another wave of strikes. The Russian Defense Ministry reported its air defense systems destroyed 36 Ukrainian UAVs over its territory. Meanwhile, Ukrainian Air Force officials stated that 128 Russian attack drones targeted Ukraine during the same period, with 91 reportedly being jammed or shot down.\nIn the Odesa region, Russian forces conducted two waves of attacks using Geran-2 unmanned aerial vehicles on Izmail. During the first wave, a large substation powering the military port was destroyed, while the second wave destroyed a ferry carrying NATO military supplies for the Ukrainian Armed Forces. Additionally, a shipbuilding plant located near the port came under attack, where, according to preliminary data, workshops assembling unmanned boats were destroyed.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182553Z"
    },
    {
      "original": "Russia's Massive Strike On Odesa Targets Port Infrastructure And NATO Supplies For The Ukrainian Armed Forces\nOn the night of November 16-17, Russia and Ukraine exchanged another wave of strikes. The Russian Defense Ministry reported its air defense systems destroyed 36 Ukrainian UAVs over its territory. Meanwhile, Ukrainian Air Force officials stated that 128 Russian attack drones targeted Ukraine during the same period, with 91 reportedly being jammed or shot down.\nIn the Odesa region, Russian forces conducted two waves of attacks using Geran-2 unmanned aerial vehicles on Izmail. During the first wave, a large substation powering the military port was destroyed, while the second wave destroyed a ferry carrying NATO military supplies for the Ukrainian Armed Forces. Additionally, a shipbuilding plant located near the port came under attack, where, according to preliminary data, workshops assembling unmanned boats were destroyed.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182562Z"
    },
    {
      "original": "PINCER MOVEMENT: RUSSIAN FORCES TIGHTEN GRIP ON MIRNOGRAD WHILE ADVANCING TOWARD GULYAIPOLE",
      "timestamp": "2025-11-18T11:45:01.182566Z"
    },
    {
      "original": "Artillery Punch In Zaporizhzhia: Russian Firepower Is Crushing Ukrainian Forces In Huliaipole\nRussian units have taken control of Platonovka in the direction of Siversk. Having crossed the Volchya River, the Russian army has resumed their advance towards Novopavlovka. \nThe leader of the French «Patriots» party, Florian Philippot, has criticized Ukraine's purchase of French aircraft.\nRead more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182577Z"
    },
    {
      "original": "Artillery Punch In Zaporizhzhia: Russian Firepower Is Crushing Ukrainian Forces In Huliaipole\nRussian units have taken control of Platonovka in the direction of Siversk. Having crossed the Volchya River, the Russian army has resumed their advance towards Novopavlovka. \nThe leader of the French «Patriots» party, Florian Philippot, has criticized Ukraine's purchase of French aircraft.\nRead more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182584Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 17, 2025\nOn November 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-18T11:45:01.182591Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 17, 2025\nOn November 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-18T11:45:01.182598Z"
    },
    {
      "original": "Russian Forces Are Back In Southern Syria As Talks With Israel Reach Dead End (Video)\nThe redeployment of Russian forces in southern Syria appears to be nearing as talks between the country’s new Islamist-led government and Israel are reported to have reached a dead end.\nOn November 18, Russian defense officials conducted a tour in the region, in the first such move since the fall of the regime of President Bashar al-Assad last year.\n“A joint delegation from the Syrian and Russian ministries of defense conducted a field tour that included a number of military points and sites in southern Syria, with the aim of learning about the situation on the ground within the framework of the existing cooperation between the two sides,” a statement from the Media and Communication Department published by the state-run Syrian Arab News Agency reads.\nJust a few hours after the tour was concluded on November 17, Israel’s Kan public broadcaster reported that talks with Syria are currently at a dead end.\nRead more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182607Z"
    },
    {
      "original": "Russian Forces Are Back In Southern Syria As Talks With Israel Reach Dead End (Video)\nThe redeployment of Russian forces in southern Syria appears to be nearing as talks between the country’s new Islamist-led government and Israel are reported to have reached a dead end.\nOn November 18, Russian defense officials conducted a tour in the region, in the first such move since the fall of the regime of President Bashar al-Assad last year.\n“A joint delegation from the Syrian and Russian ministries of defense conducted a field tour that included a number of military points and sites in southern Syria, with the aim of learning about the situation on the ground within the framework of the existing cooperation between the two sides,” a statement from the Media and Communication Department published by the state-run Syrian Arab News Agency reads.\nJust a few hours after the tour was concluded on November 17, Israel’s Kan public broadcaster reported that talks with Syria are currently at a dead end.\nRead more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182617Z"
    },
    {
      "original": "Syria Support One China Principle Amid Reports Of Plan To Extradite Uyghur Jihadists\nSyrian Foreign Minister Asaad al-Shaibani has pledged to deepen collaboration on “counterterrorism” with China on his first visit to Beijing since the fall of the regime of former President Bashar al-Assad last year, amid reports suggesting that the country could extradite Uyghur jihadists.\nA statement published by the state-run Syrian Arab News Agency (SANA) said that al-Shaibani and Chinese counterpart Wang Yi agreed during the visit on November 17 that they would work together on combating “terrorism”.\nThe main issue for China IS the Uighur who had gone to Syria after war broke out in 2011 to fight al-Assad, with many joining the Turkistan Islamic Party (TIP).\nUp to 4,000 Uighurs were reportedly members of the TIP, which was integrated after the fall of Assad into the 84th Division, a unit of the new Syrian military. The Emir of the party was even given the rank of Brigadier General.\nRead more \nHERE",
      "timestamp": "2025-11-18T11:45:01.182625Z"
    }
  ],
  "script_run_time": "2025-11-18T11:45:01.183451Z"
}