{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі південного-сходу, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-08-31T21:30:30.830203Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-31T21:30:30.830221Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА в акваторії Чорного моря в напрямку Одещини",
      "timestamp": "2025-08-31T21:30:30.830227Z"
    },
    {
      "original": "Запорізька, Харківська, Дніпропетровська, Донецька області - ракетна небезпека!",
      "timestamp": "2025-08-31T21:30:30.830230Z"
    },
    {
      "original": "🛸\n на Сумщині та Чернігівщині ворожі БпЛА.\nЗалучено засоби для їх збиття.",
      "timestamp": "2025-08-31T21:30:30.830236Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T21:30:30.830243Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на південно-східному та східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T21:30:30.830251Z"
    },
    {
      "original": "🚀\n КАБи на Донеччині та Сумщині!",
      "timestamp": "2025-08-31T21:30:30.830255Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння в областях, де оголошено повітряну тривогу.",
      "timestamp": "2025-08-31T21:30:30.830259Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.\n🛬\n Продовжується активність ворожої тактичної авіації на східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T21:30:30.830267Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному та східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T21:30:30.830274Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Чернігівщині та Сумщині \n➡️\n курсом на південь.",
      "timestamp": "2025-08-31T21:30:30.830280Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Дніпропетровщині \n➡️\n курсом на захід.",
      "timestamp": "2025-08-31T21:30:30.830286Z"
    },
    {
      "original": "🛵\n ударні БпЛА на Чернігівщині \n➡️\n курсом на Київщину.\n🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Чернігівщину та Полтавщину.",
      "timestamp": "2025-08-31T21:30:30.830297Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.",
      "timestamp": "2025-08-31T21:30:30.830303Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.\n🛵\n ворожі БпЛА на сході Донеччини \n➡️\n курсом на північний схід/південь.",
      "timestamp": "2025-08-31T21:30:30.830312Z"
    },
    {
      "original": "🛵\n нова група ударних БпЛА на Донеччині \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-08-31T21:30:30.830317Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!\n🚀\nПуски КАБ на Сумщину!",
      "timestamp": "2025-08-31T21:30:30.830326Z"
    },
    {
      "original": "🚀\n Запоріжжя - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T21:30:30.830331Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.",
      "timestamp": "2025-08-31T21:30:30.830336Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.\n🛵\n ударні БпЛА на Полтавщині \n➡️\n курсом на захід.\n🛵\n ворожі БпЛА на півночі Чернігівщини \n➡️\n курсом північний захід.",
      "timestamp": "2025-08-31T21:30:30.830346Z"
    },
    {
      "original": "Russian forces have captured the village of Komyshuvakha, Pokrovske direction, Donetsk Oblast.\nPre-war population: ~188.\nTotal land area: ~0.54km².",
      "timestamp": "2025-08-31T21:30:31.539449Z"
    },
    {
      "original": "Russian forces continued to advance in the Borova direction, building on previous successes.\nAdvances occurred in two areas. In the east, Russian forces resumed their attacks in Luhansk Oblast, advancing north along the tactical heights towards the Kharkiv-Luhansk regional border. They moved along a treeline and a chain of forests, establishing control over previously lost positions there. From there, they advanced downhill and east to the outskirts of Hrekivka, recapturing the positions in the low-lying ground there. The Russians were also able to recapture the western edge of the forest towards the swamp on the Kharkiv-Luhansk-Donetsk tri-border point.\nIn the west, Russian forces managed to break through Ukrainian positions west of the Nitrius River, significantly expanding their small bridgehead on its western bank. They pushed north through the rest of Hlushchenkove, completing the capture of the village, and began propelling northwards towards Andriivka, threatening to cut off Azov in the salient to the east. Russian forces also advanced west to the tactical heights, seizing new treeline positions and pushing towards the village of Maliivka.\nMeanwhile, Ukrainian forces continued their assault operations in Novomykhailivka and Ridkodub, without making any confirmed progress. \n+ ~14.27km² in favour of Russia.",
      "timestamp": "2025-08-31T21:30:31.539463Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have further developed their breakthrough to the Nitrius River.\nFollowing the series of failed attacks on Shandryholove, and a withdrawal from its northern outskirts, Russian forces have been carrying out new attacks aimed at bypassing the village and reaching the Nitrius River. As a result of recent actions, this goal has been achieved, and the remaining road east of the river resupplying Shandryholove has been physically cut. \nRussian forces advanced from their newly captured positions on the tactical heights northeast of Derylove, as well as from the eastern outskirts of Shandryholove, to the forest plantations southeast of the village. They continued to bypass it, moving further west to the next set of forest plantations, before reaching and cutting the road, and entrenching on the eastern bank of the Nitrius River. \nAs a result, Shandryholove has now been taken into an operational encirclement, as there are no bridges connecting the Ukrainian salient to the western bank of the river. We will likely see attempts be carried out by Ukrainian forces to unblock the road in the near future. \n+ ~4.56 km² in favour of Russia.",
      "timestamp": "2025-08-31T21:30:31.539470Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance west of the Zherebets River and have made important progress over the past week.\nRussian forces advanced in three areas. In the north, they continued their assault operations to recapture the village of Myrne, advancing south and downhill to the next set of forest plantations. Other forces moved further west, capturing a small farm and gaining a foothold on the southern end of a forested area. Fighting is currently ongoing for the forests west of Myrne, where Ukrainian forces are surrounded on three sides.\nTo the southeast, Russian forces continued their assault on Zarichne, and managed to recapture the Torske Fish Farm after Ukrainian forces withdraw over the Zherebets River. Russian forces then crossed the river at this section, gaining a foothold in the northern part of Zarichne and linking up with their bridgehead in the centre of the village. Fighting is now ongoing for Ozerna Street, which is partially in the grey zone.\nIn the south, after repeated DRG activities, Russian forces were able to cross the Zherebets River at a third point and entered the southern part of Zarichne. They established a foothold at the eastern end of Spartaka and Bulvarna Streets. At the same time, other forces from the central bridgehead advanced south down Poshtova Street, approaching a tributary of the Zherebets River where other Russian formations are entrenched. \n+ ~9.06km² in favour of Russia.",
      "timestamp": "2025-08-31T21:30:31.539477Z"
    },
    {
      "original": "In the Dobropillya direction, over the past week Ukrainian forces have continued to decrease the size of the Russian salient, and are now attempting to cut it off at the base.\nOn the eastern flank of the salient, following the arrival of additional reinforcements, Ukrainian forces crossed the Kazenyi Torets River into Volodomyrivka, took up positions in the kill-zone they had previously set up, and began clearing the rest of the village. They were able to reach the agricultural buildings, and recapture most of the settlement. From there, attacks were made from Shakhove to the west and northwest, where positions in three separate forest plantations were recaptured. Ukrainian forces also re-established control over the western approaches to Toretske, as well as the treelines further west, after the Russians withdrew to shorten their line of contact. \nOn the western flank of the salient, Azov resumed their assault operations after a brief pause which occurred in part due to intensified Russian FAB glide-bomb strikes. Supported by forces east of Novyi Donbas, they advanced from the treelines west of Vilne into Nove Shakhove, recapturing the village. From there they began to attack further west down the treelines, with the goal of cutting the Russian salient off at the base.\nTo the north, due to Azov's success in Nove Shakhove, Russian forces began withdrawing from their newly captured positions in and around Rubizhne. Ukrainian forces re-established control over Rubizhne, as well as at least part of the treelines on the tactical heights east of the village. Ukrainian forces also began attacking from Vilne towards Kucheriv Yar, recapturing positions in the forest plantations in the low-lying ground next to the Velyka Balka Gulley, as well as on an adjacent treeline. \n+ ~26.13km² in favour of Ukraine.",
      "timestamp": "2025-08-31T21:30:31.539483Z"
    },
    {
      "original": "Russian S-300 air defence is currently trying to shoot down Ukrainian Su-27s over Slovyansk. \n2 Su-27s departed from Ozerne Airbase in Zhytomyr and flew to their launch lines over Slovyansk to launch glide-bombs at Russian positions. Russian S-300 missiles were launched from the vicinity of Donetsk City.",
      "timestamp": "2025-08-31T21:30:31.539491Z"
    },
    {
      "original": "⚡️\n🇸🇾\n Last night, violent clashes occurred in Tel Maaz, East of Aleppo, between Syrian MoD forces and the SDF. After a brief exchange of shelling, the Syrian MoD repelled an attack on the village, followed by drone strikes around the Tishrin Dam by Turkish drones against the SDF. \n@wfwitness",
      "timestamp": "2025-08-31T21:30:31.539498Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations and have re-entered western Pokrovsk. \nRussian forces advanced in two areas. In the northwest, after regrouping in Leontovychi and repelling Ukrainian attacks, they advanced into western Pokrovsk and began clearing the private sector on the edge of the city. From there, they pushed northeast up four parallel residential streets towards the E-50 highway, which they are now operating in the vicinity of. The Russians were also able to re-establish control over the surroundings of the terykon next to Leontovychi, and after roughly five days of fighting, secured the western half of the village of Troyanda. The eastern half is in the grey-zone, with both sides regularly operating there.\nTo the southeast, after pausing their attacks on Chunyshyne, Russian forces were finally able to establish control over the guitar-shaped trench fortification northeast of Zelene, while other forces captured the rest of the forests north of Dachenske. They were also able to capture most of a treeline northwest of Lysivka.\n+ ~7.62km² in favour of Russia.",
      "timestamp": "2025-08-31T21:30:31.539504Z"
    },
    {
      "original": "In the Pokrovske-Prosyana direction, Russian forces have continued to make substantial progress over the past week, capturing three more villages.\nIn the south, after securing the Zaporizhzhia-Donetsk-Dnipropetrovsk tri-border point, Russian forces began attacking the village of Zaporizke in Dnipropetrovsk Oblast from two directions. The village quickly came under Russian control due to additional progress being made towards Ternove from the southeast. \nTo the northeast, after capturing Novoheorhiivka, Russian forces began their operation to capture Komyshuvakha. Ukraine had a much larger presence here, so Russia opted to encircle the settlement instead. They advanced north up the treelines on the tactical heights west of the village, and west from Shevchenko to the rear of Komyshuvakha, forcing the Ukrainians to withdraw to the northwest to avoid being cut off. \nAt the same time, Russian forces spearheaded west along the Vorona River, capturing the village of Vorone. Ukrainian forces counterattacked and managed to retake some positions there, but after back-and-forth fighting, Russia pushed them out once again and consolidated there. This was helped in part by the capture of the treelines on the heights southwest of Sichneve, improving their supply. Russian supply was already relatively unhindered as Ukrainian drone operators were caught off-guard in frontline settlements and had to take the time to redeploy and set up further in the rear, resulting in a significant decrease in Ukrainian FPV drone usage. \nTo the north, Russian forces were able to approach Sichneve from the east, before breaking through Ukrainian lines north of the village to the Vovcha River. They moved west down a gulley, capturing positions in the forest plantations, and entered the northern part of Novoselivka, although it's unclear if any positions have been established. They were also able to capture treeline positions on the heights north of the gulley used to enter Novoselivka.\nIn the north, Russian forces recaptured previously lost positions in the treelines east of Oleksandrohrad, forcing the Ukrainians to pull back into the village.\n+ ~42.76km² in favour of Russia.",
      "timestamp": "2025-08-31T21:30:31.539512Z"
    },
    {
      "original": "The Israeli airstrikes on the Houthi-controlled Yemeni capital of Sana'a have confirmed to have killed the following:  Houthi Prime Minister Ahmed al-Rahawi The Minister of Information  The Minister of Justice  The Minister of Electricity  The Minister of…",
      "timestamp": "2025-08-31T21:30:31.539515Z"
    },
    {
      "original": "Additional deaths from the Israeli airstrikes on top Houthi leaders have been confirmed: \nThe Deputy Prime Minister\nThe Minister of Education\nThe Minister of Social Affairs\nThe Minister of Justice\nThe Minister of Transport and Public Works\nThe Minister of Economy\nThe Minister of Culture\nThe Deputy Minister of Interior\nThe Director of Intelligence\nThe Deputy Head of the Intelligence Apparatus\nThe Chief of Staff to the Prime Minister.\nOnly four ministers remain alive, with the Houthi government now lying in ruins from just this one wave of strikes.",
      "timestamp": "2025-08-31T21:30:31.539525Z"
    },
    {
      "original": "Multiple sources are reporting that the spokesperson for the Al-Qassam Brigades (armed wing of Hamas) was killed in an Israeli airstrike on the Gaza Strip yesterday. \nThis is unconfirmed and should be treated as such considering Israel's track record of not actually killing officials who everyone believed were dead.",
      "timestamp": "2025-08-31T21:30:31.539529Z"
    },
    {
      "original": "Launch of 3 Ukrainian Flamingo cruise missiles, likely from Tuzly or somewhere in southern Odessa Oblast. \nIt remains unclear if these launches were for combat use, as the missile has not yet been reported in any confirmed strike, though the activity appears recent",
      "timestamp": "2025-08-31T21:30:31.539533Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on the city of Slovyansk, Donetsk Oblast. They used a total of 9 drones. All drones impacted, however two failed to detonate. \nThe main target was a small temporary deployment point used by the 8th Special Operations Regiment of the AFU. As a result, a fire broke out in the buildings, resulting in a large portion of the soldiers getting trapped burning alive before they could be rescued. The 8th Special Operations Regiment is regarded as one of Ukraine's most combat ready regiments.\nCoordinates: 48.859640, 37.580340",
      "timestamp": "2025-08-31T21:30:31.539540Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on the city of Slovyansk, Donetsk Oblast. They used a total of 9 drones. All drones impacted, however two failed to detonate. \nThe main target was a small temporary deployment point used by the 8th Special Operations Regiment of the AFU. As a result, a fire broke out in the buildings, resulting in a large portion of the soldiers getting trapped burning alive before they could be rescued. The 8th Special Operations Regiment is regarded as one of Ukraine's most combat ready regiments.\nCoordinates: 48.859640, 37.580340",
      "timestamp": "2025-08-31T21:30:31.539545Z"
    },
    {
      "original": "Russian Geran-2 drone strike on a Ukrainian position in the village of Torske, southwest of Druzhkivka. \nWhen you don't hear about large drone strikes on major Ukrainian cities for a night or two in a row, this is where they fly - the frontline. Dozens of these strikes are often carried out daily, and there is no air defence in most of Ukrainian-controlled Donetsk Oblast to counter them. \nCoordinates: 48.550556, 37.423611",
      "timestamp": "2025-08-31T21:30:31.539550Z"
    },
    {
      "original": "The UKMTO reports that an unknown projectile hit the water in close proximity to a vessel in the Red Sea, around 40 Nautical Miles southwest of Yanbu, Saudi Arabia. The crew is safe, and the ship is continuing its voyage, while authorities are currently investigating the incident.",
      "timestamp": "2025-08-31T21:30:31.539553Z"
    },
    {
      "original": "Regarding the situation in the Orikhiv direction, western Zaporizhzhia Oblast.\nBoth Russian and Ukrainian sources are reporting that Russian forces carried out ground attacks on Mala Tokmachka and Novodanylivka..\nRussian sources reported that Russian forces resumed assault operations in Mala Tokmachka, although it's unclear where from. The last known western-most Russian positions in the village were at the local school in the village centre, although it's unclear if those positions were retained. Ukrainian sources report that the Russian attacks were repelled by Ukrainian FPV drone operators but did not provide additional details.\nRussian sources also reported that attacks took place on Novodanylivka. Currently, there is a massive grey zone stretching from the areas north of Robotyne to the southern outskirts of Novodanylivka, however, Russian forces (likely from the 3rd assault company of the 291st regiment) managed to enter the southern houses of the village. It is currently unclear if they were able to establish any positions there, however. \nThese reports are corroborated by Sentinel imagery, which shows a massive increase in fires burning both on the frontline, and in Ukrainian controlled territory north of Mala Tokmachka on August 29. Almost all of these fires burnt out by August 30. Some small damage to buildings in Mala Tokmachka, likely from FPV drones, was recorded in the central part of the village, but nothing to suggest increased usage in that area.\nAdditionally, according to my information, large artillery duels and FAB bombardment has occurred south of Zaporizhzhia City since August 28. Heavy artillery shelling targeted Ukrainian positions in the area for around an hour straight in the early hours of the morning on August 31. At least 16 glide-bombs were dropped on Ukrainian positions at around 11:30pm for a period of roughly 20 minutes on August 30. Significant FAB bombardment also targeted the town of Malokaterynivka, around 14km south of Zaporizhzhia City on the night of August 28-29, resulting in large fires burning uncontrolled in the dachas and residential areas for over 24 hours. Russian artillery shelling did continue through to August 31, albeit at a decreased rate, and some of it was concentrated on areas west of Orikhiv.",
      "timestamp": "2025-08-31T21:30:31.539560Z"
    },
    {
      "original": "Recent Russian strategic bomber movements suggests that another large-scale combined missile attack on Ukraine is imminent. \nFollowing the strikes on August 31, most of the bombers returned to airbases close to Ukraine and remained there, rather than flying to the far east for equipment with Kh-101 cruise missiles as usual. 2 Tu-95s landed at Olenya Airbase, Murmansk Oblast, 1 Tu-95 landed at Engels-2 Airbase, Saratov Oblast, and 1 Tu-95 landed at Diaghilev Airbase, Ryazan Oblast. \nCurrently, the following aircraft are located near Ukraine:\nOlenya Airbase: 2 Tu-95MS\nEngels-2 Airbase: 3 Tu-95MS, 1 Tu-160\nDiaghilev Airbase: 3 Tu-95MS.\n2 of the Tu-95s at Engels-2 have been equipped with missiles. The status of the third is unknown. Notably, the number of flights to Diaghilev has increased, with one of the aircraft which took part in the most recent combat flight landing there afterwards. \nAs for the Tu-160 that launched missiles during the most recent attack, it flew to Ukrainka Airbase, Amur Oblast, in the far east where it is probably also being equipped with Kh-101 cruise missiles. \nIt is also important to remember that for around 2 weeks, Russian decreased their usage of Iskander-M ballistic missiles, Iskander-K cruise missiles, and significantly decreased their usage of Geran-2 drones. This indicates that stockpiles were built up of these weapons, and while they will have burnt through a decent amount of them since then, there will still be a lot left over.",
      "timestamp": "2025-08-31T21:30:31.539570Z"
    }
  ],
  "script_run_time": "2025-08-31T21:30:32.126011Z"
}