{
  "messages": [
    {
      "original": "🛵\n БпЛА на Полтавщині на півдні від н.п.Лубни курсом на захід та в напрямку н.п.Велика Багачка зі сходу.\n \n🛵\n БпЛА на Чернігівщині між н.п. Борзна і Ніжин північно-західним курсом;  \n🛵\n БпЛА на південному заході Донеччини, курс - південний/північно-східний;\n🛵\n БпЛА на південному сході Дніпропетровщини, курс - північно-західний;\n🛵\n БпЛА на Сумщині в напрямку на/повз н.п.Терни із заходу.",
      "timestamp": "2025-09-17T21:24:01.314104Z"
    },
    {
      "original": "🛵\n БпЛА на з Полтавщини курсом на північ Черкащини.",
      "timestamp": "2025-09-17T21:24:01.314117Z"
    },
    {
      "original": "🛵\n БпЛА на з Полтавщини курсом на північ Черкащини.",
      "timestamp": "2025-09-17T21:24:01.314125Z"
    },
    {
      "original": "🛵\n БпЛА з Черкащини продовжує рух на Київщину (курс - н.п. Яготин).",
      "timestamp": "2025-09-17T21:24:01.314130Z"
    },
    {
      "original": "🛵\n Нові групи ворожих ударних БпЛА на сході Дніпропетровщини рухаються в північно-західному напрямку.",
      "timestamp": "2025-09-17T21:24:01.314135Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-09-17T21:24:01.314141Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Запорізьку область!",
      "timestamp": "2025-09-17T21:24:01.314147Z"
    },
    {
      "original": "🚀\n КАБ в напрямку м.Запоріжжя!",
      "timestamp": "2025-09-17T21:24:01.314151Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на межі Миколаївщини та Херсонщини. Залучено засоби для збиття.",
      "timestamp": "2025-09-17T21:24:01.314155Z"
    },
    {
      "original": "🛵\n Нові групи ворожих ударних БпЛА на сході Дніпропетровщини рухаються в північно-західному напрямку.",
      "timestamp": "2025-09-17T21:24:01.314159Z"
    },
    {
      "original": "🛵\n БпЛА  з Дніпропетровщини курсом на Донеччину.",
      "timestamp": "2025-09-17T21:24:01.314164Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному та північно-східному напрямках!\n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-17T21:24:01.314172Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Донеччину!",
      "timestamp": "2025-09-17T21:24:01.314177Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Сумщину!",
      "timestamp": "2025-09-17T21:24:01.314183Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ \n➡️\n на Запорізьку область!",
      "timestamp": "2025-09-17T21:24:01.314188Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на північний схід Харківщини!",
      "timestamp": "2025-09-17T21:24:01.314194Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ \n➡️\n на Донеччину!",
      "timestamp": "2025-09-17T21:24:01.314199Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА  на межі Донеччини і Дніпропетровщини, курс - північний/північно-західний.",
      "timestamp": "2025-09-17T21:24:01.314207Z"
    },
    {
      "original": "🚀\n Пуски КАБ ворожою авіацією на межі Донеччини, Дніпропетровщини та Запорізької області.",
      "timestamp": "2025-09-17T21:24:01.314213Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку н.п.Білопілля.",
      "timestamp": "2025-09-17T21:24:01.314217Z"
    },
    {
      "original": "🛵\n Ворожі ударні БпЛА  на межі Донеччини і Дніпропетровщини, курс - північний/північно-західний.",
      "timestamp": "2025-09-17T21:24:01.314221Z"
    },
    {
      "original": "🛵\n БпЛА  на Дніпропетровщині в напрямку на/повз н.п.Петропавлівка.\n🛵\n БпЛА  курсом на н.п.Лозова з півдня (Харківщина)",
      "timestamp": "2025-09-17T21:24:01.314227Z"
    },
    {
      "original": "🛵\n БпЛА  на межі Дніпропетровщини і Харківщини курсом на Полтавщину;\n \n🛵\n БпЛА на межі Донеччини і Харківщини, курс - південний (вектор на/повз Барвінкове);\n🛵\n БпЛА на південному сході Дніпропетровщини курс на північ та на захід;\n🛵\n БпЛА на Сумщині, курс на Лебедин з півночі.",
      "timestamp": "2025-09-17T21:24:01.314238Z"
    },
    {
      "original": "2 minutes away",
      "timestamp": "2025-09-17T21:24:01.784096Z"
    },
    {
      "original": "Approaching the village of Inhulets.",
      "timestamp": "2025-09-17T21:24:01.784103Z"
    },
    {
      "original": "Another Su-34 is flying from Crimea towards Kherson Oblast. It may fly to Zaporizhzhia Oblast, following two earlier aircraft.",
      "timestamp": "2025-09-17T21:24:01.784107Z"
    },
    {
      "original": "Approaching the village of Inhulets.",
      "timestamp": "2025-09-17T21:24:01.784110Z"
    },
    {
      "original": "Explosions were heard. 4 KABs impacted the area.",
      "timestamp": "2025-09-17T21:24:01.784113Z"
    },
    {
      "original": "Another Su-34 is flying from Crimea towards Kherson Oblast. It may fly to Zaporizhzhia Oblast, following two earlier aircraft.",
      "timestamp": "2025-09-17T21:24:01.784117Z"
    },
    {
      "original": "The 3rd plane is circling in the Crimea-Kherson border area. It will escort the two Su-34s back to their home base, which are already on the return flight, flying southeast over Kherson Oblast.",
      "timestamp": "2025-09-17T21:24:01.784120Z"
    },
    {
      "original": "Watch out guys, Astraia Intel knows more about how the war is going than the literal president of Ukraine. I think if Zelensky (someone who has constantly lied about this war) is sounding the alarm bells, it's a solid sign that things haven't been going in Ukraine's favour.",
      "timestamp": "2025-09-17T21:24:01.784123Z"
    },
    {
      "original": "Watch out guys, Astraia Intel knows more about how the war is going than the literal president of Ukraine. I think if Zelensky (someone who has constantly lied about this war) is sounding the alarm bells, it's a solid sign that things haven't been going in…",
      "timestamp": "2025-09-17T21:24:01.784127Z"
    },
    {
      "original": "\"They will accept military rule because I say so\"",
      "timestamp": "2025-09-17T21:24:01.784130Z"
    },
    {
      "original": "Yesterday, the battle for the Serebryanskyi Forest in Luhansk Oblast finally ended after the remaining Ukrainian forces were pushed out of its southwestern-most part.\nThis battle began in late 2022 during the Ukrainian Kharkiv counteroffensive and lasted for nearly three years. Ukrainian forces, including Azov, held their positions in a massive complex of trenches and bunkers within the now largely destroyed forest. \nHowever, the vast majority of Russian advances during this nearly 3-year-long battle occurred in the final month. I have overlayed what the frontline roughly looked like on August 6, around the beginning of the Russian offensive here. \nAs a result, Ukrainian control in Luhansk Oblast has now shrunk to roughly 47 km².",
      "timestamp": "2025-09-17T21:24:01.784136Z"
    },
    {
      "original": "Russian Su-34s carried out launch maneuvers of KAB glide-bombs towards Tokarivka, Kherson Oblast.",
      "timestamp": "2025-09-17T21:24:01.784140Z"
    },
    {
      "original": "Russian Su-34s carried out launch maneuvers of KAB glide-bombs towards Tokarivka, Kherson Oblast.",
      "timestamp": "2025-09-17T21:24:01.784143Z"
    },
    {
      "original": "~90 seconds until impacts",
      "timestamp": "2025-09-17T21:24:01.784146Z"
    },
    {
      "original": "~90 seconds until impacts",
      "timestamp": "2025-09-17T21:24:01.784149Z"
    },
    {
      "original": "Approaching",
      "timestamp": "2025-09-17T21:24:01.784151Z"
    },
    {
      "original": "Approaching",
      "timestamp": "2025-09-17T21:24:01.784155Z"
    },
    {
      "original": "Explosions in Tokarivka",
      "timestamp": "2025-09-17T21:24:01.784160Z"
    },
    {
      "original": "The KABs impacted the village of Inhulets. The same area that was hit yesterday. The Su-34s are now returning back to Crimea.",
      "timestamp": "2025-09-17T21:24:01.784169Z"
    },
    {
      "original": "Russian forces have captured the village of Olhivske, Hulyaipole Direction, Zaporizhzhia Oblast.\nPre-war population: ~55.\nTotal land area: ~0.34 km².",
      "timestamp": "2025-09-17T21:24:01.784174Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:\nWith the IDF officially announcing the beginning of its offensive to capture Gaza City, intensified operations have been recorded in two main parts of the city over the past 48 hours.\nIn the southwest, Israeli forces resumed clearing operations in the already flattened parts of southern Gaza City. They quickly reached Dahdouh Road from the southeast and are now within 1.15 km of the coast. Israeli forces have now taken up positions in a residential quarter (31.50155, 34.42969) in the first part of the partially destroyed coastal Sheikh Ijlin Neighbourhood. \nTo the northeast, the IDF continued pushing from Jabalia at their usual pace and entered into the Gaza Governorate in the area of the Al Sheik Radwan Pool. They began clearing operations towards Gaza City centre from this area, capturing several dense residential blocks (31.52189, 34.4701 & 31.5241, 34.47019), before armoured units began their main vector of attack northwest down Kamal Naser Street. Here they advanced for close to 500 metres, reaching Al-Jala Street, where they expanded for about 240 metres through the dense residential blocks to the southwest (31.52593, 34.46655). \n+ ~1.80 km² in favour of the IDF.",
      "timestamp": "2025-09-17T21:24:01.784180Z"
    },
    {
      "original": "Update from the Gaza Strip - Northern Governorate:\nFollowing the announcement by the IDF that they would be beginning their offensive on Gaza City, a series of supporting attacks were launched on the Northern Governorate to support formations advancing in Gaza Governorate. \nIsraeli armoured units began advancing along the coastal Al-Rashid Road, as well as along roads previously created by the IDF during their previous operations here, reaching the first districts of Jabalia City. They were able to quickly clear and capture the outlying streets (31.5529, 34.4642), reaching the edge of the Madinat Al 'Awada Neighbourhood from the north (31.54792, 34.46454). At the same time, other forces captured other key points along the way, including the destroyed Gaza Oil Company complex (31.55287, 34.46791), and the former IDF base at the Gaza Desalination Plant (31.56156, 34.46763). \nTo the southeast, Israeli forces massively intensified their operations in the Nazla Neighbourhood of Jabalia City and cleared a large section of the dense residential zones north of Al-Quds Street, reaching the edge of the Sheik Radwan Neighbourhood of Gaza City (31.53159, 34.47553). \nThe goal here appears to be to isolate remaining Palestinian militant cells in Jabalia Refugee Camp, Jabalia City, Beit Lahiya, and Atatra, so the IDF can focus on establishing a stronger presence in the northern suburbs of Gaza City. \n+ ~2.28 km² in favour of the IDF.",
      "timestamp": "2025-09-17T21:24:01.784187Z"
    },
    {
      "original": "Meanwhile, after what seems like forever...\nThere haven't been any charges yet, but it will be interesting to see how this plays out.",
      "timestamp": "2025-09-17T21:24:01.784193Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that groups of Ukrainian soldiers were encircled in the western part of Sichneve around four days ago, after Russian forces bypassed the village and continued advancing further west. \nRussian forces are now striking them with FPV drones, while ground forces are attempting to clear the pocket by attacking from the east of the village. A large grey zone has formed in the treelines west of the settlement, so it's possible that Ukraine will make attempts at rescuing these soldiers through this. \nHowever, as a result of the local collapse of Ukrainian lines in this area and the subsequent encirclement of Ukrainian troops, Ukrainian Commander-in-Chief Oleksandr Syrskyi dismissed Maksym Kituhin, the commander of the 20th Army Corps, from his current position. He will still serve in the AFU, but in another unspecified role.",
      "timestamp": "2025-09-17T21:24:01.784198Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-17T21:24:01.784201Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-17T21:24:01.784204Z"
    },
    {
      "original": "The missile launch failed, and it fell along the way.",
      "timestamp": "2025-09-17T21:24:01.784207Z"
    },
    {
      "original": "Footage showing a Russian Mi-28 helicopter flying over Bakhmut. The city is beginning to become overgrown now that fighting is moving away.",
      "timestamp": "2025-09-17T21:24:01.784210Z"
    },
    {
      "original": "Kiev Forces Are Losing Ground In Pokrovsk (Videos)\nAs of September 17, Kiev forces continue to lose ground to the Russian military in several directions in Donetsk, Dnepropetrovsk and Zaporozhye.\nA new push by the Russian military was reported to the east of Shakhovo, which is located in the Pokrovsk direction.\nThe main battle in this direction remains, however, in Pokrovsk itself, with Russian troops pushing deeper into urban areas in the city.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335864Z"
    },
    {
      "original": "Kiev Forces Are Losing Ground In Pokrovsk (Videos)\nAs of September 17, Kiev forces continue to lose ground to the Russian military in several directions in Donetsk, Dnepropetrovsk and Zaporozhye.\nA new push by the Russian military was reported to the east of Shakhovo, which is located in the Pokrovsk direction.\nThe main battle in this direction remains, however, in Pokrovsk itself, with Russian troops pushing deeper into urban areas in the city.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335877Z"
    },
    {
      "original": "Gaza Death Toll Exceeds 65,000 On Second Day Of Major Israeli Offensive (18+ Videos)\nMore strikes hit Gaza City and other parts of the Palestinian Strip on September 17, as Israeli troops advanced in a major offensive meant to defeat Hamas.\nThe Israeli Air Force and Artillery Corps have struck over 150 targets in Gaza City since the start of the offensive a day earlier, the Israeli Defense Forces said in a statement, noting in another that the targets included tunnels, buildings used by “terror groups,” cells of operatives, and other infrastructure.\nAl-Jazeera said that recent Israeli strikes on the Strip claimed the lives of 62 Palestinians, with at least 40 getting killed in Gaza City.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335886Z"
    },
    {
      "original": "Gaza Death Toll Exceeds 65,000 On Second Day Of Major Israeli Offensive (18+ Videos)\nMore strikes hit Gaza City and other parts of the Palestinian Strip on September 17, as Israeli troops advanced in a major offensive meant to defeat Hamas.\nThe Israeli Air Force and Artillery Corps have struck over 150 targets in Gaza City since the start of the offensive a day earlier, the Israeli Defense Forces said in a statement, noting in another that the targets included tunnels, buildings used by “terror groups,” cells of operatives, and other infrastructure.\nAl-Jazeera said that recent Israeli strikes on the Strip claimed the lives of 62 Palestinians, with at least 40 getting killed in Gaza City.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335895Z"
    },
    {
      "original": "Russian Forces Continue Strikes Against Ukrainian Armed Forces’ Transport and Energy Hubs \nThe overall ratio of attacking Russian and Ukrainian fixed-wing UAVs last night favored Russia: 13 Ukrainian UAVs (+6 during the day) were shot down over Russia, while 136 out of 172 launched UAVs were shot down over Ukraine.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335902Z"
    },
    {
      "original": "Russian Forces Continue Strikes Against Ukrainian Armed Forces’ Transport and Energy Hubs \nThe overall ratio of attacking Russian and Ukrainian fixed-wing UAVs last night favored Russia: 13 Ukrainian UAVs (+6 during the day) were shot down over Russia, while 136 out of 172 launched UAVs were shot down over Ukraine.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335908Z"
    },
    {
      "original": "Military Situation In Ukraine On September 17, 2025 (Maps Update)",
      "timestamp": "2025-09-17T21:24:02.335912Z"
    },
    {
      "original": "Military Situation In Ukraine On September 17, 2025 (Maps Update)",
      "timestamp": "2025-09-17T21:24:02.335916Z"
    },
    {
      "original": "Iran Executed Alleged Israeli Spy Who Wanted To Fight For Ukraine \nIran has executed a man accused of spying for Israel, state media reported on September 17, identifying him as Babak Shahbazi.\nThe judiciary’s Mizan news agency said that Shahbazi gathered and sold sensitive information about Iranian data centers and security installations to Israeli handlers. It described him as working on “industrial cooling devices” as a contractor for companies that worked on telecommunications, military and security sites.\nIn a plot twist, Iranian opposition activists, including the Oslo-based group Iran Human Rights, alleged that Shahbazi was detained over writing a letter to Ukrainian President Volodymyr Zelenskyy offering to fight against Russia.\nRead more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335924Z"
    },
    {
      "original": "Israel Signals Readiness for New Military Campaigns Against Iran and Yemen  \nIsrael’s Defense Ministry has announced preparations for a new phase of conflict with Iran and Yemen, citing the high costs of intercepting ballistic missiles and the need for accelerated military readiness. To that end, it is forming a Supreme Armaments Council to streamline weapons procurement and strategic planning.\nMaj. Gen. Amir Baram, Director General of the Defense Ministry, stated:\n“Our recent military operation in Iran ended in a decisive Israeli victory, but further phases are imminent. Iran, feeling deeply humiliated, is rapidly investing in its defense capabilities—unlike Israel, where such decisions take longer to implement.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-17T21:24:02.335934Z"
    },
    {
      "original": "ISRAEL SETS GAZA CITY ABLAZE",
      "timestamp": "2025-09-17T21:24:02.335937Z"
    }
  ],
  "script_run_time": "2025-09-17T21:24:02.336355Z"
}