{
  "messages": [
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-13T18:57:38.924236Z"
    },
    {
      "original": "🛵\n Група БпЛА на Чернігівщині в районі Ніжина.\n🛵\n БпЛА з Сумщини на Полтавщину.\n🛸\n Розвідувальний БпЛА на півночі Харківщини курсом на Харків.",
      "timestamp": "2025-10-13T18:57:38.924257Z"
    },
    {
      "original": "🛵\n Полтава - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T18:57:38.924263Z"
    },
    {
      "original": "🛵\n Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T18:57:38.924268Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-13T18:57:38.924272Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-13T18:57:38.924277Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харківщину з півночі!",
      "timestamp": "2025-10-13T18:57:38.924281Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Київщину (Броварський район).",
      "timestamp": "2025-10-13T18:57:38.924286Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччину (Покровський район).",
      "timestamp": "2025-10-13T18:57:38.924290Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Харківщини у південно-західному напрямку.",
      "timestamp": "2025-10-13T18:57:38.924295Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині курсом на Ромни.",
      "timestamp": "2025-10-13T18:57:38.924299Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА зі сходу у напрямку міста!",
      "timestamp": "2025-10-13T18:57:38.924303Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-10-13T18:57:38.924308Z"
    },
    {
      "original": "🛵\n Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T18:57:38.924315Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину зі сходу.",
      "timestamp": "2025-10-13T18:57:38.924319Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T18:57:38.924323Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини на Київщину (Броварський район).",
      "timestamp": "2025-10-13T18:57:38.924328Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-13T18:57:38.924334Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-13T18:57:38.924338Z"
    },
    {
      "original": "🚀\nКАБ курсом на Харків!",
      "timestamp": "2025-10-13T18:57:38.924342Z"
    },
    {
      "original": "In the Stepnohirsk direction, Ukrainian forces have launched a series of counterattacks aimed at reversing the Russian progress over the past few months.\nIn the west, Ukrainian forces pushed through the grey zone in Prymorske, recapturing positions in the southern dachas towards the dried-up inlet. Other forces cleared isolated pockets of Russian soldiers in the dachas around Pokrovska Street, moving southeast through the streets near the railway line, and capturing the Prymorske railway station.\nTo the east, Ukrainian forces cleared the remaining Russian positions on the western outskirts of Stepnohirsk, in the dachas, and in nearby the forested areas, reaching the northern bank of the small river. Other forces were able to cross the river over the E-150 Highway, and capture positions on the southern bank around the overpass. \nMeanwhile, Russian forces continued their attempts at infiltrating southern Stepnohirsk from the 3rd Microdistrict, however Ukrainian drone coverage is preventing them from consolidating. The grey zone remains. \n+ ~1.67 km² in favour of Ukraine.",
      "timestamp": "2025-10-13T18:57:39.685674Z"
    },
    {
      "original": "In the Stepnohirsk direction, Ukrainian forces have launched a series of counterattacks aimed at reversing the Russian progress over the past few months.  In the west, Ukrainian forces pushed through the grey zone in Prymorske, recapturing positions in the…",
      "timestamp": "2025-10-13T18:57:39.685687Z"
    },
    {
      "original": "Regarding Zelensky's claim of \"counteroffensive\" actions in western Zaporizhzhia Oblast.\nIn the post above, I talked about confirmed Ukrainian advances in Stepnohirsk and Prymorske, however the claims of Ukrainian advances extend to Stepove, Mali Shcherbaky, and Shcherbaky. \nUkrainian forces were able to enter Mali Shcherbaky and raise a flag in the western part of the village, however no consolidation has taken place, and Russian forces are attempting to clear them out of this grey zone. \nAs for Stepove and Shcherbaky, there is no evidence of Ukrainian advances being made. Neither of these two villages were under full Russian control, so advances would theoretically be easier.",
      "timestamp": "2025-10-13T18:57:39.685694Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance and have once again recaptured the village of Dorozhnje.\nFollowing the failed Ukrainian Bradely AFV attack on Russian positions east of Doroznje, Russian forces counterattacked from the forests west of Nykanorivka, crossing over the fields into the Doroznje Freight Train Station. The village was once again brought under full Russian control, with Russian forces consolidating in the treeline to the north, and railway windbreaks to the south. \nMeanwhile, the frontline was corrected in favour of Ukraine to the south, with Ukrainian forces retaining control over the treeline south of Dorozhnje. The grey zone extends as far as the southwestern outskirts of Nykanorivka. \nRussia is also accumulating new groups of soldiers in the Hektova Balka Gulley north of Nykanorivka in preparation for assault operations on the village of Ivanivka. \n+ ~1.57 km² in favour of Russia.",
      "timestamp": "2025-10-13T18:57:39.685701Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, both Russian and Ukrainian forces have advanced, each reversing the other's progress in different areas.\nIn the west, Russian forces consolidated in the northern part of Kucheriv Yar, and begun attacks outside the village. They were able to advance into the forested areas to the north, and the treelines to the northwest, taking up new positions there. DRGs also began infiltrating north up the road and have reached the southern outskirts of Zolotyi Kolodyaz. Other forces began advancing up the gulley in the direction of Hruzke, while the Ukrainians attempt to gain a foothold in the positions to the rear. \nTo the south, Russian forces advanced downhill from the tactical heights into the forested areas, improving their positions in the direction of Shakhove. Other forces continued their attacks towards the western outskirts of Shakhove, but continue to be repelled by the Ukrainian garrison. \nAdditionally, to the west, the frontline was corrected, with Vilne now being in the grey zone. Last week, some Russian soldiers were able to enter part of the village but were unable to consolidate. The village was not brought under control, unlike what I previously stated. However, Russian forces are attempting to advance from the treelines to the southwest in the direction of Vilne, but it is unclear if they have had any successes. \nOn the other hand, Ukrainian forces continued their counterattacks in the Druzhkivka direction and have eliminated the Russian spearhead to Sofiivka. They were able to clear the northern and northeastern outskirts of the village, and began advancing west down a treeline, while other forces pushed south down the treelines to the north. Once these positions were recaptured, the Ukrainians began attacking towards the groves to the southeast, infiltrating towards the Russian positions along the western bank of the reservoir. Russian FAB/KAB glide-bombs are targeting these areas, but the majority of them miss the positions (by up to 250 metres) and fall in the fields. \nTo the south, Russian forces are also continuing their attacks under artillery and FPV drone cover through the gulley towards the Ukrainian strongpoints, but their advance is being impeded by Ukrainian FPV drone strikes. They have been unable to make any progress here for some time now. \n+ ~5.15 km² in favour of Ukraine.\n+ ~5.12 km² in favour of Russia.",
      "timestamp": "2025-10-13T18:57:39.685709Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces resumed assault operations north of Chasiv Yar and have crossed the Siverskyi Donets Canal. \nRussian forces advanced from their positions in the treelines and forested areas northwest of Hryhorivka, crossing the canal and establishing control over a series of trench lines and dugouts along the windbreak on the western bank of the canal. They also began pushing north up a treeline towards the southeastern outskirts of Novomarkove. All of these positions are situated on the tactical heights. \n+ ~0.30 km² in favour of Russia.",
      "timestamp": "2025-10-13T18:57:39.685715Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to advance and have entered the village of Dronivka.\nIn the east, Russian forces established full control over the village of Rudnik, capturing its southwestern residential sector, as well as the adjacent chalk quarry. From there, other forces began attacking from the north, pushing south through the forests, and reaching the northern bank of the Bakhmutovka River. They were able to cross over the bridge and gain a foothold in the northern streets of Dronivka. \nMeanwhile, after capturing the mine, Russian forces advanced west down the gulley to the Bakhmutovka River, before crossing it and gaining a foothold in the windbreaks on either side of the railway tracks. They then accumulated additional soldiers, and pushed northwest into the southeastern part of Dronivka, capturing positions in the first residential street. The Russians are attempting to advance further, and fighting is now ongoing for areas closer towards the centre of the village.\nIn the west, after capturing the trench networks next to the railway bridge, Russian forces continued to advance south down the western bank of the Siverskyi Donets River, where they established control over additional positions in the forests there. \n+ ~8.43 km² in favour of Russia.",
      "timestamp": "2025-10-13T18:57:39.685721Z"
    },
    {
      "original": "In the Khotin direction, Russian forces resumed assault operations northwest of Oleksiivka, and have further improved their tactical position in the area.\nNewly arrived Russian reinforcements advanced from the treelines near the international border to the lightly forested gulleys west and northwest of Oleksiivka, establishing control over previously lost positions. This brought the road used by Ukrainian forces to supply their forces stationed in the agricultural complex on the western outskirts of Oleksiivka, and to attack into the residential part of the village, under Russian fire control.\n+ ~2.70 km² in favour of Russia.",
      "timestamp": "2025-10-13T18:57:39.685726Z"
    },
    {
      "original": "There is an increased threat of Russian missile attacks on the southern regions of Ukraine tonight, involving Iskander-M ballistic missiles and/or Iskander-K cruise missiles.\nNothing is definite right now - just a possibility.",
      "timestamp": "2025-10-13T18:57:39.685730Z"
    },
    {
      "original": "I finally revised both of the incorrect maps initially posted here: \nhttps://t.me/franfran2424_ES/8601\n \nAs a summary, the 2023-2025 ukrainian groups followed regions, while russian groups followed military districts. \nNow it's all more complicated: \n- Ukrainian groups names ressemble their \"military districts\" (operational commands), but will handle army corps with units from all over the contry, since units are shuffled around army corps according to operational needs.\n-Russian groups \"south\" and \"center\" have a mix of units of those two military districts (Southern, Central), and group \"dnieper\" is manned mostly by units of Southern MD.\nMore details about their structure in the next post.",
      "timestamp": "2025-10-13T18:57:39.685738Z"
    },
    {
      "original": "I finally revised both of the incorrect maps initially posted here: \nhttps://t.me/franfran2424_ES/8601\n \nAs a summary, the 2023-2025 ukrainian groups followed regions, while russian groups followed military districts. \nNow it's all more complicated: \n- Ukrainian groups names ressemble their \"military districts\" (operational commands), but will handle army corps with units from all over the contry, since units are shuffled around army corps according to operational needs.\n-Russian groups \"south\" and \"center\" have a mix of units of those two military districts (Southern, Central), and group \"dnieper\" is manned mostly by units of Southern MD.\nMore details about their structure in the next post.",
      "timestamp": "2025-10-13T18:57:39.685746Z"
    },
    {
      "original": "I finally revised both of the incorrect maps initially posted here: https://t.me/franfran2424_ES/8601   As a summary, the 2023-2025 ukrainian groups followed regions, while russian groups followed military districts.   Now it's all more complicated:  - Ukrainian…",
      "timestamp": "2025-10-13T18:57:39.685750Z"
    },
    {
      "original": "Really cool niche channel. I recommend joining it ^^",
      "timestamp": "2025-10-13T18:57:39.685753Z"
    },
    {
      "original": "2 million views on my interactive Ukraine map, thank you all so much!",
      "timestamp": "2025-10-13T18:57:39.685761Z"
    },
    {
      "original": "HIMARS launches to Belgorod. Russian S-300 air defence is engaging them.",
      "timestamp": "2025-10-13T18:57:39.685764Z"
    },
    {
      "original": "HIMARS launches to Belgorod. Russian S-300 air defence is engaging them.",
      "timestamp": "2025-10-13T18:57:39.685767Z"
    },
    {
      "original": "1 missile was intercepted on approach to Belgorod. Maybe a Neptune.",
      "timestamp": "2025-10-13T18:57:39.685770Z"
    },
    {
      "original": "There is an increased threat of Russian missile attacks on the southern regions of Ukraine tonight, involving Iskander-M ballistic missiles and/or Iskander-K cruise missiles.  Nothing is definite right now - just a possibility.",
      "timestamp": "2025-10-13T18:57:39.685773Z"
    },
    {
      "original": "There is an increased threat of missiles for all the regions shown on the map, not just the southern regions of Ukraine.\nLaunches of Geran-2/Gerbera drones have been recorded from 6 locations. The first drones are entering Ukrainian airspace via Kharkiv, Chernihiv, and Sumy Oblasts.",
      "timestamp": "2025-10-13T18:57:39.685777Z"
    },
    {
      "original": "There is an increased threat of missiles for all the regions shown on the map, not just the southern regions of Ukraine.  Launches of Geran-2/Gerbera drones have been recorded from 6 locations. The first drones are entering Ukrainian airspace via Kharkiv,…",
      "timestamp": "2025-10-13T18:57:39.685781Z"
    },
    {
      "original": "Note: no combat activity related to Tu-95MS or Tu-160 strategic bombers has been recorded. Preparations for the next attack involving them are not yet complete, so don't expect any Kh-101 cruise missiles tonight.",
      "timestamp": "2025-10-13T18:57:39.685784Z"
    },
    {
      "original": "Earlier, two Russian S-300 ballistic missiles working in ground-to-ground mode struck a target near Derhachi, north of Kharkiv City. The glow from a fire can be seen from Kharkiv City.",
      "timestamp": "2025-10-13T18:57:39.685787Z"
    },
    {
      "original": "There are unconfirmed reports of Russian soldiers entering eastern Myrnohrad in the area of Stritenska Street and Syedova Street.\nThe situation should be clarified in the next couple of days.",
      "timestamp": "2025-10-13T18:57:39.685791Z"
    },
    {
      "original": "2 explosions were heard in Kharkiv City from Russian KAB glide-bomb impacts. There are reports of power outages.",
      "timestamp": "2025-10-13T18:57:39.685794Z"
    },
    {
      "original": "Ukraine's Cyber Front: Can Digital Defense Halt a Conventional Advance?\nThis is a new, advanced branch of the Ukrainian army. Kyiv intends to launch an offensive against Russian infrastructure. What are Zelensky's realistic chances of implementing his plans?\nWar has long been waged on land, at sea and in the air. Now, invisible battles are being fought on the fields of the World Wide Web. The concept adhered to by the world's leading powers is simple: it is pointless to bomb a target factory for months on end, wasting energy, time and, most importantly, expensive ammunition. It is possible to paralyse the desired target with the help of hackers via the internet, completely depriving it of its ability to function.\nIn recent months, there have been large-scale disruptions at major European airports, such as Heathrow in the UK, Berlin-Brandenburg in Germany, and Zaventem in Belgium. These flight delays and cancellations have cost the European Union millions of dollars. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491492Z"
    },
    {
      "original": "Ukraine's Cyber Front: Can Digital Defense Halt a Conventional Advance?\nThis is a new, advanced branch of the Ukrainian army. Kyiv intends to launch an offensive against Russian infrastructure. What are Zelensky's realistic chances of implementing his plans?\nWar has long been waged on land, at sea and in the air. Now, invisible battles are being fought on the fields of the World Wide Web. The concept adhered to by the world's leading powers is simple: it is pointless to bomb a target factory for months on end, wasting energy, time and, most importantly, expensive ammunition. It is possible to paralyse the desired target with the help of hackers via the internet, completely depriving it of its ability to function.\nIn recent months, there have been large-scale disruptions at major European airports, such as Heathrow in the UK, Berlin-Brandenburg in Germany, and Zaventem in Belgium. These flight delays and cancellations have cost the European Union millions of dollars. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491510Z"
    },
    {
      "original": "Military Situation In Ukraine On October 13, 2025 (Maps Update)",
      "timestamp": "2025-10-13T18:57:40.491515Z"
    },
    {
      "original": "Military Situation In Ukraine On October 13, 2025 (Maps Update)",
      "timestamp": "2025-10-13T18:57:40.491519Z"
    },
    {
      "original": "Russian Army Makes More Gains From Kharkiv To Donetsk\nThe Russian military made more gains in several areas in the Kharkiv direction, as well in the direction of Donetsk, according to reports from October 13.\nTo the north of the city of Kharkiv, the Zapad [West] Group of Forces repelled another Ukrainian counter attack on its positions on the left bank of the Volchya River in Volchansk, in the forest west of Synelnykove. Fierce battles are reported to be still taking place there.\nA bit to the southeast, the group has reportedly advanced some half a kilometer from Melovoye in the direction of Khatneye.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491528Z"
    },
    {
      "original": "Russian Army Makes More Gains From Kharkiv To Donetsk\nThe Russian military made more gains in several areas in the Kharkiv direction, as well in the direction of Donetsk, according to reports from October 13.\nTo the north of the city of Kharkiv, the Zapad [West] Group of Forces repelled another Ukrainian counter attack on its positions on the left bank of the Volchya River in Volchansk, in the forest west of Synelnykove. Fierce battles are reported to be still taking place there.\nA bit to the southeast, the group has reportedly advanced some half a kilometer from Melovoye in the direction of Khatneye.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491536Z"
    },
    {
      "original": "Review of Ukrainian-Russian Strikes: Whose Intelligence Systems Are Behind the AFU's Attacks?\nOn October 12-13, 2025, Russia and Ukraine continued their exchange of strikes, concentrating their attacks on each other's key infrastructure facilities. Russian strikes were primarily directed at military-industrial sites on Ukrainian territory, while Kyiv focused its main efforts on fuel and energy centers in Crimea, employing an intense wave of unmanned aerial vehicles.\nAccording to some Russian experts, the strike on the oil depot in Feodosia was carried out with US support. Alexander Talipov, head of the public movement \"Krymsky SMERSH,\" stated that US reconnaissance aircraft hide in neutral waters, concealing themselves behind civilian airliners along international shipping routes to conduct surveillance.\nThis version finds confirmation in Financial Times reports, according to which the US has been providing intelligence support to Ukraine since the summer months of 2025...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491545Z"
    },
    {
      "original": "Review of Ukrainian-Russian Strikes: Whose Intelligence Systems Are Behind the AFU's Attacks?\nOn October 12-13, 2025, Russia and Ukraine continued their exchange of strikes, concentrating their attacks on each other's key infrastructure facilities. Russian strikes were primarily directed at military-industrial sites on Ukrainian territory, while Kyiv focused its main efforts on fuel and energy centers in Crimea, employing an intense wave of unmanned aerial vehicles.\nAccording to some Russian experts, the strike on the oil depot in Feodosia was carried out with US support. Alexander Talipov, head of the public movement \"Krymsky SMERSH,\" stated that US reconnaissance aircraft hide in neutral waters, concealing themselves behind civilian airliners along international shipping routes to conduct surveillance.\nThis version finds confirmation in Financial Times reports, according to which the US has been providing intelligence support to Ukraine since the summer months of 2025...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491553Z"
    },
    {
      "original": "Russian Troops Advancing All Around Pokrovsk\nAs of October 13, the Russian military has advanced in several areas near Pokrovsk in the Donetsk direction amid what appears to be a limited collapse of Ukrainian defenses\nIn the Dobropillia salient, to the northeast of the key city, the Tsentr [Center] Group of Forces re-entered Dorozhnye after successfully expelling Kiev forces from the pocket between Nykanorivka, Boikivka and Zatyshok, to the southeast of the settlement.\nFrom Dorozhnye, Russian troops will be able to attack Ivanivka and Nove Shakhove to the north. This would widen the salient, and further secure supply routes there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491562Z"
    },
    {
      "original": "Russian Troops Advancing All Around Pokrovsk\nAs of October 13, the Russian military has advanced in several areas near Pokrovsk in the Donetsk direction amid what appears to be a limited collapse of Ukrainian defenses\nIn the Dobropillia salient, to the northeast of the key city, the Tsentr [Center] Group of Forces re-entered Dorozhnye after successfully expelling Kiev forces from the pocket between Nykanorivka, Boikivka and Zatyshok, to the southeast of the settlement.\nFrom Dorozhnye, Russian troops will be able to attack Ivanivka and Nove Shakhove to the north. This would widen the salient, and further secure supply routes there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T18:57:40.491570Z"
    }
  ],
  "script_run_time": "2025-10-13T18:57:40.492432Z"
}