{
  "messages": [
    {
      "original": "🚀\nЙмовірно здійснено пуски крилатих ракет з літаків стратегічної авіації: Ту-95МС та Ту-160! Слідкуйте за нашими повідомленнями!",
      "timestamp": "2025-12-06T05:30:49.720832Z"
    },
    {
      "original": "🚀\nКрилаті ракети \n➡️\n через Сумщину!",
      "timestamp": "2025-12-06T05:30:49.720852Z"
    },
    {
      "original": "🚀\nКрилаті ракети \n➡️\n через Сумщину!",
      "timestamp": "2025-12-06T05:30:49.720859Z"
    },
    {
      "original": "🚀\n КР продовжуть рух \n➡️\n у напрямку Прилуцького району Чернігівщини.",
      "timestamp": "2025-12-06T05:30:49.720867Z"
    },
    {
      "original": "🛵\n Чернігів, Жовква, Жидачів (Львівщина), Яготин, Іванків (Київщина), Коростень, Звягель (Житомирщина) \n➡️\n особлива увага!",
      "timestamp": "2025-12-06T05:30:49.720874Z"
    },
    {
      "original": "🛵\n Біла Церква, Рівне, Тернопіль \n➡️\n БпЛА у передмісті!",
      "timestamp": "2025-12-06T05:30:49.720880Z"
    },
    {
      "original": "🚀\n КР продовжуть рух \n➡️\n у напрямку Прилуцького району Чернігівщини.",
      "timestamp": "2025-12-06T05:30:49.720886Z"
    },
    {
      "original": "🚀\n Група КР через Чернігівщину \n➡️\n у напрямку Пирятина (Полтавщина)!",
      "timestamp": "2025-12-06T05:30:49.720892Z"
    },
    {
      "original": "🚀\nНові групи ракет \n➡️\n через Сумщину! Курс \n➡️\n на Полтавщину!",
      "timestamp": "2025-12-06T05:30:49.720899Z"
    },
    {
      "original": "🚀\n Група КР через Чернігівщину \n➡️\n у напрямку Пирятина (Полтавщина)!",
      "timestamp": "2025-12-06T05:30:49.720906Z"
    },
    {
      "original": "🚀\n КР \n➡️\n курсом на Канів (Черкащина).",
      "timestamp": "2025-12-06T05:30:49.720913Z"
    },
    {
      "original": "🚀\nКалібри повз Запорізьку область \n➡️\n на Дніпро!",
      "timestamp": "2025-12-06T05:30:49.720919Z"
    },
    {
      "original": "🚀\n КР \n➡️\n курсом на Канів (Черкащина).",
      "timestamp": "2025-12-06T05:30:49.720924Z"
    },
    {
      "original": "🚀\n Перша група КР \n➡️\n на півдні Київщини в районі Миронівки/Богуслава.\nЗа нею \n➡️\n ще декілька груп тим же маршрутом.",
      "timestamp": "2025-12-06T05:30:49.720932Z"
    },
    {
      "original": "🚀\nКалібри повз Запорізьку область \n➡️\n на Дніпро!",
      "timestamp": "2025-12-06T05:30:49.720937Z"
    },
    {
      "original": "🚀\n Ще група Калібрів \n➡️\n на Миколаївщині в районі Баштанки!",
      "timestamp": "2025-12-06T05:30:49.720942Z"
    },
    {
      "original": "🚀\n Перша група КР \n➡️\n на півдні Київщини в районі Миронівки/Богуслава. За нею \n➡️\n ще декілька груп тим же маршрутом.",
      "timestamp": "2025-12-06T05:30:49.720949Z"
    },
    {
      "original": "🚀\nТримають курс на Вінниччину!",
      "timestamp": "2025-12-06T05:30:49.720953Z"
    },
    {
      "original": "🚀\n Ще група Калібрів \n➡️\n на Миколаївщині в районі Баштанки!",
      "timestamp": "2025-12-06T05:30:49.720958Z"
    },
    {
      "original": "🚀\n Ще група Калібрів \n➡️\n на Одещині! Повз Південне!",
      "timestamp": "2025-12-06T05:30:49.720965Z"
    },
    {
      "original": "🛵\n Біла Церква, Рівне, Тернопіль \n➡️\n БпЛА у передмісті!",
      "timestamp": "2025-12-06T05:30:49.720970Z"
    },
    {
      "original": "🛵\n Луцьк, Біла Церква, Вишгород, Чернігів, Десна, Радомишль!",
      "timestamp": "2025-12-06T05:30:49.720974Z"
    },
    {
      "original": "🚀\nТримають курс на Вінниччину!",
      "timestamp": "2025-12-06T05:30:49.720978Z"
    },
    {
      "original": "🚀\nКР через Вінниччину! Курс Хмільник!",
      "timestamp": "2025-12-06T05:30:49.720982Z"
    },
    {
      "original": "🛵\n Луцьк, Біла Церква, Вишгород, Чернігів, Десна, Радомишль!",
      "timestamp": "2025-12-06T05:30:49.720986Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на Старокостянтинів!",
      "timestamp": "2025-12-06T05:30:49.720991Z"
    },
    {
      "original": "🚀\nКР через Вінниччину! Курс Хмільник!",
      "timestamp": "2025-12-06T05:30:49.720995Z"
    },
    {
      "original": "🚀\n Група КР із Вінниччини курсом на Летичів (Хмельниччина)!",
      "timestamp": "2025-12-06T05:30:49.720999Z"
    },
    {
      "original": "🚀\n Група КР повернула у напрямку Білої Церкви!",
      "timestamp": "2025-12-06T05:30:49.721004Z"
    },
    {
      "original": "🛵\n Луцьк, Біла Церква, Вишгород, Чернігів, Десна, Радомишль!",
      "timestamp": "2025-12-06T05:30:49.721009Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на Львів!",
      "timestamp": "2025-12-06T05:30:49.721015Z"
    },
    {
      "original": "🚀\n Група КР із Вінниччини курсом на Летичів (Хмельниччина)!",
      "timestamp": "2025-12-06T05:30:49.721018Z"
    },
    {
      "original": "🚀\n Група КР \n➡️\n повз Хмельницький!",
      "timestamp": "2025-12-06T05:30:49.721025Z"
    },
    {
      "original": "🚀\n Група КР повернула у напрямку Білої Церкви!",
      "timestamp": "2025-12-06T05:30:49.721028Z"
    },
    {
      "original": "🚀\n Київщина: групи ракет повз Фастів в район Макарова!",
      "timestamp": "2025-12-06T05:30:49.721032Z"
    },
    {
      "original": "🚀\n Група КР \n➡️\n повз Хмельницький!",
      "timestamp": "2025-12-06T05:30:49.721037Z"
    },
    {
      "original": "🚀\n КР із Хмельниччини \n➡️\n на Тернопільщину!",
      "timestamp": "2025-12-06T05:30:49.721042Z"
    },
    {
      "original": "Kh-101s in Sumy Oblast",
      "timestamp": "2025-12-06T05:30:50.173476Z"
    },
    {
      "original": "Nope, its Grad MLRS",
      "timestamp": "2025-12-06T05:30:50.173487Z"
    },
    {
      "original": "Now the Kh-101s are entering Sumy Oblast",
      "timestamp": "2025-12-06T05:30:50.173490Z"
    },
    {
      "original": "5 groups of Kh-101 cruise missiles are detected.\nThe first 3 groups are flying west to Talalaivka, Chernihiv Oblast.\n2 more groups follow behind in Sumy Oblast.\nTrajectories will not be used on the map due to the large quantity of missiles expected.",
      "timestamp": "2025-12-06T05:30:50.173497Z"
    },
    {
      "original": "8 groups of missiles are detected.\n5 groups are flying southwest to Pyryatyn, Poltava Oblast.\n2 groups are flying north of Romny, Sumy Oblast on a southwestern course.\n1 group is flying east of Romny on a southwestern course.",
      "timestamp": "2025-12-06T05:30:50.173502Z"
    },
    {
      "original": "All groups of Kh-101s are generally flying towards Yahotyn, Kyiv Oblast.",
      "timestamp": "2025-12-06T05:30:50.173505Z"
    },
    {
      "original": "*Total group numbers are still being clarified",
      "timestamp": "2025-12-06T05:30:50.173508Z"
    },
    {
      "original": "3 groups of Kh-101s are flying southwest towards Drabiv, Cherkasy Oblast.\n5 groups are flying one after another towards Yahotyn, Kyiv Oblast.\nAll missiles fly at 850-900 km/h.",
      "timestamp": "2025-12-06T05:30:50.173512Z"
    },
    {
      "original": "1 group of Kh-101s is approaching Kaniv, Cherkasy Oblast from the east.\n2 groups are flying southwest to Drabiv, Cherkasy Oblast.\n1 group is flying past the northernmost part of Cherkasy Oblast to southern Kyiv Oblast.\n4 more groups are generally flying along the Poltava-Chernihiv Border to Kyiv/Cherkasy Oblast.",
      "timestamp": "2025-12-06T05:30:50.173517Z"
    },
    {
      "original": "Unidentified missile to Zaporizhzhia",
      "timestamp": "2025-12-06T05:30:50.173520Z"
    },
    {
      "original": "2 groups of Kalibrs are flying northwest past Vilnyansk, Zaporizhzhia Oblast, to Dnipro.\n3 groups of Kh-101s are approaching Kaniv, Cherkasy Oblast.\n2 groups of Kh-101s are flying west through southeastern Kyiv Oblast\n3 groups of Kh-101s are flying southwest to Pyryatyn, Poltava Oblast.\n1 new group of Kh-101s is bypassing Romny, Sumy Oblast from the north on a westerly course.",
      "timestamp": "2025-12-06T05:30:50.173526Z"
    },
    {
      "original": "~4 Kalibrs are approaching Dnipro",
      "timestamp": "2025-12-06T05:30:50.173529Z"
    },
    {
      "original": "New Kalibrs are entering Mykolaiv Oblast",
      "timestamp": "2025-12-06T05:30:50.173532Z"
    },
    {
      "original": "Explosions in Dnipro. Kalibrs",
      "timestamp": "2025-12-06T05:30:50.173535Z"
    },
    {
      "original": "1 pair of Kalibrs is flying southwest to Dobroslav, Odesa Oblast.\n----\n3 groups of Kh-101s are flying south of Bila Tserkva, Kyiv Oblast on a southwestern course.\n5 groups of Kh-101s are flying southwest through northwestern Poltava Oblast and northern Cherkasy Oblast.",
      "timestamp": "2025-12-06T05:30:50.173539Z"
    },
    {
      "original": "A pair of Kalibrs is flying towards Olshanske, Mykolaiv Oblast\n-----\n1 groups of Kh-101s is flying towards Haisyn, Vinnytsia Oblast on a southwestern course.\n2 groups are following behind the first, flying southwest through southwestern Kyiv Oblast.\n2 groups are approaching Myronivka, Kyiv Oblast from the east.\n3 groups are flying southwest to/through Kaniv, Cherkasy Oblast.",
      "timestamp": "2025-12-06T05:30:50.173545Z"
    },
    {
      "original": "1 pair of Kalibrs is flying towards Odesa Oblast from Mykolaiv Oblast. It is maneuvering. \n-----\n1 group of Kh-101s is flying west through northern Vinnytsia Oblast.\n4 groups are flying southwest through southern/southwestern Kyiv Oblast.\n3 groups are entering Kyiv Oblast from Kaniv.",
      "timestamp": "2025-12-06T05:30:50.173551Z"
    },
    {
      "original": "No updates from the Kalibr pair.\n-----\n1 group of Kh-101s is flying southwest through eastern Khmelnytskyi Oblast.\n1 group is returning northeast to Bila Tserkva, Kyiv Oblast.\n2 groups are flying west to the Kyiv-Vinnytsia border.\n1 group is following the previous two\n3 groups are flying southwest through central Cherkasy Oblast.\n1 group from earlier reappeared, flying west through southern Cherkasy Oblast.",
      "timestamp": "2025-12-06T05:30:50.173558Z"
    },
    {
      "original": "Both kalibrs disappeared\nAnother group of Kh-101s in Vinnytsia Oblast changed course to the east, flying to Bila Tserkva/Fastiv.\n2 groups in Cherkasy Oblast changed course to the north/northeast, also flying to Bila Tserkva District.\n1 group in eastern Khmelnytskyi Oblast continues flying southwest.\n3 groups from Cherkasy Oblast are flying west through central and southern Vinnytsia Oblast.\n1 group is flying west/northwest through northwestern Vinnytsia Oblast.",
      "timestamp": "2025-12-06T05:30:50.173568Z"
    },
    {
      "original": "Explosions in Nalyvaykivska, Kyiv Oblast.\nKh-101s are striking the 750 kV substation.",
      "timestamp": "2025-12-06T05:30:50.173571Z"
    },
    {
      "original": "Explosions in Lutsk. Gerans",
      "timestamp": "2025-12-06T05:30:50.173574Z"
    },
    {
      "original": "Iranian Drones Tracked U.S. Warship During Live-Fire Drills (Video)\nIran’s Islamic Revolutionary Guard Corps (IRGC) Navy on December 4 kicked off a two-day naval exercise, issuing warnings to United States warships operating in waters near the Islamic Republic.\nThe exercise is named after Mohammad Nazeri, a commander of the elite commando units of the IRGC Navy who lost his life in 2016. It is taking place in the Persian Gulf, the Hormuz Strait, the Sea of Oman, and the islands of Abu Musa, Greater Tunb, Lesser Tunb, and Siri.\nIranian state TV reported the exercise showcases the “sacrifice and spirit of resistance” of the IRGC’s naval forces “to confront any threat” against Iran following the 12-day war with Israel last June.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745679Z"
    },
    {
      "original": "U.S. Hits Another Alleged Drug Boat As Trump Renews Threats Of Land Strikes On Venezuela (Video)\nThe United States military on December 4 conducted another deadly strike on an alleged drug smuggling boat in the Eastern Pacific Ocean, killing four.\nIn a statement, the U.S Southern Command (SOUTHCOM) said that the strike was carried out by the Joint Task Force Southern Spear at the direction of Secretary of Defense Pete Hegseth.\n“Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the Eastern Pacific. Four male narco-terrorists aboard the vessel were killed,” the command added.\nThis was the 22nd alleged drug boat to be hit by SOUTHCOM since the U.S. military began its campaign against drug cartels in the Eastern Pacific and the Caribbean Sea last September. Including the last casualties, the campaign has so far claimed the lives of at least 83 people, all alleged drug traffickers.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745697Z"
    },
    {
      "original": "Europe’s Arms Makers: The Key Beneficiaries of War, the Blockers of Peace\nOn December 2, Russian President Vladimir Putin outlined whom he considers responsible for obstructing a peaceful resolution to the war in Ukraine. According to him, despite what he described as clear interest from both Moscow and Washington in ending the conflict, the European Union has repeatedly derailed potential agreements.\n“Even when they try to amend Trump’s proposals, it is obvious that all these changes are aimed at one thing: blocking the entire peace process,” he said.\nBrussels’ assessment of the situation has also drawn criticism. EU foreign policy chief Kaja Kallas stated that Russia must reduce its military budget and limit the size of its armed forces—effectively demanding the “demilitarization” of Moscow as the principal geopolitical rival. Given the realities on the front line, such expectations appear unrealistic. Yet these statements are not merely rhetorical. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745706Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745714Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745723Z"
    },
    {
      "original": "When Morale Breaks: Inside Ukraine’s Failing War Machine\nThe Russian army’s strategy is gradually bearing fruit. The Ukrainian army’s tactical crises are turning into operational ones. Four years of intense conflict are taking their toll on Ukrainian troops. They are becoming less and less motivated to fight.\nHigh-intensity armed conflicts cannot last for decades. The examples of World Wars I and II confirm this, as one of the warring parties suffered defeat due to the depletion of necessary resources. For countries waging wars of this type, having vital reserves is critically important. This was one of the key reasons for Germany’s defeat.\nRussia and Ukraine’s military capabilities are not comparable in scale. Even disregarding nuclear weapons, Kyiv’s conventional forces are significantly inferior to Moscow’s. However, besides troops, dozens of factors determine the success of a war. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745731Z"
    },
    {
      "original": "Russian Army Broke Through Key Ukrainian Defense Line In Siversk\nOn December 5, the Russian military’s Yug [South] Group of Forces broke through a key Ukrainian defense line within the city of the Siversk in Donetsk.\nThe line, which includes strong fortifications, lies along the eastern part of Siversk. After breaking through the line, Russian troops managed to expand their control in the eastern part of the city, even reaching the multi-story residential area on Energetikov Street which oversees all nearby areas.\nFollowing the breakthrough, some Ukrainian news sources began to sound the alarm over the catastrophic situation in Siversk.\nUkrainian troops held up in the city lost their last main supply route a few days earlier when the Yug Group of Forces stormed Sviato-Pokrovske to the south and cut the T-05-13 road. The city is not besieged yet, but bringing in supplies is getting harder by the day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745740Z"
    },
    {
      "original": "Russian Army Broke Through Key Ukrainian Defense Line In Siversk\nOn December 5, the Russian military’s Yug [South] Group of Forces broke through a key Ukrainian defense line within the city of the Siversk in Donetsk.\nThe line, which includes strong fortifications, lies along the eastern part of Siversk. After breaking through the line, Russian troops managed to expand their control in the eastern part of the city, even reaching the multi-story residential area on Energetikov Street which oversees all nearby areas.\nFollowing the breakthrough, some Ukrainian news sources began to sound the alarm over the catastrophic situation in Siversk.\nUkrainian troops held up in the city lost their last main supply route a few days earlier when the Yug Group of Forces stormed Sviato-Pokrovske to the south and cut the T-05-13 road. The city is not besieged yet, but bringing in supplies is getting harder by the day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745749Z"
    },
    {
      "original": "U.S. Strategy Shift and Russian-Ukrainian Strikes on December 4-5 (Videos) \nOn December 4-5, Russian and Ukrainian forces continued to exchange strikes. According to the Russian Defense Ministry, during the night of December 5, Russian air defense systems intercepted and destroyed 41 Ukrainian unmanned aerial vehicles over several regions. A statement from the Ukrainian Air Force reported that on the same night, Russia employed 137 attack UAVs, of which 80 were shot down or suppressed by Ukrainian air defense and electronic warfare assets.\nThese developments unfolded against the backdrop of the published update to the U.S. National Security Strategy, wherein Washington's foreign policy priorities were revised. According to the document, the U.S. administration considers achieving a swift end to the conflict in Ukraine to be a vital interest, aimed at stabilizing the European economy, preventing escalation, and restoring strategic stability in relations with Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745757Z"
    },
    {
      "original": "U.S. Strategy Shift and Russian-Ukrainian Strikes on December 4-5 (Videos) \nOn December 4-5, Russian and Ukrainian forces continued to exchange strikes. According to the Russian Defense Ministry, during the night of December 5, Russian air defense systems intercepted and destroyed 41 Ukrainian unmanned aerial vehicles over several regions. A statement from the Ukrainian Air Force reported that on the same night, Russia employed 137 attack UAVs, of which 80 were shot down or suppressed by Ukrainian air defense and electronic warfare assets.\nThese developments unfolded against the backdrop of the published update to the U.S. National Security Strategy, wherein Washington's foreign policy priorities were revised. According to the document, the U.S. administration considers achieving a swift end to the conflict in Ukraine to be a vital interest, aimed at stabilizing the European economy, preventing escalation, and restoring strategic stability in relations with Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745765Z"
    },
    {
      "original": "A WAR OF EXHAUSTION: RUSSIA PUSHES FORWARD AS UKRAINE'S RESERVES RUN THIN",
      "timestamp": "2025-12-06T05:30:50.745769Z"
    },
    {
      "original": "From Myrnohrad To Rodinskoye: Russia Develops Offensive On Ukraine’s Northern Flank\nRussian units have advanced to Donetska Street in the northeastern outskirts of Huliaipole and approached the Haichur River. The Ukrainian grouping in Siversk is practically paralyzed due to the loss of control over the main logistical routes to the north and south of the city. \nThe U.S. administration is lobbying against the EU's plans to provide Kyiv with a substantial loan for 2026–2027.\nRead more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745776Z"
    },
    {
      "original": "From Myrnohrad To Rodinskoye: Russia Develops Offensive On Ukraine’s Northern Flank\nRussian units have advanced to Donetska Street in the northeastern outskirts of Huliaipole and approached the Haichur River. The Ukrainian grouping in Siversk is practically paralyzed due to the loss of control over the main logistical routes to the north and south of the city. \nThe U.S. administration is lobbying against the EU's plans to provide Kyiv with a substantial loan for 2026–2027.\nRead more \nHERE",
      "timestamp": "2025-12-06T05:30:50.745783Z"
    }
  ],
  "script_run_time": "2025-12-06T05:30:50.746498Z"
}