{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-01T04:22:50.818277Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-01T04:22:50.818309Z"
    },
    {
      "original": "Курсом на Харків.",
      "timestamp": "2025-10-01T04:22:50.818314Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курсом на Чернігів. На півдні, курсом на Київщину.\n🛵\n БпЛА в центрі та на сході Дніпропетровщини \n➡️\n курсом на захід. \n🛵\n БпЛА на півночі Харківщини, курсом на Харків.",
      "timestamp": "2025-10-01T04:22:50.818324Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на заході Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-01T04:22:50.818331Z"
    },
    {
      "original": "🛵\n📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-01T04:22:50.818336Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-01T04:22:50.818341Z"
    },
    {
      "original": "🛵\n БпЛА на заході Дніпропетровщини \n➡️\n курсом на Кіровоградщину.",
      "timestamp": "2025-10-01T04:22:50.818347Z"
    },
    {
      "original": "🛵\n БпЛА поблизу Чернігова \n➡️\n курсом на північ.\n🛵\n БпЛА на заході та на сході Дніпропетровщини \n➡️\n курсом на північно-західний напрямок.\n🛵\n БпЛА на півночі Харківщини, курсом на північ.\n🛵\n  БпЛА на півдні Сумщини \n➡️\n курсом на схід.",
      "timestamp": "2025-10-01T04:22:50.818360Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігова \n➡️\n курсом на південь.\n🛵\n БпЛА на півночі Харківщини, курсом на Харків.\n🛵\n  БпЛА на Сумщині \n➡️\n курсом на Суми.\n🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-01T04:22:50.818377Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Київщину.\n🛵\n БпЛА на півночі від Кропивницького \n➡️\n курсом на північно-західний напрямок.",
      "timestamp": "2025-10-01T04:22:50.818386Z"
    },
    {
      "original": "🛵\n Ударний безпілотник в напрямку Києва. Під час тривоги, перебувайте у безпечних місцях!",
      "timestamp": "2025-10-01T04:22:50.818394Z"
    },
    {
      "original": "🛵\n БпЛА на Суми! Не ігноруйте сигнали повітряної тривоги, перебувайте в укриттях.",
      "timestamp": "2025-10-01T04:22:50.818407Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на північ від Харкова, курсом на захід.",
      "timestamp": "2025-10-01T04:22:50.818412Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на захід.\n🛵\n БпЛА на півночі від Кропивницького \n➡️\n курсом на Черкащину.\n🛵\n БпЛА на сході від Харкова \n➡️\n курсом на південь.",
      "timestamp": "2025-10-01T04:22:50.818424Z"
    },
    {
      "original": "Швидкісна ціль  у Запорізькій області, курсом на північ.",
      "timestamp": "2025-10-01T04:22:50.818427Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-10-01T04:22:50.818432Z"
    },
    {
      "original": "🚀\n \n🚀\nЗапорізька область та Дніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-01T04:22:50.818438Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Харківщини \n➡️\n курсом на Харків.",
      "timestamp": "2025-10-01T04:22:50.818444Z"
    },
    {
      "original": "🛵\n Ударний безпілотник в напрямку н.п. Димер на Київщині.",
      "timestamp": "2025-10-01T04:22:50.818448Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини \n➡️\n курсом на захід. \n🛵\n  БпЛА над Київським водосховищем \n➡️\n курсом на південь, на Київ.\n🛵\n БпЛА на півночі від Черкас \n➡️\n курсом на південь.",
      "timestamp": "2025-10-01T04:22:50.818459Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-10-01T04:22:51.406597Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-10-01T04:22:51.406608Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.\nUkrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high ground overlooking the village. They also began attacks over the Nitrius River to the rear of Hlushchenkove, supported by attacks from Novyi Myr towards the treelines along the Donetsk - Kharkiv regional border. \nUkrainian forces also resumed assault operations along the Donetsk - Luhansk Regional border towards the forest plantations southwest of Hrekivka, and have entered the forest west of Hrekivka. To the southwest, the Ukrainians continued to attack east through Ridkodub towards the agricultural buildings and the eastern houses, and across the Nitrius River into northeastern Karpivka, but for now Russia is holding their ground. \nMeanwhile, Russian forces continued to slowly advance around Novomykhailivka. They were able to recapture most of the rest of the village and entered the forest to the west from the south, which the Ukrainians are simultaneously attempting to infiltrate from the north. They also cleared the rest of the forests on approach to the gulley north of Novomykhailivka.\nAdditionally, Russian forces are carrying out attacks from Hrekivka towards the Luhansk - Kharkiv regional border, and from the treelines southwest of Hrekivka towards the next large forest. In the southwest, they are attempting to advance into the rear of Ridkodub from which the Ukrainians are attacking, as well as across one of the dams over the Nitrius River at the northern edge of Karpivka. \n+ ~5.85 km² in favour of Ukraine. \n+ ~2.69 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406618Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.  Ukrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high…",
      "timestamp": "2025-10-01T04:22:51.406622Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.  Ukrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high…",
      "timestamp": "2025-10-01T04:22:51.406625Z"
    },
    {
      "original": "For example, this \npost\n was in a delayed format, allowing for more clear and precise info.",
      "timestamp": "2025-10-01T04:22:51.406630Z"
    },
    {
      "original": "If I do choose to go with a delayed format, this will only be temporary.  My goal with this account has always been to provide some of the most accurate and unbiased updates possible, as personally, I am so sick of skewed reporting from most outlets - both mainstream and alternative. \nI spend much longer than people think on checking, double-checking, cross-referencing, researching, and verifying reports, but I worry this isn't currently enough to reach my own personal standards for accuracy. Already, there have been some updates I simply haven't felt comfortable publishing, even if I use the same steps for other updates.",
      "timestamp": "2025-10-01T04:22:51.406634Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to make significant progress, capturing numerous new key positions on a wide front.\nIn the north, after repelling Ukrainian attacks into Shandryholove, Russian forces advanced beyond the Nitrius River and captured the forested areas at the base of a gulley, and began their attacks towards the forests to the south. They were also able to secure the treeline running north of the gulley, connecting this bridgehead with the larger front further north.\nTo the south, after consolidating in the agricultural complex, Russian forces pushed into the northern part of the forest north of Novoselivka, and began attacking west towards the larger forest. Other forces advanced over the Nitrius River, and established control over all of northern Novoselivka. These assault groups began pushing north to the first forest, squeezing the Ukrainians out from their positions against the western bank of the large reservoir. From there, they began pushing further west through the forests, with extensive FPV drone strikes working on the Ukrainian positions, supply routes, and distribution points ahead of them. Further south, assault operations began towards the centre of Novoselivka, where the grey zone has expanded. \nIn the southeast, Russian forces continued to incrementally advance south down the Shandryholove - Drobysheve Road, and have now branched off onto the perpendicular treeline on the northern approaches to Drobysheve. Further east, after prolonged heavy fighting, the Russians broke through the remaining Ukrainian positions in the forests east of Derylove, and with help from forces in the western houses of the settlement, managed to squeeze the Ukrainians out of the centre, before occupying the positions in the forest plantations directly south of the village. \nAdditionally, Russian forces began a coordinated effort to secure the northeastern approaches to Drobysheve. Attacks were carried out towards the next treeline over from Derylove. Once this was occupied, they began storming Ukrainian strongpoints in the forested gulley from the west, and the foothold from the northeast, where heavy battles are still ongoing. \n+ ~9.19 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406641Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards Lyman from the east, making important progress in and around Zarichne.\nIn the south, Russian forces continued to push west through the forest south of Zarichne, and reached its western edge. The newly captured positions in this forest were then used as staging grounds to advance to, and capture positions in the southern houses of Zariche. These positions have since been linked up to the initial Russian bridgehead over the Zherebets River in southeastern Zarichne, resulting in large parts of the grey zone being cleared and a salient forming. Ukrainian forces are still moving in and out of the grey zone via the industrial zone in the southwest of the village, but Russia's grip on this area is becoming increasingly tight.\nFurther north, Russian forces finally cleared out the rest of northern Zarichne, and occupied the Ukrainian positions in the agricultural buildings on the western outskirts. From there, they began pushing northwest through the forests up the gulley and have almost cut off the Ukrainian garrison in Myrne. Attacks were also carried out up the western bank of the Zherebets River, as well to the trenches on the northern edge of Myrne. \nIn the northwest, Russian forces resumed their assault operations towards Stavky from the northeast and were able to capture new positions in three separate treelines.\n+ ~9.51 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406647Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to make significant progress, and have collapsed a section of Ukraine's defensive line outside Siversk.\nIn the east, Russian forces continued to infiltrate through the fields towards Dronivka, and were able to consolidate in the mine. From there, they are infiltrating towards the chalk quarry east of Dronivka. As a result of this, Ukraine was forced to withdraw from the village of Serebryanka, and is now holding a defence from three sides in Dronivka. Russian forces have also recaptured the rest of Serebryanka, as well as the surrounding positions, and are now trying to permanently establish themselves in the chalk quarry. \nThe Russians were also able to fully secure the northern bank of the Siverskyi Donets River, aligning the front along the Donetsk - Luhansk Regional Border, and officially ending the battles for the Severodonetsk District of Luhansk Oblast which have been ongoing since the first days of the war. \nTo the west, Russian forces marginally advanced towards Dronivka from the west, securing new positions in the forest on the western bank of the Siverskyi Donets River. \nIn the west, Russian forces continued their offensive on Yampil. They were able to consolidate control over additional positions in the eastern part of the village, including at the railway station, and are continuing their attacks beyond the village centre (which is currently in the grey zone). They were also able to advance further west through the forests, establishing control over the railway crossing and surrounding areas.\n+ ~24.46 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406655Z"
    },
    {
      "original": "On the western flank of Kostyantynivka, Russian forces continued their offensive north towards the city of Druzhkivka, and have made additional progress along the tactical heights and in the low-lying ground.\nRussian forces pushed further north along the Poltavka River, and have established control over new positions in the forest plantations surrounding the reservoir. Further west, they crossed a gulley and secured the forest plantations on its northern edge, while other forces pushed north along the treelines on the tactical heights to the northeast.\n+ ~6.12 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406659Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to quickly advance and have broken through Ukrainian positions towards Verbove.\nAfter capturing Kalynivske, Russian forces began pushing west along the road to Verbove under heavy air and artillery cover, quickly capturing Ukrainian positions there and in the treelines on the tactical heights to the south. From there, they entered eastern Verbove with little resistance and occupied at least half of the village, including the agricultural buildings. The intensity of FAB glide-bomb strikes in this area is increasing, with Ukrainian temporary deployment points and fortifications constantly being struck.\nAdditionally, Russian forces advanced north from their positions west of Berezove, and captured the one-house \"village\" of Stepove. They then pushed further and established control over the treeline to the north, as well as the treelines east of Stepove. \nTo the northeast, Russian forces advanced further north up the gulley leading to southwestern Sosnivka, and cleared out the rest of the salient here. \n+ ~17.81 km² in favour of Russia.",
      "timestamp": "2025-10-01T04:22:51.406665Z"
    },
    {
      "original": "A short time ago, Israeli forces infiltrated the village of Koayiah in southern Syria from their buffer zone around the Golan Heights. \nUnder the cover of reconnaissance drones, they advanced down the road through the village of Ma'ariya, and established control over Koayiah up to the bridge leading to the neighbouring settlement of Baiyt Irah. \nSeveral vehicles have been deployed, and two checkpoints were set up - one of which is on the Koayiah - Aabdyn Road, controlling movement in and out of Koayiah.",
      "timestamp": "2025-10-01T04:22:51.406670Z"
    },
    {
      "original": "— \n🇺🇦\n/\n🇩🇪\n/\n🇷🇺\n NEW: \nBBC reports that the 'mastermind' behind the sabotage attack against the Nordstream 2 pipeline in 2022 is a Ukrainian man by the name of 'Volodymyr Z'\nSounds familiar?\n@Middle_East_Spectator",
      "timestamp": "2025-10-01T04:22:51.406680Z"
    },
    {
      "original": "The situation in Suwayda remains tense but stable, with the STG and Bedouin forces occupying a number of towns on the border with Rif Dimashq and Daraa to the north and west. Many of these towns were predominantly Christian and have been looted and vandalized by the Damascus authorities and Bedouin tribes.\nOn the other hand, in the east, ISIS terrorists began to increase their operations against the Druze for the first time since 2018, when the SAA liberated the Safa volcanic area. Despite the presence of the NFSA in Tanf and the rest of Badiyah, the insurgency continues to grow stronger and may launch a serious insurgency in the near future.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1liqnO9iSvshTLwgPB3q9sJTgfUI&ll=32.83725589253059%2C36.64276501880522&z=10\n ]",
      "timestamp": "2025-10-01T04:22:51.406685Z"
    },
    {
      "original": "The situation in Suwayda remains tense but stable, with the STG and Bedouin forces occupying a number of towns on the border with Rif Dimashq and Daraa to the north and west. Many of these towns were predominantly Christian and have been looted and vandalized by the Damascus authorities and Bedouin tribes.\nOn the other hand, in the east, ISIS terrorists began to increase their operations against the Druze for the first time since 2018, when the SAA liberated the Safa volcanic area. Despite the presence of the NFSA in Tanf and the rest of Badiyah, the insurgency continues to grow stronger and may launch a serious insurgency in the near future.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1liqnO9iSvshTLwgPB3q9sJTgfUI&ll=32.83725589253059%2C36.64276501880522&z=10\n ]",
      "timestamp": "2025-10-01T04:22:51.406691Z"
    },
    {
      "original": "Last night, a combined strike was carried out on Kharkiv City. 4 Iskander-M ballistic missiles and 4-6 KAB glide-bombs were used. The main target was the \"Barabashovo\" Autoparts Market, however it appears that it hasn't been used for trade since the beginning of the war.",
      "timestamp": "2025-10-01T04:22:51.406694Z"
    },
    {
      "original": "Last night, a combined strike was carried out on Kharkiv City. 4 Iskander-M ballistic missiles and 4-6 KAB glide-bombs were used. The main target was the \"Barabashovo\" Autoparts Market, however it appears that it hasn't been used for trade since the beginning of the war.",
      "timestamp": "2025-10-01T04:22:51.406702Z"
    },
    {
      "original": "Russian forces have captured the village of Zarichne, Lyman direction, Donetsk Oblast.\nPre-war population: ~2,367.\nTotal land area: ~9.72 km².",
      "timestamp": "2025-10-01T04:22:51.406708Z"
    }
  ],
  "script_run_time": "2025-10-01T04:22:51.803796Z"
}