{
  "messages": [
    {
      "original": "Одеська область - ракетна небезпека!",
      "timestamp": "2025-08-17T10:57:48.054769Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-08-17T10:57:48.054788Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T10:57:48.054795Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Харківщини у південно-західному напрямку.",
      "timestamp": "2025-08-17T10:57:48.054801Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-08-17T10:57:48.054805Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T10:57:48.054811Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 40 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 17 серпня (із 19.30 16 серпня) противник атакував балістичною ракетою Іскандер-М та 60-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Брянськ, Міллерово, Приморсько-Ахтарськ, Шаталово – рф.\nПовітряний напад відбивали підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 40 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання ракети та 20 БпЛА на 12 локаціях у прифронтових районах Харківщини, Донеччини та Дніпропетровщини.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-17T10:57:48.054830Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Запоріжжя та області! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-17T10:57:48.054835Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-17T10:57:48.054839Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-17T10:57:48.054844Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Харківщини! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-17T10:57:48.054848Z"
    },
    {
      "original": "🛵\n Харківщина - загроза застосування ударних БпЛА.",
      "timestamp": "2025-08-17T10:57:48.054856Z"
    },
    {
      "original": "🛵\n Донеччина - загроза застосування ударних БпЛА.",
      "timestamp": "2025-08-17T10:57:48.054860Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА у акваторії Чорного моря поблизу Одещини! Залучено засоби для його збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-08-17T10:57:48.054866Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-17T10:57:48.054872Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-17T10:57:48.054876Z"
    },
    {
      "original": "🛵\n Сумщина - загроза застосування ударних БпЛА.\n🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-17T10:57:48.054881Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T10:57:48.054887Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на схід Дніпропетровщини.",
      "timestamp": "2025-08-17T10:57:48.054891Z"
    },
    {
      "original": "Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T10:57:48.054896Z"
    },
    {
      "original": "⚠️\nСпостерігається активність  розвідувальних БпЛА в Запорізькій та Сумській областях, можлива робота ППО.",
      "timestamp": "2025-08-17T10:57:48.054901Z"
    },
    {
      "original": "Russian forces have captured the village of Serebryanka, northeastern flank of Siversk, Donetsk Oblast.\nPre-war population: ~1,110.\nTotal land area: ~3.33km².\nWhile this does complicate the situation for Ukraine in Siversk significantly, the tactical heights to the south of Serebryanka are more crucial.",
      "timestamp": "2025-08-17T10:57:48.571202Z"
    },
    {
      "original": "Footage showing 4 new Russian Geran-2 drone strikes on a communication tower, and a long-range UAV control relay near the villages of Kholmy and Mamekyne.\n2 strikes on a communication tower: 51.86761, 32.56485.\n2 strikes on a UAV control relay: 52.10944, 33.21277.",
      "timestamp": "2025-08-17T10:57:48.571215Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Donetsk Oblast.\nAt least 35 drones attacked various targets in the region, including in Dobropillya, Sviatohorivka, Myrove, Novovodyane and Kramatorsk.",
      "timestamp": "2025-08-17T10:57:48.571220Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Donetsk Oblast.\nAt least 35 drones attacked various targets in the region, including in Dobropillya, Sviatohorivka, Myrove, Novovodyane and Kramatorsk.",
      "timestamp": "2025-08-17T10:57:48.571224Z"
    },
    {
      "original": "As a result of new Russian advances in the Siversk, Lyman, Dobropillya, and Bilozerske directions, the Donetsk OVA has announced mandatory evacuation orders for families with children in 38 different settlements in Donetsk Oblast since August 8. \nAmong these settlements are the cities of Druzhkivka and Bilozerske. Additionally, 3 villages not in their announced list are being evacuated, and the city of Lyman is now under an evacuation order for all civilians. \nThe purple line on the map represents the current evacuation zones, and the yellow markers represent the settlements added to the evacuation zone since August 8.",
      "timestamp": "2025-08-17T10:57:48.571229Z"
    },
    {
      "original": "There is some truth to the Deepstate and Azov claims it seems",
      "timestamp": "2025-08-17T10:57:48.571232Z"
    },
    {
      "original": "KAB glide-bomb over northern Kharkiv",
      "timestamp": "2025-08-17T10:57:48.571236Z"
    },
    {
      "original": "KAB glide-bomb over northern Kharkiv",
      "timestamp": "2025-08-17T10:57:48.571239Z"
    },
    {
      "original": "Explosion in Kharkiv City",
      "timestamp": "2025-08-17T10:57:48.571242Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Vesele, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~227.\nTotal land area: ~0.91km².",
      "timestamp": "2025-08-17T10:57:48.571247Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Zolotyi Kolodyaz, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~910.\nTotal land area: ~2.47 km².",
      "timestamp": "2025-08-17T10:57:48.571251Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Rubizhne, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~105.\nTotal land area: ~0.47km².",
      "timestamp": "2025-08-17T10:57:48.571256Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Vilne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~71.\nTotal land area: ~0.30km².",
      "timestamp": "2025-08-17T10:57:48.571260Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-17T10:57:48.571264Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.58km².",
      "timestamp": "2025-08-17T10:57:48.571268Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.\nUkrainian forces re-established control over the village of Hruzke and the gulley running southwards, before pushing into Vesele from multiple directions, where they recaptured it and the surrounding areas.\nTo the west, after a failed attempt at entering it, the Ukrainians attacked Zolotyi Kolodyaz from the forests to the west again and broke through to the centre of the village. Fierce fighting ensued for around 24 hours, with the Russians being forced to retreat south due to the loss of Vesele and Hruzke, as well as because of Ukraine's numerical superiority here. Those same forces then pushed south and have reached the northern outskirts of Kucheriv Yar. \nAdditionally, after days of positional battles, Ukrainian forces pushed east from their positions in Rubizhne, and recaptured the rest of the village, which Russia had to withdraw from due to the loss of Zolotyi Kolodyaz. From there, Ukrainian forces pushed further and captured treeline positions on the nearby tactical heights, and in the gulley leading south from Zolotyi Kolodyaz.\nTo the south, the Ukrainians pushed outwards from Stepy, establishing a buffer zone in the treelines on the tactical heights there, while other forces moved along the heights to Vilne, which also came under their control.\nFurthermore, Ukrainian forces advanced east from Novyi Donbas, and entered the village of Nove Shakhove, capturing the western houses. They were also able to recapture the village of Ivanivka, as well as  Dorozhnje, which allowed for them to re-enter Nykanorivka which is now partially in the grey zone. \nRussian forces on the other hand, were able to improve their positions west of Shakhove around a week ago, advancing downhill through two parallel gulleys, capturing positions in the forest plantations there. \n+ ~60.60km² in favour of Ukraine.\n+ ~6.78km² in favour of Russia.",
      "timestamp": "2025-08-17T10:57:48.571277Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-17T10:57:48.571280Z"
    },
    {
      "original": "Now that Ukraine has achieved significant success in their counterattacks in the Bilozerske-Dobropillya direction, watch out for Pro-Russians suddenly switching up their opinions on this initial Russian breakthrough by claiming that \"oh actually, it was just a few DRGs all along!!!\" Those will be the same people declaring that this was a collapse (which it initially was). \nNo. Russia achieved a breakthrough, Ukraine moved in a lot of reinforcements from other areas of the front, counterattacked, and made large gains. While the claims of large groups of Russians being encircled are likely false, Deepstate and Azov were correct in saying that Ukraine was able to significantly advance. I doubted them, and I was wrong. \nNow let's see what happens in these areas where Ukrainian reinforcements were pulled from, namely the Kostyantynivka direction. It will be a good case study, as we haven't seen large scale movements from one direction to another since around a year ago in Kursk.",
      "timestamp": "2025-08-17T10:57:48.571285Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-17T10:57:48.571289Z"
    },
    {
      "original": "These Ukrainian counterattacks began around 4 days ago btw",
      "timestamp": "2025-08-17T10:57:48.571292Z"
    },
    {
      "original": "Explosion in Kharkiv City",
      "timestamp": "2025-08-17T10:57:48.571295Z"
    },
    {
      "original": "The KAB impacted the village of Lisne, outside Kharkiv's city limits.",
      "timestamp": "2025-08-17T10:57:48.571298Z"
    },
    {
      "original": "European Bureaucrats Are In Rush To Sabotage Any Prospects Of Peace Following Trump-Putin Talks\nThe negotiations between US President Donald Trump and Russian President Vladimir Putin at Elmendorf-Richardson military base in Alaska marked a pivotal event in international diplomacy. The meeting, held in a \"three-on-three\" format (Russian delegation: Putin, Lavrov, Ushakov; U.S. delegation: Trump, Rubio, Whitcoff), lasted a record-breaking 2 hours and 45 minutes – longer than any previous Russia-U.S. summits in recent years. The atmosphere, as assessed by CNN, was far from cold: a handshake on the tarmac, a joint ride in the US presidential limousine \"The Beast,\" and even Trump applauding Putin.\nMeanwhile, European bureaucrats are in rush to sabotage any prospects of peace settlement. While Putin and Trump sought paths to de-escalation, London and Brussels activated mechanisms aimed at cementing division and militarization of the region.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157775Z"
    },
    {
      "original": "European Bureaucrats Are In Rush To Sabotage Any Prospects Of Peace Following Trump-Putin Talks\nThe negotiations between US President Donald Trump and Russian President Vladimir Putin at Elmendorf-Richardson military base in Alaska marked a pivotal event in international diplomacy. The meeting, held in a \"three-on-three\" format (Russian delegation: Putin, Lavrov, Ushakov; U.S. delegation: Trump, Rubio, Whitcoff), lasted a record-breaking 2 hours and 45 minutes – longer than any previous Russia-U.S. summits in recent years. The atmosphere, as assessed by CNN, was far from cold: a handshake on the tarmac, a joint ride in the US presidential limousine \"The Beast,\" and even Trump applauding Putin.\nMeanwhile, European bureaucrats are in rush to sabotage any prospects of peace settlement. While Putin and Trump sought paths to de-escalation, London and Brussels activated mechanisms aimed at cementing division and militarization of the region.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157790Z"
    },
    {
      "original": "Behind Diplomacy: Russia’s Relentless Strikes Destroy Ukrainian Shelters\nDespite high-level talks between Presidents Putin and Trump, Russian forces conducted another series of precision strikes across Ukraine overnight, demonstrating Moscow’s ability to sustain military operations while engaging in diplomacy. The attacks focused on military infrastructure, command centers, and foreign mercenary positions.\nAccording to the Ukrainian military, in total, a barrage of 85 Geran-type attack drones accompanied by decoy UAVs and an Iskander-M ballistic missile were launched, with Ukrainian air defense allegedly managed to intercept 61 targets. However, successful strikes were recorded at multiple locations, inflicting significant damage on Ukrainian military capabilities.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157799Z"
    },
    {
      "original": "Behind Diplomacy: Russia’s Relentless Strikes Destroy Ukrainian Shelters\nDespite high-level talks between Presidents Putin and Trump, Russian forces conducted another series of precision strikes across Ukraine overnight, demonstrating Moscow’s ability to sustain military operations while engaging in diplomacy. The attacks focused on military infrastructure, command centers, and foreign mercenary positions.\nAccording to the Ukrainian military, in total, a barrage of 85 Geran-type attack drones accompanied by decoy UAVs and an Iskander-M ballistic missile were launched, with Ukrainian air defense allegedly managed to intercept 61 targets. However, successful strikes were recorded at multiple locations, inflicting significant damage on Ukrainian military capabilities.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157807Z"
    },
    {
      "original": "From Donbass to Dnepropetrovsk: Russian Troops Expand Strategic Foothold in New Region\nRussian troops have secured another strategic victory in Ukraine’s Dnepropetrovsk region, with the “Vostok” (East) military grouping liberating the village of Voronoe in a coordinated offensive operation. This marks the third settlement freed in the region following earlier successes at Malievka and Yanvarskoe, demonstrating Moscow’s growing momentum along this entire sector of the front.\nThe 5th Guards Tank Brigade of Russia’s 36th Army spearheaded the assault, combining artillery barrages with precision drone strikes to dislodge entrenched Ukrainian forces from the 110th Mechanized Brigade. After softening defenses with sustained fire, Russian assault teams moved in to mop up buildings, basements, and surrounding tree lines, eliminating remaining resistance. Ukrainian forces reportedly suffered battalion-level casualties during the fighting.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157814Z"
    },
    {
      "original": "From Donbass to Dnepropetrovsk: Russian Troops Expand Strategic Foothold in New Region\nRussian troops have secured another strategic victory in Ukraine’s Dnepropetrovsk region, with the “Vostok” (East) military grouping liberating the village of Voronoe in a coordinated offensive operation. This marks the third settlement freed in the region following earlier successes at Malievka and Yanvarskoe, demonstrating Moscow’s growing momentum along this entire sector of the front.\nThe 5th Guards Tank Brigade of Russia’s 36th Army spearheaded the assault, combining artillery barrages with precision drone strikes to dislodge entrenched Ukrainian forces from the 110th Mechanized Brigade. After softening defenses with sustained fire, Russian assault teams moved in to mop up buildings, basements, and surrounding tree lines, eliminating remaining resistance. Ukrainian forces reportedly suffered battalion-level casualties during the fighting.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157821Z"
    },
    {
      "original": "Russian Army Charges Forward In Donetsk, Claims Two More Villages \nThe Russian military continued its advance in the Donetsk direction on August 16, making additional gains and inflicting some heavy losses on Kiev forces.\nIn its daily briefing, the Russian Ministry of Defense said that the Zapad [West] Group of Forces had liberated the village of Kolodezi, which is located just under ten kilometers to the northeast of the key city of Lyman.\nThe group also attacked two mechanized brigades and one motorized infantry brigade of Kiev forces near the villages of Karpovka, Shandrigolovo, and Sredneye in Donetsk, as well as close to the towns of Borovskaya Andreyevka, Kupyansk, Osinovo, Peschanoye, Petropavlovka in the Kharkiv direction, according to the ministry.\nUkrainian losses in these directions amounted to 230 troops, one British-made Mastiff armored vehicle, one Novator armored fighting vehicle, 14 motor vehicles.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157830Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 16, 2025\nOn August 16, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-17T10:57:49.157836Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 16, 2025\nOn August 16, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-17T10:57:49.157842Z"
    },
    {
      "original": "Israel Bolster Air Defenses In Preparations Of Second War With Iran \nThe Israeli Defense Forces (IDF) is accelerating plans to strengthen its multi-layered defense capabilities in anticipation of a new war with Iran or more missile attacks by the Houthis in Yemen, Walla News reported on August 15.\nAccording to the Hebrew news site, Director General of the Defense Ministry, Maj. Gen. Amir Baram, has ordered the expedited development and production of air defense systems, including the Arrow 3, Arrow 4, Iron Dome, David’s Sling, and a ground-based laser system.\nRead more: \nHERE",
      "timestamp": "2025-08-17T10:57:49.157849Z"
    },
    {
      "original": "U.S. Deploys 4,000 Troops, Carrier, Submarine And More On Counter-Cartel Mission \nCNN on August 15 provided more details about the United States’ recent decision to deploy air and naval forces to Latin America and the Caribbean to address the threat posed by drug cartels.\nThe deployment was first reported by Reuters a day earlier. It came in as a part of the efforts the administration of President Donald Trump is making to counter drug trafficking into the U.S.\nIn a first step, the U.S. designated last February Mexico’s Sinaloa Cartel and other drug gangs as well as Venezuelan criminal group Tren de Aragua as global terrorist organizations. A report from The New York Times released earlier this month alleged that Trump had secretly signed a directive to begin using military force against the groups.\nRead more: \nHERE",
      "timestamp": "2025-08-17T10:57:49.157856Z"
    },
    {
      "original": "Israeli Navy Attacks Power Plant Near Yemen’s Sanaa \nThe Israeli Navy early on August 17 launched strikes against a power plant located south of the Yemeni capital, Sanaa, which is held by the Houthis (Ansar Allah).\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes hit “energy infrastructure used by the Houthi terror regime,” near Sanaa, in response to “repeated attacks by the Houthi terror regime against the State of Israel and its citizens, including the launching of surface-to-surface missiles and UAVs toward Israeli territory.”\nThe Al-Masirah TV, which is run by the Houthis, said that the Hezyaz power plant was subjected to “an American-Israeli aggression.”\nThe channel later reported that workers and firefighters had put out a fire caused by the attack, and that work to repair the damage was underway.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157865Z"
    },
    {
      "original": "Israeli Navy Attacks Power Plant Near Yemen’s Sanaa \nThe Israeli Navy early on August 17 launched strikes against a power plant located south of the Yemeni capital, Sanaa, which is held by the Houthis (Ansar Allah).\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes hit “energy infrastructure used by the Houthi terror regime,” near Sanaa, in response to “repeated attacks by the Houthi terror regime against the State of Israel and its citizens, including the launching of surface-to-surface missiles and UAVs toward Israeli territory.”\nThe Al-Masirah TV, which is run by the Houthis, said that the Hezyaz power plant was subjected to “an American-Israeli aggression.”\nThe channel later reported that workers and firefighters had put out a fire caused by the attack, and that work to repair the damage was underway.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157873Z"
    },
    {
      "original": "Lebanese Warplane Conducted Patrol Over Syria Following Threats\nFor the first time ever, a warplane of the Lebanese Air Force (LAF) conducted on August 17 a patrol over Syria, specifically over the southern countryside of Homs in the center of the country. The unprecedented move came following threats to Beirut from Bedouin tribes loyal to the Islamist-led interim government in Damascus.\nData from the Flightradar24, which the patrol was spotted on, identified the warplane as an American-made A-29 Super Tucano turboprop light attack and counter-insurgency aircraft.\nThe patrol came exactly two days after some Bedouin tribes allied to the Syrian government gave Lebanon a “48 ultimatum” to release some 2,000 Syrian prisoners, including many Islamists who were convicted of terrorism.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157881Z"
    },
    {
      "original": "Lebanese Warplane Conducted Patrol Over Syria Following Threats\nFor the first time ever, a warplane of the Lebanese Air Force (LAF) conducted on August 17 a patrol over Syria, specifically over the southern countryside of Homs in the center of the country. The unprecedented move came following threats to Beirut from Bedouin tribes loyal to the Islamist-led interim government in Damascus.\nData from the Flightradar24, which the patrol was spotted on, identified the warplane as an American-made A-29 Super Tucano turboprop light attack and counter-insurgency aircraft.\nThe patrol came exactly two days after some Bedouin tribes allied to the Syrian government gave Lebanon a “48 ultimatum” to release some 2,000 Syrian prisoners, including many Islamists who were convicted of terrorism.\nRead more \nHERE",
      "timestamp": "2025-08-17T10:57:49.157896Z"
    }
  ],
  "script_run_time": "2025-08-17T10:57:49.158786Z"
}