{
  "messages": [
    {
      "original": "🛵\n Полтавщина - загроза застосування ворогом ударних БпЛА з Сумщини та Харківщини.",
      "timestamp": "2025-08-18T04:48:21.642408Z"
    },
    {
      "original": "🛵\n Нові БпЛА на півночі Сумщині \n➡️\n курсом на південно-західний напрямок.",
      "timestamp": "2025-08-18T04:48:21.642426Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Павлограда Дніпропетровщина та на Сумщині! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-18T04:48:21.642432Z"
    },
    {
      "original": "🚨\nОновлення щодо ворожих БпЛА:\n🛵\n  БпЛА в центрі та на півдні Харківщини \n➡️\n курсом на південно-західний напрямок.\n🛵\n  БпЛА  на Чернігівщині \n➡️\n курсом на південно-західний напрямок, в районі обласного центру та Прилук.",
      "timestamp": "2025-08-18T04:48:21.642442Z"
    },
    {
      "original": "🛵\nБроварський та Бориспільський  райони  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-18T04:48:21.642447Z"
    },
    {
      "original": "🛵\n  БпЛА на Павлоград.",
      "timestamp": "2025-08-18T04:48:21.642452Z"
    },
    {
      "original": "🛵\n Київ  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-18T04:48:21.642456Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Павлограда Дніпропетровщина та на Сумщині в районі Путивля! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-18T04:48:21.642461Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку та Дніпропетровська область (Синельниківський р-н)! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-18T04:48:21.642468Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на Сумщині та Одещині(у зв'язку з цим повітряна тривога). Залучено засоби для збиття!",
      "timestamp": "2025-08-18T04:48:21.642472Z"
    },
    {
      "original": "⚠\n Увага!\nСуми у вашому напрямку декілька БпЛА. Під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-08-18T04:48:21.642478Z"
    },
    {
      "original": "🛸\n🛵\n Ворожі  БпЛА на півночі Чернігівщини та в районі Прилук. Залучено засоби для їх збиття! Під час повітряної тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-18T04:48:21.642483Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-18T04:48:21.642488Z"
    },
    {
      "original": "🛵\n Харківщина  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-18T04:48:21.642492Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-18T04:48:21.642496Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-18T04:48:21.642500Z"
    },
    {
      "original": "🛵\n Харків - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-18T04:48:21.642504Z"
    },
    {
      "original": "🛵\n БпЛА на  Сумщині \n➡️\n курсом на південно-західний напрямок.",
      "timestamp": "2025-08-18T04:48:21.642509Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину та Сумщину.",
      "timestamp": "2025-08-18T04:48:21.642513Z"
    },
    {
      "original": "🛵\n БпЛА на  Полтавщині \n➡️\n курсом на Миргород.",
      "timestamp": "2025-08-18T04:48:21.642519Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Vilne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~71.\nTotal land area: ~0.30km².",
      "timestamp": "2025-08-18T04:48:22.167184Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-18T04:48:22.167196Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.58km².",
      "timestamp": "2025-08-18T04:48:22.167201Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.\nUkrainian forces re-established control over the village of Hruzke and the gulley running southwards, before pushing into Vesele from multiple directions, where they recaptured it and the surrounding areas.\nTo the west, after a failed attempt at entering it, the Ukrainians attacked Zolotyi Kolodyaz from the forests to the west again and broke through to the centre of the village. Fierce fighting ensued for around 24 hours, with the Russians being forced to retreat south due to the loss of Vesele and Hruzke, as well as because of Ukraine's numerical superiority here. Those same forces then pushed south and have reached the northern outskirts of Kucheriv Yar. \nAdditionally, after days of positional battles, Ukrainian forces pushed east from their positions in Rubizhne, and recaptured the rest of the village, which Russia had to withdraw from due to the loss of Zolotyi Kolodyaz. From there, Ukrainian forces pushed further and captured treeline positions on the nearby tactical heights, and in the gulley leading south from Zolotyi Kolodyaz.\nTo the south, the Ukrainians pushed outwards from Stepy, establishing a buffer zone in the treelines on the tactical heights there, while other forces moved along the heights to Vilne, which also came under their control.\nFurthermore, Ukrainian forces advanced east from Novyi Donbas, and entered the village of Nove Shakhove, capturing the western houses. They were also able to recapture the village of Ivanivka, as well as  Dorozhnje, which allowed for them to re-enter Nykanorivka which is now partially in the grey zone. \nRussian forces on the other hand, were able to improve their positions west of Shakhove around a week ago, advancing downhill through two parallel gulleys, capturing positions in the forest plantations there. \n+ ~60.60km² in favour of Ukraine.\n+ ~6.78km² in favour of Russia.",
      "timestamp": "2025-08-18T04:48:22.167210Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-18T04:48:22.167214Z"
    },
    {
      "original": "Now that Ukraine has achieved significant success in their counterattacks in the Bilozerske-Dobropillya direction, watch out for Pro-Russians suddenly switching up their opinions on this initial Russian breakthrough by claiming that \"oh actually, it was just a few DRGs all along!!!\" Those will be the same people declaring that this was a collapse (which it initially was). \nNo. Russia achieved a breakthrough, Ukraine moved in a lot of reinforcements from other areas of the front, counterattacked, and made large gains. While the claims of large groups of Russians being encircled are likely false, Deepstate and Azov were correct in saying that Ukraine was able to significantly advance. I doubted them, and I was wrong. \nNow let's see what happens in these areas where Ukrainian reinforcements were pulled from, namely the Kostyantynivka direction. It will be a good case study, as we haven't seen large scale movements from one direction to another since around a year ago in Kursk.",
      "timestamp": "2025-08-18T04:48:22.167219Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-18T04:48:22.167222Z"
    },
    {
      "original": "These Ukrainian counterattacks began around 4 days ago btw",
      "timestamp": "2025-08-18T04:48:22.167226Z"
    },
    {
      "original": "Explosion in Kharkiv City",
      "timestamp": "2025-08-18T04:48:22.167229Z"
    },
    {
      "original": "The KAB impacted the village of Lisne, outside Kharkiv's city limits.",
      "timestamp": "2025-08-18T04:48:22.167232Z"
    },
    {
      "original": "The KAB impacted the village of Lisne, outside Kharkiv's city limits.",
      "timestamp": "2025-08-18T04:48:22.167235Z"
    },
    {
      "original": "The KAB hit somewhere near the Lisne Cemetary.",
      "timestamp": "2025-08-18T04:48:22.167239Z"
    },
    {
      "original": "The KAB hit somewhere near the Lisne Cemetary.",
      "timestamp": "2025-08-18T04:48:22.167242Z"
    },
    {
      "original": "Over the past 2 hours, 4 Russian Iskander-M ballistic missiles have been launched from three directions, targeting:\nOleksandrivka, Donetsk Oblast.\nKharkiv City, Kharkiv Oblast.\nSumy City, Sumy Oblast.\nPavlohrad, Dnipropetrovsk Oblast.",
      "timestamp": "2025-08-18T04:48:22.167251Z"
    },
    {
      "original": "The city of Odesa and the villages of Usatove and Nerubaiske are under a large-scale Russian Geran-2 drone attack. ~26 drones are involved, and several impacts have been recorded. Multiple drones have also been intercepted.",
      "timestamp": "2025-08-18T04:48:22.167254Z"
    },
    {
      "original": "Two Russian Tu-95MS strategic bombers have landed at Olenya Airbase, Murmansk Oblast, after redeploying from Ukrainka Airbase, Amur Oblast. This means that there are now 7 Tu-95s stationed at Olenya, all of which are likely equipped with Kh-101 cruise missiles. \nAdditionally, 2 Tu-95s are stationed at Engels-2 Airbase, Saratov Oblast. These movements plus other information indicates that a large-scale combined missile attack on Ukraine is imminent and possibly could even occur tomorrow.",
      "timestamp": "2025-08-18T04:48:22.167258Z"
    },
    {
      "original": "Russian forces have established control over the point of intersection between Zaporizhzhia, Donetsk, and Dnipropetrovsk Oblasts, crossing into Dnipropetrovsk Oblast from a new direction.",
      "timestamp": "2025-08-18T04:48:22.167261Z"
    },
    {
      "original": "There are unconfirmed reports stating that Russian forces entered the city limits of Kostyantynivka and have established a foothold in the eastern residential areas. Reports state they came from Predtechyne and that reinforcements are arriving. \nRemember - this is one of the areas where significant redeployments occurred to contain and push back on the Russian breakthrough in the Dobropillya-Bilozerske direction.",
      "timestamp": "2025-08-18T04:48:22.167266Z"
    },
    {
      "original": "Associated Press has released the first photo of the Ukrainian \"Flamingo\" cruise missile, with a claimed range of 3,000km. The missile is currently in serial production under defence company \"Fire Point\". \nThe pictured missile is very large, with its warhead probably weighing at least 400kg.",
      "timestamp": "2025-08-18T04:48:22.167269Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n— Israel begins more raids in the West Bank\n➡️\n The Israeli army attacked Sa’ir, a town near Hebron tonight, also entering Ramallah and el-Bireh, al-Mazraa ash-Sharqiya, Turmus Aya, and Abu Falah.\n➡️\n It is important to note that not a singular resistance activity has come out of most of these towns, making the reason for the raids unknown.",
      "timestamp": "2025-08-18T04:48:22.167280Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n— Israel begins more raids in the West Bank  \n➡️\n The Israeli army attacked Sa’ir, a town near Hebron tonight, also entering Ramallah and el-Bireh, al-Mazraa ash-Sharqiya, Turmus Aya, and Abu Falah.  \n➡️\n It is important to note that not a singular resistance…",
      "timestamp": "2025-08-18T04:48:22.167288Z"
    },
    {
      "original": "They’re presumably carrying out arrests of suspected terrorists, collaborators, and their relatives, or dismantling any infrastructure that has been detected that could be used by militant cells in the future.",
      "timestamp": "2025-08-18T04:48:22.167292Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n💥\n — Very violent Israeli airstrikes are targeting Gaza City and the central camps tonight.\n@TabZLIVE",
      "timestamp": "2025-08-18T04:48:22.167300Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n💥\n — Very violent Israeli airstrikes are targeting Gaza City and the central camps tonight.  @TabZLIVE",
      "timestamp": "2025-08-18T04:48:22.167307Z"
    },
    {
      "original": "Palestinian sources report that 6 people have been killed (including one child) and 5 others injured in the Al-Saraj Neighborhood of Gaza City and in the Al-Bureij Refugee Camp in Central Gaza, in the extensive Israeli airstrikes and artillery shelling.",
      "timestamp": "2025-08-18T04:48:22.167312Z"
    },
    {
      "original": "A new 10-minute-long video shows an aerial view of the Gaza Strip. Entire towns and neighbourhoods have been reduced to rubble. \n0:00: The video starts off showing the Gaza Port and what used to be adjacent densely populated neighbourhoods. \n0:42: It then pans out to show much of the Shujaiyya, Al-Tuffah, and Zeitoun neighbourhoods completely flattened. This is where a lot of the fighting is ongoing now. \n1:03: We then see the former Netzarim Corridor, where only buildings occupied by the IDF remain standing. Everything else was bulldozed.\n2:09: Crossing over the Wadi Gaza River, you see the damaged Al-Nuseirat and Bureij Refugee Camps. These are areas in which Hamas maintains a level of civil authority and has regrouped many of their fighters. \n3:27: We then move over to the city of Deir Al-Balah, arguably the most \"untouched\" part of Gaza. This is where many civilians have fled, and while there is obviously a humanitarian crisis, life goes on more normally here than in other places.\n4:17: As the plane moves further south, the town of Al-Qarara comes into view, which is now largely flattened due to recent IDF activity. \n4:38: The rubble of Khan Younis and then Rafah are also visible in the distance, with the massive expanse of tents and shelters in the Al-Mawasi \"humanitarian zone\" in the foreground.",
      "timestamp": "2025-08-18T04:48:22.167320Z"
    },
    {
      "original": "NATO’s New Ally? Argentina And UK Secret Military Ties To Counter China In The South Atlantic\nThe South Atlantic, a region often overlooked in global geopolitics, is quietly becoming a theater of strategic maneuvering, with Britain and Argentina engaging in underreported military dialogue to counter Chinese influence. This development, driven by Argentine President Javier Milei’s pro-Western pivot, could reshape Latin America’s geopolitical landscape, bolster the US-led West’s position in the Southern Cone, and even ripple into the BRICS alliance.\nAccording to an Economist piece, Britain and Argentina have resumed defense talks after years of estrangement, spurred by Milei’s unorthodox stance on the Falklands and concerns about China’s growing footprint in the South Atlantic.\nArgentina currently seeks to modernize its dilapidated armed forces with NATO-compatible equipment, while Britain is considering loosening its stringent arms export restrictions.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659229Z"
    },
    {
      "original": "Military Situation In Yemen On August 17, 2025 (Map Update)",
      "timestamp": "2025-08-18T04:48:22.659240Z"
    },
    {
      "original": "Hamas, Islamic Jihad Are Still Resisting In Gaza \nThe Hamas Movement and the Palestinian Islamic Jihad continue to put on serious resistance in the Gaza Strip as the Israeli Defense Forces (IDF) prepares to mount an unprecedented offensive on the heart of the enclave.\nThe two factions shared between August 14 and 17 several videos documenting some of their recent operations against the IDF.\nThe first video shared by Hamas’ military wing, the al-Qassam Brigades, shows the group’s fighters clashing with Israeli troops from close range in the outskirts of Gaza City in the northern part of the Strip. The second video shows similar clashes from the city of Khan Younis in southern Gaza.\nIn both videos, Hamas fighters target Israeli troops with sniper rifles, blow up main battle tanks, armored personnel vehicles and armored bulldozers with rocket propelled grenades and shelling gatherings of the IDF with mortars.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659250Z"
    },
    {
      "original": "Hamas, Islamic Jihad Are Still Resisting In Gaza \nThe Hamas Movement and the Palestinian Islamic Jihad continue to put on serious resistance in the Gaza Strip as the Israeli Defense Forces (IDF) prepares to mount an unprecedented offensive on the heart of the enclave.\nThe two factions shared between August 14 and 17 several videos documenting some of their recent operations against the IDF.\nThe first video shared by Hamas’ military wing, the al-Qassam Brigades, shows the group’s fighters clashing with Israeli troops from close range in the outskirts of Gaza City in the northern part of the Strip. The second video shows similar clashes from the city of Khan Younis in southern Gaza.\nIn both videos, Hamas fighters target Israeli troops with sniper rifles, blow up main battle tanks, armored personnel vehicles and armored bulldozers with rocket propelled grenades and shelling gatherings of the IDF with mortars.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659260Z"
    },
    {
      "original": "Druze In Syria Demand Right Of Self Determination \nHundreds of Druze demonstrated in the city of al-Suwayda and other parts of the southern Syrian governorate on August 16 to demand the right to self determination.\nSome of the protesters waved Israeli flags to thank Israel for intervening on their side during the battle with the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes last month.\nThe protesters in al-Suwayda expressed their rejection of the interim government and demanded that those responsible for atrocities against Druze be brought to justice. Some of the protesters called on Israel to intervene to support their demand of self determination.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659268Z"
    },
    {
      "original": "Druze In Syria Demand Right Of Self Determination \nHundreds of Druze demonstrated in the city of al-Suwayda and other parts of the southern Syrian governorate on August 16 to demand the right to self determination.\nSome of the protesters waved Israeli flags to thank Israel for intervening on their side during the battle with the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes last month.\nThe protesters in al-Suwayda expressed their rejection of the interim government and demanded that those responsible for atrocities against Druze be brought to justice. Some of the protesters called on Israel to intervene to support their demand of self determination.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659276Z"
    },
    {
      "original": "Military Situation In Ukraine On August 17, 2025 (Maps Update)",
      "timestamp": "2025-08-18T04:48:22.659280Z"
    },
    {
      "original": "Military Situation In Ukraine On August 17, 2025 (Maps Update)",
      "timestamp": "2025-08-18T04:48:22.659284Z"
    },
    {
      "original": "Fresh Russian Strikes Hit Ukraine’s Sapsan Missile Program\nRussian strikes hit a site where Ukraine stored Sapsan tactical ballistic missiles, the Russian Ministry of Defense announced on August 17, just a few days after the country’s Federal Security Service (FSB) revealed an operation that stalled a plan by Kiev to mass produce the system.\nThe Sapsan, also known as Hirm and Grom, is believed to have a maximum range of 700 kilometers and a warhead weighing 480 kg.\n“Operational/tactical aircraft, attack unmanned aerial vehicles, missile troops and artillery of the Russian groups of forces struck a storage site of Sapsan theater-level missiles and their parts, ammunition depots and warehouses of long-range unmanned aerial vehicles and temporary deployment areas of Ukrainian armed formations and foreign mercenaries in 142 locations,” the ministry said in its daily briefing.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659292Z"
    },
    {
      "original": "Kyiv’s Nuclear Provocation: Ukrainian Drone Targets Smolensk Nuclear Power Plant\nIn yet another reckless act of nuclear terrorism, the Kyiv regime attempted to strike the Smolensk Nuclear Power Plant (NPP) in Russian rear using an attack drone. According to the Russian Federal Security Service (FSB), the Ukrainian unmanned aerial vehicle (UAV) was successfully intercepted and neutralized by electronic warfare systems before it could cause any damage.\nOn the night of August 17, Russian air defense and electronic warfare units detected and suppressed a Ukrainian-made Spis attack drone flying over the Smolensk NPP. The FSB released images of the wreckage, confirming the UAV’s origin. The drone, which was likely on a reconnaissance or test run before a larger-scale attack, was disabled mid-flight and crashed without causing any casualties or significant infrastructure damage.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659300Z"
    },
    {
      "original": "Kyiv’s Nuclear Provocation: Ukrainian Drone Targets Smolensk Nuclear Power Plant\nIn yet another reckless act of nuclear terrorism, the Kyiv regime attempted to strike the Smolensk Nuclear Power Plant (NPP) in Russian rear using an attack drone. According to the Russian Federal Security Service (FSB), the Ukrainian unmanned aerial vehicle (UAV) was successfully intercepted and neutralized by electronic warfare systems before it could cause any damage.\nOn the night of August 17, Russian air defense and electronic warfare units detected and suppressed a Ukrainian-made Spis attack drone flying over the Smolensk NPP. The FSB released images of the wreckage, confirming the UAV’s origin. The drone, which was likely on a reconnaissance or test run before a larger-scale attack, was disabled mid-flight and crashed without causing any casualties or significant infrastructure damage.\nRead more \nHERE",
      "timestamp": "2025-08-18T04:48:22.659307Z"
    }
  ],
  "script_run_time": "2025-08-18T04:48:22.659991Z"
}