{
  "messages": [
    {
      "original": "🛸\n🛸\n На північному сході від Чернігова та на південному сході від Кривого Рогу - розвідувальні БпЛА противника, які можуть бути потенційними навідниками ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-07-22T17:52:45.857312Z"
    },
    {
      "original": "⚠\n Увага! м.Суми! \n🛵\n🛸\n У вашому напрямку ворожі БпЛА!",
      "timestamp": "2025-07-22T17:52:45.857332Z"
    },
    {
      "original": "🛸\n На півночі Сумщини та в районі Запоріжжя ворожі БПЛА. Можлива робота ППО. Перебувайте в укриттях.",
      "timestamp": "2025-07-22T17:52:45.857339Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-22T17:52:45.857347Z"
    },
    {
      "original": "⚠\n Увага! Суми! \n🛵\n🛸\nНа південному сході міста ворожий БпЛА, курс - північний/північно-західний.",
      "timestamp": "2025-07-22T17:52:45.857354Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та  Сумщину!",
      "timestamp": "2025-07-22T17:52:45.857358Z"
    },
    {
      "original": "⚠\n Увага! Суми!  \n🛵\n🛸\nНа південному сході міста ворожий БпЛА, курс - північний/північно-західний.",
      "timestamp": "2025-07-22T17:52:45.857368Z"
    },
    {
      "original": "+ \n🛸\n З північного напрямку на місто ще БпЛА, ймовірно, розвідувальний.",
      "timestamp": "2025-07-22T17:52:45.857373Z"
    },
    {
      "original": "+ \n🛸\n З північного напрямку на місто ще БпЛА, ймовірно, розвідувальний.",
      "timestamp": "2025-07-22T17:52:45.857378Z"
    },
    {
      "original": "+ \n🛸\n🛵\n на Суми з північного сходу ворожі БпЛА.",
      "timestamp": "2025-07-22T17:52:45.857383Z"
    },
    {
      "original": "🛸\n🛸\n На Чернігівщині в районі н.п.Куликівка, на півночі Харківщини (н.п.Слатине, Старий Салтів), на сході Сумщини (в напрямку н.п.Угроїди із заходу) - розвідувальні БпЛА противника, які можуть бути потенційними навідниками ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-07-22T17:52:45.857389Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-22T17:52:45.857393Z"
    },
    {
      "original": "🚀\nПуски КАБ на межі Харківщини і Сумщини.",
      "timestamp": "2025-07-22T17:52:45.857398Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-07-22T17:52:45.857402Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину з курщини",
      "timestamp": "2025-07-22T17:52:45.857406Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину з курщини",
      "timestamp": "2025-07-22T17:52:45.857409Z"
    },
    {
      "original": "напрямок н.п.Хотінь",
      "timestamp": "2025-07-22T17:52:45.857412Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-22T17:52:45.857417Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-07-22T17:52:45.857423Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-07-22T17:52:45.857427Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Сумщині з Курщини, курс південно-західний",
      "timestamp": "2025-07-22T17:52:45.857431Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-07-22T17:52:45.857436Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-07-22T17:52:45.857440Z"
    },
    {
      "original": "🛵\n Сумська область загроза застосування ударних ворожих БпЛА",
      "timestamp": "2025-07-22T17:52:45.857485Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-22T17:52:46.365536Z"
    },
    {
      "original": "2 impacts to the same target that the Kh-101s and Kalibrs hit earlier.",
      "timestamp": "2025-07-22T17:52:46.365548Z"
    },
    {
      "original": "I think one thing that a lot of people underestimate is how many civilians remain in the Pokrovsk area. Pokrovsk alone has thousands of residents still holding out, while Myrnohrad, Rodynske and Hryshyne's residents combined also number in the thousands. I'd estimate over 5,000 in total remain across the 4 settlements. \nThe last shops and convenience stores closed in Rodynske last week, giving away all of their stock to civilians, but only after the Russians broke through towards the city's eastern outskirts. As of roughly two months ago, a few local shops in Pokrovsk City Centre were still selling basic supplies including food, water, antibiotics, and other medicines, although it's possible that these have since finally closed considering the deteriorating situation on the flanks and intensified Russian bombardment. \nOn average, 1 civilian in Pokrovsk is killed daily from the Russian artillery, MLRS, drone and FAB bombardment. This is despite its population still numbering in the thousands, its proximity to the frontline, the heavy Ukrainian presence in the city, and its strategic importance to the Russians.\nPokrovsk - as far as I know - was more Anti-Russia than most cities in the Donbas, especially Kramatorsk, Slovyansk, Bakhmut and Donetsk City. Nevertheless, people choose to stay behind, usually because they are waiting for \"liberation\" or because they have grown up there and lived in the city for their whole lives. It's all they have ever known, so it makes it more difficult to leave to cities further west. \nAdditionally, many residents who were evacuated from cities such as Avdiivka moved to Pokrovsk and Myrnohrad, yet less than a year later these cities were practically on the frontlines and under heavy Russian bombardment. Many people, especially elderly, do not want to have to go through the struggle or uprooting their lives and relocating once, let alone twice within a year. \nToday, a large portion of Pokrovsk, Myrnohrad, Rodynske and Hryshyne's populations are elderly, although many are middle-aged or younger. Most men between the ages of 18 and 60 either escaped or were mobilised. Localised mobilisation efforts were still ongoing in Pokrovsk-Myrnohrad up until 1-2 weeks ago, which had previously been ramped up when extra police and TCC units from other regions were sent to bolster Donetsk's police and TCC force, although I expect these efforts have since halted considering recent events.",
      "timestamp": "2025-07-22T17:52:46.365557Z"
    },
    {
      "original": "The Lukyanovskaya Metro Station in Kyiv was damaged during last night's Geran-2 drone strikes on the city. The Artem Defence plant was the target here, as it is across the road from the metro station.",
      "timestamp": "2025-07-22T17:52:46.365561Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-22T17:52:46.365564Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T17:52:46.365571Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T17:52:46.365574Z"
    },
    {
      "original": "Additional FIRMS data shows that a fire is burning from Geran impacts at the Kharkiv State Aircraft Manufacturing Company in the north of the city.",
      "timestamp": "2025-07-22T17:52:46.365578Z"
    },
    {
      "original": "I'd like to make this clear now as I see people talking about this quite a bit - the monitoring channels I use to help track Russian missiles and aircraft movements live are almost always unaffiliated with the Ukrainian government. There are ways to get extremely specific intel through OSINT and insider information. You have to remember, this war has been ongoing for over 3 years, and Russian air tactics remain largely the same. This allows for significant development in knowledge and ability to produce reliable reports as you don't have to account for many other variables. I will probably make a post on this in the near future outlining some channels and how I personally think they gather their data.",
      "timestamp": "2025-07-22T17:52:46.365582Z"
    },
    {
      "original": "An Iskander-M ballistic missile just impacted Kropyvnytskyi City, Kirovohrad Oblast.",
      "timestamp": "2025-07-22T17:52:46.365585Z"
    },
    {
      "original": "Russian forces have captured the village of Varachyne, Yunakivka direction, Sumy Oblast.\nPre-war population: ~62.\nTotal land area: ~0.30km².",
      "timestamp": "2025-07-22T17:52:46.365590Z"
    },
    {
      "original": "Russian forces have captured the village of Bila Hora, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~78.\nTotal land area: ~1.53km².",
      "timestamp": "2025-07-22T17:52:46.365595Z"
    },
    {
      "original": "Ukrainian forces have captured the village of Mykolaivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~364. \nTotal land area: ~0.56km²",
      "timestamp": "2025-07-22T17:52:46.365600Z"
    },
    {
      "original": "In the Bilopillya direction, Russian forces continued to advance and last week managed to cross the international border, entering the village of Ryzhivka. \nAfter establishing control over most of Tetkino, Russian forces pushed southwest cross the international border from the area of the Tetkino Train Station and established a foothold in the first two streets of Rhyzhivka.\nRyzhivka and Tetkino are effectively the same village and seamlessly merge at the border, making assault operations the same as any other village in Ukraine. \n+ ~0.49km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365606Z"
    },
    {
      "original": "In the Khotin direction, over the past five days Ukraine has been conducting a new operation aimed at recapturing the village of Kindrativka.\nAfter a previous failed attempt at encircling the Russians from the north, Ukrainian soldiers managed to re-infiltrate the northern houses of the village which were previously in the grey zone, while other forces which had been building up on the tactical heights to the west for over a week advanced east towards the centre of the village.\nDue to this combined pressure, along with assault operations from the south (unclear if these succeeded), and extensive artillery shelling, Russian forces had to withdraw from the southern and and southwestern parts of the village, pulling back to the centre as well as over the tributary of the Loknya River. \nUkrainian soldiers attempted to infiltrate to the eastern houses of the village prior to this Russian withdrawal but were hit by FAB glide-bombs. FABs also targeted almost every part of the village held by the AFU, causing significant casualties among their forces and slowing their advance. \nRussian FAB glide-bombs then struck the bridge between the two reservoirs, connecting the centre to the eastern part of the village, to complicate further Ukrainian movement west. The remaining Russian soldiers were then withdrawn from the village centre. \nDespite this extensive bombardment, Ukrainian soldiers managed to cross the tributary and establish positions in a few houses in the northwest of the village. The Russians tried to cut off the Ukrainians in the northwest by attacking to the northern street from the area of the reservoirs but were forced to retreat back after encountering heavy resistance, indicating further Ukrainian reinforcements have been getting brought in. \nAt the same time, Ukrainian forces had to withdraw from the gulley west of Kindrativka back to the treeline to the south, after being hit by over a dozen FABs and failing to consolidate. It's likely that this was a diversionary attack for the main operation on Kindrativka from the west, tying up Russian forces and complicating their movement in and out of the village.\n+ ~4.95km² in favour of Ukraine.",
      "timestamp": "2025-07-22T17:52:46.365615Z"
    },
    {
      "original": "In the Yunakivka direction, Russian forces continued to advance and have made significant progress west of Yunakivka over the past 10 days.\nRussian forces advanced on a wide front from the village of Novomykolaivka to Yunakikva. The first assault operations were centred on establishing a presence on the eastern bank of the Snahist River. Using Yablunivka as the main staging ground, Russian forces cleared the rest of the forest and seized the forest plantations on the eastern bank. \nFrom there, they crossed the bridge at the Novomykolaivka - Yablunivka road, establishing control over the forest and pushing up the adjacent treeline. Other forces then crossed the fields to Varachyne, where fierce battles ensued for the eastern houses. Russian forces exploited Ukraine's weakened forward position northwest of Varachyne and was able to push from Novomykolaivka to the intersection of three treelines, applying additional pressure on the Ukrainian soldiers in Varachyne. \nEventually Russian soldiers captured the village, and established full control over the treelines to the north. The soldiers on the eastern bank of the Snahist River continued to push south and reached the next forested area near the source of the river.\n+ ~11.80km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365621Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces crossed the international border at a new point and captured the village of Dehtyarne.\nRussian froces advanced from the areas of the villages of Savvin and Gaevka in Belgorod Oblast, crossing the international border at the northernmost point of Kharkiv Oblast, and began clearing Dehtyarne and the surrounding areas.\nThe village didn't have much of a Ukrainian presence in the first place, making the advances much easier, however the Russians still took at least 2 days to clear and secure the area.\n+ ~16.70km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365626Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to expand their incursion zone into Kharkiv Oblast, and entered the village of Ambarne.\nRussian forces advanced from their positions in the forest plantations, clearing the rest of the positions north of the village, before entering its first houses. Fighting ensued with the Ukrainian garrison stationed there, although it is unclear if the Russians were able to gain a foothold.\n+ ~0.59km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365633Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, capturing various positions at the eastern-most edge of Ukraine's northern bridgehead on the eastern bank of the Oskil River.\nAround 5 days ago, Ukrainian forces began a series of counterattacks aimed at regaining control over the trench networks on the tactical heights in the area of the road-bridge over the railway tracks. They advanced east along the railway line, utilising the cover from the windbreaks on either side of the tracks to infiltrate Russian trench positions and dugouts, recapturing them and reaching the main trench strongpoints at the bridge. \nOnce this strongpoint was under Ukrainian control, and positions had been recaptured in the adjacent forest, small groups of Ukrainian soldiers moved east across the open fields and infiltrated the southeastern part of Stepova Novosilka at two points. \nMeanwhile, Russian soldiers slightly improved their positions to the north, crossing a gulley and establishing control over a small treeline to the west. \n+ ~2.28km² in favour of Ukraine.\n+ ~0.33km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365641Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have been advancing on the Donetsk and Luhansk Oblast sides of the border.\nRussian forces advanced in two areas. In the northeast, they captured positions in two treeline in Luhansk Oblast, and completed the capture of the forest in Donetsk Oblast, forcing a Ukrainian withdrawal back to the Kharkiv side of the Kharkiv-Donetsk-Luhansk tri-border intersection.\nTo the southwest, Russian forces improved their positions north of Ridkodub, advancing down two treelines and capturing a third. They also entered the northern edge of the agricultural complex on the northern outskirts of Ridkodub, but it is unclear if they were able to recapture any positions there.\nUkrainian forces advanced in two areas. In the east, they continued to advance east through the village of Ridkodub and recaptured the local administrative building, as well as further houses on Tsentralna Street. They also re-entered the northeastern street of the village, capturing the western end of it. Russian forces no longer maintain a significant presence in Ridkodub, and mainly cover it with drones and artillery while holding a foothold in the eastern houses. \nIn the west, Ukrainian forces eliminated the Russian bridgehead on the western bank of the Nitrius River in Karpivka, and crossed over at the same point between the reservoirs. They were able to establish their own bridgehead on the eastern bank of the river, and advanced northeast, pushing Russian soldiers out of the northern part of the village. Despite this progress, their presence in the northern houses isn't significant enough to safely move across the other bridge between the reservoirs, despite it being under their control.\n+ ~2.32km² in favour of Russia.\n+ ~2.08km² in favour of Ukraine.",
      "timestamp": "2025-07-22T17:52:46.365648Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards the Zherebets River and captured additional positions east of the village of Torske.\nThey advanced south down a treeline to the northwestern edge of the Serebryanskyi Forest, before entering and establishing a foothold in it. Russian forces also improved their positions further west, capturing additional trenches in the small forests in the low-lying ground.\n+ ~1.40km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365653Z"
    },
    {
      "original": "In the Siversk direction, Russian and Ukrainian forces have been advancing, capturing various positions east and northeast of Siversk.\nUkrainian forces recaptured most of the rest of their previously lost positions east of Siversk, establishing control over various trench fortifications south of the Plotka River. They reached and captured a small treeline north of Verkhnokamyanske, while also approaching the village's northwestern houses.\nRussian forces resumed their assault operations in the village of Serebryanka, and captured additional positions in the southeastern part, approaching a trench strongpoint from the northeast.\n+ ~6.30km² in favour of Ukraine.\n+ ~0.20km² in favour of Russia.",
      "timestamp": "2025-07-22T17:52:46.365659Z"
    },
    {
      "original": "Following recent developments around Pokrovsk, Ukrainian source Deepstate is now characterising the overall Ukrainian manpower situation as \"catastrophic\".",
      "timestamp": "2025-07-22T17:52:46.365662Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T17:52:46.872827Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T17:52:46.872847Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – July 22, 2025",
      "timestamp": "2025-07-22T17:52:46.872855Z"
    },
    {
      "original": "Beyond Apples And Sausages: Russia And North Korea Reshaping Eurasia\nFinancial Times has reported on the rising Russian-North Korean commercial co-operation by emphasising (in its headline) “Apples, sausages and workers”. The truth is that the deepening alliance between the Russian Federation and the Democratic People’s Republic of Korea, cemented in June 2024 through a comprehensive strategic partnership treaty, goes way beyond that, marking a turning point in Northeast Asian geopolitics; and such ties are growing stronger.\nOne should keep in mind is not a fleeting or merely tactical convergence. Rather, it represents a structural realignment, with North Korea (NK) securing access to satellite technologies, energy supplies, and critical resources, effectively ending its long period of economic and diplomatic isolation...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872863Z"
    },
    {
      "original": "Strikes Overview: Russia Targets Ukraine’s Last Weapons Workshops\nRussian forces continue precision strikes across Ukraine, targeting critical military and energy infrastructure while Ukrainian drones attempt retaliatory attacks on Russian territory. The exchanges highlight the escalating drone warfare between both sides, with Russia maintaining advantage in quantity and precision of deployed systems...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872870Z"
    },
    {
      "original": "Strikes Overview: Russia Targets Ukraine’s Last Weapons Workshops\nRussian forces continue precision strikes across Ukraine, targeting critical military and energy infrastructure while Ukrainian drones attempt retaliatory attacks on Russian territory. The exchanges highlight the escalating drone warfare between both sides, with Russia maintaining advantage in quantity and precision of deployed systems...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872876Z"
    },
    {
      "original": "Clashes In Al-Suwayda Continue With More Atrocities Being Reported (18+ Videos)\nTensions remain high in the southern Syrian governorate of al-Suwayda as of July 22, with reports of ongoing clashes in the countryside and more war crimes.\nThe clashes are focused in the town of Umm al-Zaytun in the northern countryside of al-Suwayda. Tribal forces, reportedly including troops from Syria’s Islamist-led government, maintain a presence within the town. However, Druze fighters have so far managed to prevent them from advancing towards the key town of Shahba to the south...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872884Z"
    },
    {
      "original": "Clashes In Al-Suwayda Continue With More Atrocities Being Reported (18+ Videos)\nTensions remain high in the southern Syrian governorate of al-Suwayda as of July 22, with reports of ongoing clashes in the countryside and more war crimes.\nThe clashes are focused in the town of Umm al-Zaytun in the northern countryside of al-Suwayda. Tribal forces, reportedly including troops from Syria’s Islamist-led government, maintain a presence within the town. However, Druze fighters have so far managed to prevent them from advancing towards the key town of Shahba to the south...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872891Z"
    },
    {
      "original": "Inside the Trap: Russian Saboteurs Approach Battle for Pokrovsk\nThe strategic city of Pokrovsk (Krasnoarmiysk) has become the focal point of Russian Donbass offensive, where the Russian military is actively combining sabotage operations with constant frontline advances. Reports confirm that first Russian sabotage and reconnaissance groups have entered the city and are persistently present in the southern districts of the city, creating chaos among Ukrainian defenders...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872897Z"
    },
    {
      "original": "Inside the Trap: Russian Saboteurs Approach Battle for Pokrovsk\nThe strategic city of Pokrovsk (Krasnoarmiysk) has become the focal point of Russian Donbass offensive, where the Russian military is actively combining sabotage operations with constant frontline advances. Reports confirm that first Russian sabotage and reconnaissance groups have entered the city and are persistently present in the southern districts of the city, creating chaos among Ukrainian defenders...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872904Z"
    },
    {
      "original": "In Video: HIMARS Strike Reached Russian S-300 Near Frontlines\nUkrainian forces successfully targeted Russian S-300 air defense system in Belgorod region in a recent precision strike, using US-supplied HIMARS MLRS. The footage confirmed the attack, highlighting some vulnerabilities in Russian air defense deployments near the border regions, but confirmed that the launchers did not suffer damage...\nRead more: \nHERE",
      "timestamp": "2025-07-22T17:52:46.872912Z"
    }
  ],
  "script_run_time": "2025-07-22T17:52:46.873756Z"
}