{
  "messages": [
    {
      "original": "🛵\n Дніпропетровщина: БпЛА в напрямку Васильківки з південного сходу.",
      "timestamp": "2026-01-08T19:20:24.716989Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-08T19:20:24.717008Z"
    },
    {
      "original": "🚀\nПуски КАБ на Одещину!",
      "timestamp": "2026-01-08T19:20:24.717014Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря, уздовж узбережжя Миколаївщини \n➡️\n курсом на Одещину.",
      "timestamp": "2026-01-08T19:20:24.717020Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Чорноморське/Південне.",
      "timestamp": "2026-01-08T19:20:24.717027Z"
    },
    {
      "original": "🚀\nПуски КАБ на Одещину!",
      "timestamp": "2026-01-08T19:20:24.717031Z"
    },
    {
      "original": "🚀\n КАБ \n➡️\n на Затоку!",
      "timestamp": "2026-01-08T19:20:24.717037Z"
    },
    {
      "original": "🚀\n КАБ \n➡️\n на Затоку!",
      "timestamp": "2026-01-08T19:20:24.717043Z"
    },
    {
      "original": "🚀\n КАБ \n➡️\n на Маяки!",
      "timestamp": "2026-01-08T19:20:24.717049Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Куп'янська та Ізюма.",
      "timestamp": "2026-01-08T19:20:24.717055Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2026-01-08T19:20:24.717060Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2026-01-08T19:20:24.717064Z"
    },
    {
      "original": "Швидкісна ціль через Запорізьку область!",
      "timestamp": "2026-01-08T19:20:24.717068Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2026-01-08T19:20:24.717072Z"
    },
    {
      "original": "Ціль на Кривий Ріг!",
      "timestamp": "2026-01-08T19:20:24.717076Z"
    },
    {
      "original": "🚀\nПуски КАБ \n➡️\n на Запорізьку область.",
      "timestamp": "2026-01-08T19:20:24.717082Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Кривий Ріг!",
      "timestamp": "2026-01-08T19:20:24.717088Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Кривий Ріг!",
      "timestamp": "2026-01-08T19:20:24.717098Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n у бік Кривого Рогу!",
      "timestamp": "2026-01-08T19:20:24.717104Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Запоріжжя.",
      "timestamp": "2026-01-08T19:20:24.717112Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n в напрямку Павлограда, Синельникового, Дніпра.\n🛵\n Групи БпЛА \n➡️\n на Кривій Ріг.",
      "timestamp": "2026-01-08T19:20:24.717122Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Кривий Ріг!",
      "timestamp": "2026-01-08T19:20:24.717126Z"
    },
    {
      "original": "🛵\n Група БпЛА із Дніпропетровщини \n➡️\n на Харківщину.",
      "timestamp": "2026-01-08T19:20:24.717132Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: \n- БпЛА в напрямку м.Дніпро з південного сходу;\n- БпЛА курсом на Павлоград з півдня.",
      "timestamp": "2026-01-08T19:20:24.717138Z"
    },
    {
      "original": "🛵\n Запорізька область: група БпЛА через Томаківку \n➡️\n на північний захід.\n🛵\n Дніпропетровщина: БпЛА \n➡️\n у напрямку Павлограда.",
      "timestamp": "2026-01-08T19:20:24.717147Z"
    },
    {
      "original": "🚀\nПуски КАБ \n➡️\n на Харківщину зі сходу.",
      "timestamp": "2026-01-08T19:20:24.717152Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations following a series of Ukrainian counterattacks.\nRussian forces advanced north from the village of Shakhove, breaking through the kill-zone imposed by Ukrainian drones, and entrenching in the forests to the north. From there, they began advancing to the west, reaching the clay quarries and establishing control over treeline positions. Other assault groups improved their positions northwest of Shakhove in additional forested areas.\n+ ~8.72 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T19:20:25.536858Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces intensified their offensive operations and have broken through Ukrainian defences south of Kostyantynivka.\nFollowing the arrival of reinforcements into Kostyantynivka, infantry from the Russian 10th Tank Regiment broke through the kill-zone imposed by Ukrainian drones in the area of the anti-tank ditches at the highway intersection, consolidating in the treelines and infiltrating further north to the forested gulley. From there, they moved further north in small groups, reaching the village of Illinivka where they scattered, primarily into the northern and southeastern parts of the village. Ukrainian heavy bomber drones are attempting to kill as many of the surviving infantry as possible, ahead of possible clearing operations by Ukrainian assault groups.\nAdditionally, Russian infantry managed to consolidate in more positions in the forests north of the Kleban-Bykske Reservoir, as well as in the treelines to the northwest, and intensified their infiltrations towards the southern outskirts of Berestok.\nIn the northeast, following the arrival of significant reinforcements, Russian forces intensified their efforts and establishing a large foothold in eastern Kostyantynivka. They managed to capture the rest of the buildings and residential streets up to the highway southeast of the Kostyantynivka Railway Station, and began infiltrating to the station and even further northwest to the Metalurh Park. \n+ ~3.74 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T19:20:25.536876Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces intensified their offensive operations and have broken through Ukrainian defences south of Kostyantynivka.  Following the arrival of reinforcements into Kostyantynivka, infantry from the Russian 10th Tank Regiment…",
      "timestamp": "2026-01-08T19:20:25.536881Z"
    },
    {
      "original": "(PART 1)\n \nAnalysis on the situation in the Kostyantynivka direction and Russian plans to take the city:\nOver the last two months, the Russian command has deployed significant reinforcements to the Kostyantynivka direction, in what appears to be an attempt to properly set themselves up for the capture of Kostyantynivka city. \nA few days ago, Russian infantry from the 10th Tank Regiment carried out a 5km-deep infiltration into the village of Illinivka, west of Kostyantynivka, in what appears to be the first move to collapse Ukrainian defences outside the city. \nFor some time, the Russian forces (apparently primarily consisting of forces from the 72nd Motor Rifle Brigade, and possibly supported by elements of the 78th \"Akhmat\" Motor Rifle Regiment) attempting to establish a large foothold in the eastern part of the city have been hindered by a lack of progress by neighbouring units on the flanks. On their right flank, the 77th Motor Rifle Regiment and 89th Tank Regiment, supported by elements of the 1008th and 1442nd Motor Rifle Regiments, have struggled to make progress in the area of Predtechyne and Stupochky, despite earlier deep infiltration by DRGs into the large forests east of Kostyanytynivka. On their left flank, despite earlier successes, the 4th, 78th, 103rd, and 1194th Motor Rifle Regiments have become bogged down in the fields west of Pleshchiivka and Ivanopillya, and are struggling to consolidate due to heavy Ukrainian drone usage on their supply routes. \nThe Russian command seems to have attempted to solve this issue on the flanks by carrying/planning to carry out two concerted operations: \nOn the right flank, soldiers 10th Tank Regiment achieved a localised breakthrough in the direction of Illinivka, which saw them break through the Ukrainian drone kill-zone in the area of the highway intersection, and scattered infantry throughout the village. At the same time, other assault groups of the 10th Tank Regiment are advancing through the kill-zones in the western part of the forest north of the Kleban-Bykske Reservoir to infiltrate the southern outskirts of Berestok, which had previously proven unsuccessful for them. This appears to be a coordinated effort to push past the kill-zones and force the Ukrainian formations stubbornly defending the rest of the forest and the areas northwest of Ivanopillya to withdraw to the north, thereby freeing up the 4th, 78th, 103rd, and 1194th regiments to clear the rest of the areas south of the city, and further developing the left flank of the main push towards the centre of Kostyantynivka. \nThis effort is also being supported by the 54th, 1436th, and 1219th Motor Rifle Regiments in the area of Stepanivka, who have - over the last 2 months - incrementally approached the village from the south and west, and are attempting to consolidate and accumulate for attacks directly into the settlement which currently remains firmly under Ukrainian control. If the 10th Tank Regiment is able to consolidate in Illinivka and bring in supplies, this could develop a left flank for them and force the remaining Ukrainian units stubbornly defending the forests northeast of Yablunivka to withdraw north. \nHowever, currently I doubt their ability to successfully bring in adequate supplies to Illinivka due to the depth of the incursion zone, and the kill-zones which are still in place from Ukrainian drones in the area of the highway intersection. Currently, heavy Ukrainian bomber drones are focusing on carrying out strikes on Russian infantry in the northern part of Illinivka. From there, they will probably intensify strikes on the southern part of the village. It's likely - in my opinion - that Ukrainian assault groups will subsequently clear out the village to try to save the situation, as it's very clear the implications that a successful Russian capture of the village would have for the overall defence of Kostyantynivka.",
      "timestamp": "2026-01-08T19:20:25.536893Z"
    },
    {
      "original": "(PART 1)   Analysis on the situation in the Kostyantynivka direction and Russian plans to take the city:  Over the last two months, the Russian command has deployed significant reinforcements to the Kostyantynivka direction, in what appears to be an attempt…",
      "timestamp": "2026-01-08T19:20:25.536897Z"
    },
    {
      "original": "(PART 2) \nAnalysis on the situation in the Kostyantynivka direction and Russian plans to take the city\n:\nAlthough, it is possible that the Russians will be able to at least secure the forested gulley southwest of Illinivka first, and use this in the future for additional attempts to capture the village\nAs for the right flank of the 72nd Regiment, no major increases in Russian attacks have been observed. Currently, the main vector of attack is along the highway from Stupochky to the large forests east of Kostyantynivka, however no significant success has been recorded yet. Recently, the Russian command redeployed the 70th Motor Rifle Division to the Kostyantynivka direction. In my opinion, this is being done in an attempt to solve the problem on the right flank of the city, in coordination with the recent attacks on Illinivka. Prior to this redeployment, the 28th Motor Rifle Regiment of the 70th Division was already operating in Chasiv Yar, where they have faced problems from Ukrainian incursions into the southwestern part of the city in October (which they have only managed to recapture around half of) and the strong defences in the neighbouring village of Mykolaivka. It's highly likely that the rest of the 70th Division has been redeployed to Bakhmut, where the 24th and 26th Motor Rifle Regiments, along with the 17th Tank Regiment will again attempt to properly develop the right flank of the city.  \nHowever, as these preparations take place, actions are already underway on the extreme right flank of the city in the area of Virolyubivka and Mykolaivka. Here, the 126th and 127th Motor Rifle Regiments have been making incremental progress over the last 3 months, successfully creating a large \"ledge\" northeast of Kostyantynivka. This will likely serve as a springboard for attacks on the Stinky - Klynove line, with the goal of enveloping the strong Ukrainian defences in the area of Mykolaivka, Chervone, and Podilske, which would eventually collapse remaining Ukrainian defences northeast of the city. \nOverall, the Russian command appears to be implementing a comprehensive plan to take Kostyantynivka (Whose pre-war population exceeds that of Pokrovsk) in a timely manner. If this succeeds, it will prevent Russian forces from engaging in an extremely prolonged and costly battle for this large city, and allow them to coordinate properly with adjacent offensives in the directions of Dobropillya and Slovyansk.",
      "timestamp": "2026-01-08T19:20:25.536905Z"
    },
    {
      "original": "Fighting has resumed in the al Ashrafiya and Sheikh Maqsoud neighbourhoods of northern Aleppo as STG government forces are expected to launch a full-scale operation to capture the SDF-held enclave.  This comes as last-minute U.S. backed peace talks failed…",
      "timestamp": "2026-01-08T19:20:25.536909Z"
    },
    {
      "original": "It appears that the STG government offensive on the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods of northern Aleppo will begin in the coming hours. \nSustained shelling is currently underway, and the Turkish MOD has released a statement pledging to support the STG with the necessary support if requested.",
      "timestamp": "2026-01-08T19:20:25.536913Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance and have made new progress in four different areas.\nIn the northeast, Russian forces resumed assault operations in the area of Novomarkove. They managed to capture the treeline positions west of the village and the rest of the windbreaks on either side of the Siverskyi Donets Canal to the north. Other forces levelled the frontline in the treelines to the south and began pushing further west in the direction of Markove.\nTo the southwest, Russian forces continued advancing in the direction of Fedorivka, where they managed to consolidate in new positions in the forested parts of the gulley. They also improved their positions in the treeline to the west.\nTo the south, at some point recently, Russian forces consolidated in the southeastern part of Virolyubivka, on the southern bank of the tributary of the Bilenka River. Ukrainian forces subsequently carried out several counterattacks to dislodge these Russian soldiers, but they were ultimately repelled.\nTo the southeast, Russian forces continued incrementally advancing west of Chasiv Yar. They improved their positions along the railway windbreaks and breached Ukrainian fortifications in the treelines northwest of Mykolaivka, reaching the northwestern edge of the village. Other assault groups continued expanding their zone of control to the northwest, where they managed to capture new positions in two different treelines. \n+ ~5.68 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T19:20:25.536922Z"
    },
    {
      "original": "Here's a very interesting and useful tool which allows you to compare maps from different sources (me, Suriyak, Deepstate, and others).\nIt also has the timeline feature, similar to that of Deepstate's, allowing you to view changes over time. \nLink: \nhttps://UkraineViews.org",
      "timestamp": "2026-01-08T19:20:25.536928Z"
    },
    {
      "original": "This is the TG channel of the multi mapping tool I've shown a few times on my channel \nUkraineViews is a tool to navigate maps of the war in Ukraine across time and sources.\nhttps://UkraineViews.org\nhttps://t.me/UkraineViews",
      "timestamp": "2026-01-08T19:20:25.536937Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance and have captured the last 2023-era fortifications northwest of Bakhmut. \nIn the southwest, Russian forces advanced on a wide front from the Zaliznyanske area, capturing new positions in four different treelines, including in the last 2023 strongpoints, and the rest of the forest south of Bondarne.\nIn the northeast, Russian forces continued advancing through Bondarne and captured central part of the village. Fighting continues for its western houses. \n+ ~4.58 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-08T19:20:25.536944Z"
    },
    {
      "original": "It appears that the STG government offensive on the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods of northern Aleppo will begin in the coming hours.   Sustained shelling is currently underway, and the Turkish MOD has released a statement pledging to…",
      "timestamp": "2026-01-08T19:20:25.536948Z"
    },
    {
      "original": "The STG has announced a curfew for the SDF-held Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo, urging civilians to stay away from SDF positions as they begin their offensive.",
      "timestamp": "2026-01-08T19:20:25.536951Z"
    },
    {
      "original": "A failed rocket launch was carried out from Gaza City, which crashed approximately 140 metres away, near a hospital. An Israeli airstrike was reportedly carried out on the launch site afterwards.",
      "timestamp": "2026-01-08T19:20:25.536955Z"
    },
    {
      "original": "A failed rocket launch was carried out from Gaza City, which crashed approximately 140 metres away, near a hospital. An Israeli airstrike was reportedly carried out on the launch site afterwards.",
      "timestamp": "2026-01-08T19:20:25.536958Z"
    },
    {
      "original": "The STG has issued evacuation orders for civilians in 5 parts of northern Aleppo, ahead of their ground offensive.",
      "timestamp": "2026-01-08T19:20:25.536961Z"
    },
    {
      "original": "There are Russian soldiers in Podoly, and they are not DRGs. Apparently, troops were landed there, in the trench systems. I still don't know how they got there, but judging by the direction the vehicle was traveling, it had to cover a long distance, which seems to indicate that the Ukrainian presence in a large area is highly debatable and that Ukrainian drones are what is really preventing Russian consolidation.\nIn any case, Kupiansk remains a very strange front, with quite contradictory news reports.",
      "timestamp": "2026-01-08T19:20:25.536965Z"
    },
    {
      "original": "There are Russian soldiers in Podoly, and they are not DRGs. Apparently, troops were landed there, in the trench systems. I still don't know how they got there, but judging by the direction the vehicle was traveling, it had to cover a long distance, which…",
      "timestamp": "2026-01-08T19:20:25.536969Z"
    },
    {
      "original": "This area in blue is known to have a very low presence of Ukrainian soldiers, so it's definitely possible that Russian forces infiltrated through there.",
      "timestamp": "2026-01-08T19:20:25.536972Z"
    },
    {
      "original": "The STG has issued evacuation orders for civilians in 5 parts of northern Aleppo, ahead of their ground offensive.",
      "timestamp": "2026-01-08T19:20:25.536975Z"
    },
    {
      "original": "Under heavy artillery cover, STG government forces have launched their full-scale ground offensive against the SDF-held Kurdish-majority Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo.\nThe two main epicentres of fighting right now are in the Resafa District and the Syriac Quarter. STG forces attempted to attack the Syriac Quarter from at least two directions, after it was shelled with mortars. One of these attacks has been repelled by the SDF, with the STG suffering casualties. \nThey are also attacking towards the centre of the Resafa District, where heavy fighting is ongoing. \nAdditional evacuation orders have been issued for 3 more areas, bringing the total number of evacuation orders to 8.",
      "timestamp": "2026-01-08T19:20:25.536981Z"
    },
    {
      "original": "Scenes from northern Aleppo, where the shelling and battles have significant intensified.",
      "timestamp": "2026-01-08T19:20:25.536984Z"
    },
    {
      "original": "Scenes from northern Aleppo, where the shelling and battles have significant intensified.",
      "timestamp": "2026-01-08T19:20:25.536987Z"
    },
    {
      "original": "The STG is carrying out artillery strikes on SDF snipers at the entrance to the Sheikh Masoud Neighbourhood as cover for advancing ground units.",
      "timestamp": "2026-01-08T19:20:25.536990Z"
    },
    {
      "original": "One Russian \"Varshavyanka\" submarine has been deployed to the waters of the Black Sea from Novorossiysk Naval Base, Krasnodar Krai. \nTotal possible salvo: 6 Kalibr cruise missiles.",
      "timestamp": "2026-01-08T19:20:25.536994Z"
    },
    {
      "original": "UAE Allies In Yemen Lost Everything And Fled Country (Videos)\nYemeni government forces affiliated with the Saudi-backed Presidential Leadership Council (PLC) have taken over the key province of Aden with the United Arab Emirate’s top ally, Aidarus al-Zubaidi, head of the Southern Transitional Council (STC), fleeing the country.\nThe development marked the end of the conflict between the PLC and STC, and along with it the influence of the UAE in Yemen.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412635Z"
    },
    {
      "original": "UAE Allies In Yemen Lost Everything And Fled Country (Videos)\nYemeni government forces affiliated with the Saudi-backed Presidential Leadership Council (PLC) have taken over the key province of Aden with the United Arab Emirate’s top ally, Aidarus al-Zubaidi, head of the Southern Transitional Council (STC), fleeing the country.\nThe development marked the end of the conflict between the PLC and STC, and along with it the influence of the UAE in Yemen.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412652Z"
    },
    {
      "original": "Ukrainian serviceman Stepan Shevelev, \nborn in 1980, mobilized right outside a store without any chance to resist, was captured after his group was thrown onto the front line without ammunition, training, or support. In his testimony, he describes \"training centers\" as places of humiliation under foreign instructors, the lack of rotations and body evacuations, and the dire situation in the Ukrainian Armed Forces, where reinforcements mainly consist of disabled people, homeless individuals, and the sick, whom no one trains or provides with food or water.\n\"They barely trained us in anything. Some foreigner came to us, maybe an Englishman; he only humiliated us, as if we weren't even human. They don't evacuate bodies, don't even think about clearing them. There aren't even people left to do that. And who's in the AFU? Cripples and homeless guys they pick up. They'll give you a uniform, but almost no water or food. Better to run, not get caught, hide... Or better yet, leave the country.\"",
      "timestamp": "2026-01-08T19:20:26.412658Z"
    },
    {
      "original": "U.S. Fired Anti-Radar Missile And Glide Munitions At Venezuela, Killed Over 100 People \nThe United States military used anti-radar missiles and glide munitions during its January 3 operation in Venezuela which ended with the capture of President Nicolás Maduro and his wife, Cilia Flores.\nVenezuela media released a photo showing the remains of a AGM-88-series anti-radar missile which were found at a three-story civilian apartment building, where one civilian was killed and another seriously wounded, in the city of Catia La Mar.\nAdditionally, a video released by Venezuelan authorities revealed that the Venezuelan Institute of Scientific Research, located near the city of San Antonio de Los Altos, was targeted with a AGM-154 Joint Standoff Weapon (JSOW) glide munition. It is unclear if anyone was killed in the strike.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412667Z"
    },
    {
      "original": "U.S. Fired Anti-Radar Missile And Glide Munitions At Venezuela, Killed Over 100 People \nThe United States military used anti-radar missiles and glide munitions during its January 3 operation in Venezuela which ended with the capture of President Nicolás Maduro and his wife, Cilia Flores.\nVenezuela media released a photo showing the remains of a AGM-88-series anti-radar missile which were found at a three-story civilian apartment building, where one civilian was killed and another seriously wounded, in the city of Catia La Mar.\nAdditionally, a video released by Venezuelan authorities revealed that the Venezuelan Institute of Scientific Research, located near the city of San Antonio de Los Altos, was targeted with a AGM-154 Joint Standoff Weapon (JSOW) glide munition. It is unclear if anyone was killed in the strike.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412675Z"
    },
    {
      "original": "Military Situation In Northern Palestine On January 8, 2026 (Map Update)",
      "timestamp": "2026-01-08T19:20:26.412679Z"
    },
    {
      "original": "Ukraine Lost Another Key Settlement In Zaporozhye (Videos)\nOn January 8, the Russian military resumed advance along the Haichur River in Zaporozhye, capturing a key settlement from Kiev forces.\nBratskoye, located on the right bank of the Haichur far to the north from the city of Huliapole, was captured by the 36th Guards Separate Motorised Rifle Brigade of the 29th Army of the Vostok [East] Group of Forces, according to the Russian Ministry of Defense.\nAway from Haichur, to the west in Zaporozhye, the Vostok Group of Forces continue to make gains in the Stepnohirsk direction.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412687Z"
    },
    {
      "original": "Ukraine Lost Another Key Settlement In Zaporozhye (Videos)\nOn January 8, the Russian military resumed advance along the Haichur River in Zaporozhye, capturing a key settlement from Kiev forces.\nBratskoye, located on the right bank of the Haichur far to the north from the city of Huliapole, was captured by the 36th Guards Separate Motorised Rifle Brigade of the 29th Army of the Vostok [East] Group of Forces, according to the Russian Ministry of Defense.\nAway from Haichur, to the west in Zaporozhye, the Vostok Group of Forces continue to make gains in the Stepnohirsk direction.\nRead more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412695Z"
    },
    {
      "original": "Military Situation In Ukraine On January 8, 2026 (Maps Update)",
      "timestamp": "2026-01-08T19:20:26.412699Z"
    },
    {
      "original": "Military Situation In Ukraine On January 8, 2026 (Maps Update)",
      "timestamp": "2026-01-08T19:20:26.412704Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: Tanker Ablaze Off Turkey, Dnipro Blackout, Russia Plans 'Oreshnik' Strike\nOn the night of January 8, Ukrainian air forces recorded 97 drones launched from Russian territory, of which 70 were shot down or suppressed. Russian air defense destroyed 66 Ukrainian drones, with the majority over Crimea, the Azov Sea, and the Black Sea. As a result of these strikes, Ukraine's energy infrastructure was damaged, including blackouts in key regions, while the Russian side did not report significant destruction.\nSimultaneously, it was reported that on January 7, off the coast of Turkey, approximately 50 kilometers from Kastamonu province, a drone attacked the oil tanker Elbus, sailing under the flag of Palau. According to Turkish media, including Ortadoğu Gazetesi and NTV, the strike hit the upper part of the vessel, causing a fire. The crew was unharmed, and the tanker was towed to the port of İnebolu for inspection.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412713Z"
    },
    {
      "original": "Russia-Ukraine Strike Exchange: Tanker Ablaze Off Turkey, Dnipro Blackout, Russia Plans 'Oreshnik' Strike\nOn the night of January 8, Ukrainian air forces recorded 97 drones launched from Russian territory, of which 70 were shot down or suppressed. Russian air defense destroyed 66 Ukrainian drones, with the majority over Crimea, the Azov Sea, and the Black Sea. As a result of these strikes, Ukraine's energy infrastructure was damaged, including blackouts in key regions, while the Russian side did not report significant destruction.\nSimultaneously, it was reported that on January 7, off the coast of Turkey, approximately 50 kilometers from Kastamonu province, a drone attacked the oil tanker Elbus, sailing under the flag of Palau. According to Turkish media, including Ortadoğu Gazetesi and NTV, the strike hit the upper part of the vessel, causing a fire. The crew was unharmed, and the tanker was towed to the port of İnebolu for inspection.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-08T19:20:26.412721Z"
    }
  ],
  "script_run_time": "2026-01-08T19:20:26.413531Z"
}