{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Таганрогу.",
      "timestamp": "2025-10-19T15:08:30.949422Z"
    },
    {
      "original": "🛵\n БпЛА на  Запоріжжі у південно-західному напрямку.",
      "timestamp": "2025-10-19T15:08:30.949442Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-19T15:08:30.949448Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-19T15:08:30.949452Z"
    },
    {
      "original": "🛵\n БпЛА на  сході Миколаївщини у південно-західному напрямку.",
      "timestamp": "2025-10-19T15:08:30.949457Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-19T15:08:30.949466Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-19T15:08:30.949470Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-19T15:08:30.949474Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини курсом на захід.",
      "timestamp": "2025-10-19T15:08:30.949482Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-19T15:08:30.949490Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-10-19T15:08:30.949495Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-19T15:08:30.949503Z"
    },
    {
      "original": "🛵\n Групи БпЛА на півночі Чернігівщини, курсом на південь.",
      "timestamp": "2025-10-19T15:08:30.949507Z"
    },
    {
      "original": "🛵\n  БпЛА на межі Чернігівщини та Сумщини, рухається в південному напрямку.",
      "timestamp": "2025-10-19T15:08:30.949512Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-19T15:08:30.949517Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-19T15:08:30.949521Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини рухається в західному напрямку.",
      "timestamp": "2025-10-19T15:08:30.949525Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-19T15:08:30.949529Z"
    },
    {
      "original": "🛵\n БпЛА в центральній частині Харківщини рухається в західному напрямку.",
      "timestamp": "2025-10-19T15:08:30.949534Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину та Донеччину.",
      "timestamp": "2025-10-19T15:08:30.949538Z"
    },
    {
      "original": "2 Tu-95MS Russian strategic bombers have redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast, after being equipped with Kh-101 cruise missiles. \nAt least 1 Tu-95MS strategic bomber is redeploying from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast. \nThe movements, plus additional information, suggest that there increased possibility for a large-scale, combined missile and drone attack tonight, however nothing is certain at this moment. \nI will continue to provide updates today and inform if anything changes.",
      "timestamp": "2025-10-19T15:08:31.679715Z"
    },
    {
      "original": "UKTMO reports that a ship operating 116 Nautical Miles east of Aden, Yemen, has been hit by an unknown projectile, resulting in a fire. \nEarlier, there were reports that a Cameroon-flagged tanker experienced an explosion, with the crew requesting to abandon the ship. Rescue operations are currently ongoing, and an investigation is underway.",
      "timestamp": "2025-10-19T15:08:31.679728Z"
    },
    {
      "original": "A reconnaissance drone is operating off the coast of Odesa City. It has been in that general area for the past 2 hours.",
      "timestamp": "2025-10-19T15:08:31.679732Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-19T15:08:31.679736Z"
    },
    {
      "original": "The target of the Iskander missile earlier was also attacked by several MLRS rockets and Geran-2 drones. A reconnaissance drone was operating there, filming the strikes, so we will probably get a video of the strikes soon.",
      "timestamp": "2025-10-19T15:08:31.679739Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations south of Novopavlivka and have expanded their bridgehead on the northern bank of the Vovcha River.\nAfter establishing control over Filiya and beginning attacks east of the settlement, Russian forces began making quicker progress towards encircling the remaining Ukrainian formations stationed to the south near Dachne. They advanced uphill from the eastern approaches to Filiya, moving along two treelines to the trench strongpoints west of the highway. These strongpoints were then captured, threatening the encirclement of the Ukrainian forces to the south. \n+ ~3.08 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679744Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Ukrainian forces counterattacked, re-establishing control over the Pokrovsk Coal Mine.\nFollowing the Russian assault groups entering and establishing themselves in the eastern buildings of the mine complex, Ukrainian forces began counterattacking. They first covered the Russian positions with FPV drones, preventing accumulation of infantry, and struck any reinforcements arriving from the south. Assault groups then moved in from the western part of the mine and cleared the positions from the surviving Russian soldiers. A grey zone has now formed up to the anti-tank ditch north of Udachne. \n+ ~0.83 km² in favour of Ukraine.",
      "timestamp": "2025-10-19T15:08:31.679749Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.\nIn the southeast, Russian forces consolidated along the railway line north of Chunyshyne and entered the village of Novopavlivka. They advanced east down the main street, capturing most of the village and pushing the Ukrainians to the northeastern houses.\nIn southern Pokrovsk, Russian forces were able to consolidate in the high-rise buildings of the Shakhtarskyi District and began infiltrating north of the E-50 highway, into the Prospecta, Sobachivka,and Hospital Districts. Assault operations also continued in the high-rise buildings of the Pivdennyi and Soniachnyi Districts, as well as towards Yuvileynyy Park.\nFurther northwest, Russian forces captured the rest of the industrial zone in western Pokrovsk, and re-established control over positions in the Durniak and Pervomaika Districts. Deep infiltrations are now taking place from here, with Russian soldiers and DRGs crossing the railway line into the northwestern factory districts, and into the city centre towards the railway station. Assault operations also continued towards the Prospecta District from the east and deeper into the Market District.\n+ ~4.15 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679756Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to attack the approaches to Myrnohrad, and have made progress in two different areas.\nIn the north, Russian forces advanced from Novoekonomichne to the Kapitalna Mine. They were able to capture the mine along with the positions to the north and begin pushing towards northeastern Myrnohrad. The Russians then secured the forested areas east of the tributary of the Kazenyi Torets River and entered the industrial zone on the edge of the city. Additionally, they were able to advance west of this tributary, pushing from the area of the terkyons to the treelines directly north of Myrnohrad, forcing the Ukrainians to withdraw to the railway line. \nIn the south, Russian forces improved their positions in Kozatske, capturing the central part of the village, and entering its southern houses. This partially secures the southern flank of the formations that managed to enter the first houses of Myrnohrad. \n+ ~6.30 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679763Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance towards Markove and have expanded their bridgehead on the western bank of the Siverskyi Donets Canal.\nRussian forces advanced from their positions in the treelines and trench fortifications east of the canal, establishing control over new trenches and dugouts in and around the windbreak that runs parallel with the canal. The grey zone has also expanded to the adjacent treelines leading towards Markove and Novomarkove.\n+ ~0.29 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679768Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards Lyman and have made progress in three different areas.\nIn the southeast, Russian forces cleared the grey zone in southern and central Yampil, refocusing their efforts on the southwestern part of the village where both sides are attacking each other's positions. \nTo the west, Russian forces broke through Ukrainian positions south of the railway line and linked up with formations in northwestern Yampil. They were able to clear a large part of the Yampil forest, allowing for further assault operations to take place to the southwest in the direction of the Lyman - Siversk Highway. The Russians also advanced along the railway line towards eastern Lyman, capturing more positions in the forests there and to the south of the tracks. \nAdditionally, Russian forces cleared the rest of the salient that formed south of Zarichne by attacking from the northeast and southeast. They then pushed further west along multiple attack vectors in conjunction with the attacks along the railway line. \nIn the north, Russian forces continued to slowly advance along the forested gulley west of Zarichne. They captured new positions towards the western half of the gulley and are repelling additional Ukrainian counterattacks there. Russian forces are also attempting to improve their positions in the treelines northwest of Zarichne, while the Ukrainians have shifted their focus away from the agricultural buildings on the northwestern outskirts of Zarichne, to the area of Slovyanska Street. \n+ ~10.25 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679780Z"
    },
    {
      "original": "A short time ago, a Russian Grom-E1 rocket-powered glide-bomb launched from a Su-34 in southwestern Donetsk Oblast impacted the Lozova area of Kharkiv Oblast. The flight length was 120 - 140 km.",
      "timestamp": "2025-10-19T15:08:31.679784Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.  In the southeast, Russian forces consolidated along the railway line north of Chunyshyne and…",
      "timestamp": "2025-10-19T15:08:31.679788Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.\nLess than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the railway line, including the city centre. The E-50 highway has been cut via Pokrovsk's northwestern industrial zone, meaning supply is now even more difficult. \nWe could be approaching the end of the battle for the city and neighbouring Myrnohrad.",
      "timestamp": "2025-10-19T15:08:31.679793Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.  Less than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the…",
      "timestamp": "2025-10-19T15:08:31.679796Z"
    },
    {
      "original": "\"Pokrovsk isn't strategically important\" cope in 3, 2, 1...",
      "timestamp": "2025-10-19T15:08:31.679799Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards the Siverskyi Donets River and have advanced in two areas.\nIn the southeast, Russian forces were able to consolidate in the northern streets of Drobysheve and the agricultural buildings to the east. They also advanced through the forests northwest of Drobysheve, reaching the Nitrius River from the east, and capturing additional positions to the south and north. Additionally, Russian forces expanded their bridgehead west of the river, capturing new positions in the southwestern residential area of Novoselivka, and entering the forests behind them. \nIn the northwest, after heavy FAB, artillery, and FPV drone strikes, Russian forces were able to make significant progress in the forest northwest of Novoselivka, advancing in the direction of Oleksandrivka. They were also able to enter the large forests to the west where fighting is ongoing.\n+ ~6.96 km² in favour of Rusia.",
      "timestamp": "2025-10-19T15:08:31.679805Z"
    },
    {
      "original": "Footage showing two Russian Iskander-M ballistic missile strikes on a Ukrainian Patriot air defence installation near Pavlohrad, Dnipropetrovsk Oblast.\nThe strikes, which took place 3 days ago on October 15, targeted the Patriot's launcher and radar station. This system has been covering the Pavlohrad area for at least the last 4 months.",
      "timestamp": "2025-10-19T15:08:31.679809Z"
    },
    {
      "original": "2 Tu-95MS Russian strategic bombers have redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast, after being equipped with Kh-101 cruise missiles.   At least 1 Tu-95MS strategic bomber is redeploying from Ukrainka Airbase to Engels…",
      "timestamp": "2025-10-19T15:08:31.679812Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack:\nA Tu-95MS departed from Olenya Airbase, Murmansk Oblast, and landed at Engels-2 Airbase, Saratov Oblast.\nCombat-related radio activity from the Black Sea Fleet at Novorossiysk Naval Base, Krasnodar Krai, was recorded last night.\nRadio activity between Olenya Airbase and Moscow was recorded last night. \nDeliveries of Iskander-M ballistic missiles and possible Iskander-K cruise missiles from Shaykovka and Balitmore Airbases to OTRK installations in Bryansk and Voronezh Oblast took place over the last 48 hours. \nAccumulation of Geran-2/Gebera drones continues at all major launch points. \nSu-24MR reconnaissance aircraft are carrying out significantly more frequent flights over Rostov Oblast, Krasnodar Krai, and areas northeast of Ukraine. \nAn A-50U AWACS aircraft (tail number RF-50608) continues to carry out daily reconnaissance missions over Tambov, Volgograd, and Ryazan Oblast from Ulyanovsk-East Airbase, Ulyanovsk Oblast. \nOne \"Buyan-M\" Corvette and one \"Admiral Makarov\" Frigate remain equipped with Kalibr cruise missiles, although there may be additional vessels equipped too. \n4 MiG-31Ks are still equipped at Savasleika Airbase, Nizhny Novgorod Oblast, but show no relevant signs of activity yet. \n3 Tu-95MS strategic bombers from Ukrainka Airbase, Amur Oblast, carried out a training mission over the Kuril Islands in the Pacific Ocean, in which launches of Kh-101 cruise missiles were simulated with electronic warfare.",
      "timestamp": "2025-10-19T15:08:31.679824Z"
    },
    {
      "original": "Update from Pokrovsk:\nRussian forces continued to quickly advance inside the city and are now present in practically all areas south of the railway line.\nAfter breaking through Ukrainian positions in the southern suburbs, Russian forces consolidated in the Hospital District and entered the Prospecta District where they were able to secure at least the four southern blocks. Soldiers and DRGs are now infiltrating north to the city centre and the railway station, where fighting is ongoing with Ukrainian forces. \nAdditionally, Russian forces managed to completely capture the four high-rise districts in southern Pokrovsk after the remaining Ukrainian soldiers were forced to withdraw. They then crossed the E-50 highway and entered the southeastern streets of the Sobachivka District.\nTo the northwest, Russian forces continued to advance in the Pervomaika District, consolidating in numerous new residential blocks, and infiltrating towards the school, and further to the city centre.\nTo the west, Russian forces were able to secure and consolidate in the rest of the Durniak District, before spearheading east through northern Pervomaika District and into the city centre, where fighting is ongoing. They also captured the areas west of Durniak District and expanded the grey zone further in Pokrovsk's northwestern industrial zone.\nLarge parts of Pokrovsk remains in the grey zone due to the mixed state of fighting, a critical shortage of Ukrainian manpower, and the mixed and layered state of control. \n+ ~4.16 km² in favour of Russia.",
      "timestamp": "2025-10-19T15:08:31.679833Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian HIMARS GMLRS launcher near the village of Kuz'myns'ke, Chernihiv Oblast.",
      "timestamp": "2025-10-19T15:08:31.679836Z"
    },
    {
      "original": "Russian forces have recaptured the village of Myrne, Lyman direction, Donetsk Oblast.\nPre-war population: ~18.\nTotal land area: ~0.12 km².",
      "timestamp": "2025-10-19T15:08:31.679840Z"
    },
    {
      "original": "Russian forces have captured the village of Novoselivka, Lyman direction, Donetsk Oblast.\nPre-war population: ~1,390.\nTotal land area: ~3.06 km².",
      "timestamp": "2025-10-19T15:08:31.679845Z"
    },
    {
      "original": "Russian Army Advances Deep In Pokrovsk, As Kiev Forces Attack Civilians Fleeing \nOn October 18, the Russian military advanced in several parts of Pokrovsk in the Donetsk direction, amid what appears to be a collapse in Ukrainian defenses inside the city.\nThe Tsentr [Center] Group of Forces broke through Ukrainian defenses in the urban part of the city’s center, specifically in the Yuzhny microdistrict. Russian troops even managed to reach the city’s main train station, according to preliminary reports, which note that some of the newly-captured areas have not been cleared yet.\nAdvance was also reported in the western parts of Pokrovsk. Russian troops are said to have taken over the entrance of the city there, effectively cutting off the route leading to Andronivka.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412144Z"
    },
    {
      "original": "Russian Army Advances Deep In Pokrovsk, As Kiev Forces Attack Civilians Fleeing \nOn October 18, the Russian military advanced in several parts of Pokrovsk in the Donetsk direction, amid what appears to be a collapse in Ukrainian defenses inside the city.\nThe Tsentr [Center] Group of Forces broke through Ukrainian defenses in the urban part of the city’s center, specifically in the Yuzhny microdistrict. Russian troops even managed to reach the city’s main train station, according to preliminary reports, which note that some of the newly-captured areas have not been cleared yet.\nAdvance was also reported in the western parts of Pokrovsk. Russian troops are said to have taken over the entrance of the city there, effectively cutting off the route leading to Andronivka.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412162Z"
    },
    {
      "original": "Squeezing The Bridgehead: Russian Forces Tighten Control Along Oskol River Near Kupyansk\nRussian forces established control over Okhotniche on the Pokrovsk axis. Preparations are ongoing for an assault on Vovchanskie Khutora on the Kharkiv axis. \nAustria has reversed its stance and is ready to support the 19th EU sanctions package.\nRead more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412174Z"
    },
    {
      "original": "Squeezing The Bridgehead: Russian Forces Tighten Control Along Oskol River Near Kupyansk\nRussian forces established control over Okhotniche on the Pokrovsk axis. Preparations are ongoing for an assault on Vovchanskie Khutora on the Kharkiv axis. \nAustria has reversed its stance and is ready to support the 19th EU sanctions package.\nRead more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412181Z"
    },
    {
      "original": "Ukraine Amid an Energy Crisis and Waning Western Support\nOn October 17-18, the conflict between Russia and Ukraine continued with an exchange of strikes, a key feature of which was the record-breaking activity of Russian aviation in employing KAB guided aerial bombs. According to the Ukrainian Armed Forces General Staff, 268 instances of these munitions being used were recorded in a single day—an absolute maximum for 2025, significantly exceeding the previous record of 193 aerial bombs set in September.\nThe Russian side claims that during the strikes, it hit critical transport infrastructure facilities, defense industrial enterprises, a GUR drone operator training center, an unmanned aerial vehicle (UAV) assembly workshop, an air defense radar station, and numerous Ukrainian unit deployment points—across 156 districts in total.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412190Z"
    },
    {
      "original": "Ukraine Amid an Energy Crisis and Waning Western Support\nOn October 17-18, the conflict between Russia and Ukraine continued with an exchange of strikes, a key feature of which was the record-breaking activity of Russian aviation in employing KAB guided aerial bombs. According to the Ukrainian Armed Forces General Staff, 268 instances of these munitions being used were recorded in a single day—an absolute maximum for 2025, significantly exceeding the previous record of 193 aerial bombs set in September.\nThe Russian side claims that during the strikes, it hit critical transport infrastructure facilities, defense industrial enterprises, a GUR drone operator training center, an unmanned aerial vehicle (UAV) assembly workshop, an air defense radar station, and numerous Ukrainian unit deployment points—across 156 districts in total.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412198Z"
    },
    {
      "original": "Patriot Struck: Summary Of Russian Combat Footage From October 18, 2025\nOn October 18, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-19T15:08:32.412205Z"
    },
    {
      "original": "Patriot Struck: Summary Of Russian Combat Footage From October 18, 2025\nOn October 18, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-19T15:08:32.412211Z"
    },
    {
      "original": "Russian Army Captures Poltavka Amid Ukrainian Collapse, Advances Near Pokrovsk\nOn October 19, Ukrainian defenses along the Yanchur River in the Zaporozhye direction began to collapse with the Russian military taking over the key settlement of Poltavka.\nThe capture of Poltavka by the Vostok [East] Group of Forces was confirmed by the Russian Ministry of Defense. Other sources reported that Russian troops also took over Okhotnyche, located right to the north of the settlement along the Yanchur. In addition, the troops expanded their control around Malinivka, located to the south of Poltavka.\n“The assault was complicated by the need to cross the river at several points along the front. But during a comprehensive fire strike on the enemy by aviation and artillery, as well as with the support of drone operators, the Far Eastern warriors liberated one of the largest settlements on the western bank of the Yanchur,” the Russian MoD said in a statement.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412221Z"
    },
    {
      "original": "Russian Army Captures Poltavka Amid Ukrainian Collapse, Advances Near Pokrovsk\nOn October 19, Ukrainian defenses along the Yanchur River in the Zaporozhye direction began to collapse with the Russian military taking over the key settlement of Poltavka.\nThe capture of Poltavka by the Vostok [East] Group of Forces was confirmed by the Russian Ministry of Defense. Other sources reported that Russian troops also took over Okhotnyche, located right to the north of the settlement along the Yanchur. In addition, the troops expanded their control around Malinivka, located to the south of Poltavka.\n“The assault was complicated by the need to cross the river at several points along the front. But during a comprehensive fire strike on the enemy by aviation and artillery, as well as with the support of drone operators, the Far Eastern warriors liberated one of the largest settlements on the western bank of the Yanchur,” the Russian MoD said in a statement.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412230Z"
    },
    {
      "original": "After Promising Visit To Russia, Syria’s Foreign Minister Says No Agreements Were Reached\nSyria’s Foreign Minister Asaad Al-Shaibani announced on October 18 that Damascus is holding extensive discussions with Russia to reassess earlier bilateral accords, while stressing that no new agreements have been finalized.\n“There are no agreements at this time. We have not yet reached any new ones. The main point of any talks with Russia is to review the old agreements,” Shaibani said in an interview with the state-run Al-Ikhbariyah TV.\nHe noted that the talks include the status of Russian military bases in Syria. Two bases remain on the coast of the country: Hmeimim Air Base near the city of Jabelh and a naval facility at the port of Tartus.\n“Russian bases in Syria are the subject of negotiations between Damascus and Moscow,” Shaibani added.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T15:08:32.412240Z"
    }
  ],
  "script_run_time": "2025-10-19T15:08:32.413167Z"
}