{
  "messages": [
    {
      "original": "🛵\n БпЛА на Київщині, напрямок Боярка.",
      "timestamp": "2026-01-12T06:00:51.359030Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині, напрямок Фастів.",
      "timestamp": "2026-01-12T06:00:51.359048Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, напрямок н.п.Городня",
      "timestamp": "2026-01-12T06:00:51.359056Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курс південно-західний.",
      "timestamp": "2026-01-12T06:00:51.359061Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини курсом на Київщину (Вишгородський район)",
      "timestamp": "2026-01-12T06:00:51.359066Z"
    },
    {
      "original": "🛵\n Група БпЛА в акваторії Чорного моря курсом на Одещину.",
      "timestamp": "2026-01-12T06:00:51.359071Z"
    },
    {
      "original": "🛵\n Група БпЛА в акваторії Чорного моря курсом на Чорноморськ.",
      "timestamp": "2026-01-12T06:00:51.359075Z"
    },
    {
      "original": "🛵\n БпЛА з Київщини курсом на Житомирщину.",
      "timestamp": "2026-01-12T06:00:51.359080Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, повз н.п.Терни курсом на захід.",
      "timestamp": "2026-01-12T06:00:51.359084Z"
    },
    {
      "original": "🛵\n БпЛА на м.Київ з заходу.",
      "timestamp": "2026-01-12T06:00:51.359089Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині, напрямок на н.п.Роздільна.",
      "timestamp": "2026-01-12T06:00:51.359094Z"
    },
    {
      "original": "🛵\n БпЛА на м.Київ з півночі.",
      "timestamp": "2026-01-12T06:00:51.359099Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини на Полтавщину (Миргородський район),курс західний.",
      "timestamp": "2026-01-12T06:00:51.359103Z"
    },
    {
      "original": "🛵\n Група БпЛА із Полтавщини \n➡️\n в напрямку Драбова (Черкащина).\n🛵\n Чернігівщина: БпЛА \n➡️\n в напрямку Мени, Гончарівського та Десни.",
      "timestamp": "2026-01-12T06:00:51.359112Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n повз Чугуїв, західним курсом.",
      "timestamp": "2026-01-12T06:00:51.359119Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА \n➡️\n в напрямку Києва, Макарова.\n🛵\n Житомирщина: БпЛА \n➡️\n курсом на Малин, Народичі.",
      "timestamp": "2026-01-12T06:00:51.359127Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n у напрямку Охтирки.",
      "timestamp": "2026-01-12T06:00:51.359133Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Ніжин.\n🛵\n Полтавщина: БпЛА \n➡️\n повз Зіньків, курсом на захід.",
      "timestamp": "2026-01-12T06:00:51.359142Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Ніжин. \n🛵\n Полтавщина: БпЛА \n➡️\n повз Зіньків, курсом на захід.",
      "timestamp": "2026-01-12T06:00:51.359150Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n у напрямку Миргорода.\n🛵\nСумщина: БпЛА \n➡️\n повз Шостку, західним курсом.\n🛵\n Київщина: група БпЛА \n➡️\n в Чорнобильській зоні, курсом на Житомирщину.",
      "timestamp": "2026-01-12T06:00:51.359161Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n у напрямку Миргорода. \n🛵\nСумщина: БпЛА \n➡️\n повз Шостку, західним курсом. \n🛵\n Київщина: група БпЛА \n➡️\n в Чорнобильській зоні, курсом на Житомирщину.",
      "timestamp": "2026-01-12T06:00:51.359171Z"
    },
    {
      "original": "🛵\n Черкащина: БпЛА \n➡️\n у напрямку Золотоноші.\n🛵\n Житомирщина: БпЛА \n➡️\n повз Коростень.",
      "timestamp": "2026-01-12T06:00:51.359180Z"
    },
    {
      "original": "In the Borova direction, both Ukrainian and Russian forces are advancing in western Luhansk Oblast, each making progress in the area of the regional border with Donetsk Oblast.\nIn the east, Ukrainian forces re-entered the village of Hrekivka from the north and recaptured the northern part of the village. Fighting continues in the southern houses, which are partly in the grey-zone.\nIn the west, after entering the forest northwest of Hrekivka, Russian forces expanded their foothold and began pushing west, establishing control over most of the forest.\n+ ~0.56 km² in favour of Russia. \n+ ~0.85 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-12T06:00:52.167198Z"
    },
    {
      "original": "In the Borova and Svyatohirsk directions, Russian forces intensified their assault operations and have made significant progress across multiple areas.\nIn the north, Russian forces captured multiple Ukrainian strongpoints east of Korovii Yar allowing for them to break through to the north, physically cutting the Korovii Yar - Karpivka Road and capturing positions in several different treelines further north. \nTo the southwest, the Russians advanced further west down the gulley from Seredjne, capturing positions in the forest plantations there. Other assault groups captured positions in two different treelines and entered the eastern part of Oleksandrivka. \nTo the south, the Russians captured the remaining parts of the forests northwest of Yarova. From there, DRGs infiltrated the western part of the village and continued moving southwest to the Siverskyi Donets River, entering the eastern part of the city of Svyatohirsk. \nTo the east, Russian forces continued clearing the forests north of Yarova and captured the northeastern streets of the village. Other assault groups broke through Ukrainian positions further east, forcing the remaining Ukrainian formations to withdraw from southern Novoselivka due to the risk of encirclement, allowing Russia to bring the settlement, as well as some of the forests to the south, under their full control. \n+ ~16.59 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-12T06:00:52.167219Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced, each making progress across four different areas.\nIn the north, following earlier penetrations by Russian DRGs, Russian forces advanced further down the treelines north of Lyman and captured the agricultural buildings on the northern outskirts of Lyman. \nTo the south, Ukrainian forces cleared central and eastern Lyman from Russian DRGs and recaptured School No. 2, allowing for them to advance further east through the treelines. Additionally, they managed to re-enter the Masliakivka District in the easternmost part of the city, recapturing around half of it. Fighting is ongoing for its eastern streets. \nIn the south, Russian forces began advancing north from their spearhead south of Lyman, where they managed to capture a large section of the forest and reach the Lyman - Raihorodok Highway. Other assault groups continued to strengthen the southern flank of this spearhead and further improved their positions in the forests there. \n+ ~4.33 km² in favour of Ukraine.\n+ ~4.03 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-12T06:00:52.167228Z"
    },
    {
      "original": "A Russian IL-76MD cargo plane landed at Baltimore Airbase, Voronezh Oblast, this morning. \nThe cargo consists of Iskander-M ballistic missiles for OTRK installations near Liski, Voronezh Oblast.",
      "timestamp": "2026-01-12T06:00:52.167233Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time. \nThe Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2). \nAccording to the Ukrainian Main Intelligence Directorate, Geran-5 drones will likely be launched from Su-25 aircraft in the future, and it may be equipped with R-73 air-to-air missiles as a counter-meausure at some point too. \nIt was used to strike a target in the vicinity of Kryvyi Rih, Dnipropetrovsk Oblast, yesterday afternoon.",
      "timestamp": "2026-01-12T06:00:52.167239Z"
    },
    {
      "original": "Russia is reportedly planning to carry out tests with new missiles launched from strategic bombers in the near future. \nThese include:\nKh-BD-K cruise missile, which are carried by Tu-95MS bombers. They are similar to Kh-101s, but have an improved guidance system and can fly at higher altitudes of 30-70 metres. \nKh-99 hypersonic cruise missiles, which are carried by Tu-160M bombers. They can fly at speeds of up to 6,600 km/h and have a range of up to 5,500 km. \nKh-MC supersonic anti-ship missiles, which are carried by all strategic bombers. They can fly at speeds of up to 4,200 km/h and have a range of 900 km. These are very similar to Kh-22 missiles.",
      "timestamp": "2026-01-12T06:00:52.167245Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time.   The Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2).   According to…",
      "timestamp": "2026-01-12T06:00:52.167249Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T06:00:52.167253Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T06:00:52.167257Z"
    },
    {
      "original": "Russian forces have captured the village of Zelene, Omelnyk direction, Zaporizhzhia Oblast.\nPre-war population: ~50.\nTotal land area: ~0.95 km².\nThe fighting for Zelene lasted <5 days.",
      "timestamp": "2026-01-12T06:00:52.167263Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Ridkodub, Borova direction, Donetsk Oblast.\nPre-war population: ~531.\nTotal land area: ~2.73 km².\nThe second battle for Ridkodub lasted approximately 200 days.",
      "timestamp": "2026-01-12T06:00:52.167272Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.\nPre-war population: ~4,294.\nTotal land area: ~5.10 km².\nThe fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T06:00:52.167277Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.  Pre-war population: ~4,294. Total land area: ~5.10 km².  The fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T06:00:52.167281Z"
    },
    {
      "original": "Stepnohirsk direction \n➡️\n Komyshuvakha direction",
      "timestamp": "2026-01-12T06:00:52.167286Z"
    },
    {
      "original": "Over the last few days, Russia has significantly intensified their artillery and MLRS shelling of frontline areas in western Zaporizhzhia Oblast.\nThis is being done in coordination with intensified assault operations, which have resulted in the town of Stepnohirsk being captured, and the large village of Prymorske being almost fully captured. \nAdditionally, Russian reconnaissance drones have been very active both in frontline settlements and in Zaporizhzhia City itself, scouting out targets and adjusting strikes.",
      "timestamp": "2026-01-12T06:00:52.167290Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing a number of FP-1 drone strikes carried out on Russian oil drilling platforms in the Caspian Sea.\nThe following was hit:\nLSP-1 platform by 2 drones. LSP-1 is situated on the Filanovsky oil field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged. \nLSP-R platform by 3 drones. LSP-R is situated on the Graifer Oil Field. As a result of the strikes, the power module was damaged, which reportedly forced the platform to temporarily shut down.\nLSP platform by 1 drone. LSP is situated o the Kochagin Oil Field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged.\nLSP-1 coordinates: 45.002180,48.479140\nLSP-R coordinates: 45.0628000,48.6108000\nLSP coordinates: 44.914090,48.958680\nThe distance from the nearest Ukrainian-controlled territory is approximately 940 km.",
      "timestamp": "2026-01-12T06:00:52.167300Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T06:00:52.167305Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T06:00:52.167309Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T06:00:52.167319Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T06:00:52.167325Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-12T06:00:53.040704Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-12T06:00:53.040722Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040734Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040743Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040753Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040763Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040773Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040781Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040791Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T06:00:53.040801Z"
    }
  ],
  "script_run_time": "2026-01-12T06:00:53.041721Z"
}