{
  "messages": [
    {
      "original": "🛵\n Група БпЛА на Запоріжжі \n➡️\n курсом на північ/північний захід.",
      "timestamp": "2025-11-13T09:51:41.652556Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Чернігівщину та Полтавщину.\n🛵\n Група БпЛА на Запоріжжі \n➡️\n курсом на південний захід.\n🛵\n  БпЛА на півдні Одещини \n➡️\n курсом на захід.",
      "timestamp": "2025-11-13T09:51:41.652581Z"
    },
    {
      "original": "🛵\n Група БпЛА на Полтавщині \n➡️\n курсом на Харківщину та Дніпропетровщину.\n🛵\n Група БпЛА на Запоріжжі \n➡️\n курсом на південний захід.\n🛵\n  БпЛА на Діпропетровщині  \n➡️\n курсом на південь.",
      "timestamp": "2025-11-13T09:51:41.652596Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Одещини з акваторії Чорного моря.",
      "timestamp": "2025-11-13T09:51:41.652604Z"
    },
    {
      "original": "🛵\n Одещина: група БпЛА на півдні \n➡️\n в напрямку н.п Сарата, Васильківка.",
      "timestamp": "2025-11-13T09:51:41.652610Z"
    },
    {
      "original": "🛵\n  Миколаївщина: БпЛА з півдня в північно-східному напрямку.",
      "timestamp": "2025-11-13T09:51:41.652615Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА на сході в північно-західному напрямку.",
      "timestamp": "2025-11-13T09:51:41.652619Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, в південо-західному напрямку.",
      "timestamp": "2025-11-13T09:51:41.652623Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-13T09:51:41.652631Z"
    },
    {
      "original": "🛸\n На сході Миколаївщини - ворожі БпЛА, ймовірно, розвідувальні! Залучено засоби для збиття.",
      "timestamp": "2025-11-13T09:51:41.652636Z"
    },
    {
      "original": "⚠\n Увага! \n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-13T09:51:41.652643Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-13T09:51:41.652648Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-13T09:51:41.652657Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-11-13T09:51:41.652662Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-13T09:51:41.652666Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 102 ВОРОЖИХ  БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 13 листопада (з 19:00 12 листопада) противник атакував однією балістичною ракетою Іскандер-М із ТОТ АР Криму,  138 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Орел, Приморсько-Ахтарськ – рф, Чауда, Гвардійське – ТОТ АР Крим, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 10:30, протиповітряною обороною збито/подавлено 102 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, сході та півдні країни.\nЗафіксовано влучання 36 ударних БпЛА на 10 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-13T09:51:41.652685Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-13T09:51:41.652691Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Сумщині в напрямку на/повз Білопілля.\n🛵\n🛸\n БпЛА в напрямку Улянівки.",
      "timestamp": "2025-11-13T09:51:41.652701Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-11-13T09:51:41.652707Z"
    },
    {
      "original": "🚀\nПуски КАБ на межі Донецької, Запорізької та Дніпропетровської областей.",
      "timestamp": "2025-11-13T09:51:41.652713Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччині в напрямку на/повз Дружківку із заходу.",
      "timestamp": "2025-11-13T09:51:41.652718Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked the cities of Slovyansk and Kramatorsk in Donetsk Oblast. \nAt least 4 drones struck energy infrastructure in Kramatorsk, while 2 drones impacted an unknown target in Slovyansk. \nVideos are both from Kramatorsk.",
      "timestamp": "2025-11-13T09:51:42.653701Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked the cities of Slovyansk and Kramatorsk in Donetsk Oblast. \nAt least 4 drones struck energy infrastructure in Kramatorsk, while 2 drones impacted an unknown target in Slovyansk. \nVideos are both from Kramatorsk.",
      "timestamp": "2025-11-13T09:51:42.653715Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T09:51:42.653719Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T09:51:42.653723Z"
    },
    {
      "original": "Over the last week, local Palestinian armed groups affiliated with the Palestinian Islamic Jihad's Saraya Al-Quds Brigades claimed responsibility for two attacks in the West Bank.\nOn November 4, the \"Tulkarm Brigade\" stated that their fighters fired on a newly established Israeli outpost with small arms near the border with Israel west of the city of Tulkarm. This is the first recorded presence of Palestinian militants in the area of Tulkarm City in some time. IDF troops effectively occupy the city, which previously served as a stronghold for multiple armed groups.\nOn November 11, the \"Nablus Brigade\" stated that their fighters fired on an Israeli military vehicle with small arms near the \"Alon Moreh\" settlement east of Nablus. An increase in insurgent activity has been recorded in the Nablus area over the past month, which has seen very little activity recently due to frequent and sustained IDF raids.\nNo Israeli casualties were reported in either of these incidents.\nAdditionally, the Saraya Al-Quds Brigades announced the death of a fighter from the local armed group \"Tubas Battalion\" after he was killed by IDF troops in the Al-Fara'a Refugee Camp.",
      "timestamp": "2025-11-13T09:51:42.653730Z"
    },
    {
      "original": "I'm having issues with my computer, so I won't be able to post map updates from Ukraine today. All updates are live on my interactive map as usual, and I will try to make long-form posts about them as soon as possible.\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=48.38420505740439%2C37.273749674799895&z=12",
      "timestamp": "2025-11-13T09:51:42.653734Z"
    },
    {
      "original": "🇺🇦\n⚡️\n — Ukraine has suspended Justice Minister German Galushchenko amid an energy-sector corruption investigation. \n➡️\n His duties have been taken over by Deputy Minister for European Integration Lyudmyla Sugak. \n➡️\n Galushchenko, who served as energy minister for four years, is accused of receiving “personal benefits” from Timur Mindich in exchange for influence over energy-sector funds.\n@TabZLIVE",
      "timestamp": "2025-11-13T09:51:42.653745Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T09:51:42.653748Z"
    },
    {
      "original": "Consequences of the morning Russian Geran-2 drone strikes on a warehouse facility in Kharkiv City.",
      "timestamp": "2025-11-13T09:51:42.653751Z"
    },
    {
      "original": "I’m seeing a lot of “Pro-Ukraine” accounts calling for mass mobilisation of more Ukrainian men today. \nTo those people advocating for this, think for a second - would you go and volunteer yourself? Would you go and fight alongside the country you claim to support so much? \nOr are you happy with just sitting at home in your comfortable, peaceful country advocating for the killing of hundreds of thousands. Because that’s what it would mean - mass mobilisation of additional Ukrainians would be condemning a significant portion of them to their deaths. They will die for a war that cannot be won. \nAll the while you have the audacity to claim that this is a good idea, while not being prepared to do anything yourself other than lie on Twitter for money and engagement. \nPeople like this are some of the most fucking vile, disgusting humans on this planet, and I truly hope that their statements will come back to haunt them once this war is over. \nYou do not support Ukraine. You are only anti-Russia. You have blood on your hands.",
      "timestamp": "2025-11-13T09:51:42.653759Z"
    },
    {
      "original": "Im happy to announce i will be doing an interview with AMK Mapping soon. Hopefully early next week at the latest, itll be uploaded to my youtube channel. We will be discussing what couldve happened if the invasion took place in 2014, as well as the origins of this conflict to begin with, before going into the future and what it holds. \nhttps://www.youtube.com/@hudsonwarmap",
      "timestamp": "2025-11-13T09:51:42.653763Z"
    },
    {
      "original": "Russian forces have captured the village of Yablukove, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~48.\nTotal land area: ~0.11 km².",
      "timestamp": "2025-11-13T09:51:42.653767Z"
    },
    {
      "original": "Russian forces have captured the village of Rivnopillya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~268.\nTotal land area: ~0.92 km².",
      "timestamp": "2025-11-13T09:51:42.653771Z"
    },
    {
      "original": "Russian forces have captured the village of Sukhyi Yar, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~237.\nTotal land area: ~0.49 km².",
      "timestamp": "2025-11-13T09:51:42.653776Z"
    },
    {
      "original": "For those wondering, Pokrovsk has already effectively fallen. Only a couple of streets remain, meaning that any future progress within the city will be mostly symbolic.",
      "timestamp": "2025-11-13T09:51:42.653782Z"
    },
    {
      "original": "Last night, Ukrainian Flamingo cruise missiles attacked the Oryol Thermal Power plant in Oryol Oblast. \nThe number of missiles used is unknown, but it is known that 1 missile impacted and 1 was intercepted.",
      "timestamp": "2025-11-13T09:51:42.653787Z"
    },
    {
      "original": "Last night, Ukrainian Flamingo cruise missiles attacked the Oryol Thermal Power plant in Oryol Oblast. \nThe number of missiles used is unknown, but it is known that 1 missile impacted and 1 was intercepted.",
      "timestamp": "2025-11-13T09:51:42.653791Z"
    },
    {
      "original": "Russian forces have captured the village of Danylivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~355.\nTotal land area: ~0.97 km².",
      "timestamp": "2025-11-13T09:51:42.653795Z"
    },
    {
      "original": "Russian forces have captured the village of Danylivka, Hulyaipole direction, Dnipropetrovsk Oblast.  Pre-war population: ~355. Total land area: ~0.97 km².",
      "timestamp": "2025-11-13T09:51:42.653798Z"
    },
    {
      "original": "As a result of this advance, Russian forces have now physically cut the Hulyaipole - Pokrovsk'e Highway. \nCurrently, there is only one usable paved road left leading into Hulyaipole, which is less than 6 km from the frontline, meaning it is under constant Russian drone surveillance.",
      "timestamp": "2025-11-13T09:51:42.653802Z"
    },
    {
      "original": "The day AI becomes completely unbiased will be scary for many.",
      "timestamp": "2025-11-13T09:51:42.653805Z"
    },
    {
      "original": "Military Situation In Ukraine On November 12, 2025 (Maps Update)",
      "timestamp": "2025-11-13T09:51:43.466888Z"
    },
    {
      "original": "Military Situation In Ukraine On November 12, 2025 (Maps Update)",
      "timestamp": "2025-11-13T09:51:43.466901Z"
    },
    {
      "original": "India Says Delhi Blast Was ‘Terror Incident’ Amid Rising Tensions With Pakistan (Videos)\nThe Indian Government has declared a car blast that killed eight people and wounded at least 20 others in Delhi as a \"terror incident\" and vowed to bring the perpetrators to justice as swiftly as possible.\nThe car bomb blew up in the city’s historic 17th century Red Fort, more known as Lal Qila, on November 10. At the time, Prime Minister Narendra Modi vowed that India’s “agencies will go to the root of this conspiracy and will not spare the conspirators behind it.”\nIn a resolution adopted late on November 12, Modi's cabinet said: \"The country has witnessed a heinous terror incident, perpetrated by anti-national forces, through a car explosion.\"\nA day after the bombing in Delhi, a suicide bomber self-detonated next to a police car outside a court building in Islamabad, the capital of Pakistan, killing at least 12 others and wounding at least 27.\nRead more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466911Z"
    },
    {
      "original": "India Says Delhi Blast Was ‘Terror Incident’ Amid Rising Tensions With Pakistan (Videos)\nThe Indian Government has declared a car blast that killed eight people and wounded at least 20 others in Delhi as a \"terror incident\" and vowed to bring the perpetrators to justice as swiftly as possible.\nThe car bomb blew up in the city’s historic 17th century Red Fort, more known as Lal Qila, on November 10. At the time, Prime Minister Narendra Modi vowed that India’s “agencies will go to the root of this conspiracy and will not spare the conspirators behind it.”\nIn a resolution adopted late on November 12, Modi's cabinet said: \"The country has witnessed a heinous terror incident, perpetrated by anti-national forces, through a car explosion.\"\nA day after the bombing in Delhi, a suicide bomber self-detonated next to a police car outside a court building in Islamabad, the capital of Pakistan, killing at least 12 others and wounding at least 27.\nRead more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466921Z"
    },
    {
      "original": "Strikes On Energy Infrastructure And A Corruption Scandal: Ukraine’s Twin Crisis\nRussia and Ukraine continued to exchange strikes on November 11-12. According to the Russian Ministry of Defence, air defence systems destroyed 22 UAVs on the night of November 12. The Ukrainian Air Force reported that Russian forces launched 121 attack UAVs, 90 of which were shot down or suppressed.\nUkraine’s internal situation was complicated by a corruption scandal in the energy sector. President Volodymyr Zelenskyy announced the need for the dismissal of Minister of Justice Galushchenko and Minister of Energy Grinchuk due to their alleged involvement in corrupt schemes linked to Timur Mindich. This step continues a pattern of distancing from individuals accused of corruption schemes.\nHowever, it raises questions about whether  Mindich, as a friend and one of Zelenskyy's closest associates, could have carried out large-scale corruption schemes without the President's knowledge.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466930Z"
    },
    {
      "original": "Strikes On Energy Infrastructure And A Corruption Scandal: Ukraine’s Twin Crisis\nRussia and Ukraine continued to exchange strikes on November 11-12. According to the Russian Ministry of Defence, air defence systems destroyed 22 UAVs on the night of November 12. The Ukrainian Air Force reported that Russian forces launched 121 attack UAVs, 90 of which were shot down or suppressed.\nUkraine’s internal situation was complicated by a corruption scandal in the energy sector. President Volodymyr Zelenskyy announced the need for the dismissal of Minister of Justice Galushchenko and Minister of Energy Grinchuk due to their alleged involvement in corrupt schemes linked to Timur Mindich. This step continues a pattern of distancing from individuals accused of corruption schemes.\nHowever, it raises questions about whether  Mindich, as a friend and one of Zelenskyy's closest associates, could have carried out large-scale corruption schemes without the President's knowledge.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466940Z"
    },
    {
      "original": "HYPERSONIC STRIKE AND GROUND GAINS: RUSSIA'S MULTI-DOMAIN PRESSURE ON UKRAINE",
      "timestamp": "2025-11-13T09:51:43.466946Z"
    },
    {
      "original": "Firestorm: Ukrainian Army Abandons Positions In Rivnopillia Due To Heavy Strikes \nRussian forces have gained full control of Sukhyi Yar in the Pokrovsk sector. Ukrainian forces are withdrawing from Rivnopillia due to heavy artillery and air strikes. \nBloomberg stated that any money provided to Ukraine would be stolen, making further financial assistance impractical.\nRead more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466954Z"
    },
    {
      "original": "Firestorm: Ukrainian Army Abandons Positions In Rivnopillia Due To Heavy Strikes \nRussian forces have gained full control of Sukhyi Yar in the Pokrovsk sector. Ukrainian forces are withdrawing from Rivnopillia due to heavy artillery and air strikes. \nBloomberg stated that any money provided to Ukraine would be stolen, making further financial assistance impractical.\nRead more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466961Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From November 12, 2025\nOn November 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-13T09:51:43.466968Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From November 12, 2025\nOn November 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-13T09:51:43.466975Z"
    },
    {
      "original": "Venezuela Accelerates Preparations For Possible Invasion By U.S. (Video)\nThe Venezuelan government announced on November 11 it is launching a “massive mobilization” of military personnel, weapons and equipment in response to the United States military buildup in the Caribbean Sea.\nThe military preparations include the “massive deployment of ground, aerial, naval, riverine and missile forces,” according to a statement shared by Minister of People’s Power for Defense Vladimir Padrino Lopez, who described the deployment as a response to the “imperialist threat” posed by the U.S.\nRead more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466982Z"
    },
    {
      "original": "Zelensky Could Flee To Britain In Wake Of Anti-Corruption Raids In Ukraine\nPresident Volodymyr Zelensky may be preparing to flee Ukraine — not to Poland, but to the United Kingdom, which has provided him with protection and a future residence permit. However, his stay there may not be permanent, as United States President Donald Trump may request him as a key witness in the investigation against the Democrats.\nThe noose around Zelensky and his entourage is tightening due to theft and corruption after they found themselves in the crosshairs of Ukraine’s National Anti-Corruption Bureau (NABU) and the Specialized Anti-Corruption Prosecutor’s Office. The first to be targeted was Timur Mindich, co-owner of the Kvartal 95, the studio behind many of Zelensky’s popular television projects before he went into politics, and business partner of the Ukrainian leader, who is also described as “Zelensky’s wallet,” as well as Oleksiy Chernyshov, now a former deputy prime minister...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T09:51:43.466990Z"
    }
  ],
  "script_run_time": "2025-11-13T09:51:43.467845Z"
}