{
  "messages": [
    {
      "original": "🛸\n Північ Чернігівщини - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження. Під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861120Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-21T11:37:49.861143Z"
    },
    {
      "original": "🛸\n Харківщина та Сумщина - ворожі розвідувальні БпЛА! Під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861149Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-08-21T11:37:49.861154Z"
    },
    {
      "original": "🚀\nЗагроза застосування авіаційних засобів ураження для Шосткинського та Конотопського районів.",
      "timestamp": "2025-08-21T11:37:49.861159Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-21T11:37:49.861168Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-08-21T11:37:49.861172Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-08-21T11:37:49.861177Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-08-21T11:37:49.861181Z"
    },
    {
      "original": "🛸\n Запорізький район та схід Дніпропетровщини - ворожий розвідувальний БпЛА! У разі оголошення тривоги перебувайте в укриттях!",
      "timestamp": "2025-08-21T11:37:49.861190Z"
    },
    {
      "original": "🛵\n Схід Дніпропетровщини- загроза ударного БпЛА.",
      "timestamp": "2025-08-21T11:37:49.861194Z"
    },
    {
      "original": "🛸\n Кривий Ріг - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження. Під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861199Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-21T11:37:49.861207Z"
    },
    {
      "original": "🚀\nЗагроза застосування авіаційних засобів ураження для Шосткінського, Синельнивського районів.\n🚀\nПуски КАБ на північно-західний напрямок Сумщини.",
      "timestamp": "2025-08-21T11:37:49.861213Z"
    },
    {
      "original": "🛸\n Харківщина та Чернігівщина - ворожі розвідувальні БпЛА! Під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861219Z"
    },
    {
      "original": "🛵\n Броварський, Бориспільський райони - загроза ударного БпЛА.",
      "timestamp": "2025-08-21T11:37:49.861223Z"
    },
    {
      "original": "🛵\nКиїв та Обухівський район - загроза ударного БпЛА.",
      "timestamp": "2025-08-21T11:37:49.861228Z"
    },
    {
      "original": "🛵\nКиїв та Обухівський район - загроза ударного БпЛА.",
      "timestamp": "2025-08-21T11:37:49.861232Z"
    },
    {
      "original": "Фастівський район.",
      "timestamp": "2025-08-21T11:37:49.861235Z"
    },
    {
      "original": "⚠\n Увага!\nУдарний БпЛА  має вектор руху навколо столиці! Перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861240Z"
    },
    {
      "original": "🛸\n Харківщина та Чернігівщина - ворожі розвідувальні БпЛА! У разі тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-21T11:37:49.861244Z"
    },
    {
      "original": "The remaining missiles from Vinnytsia Oblast are flying west through southern Khmelnytskyi Oblast",
      "timestamp": "2025-08-21T11:37:50.286623Z"
    },
    {
      "original": "The remaining missiles from Vinnytsia Oblast are flying west through southern Khmelnytskyi Oblast",
      "timestamp": "2025-08-21T11:37:50.286636Z"
    },
    {
      "original": "They are flying towards Chortkiv, Ternopil Oblast.",
      "timestamp": "2025-08-21T11:37:50.286641Z"
    },
    {
      "original": "Earlier, a Zircon missile was also used on Sumy City",
      "timestamp": "2025-08-21T11:37:50.286645Z"
    },
    {
      "original": "They are flying towards Chortkiv, Ternopil Oblast.",
      "timestamp": "2025-08-21T11:37:50.286648Z"
    },
    {
      "original": "Currently, the last missiles are flying northwest through Ternopil Oblast, west of Ternopil City.",
      "timestamp": "2025-08-21T11:37:50.286652Z"
    },
    {
      "original": "Currently, the last missiles are flying northwest through Ternopil Oblast, west of Ternopil City.",
      "timestamp": "2025-08-21T11:37:50.286655Z"
    },
    {
      "original": "The missiles are flying towards Lviv City.",
      "timestamp": "2025-08-21T11:37:50.286659Z"
    },
    {
      "original": "The missiles are flying towards Lviv City.",
      "timestamp": "2025-08-21T11:37:50.286662Z"
    },
    {
      "original": "The group split. Part is flying to Lutsk. The rest are flying to Mykolaiv, Lviv Oblast.",
      "timestamp": "2025-08-21T11:37:50.286665Z"
    },
    {
      "original": "A group of missiles is flying to Lutsk from the south.",
      "timestamp": "2025-08-21T11:37:50.286669Z"
    },
    {
      "original": "Multiple explosions in Lviv",
      "timestamp": "2025-08-21T11:37:50.286672Z"
    },
    {
      "original": "Explosions in Lutsk. The missile attack is over.",
      "timestamp": "2025-08-21T11:37:50.286676Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n Details of today's complex Al-Qassam ambush against an Israeli outpost in Gaza:\n– A unit of 18 Hamas fighter emerged from a tunnel near a temporary IDF outpost in southern Khan Younis.\n– The unit jumped over the dirt barrier and entered the outpost, targeting several Israeli Merkava IV tanks with Yassin-105 RPGs and IEDs from close range.\n– One of the fighter managed to snipe the commander of a Merkava IV tank, fatally injuring him.\n– Subsequently, the fighters began assaulting a building that housed IDF troops, with machine gun fire, grenades and RPGs.\n– The unit then entered the building, killing severel Israeli soldiers at point-blank range, while also losing several of their own fighters in the process.\n– When an Israeli rescue force arrived, the last Al-Qassam fighter emerged from a tunnel and blew himself up amidst the soldiers, leading to casualties.\n– Lastly, the Al-Qassam Brigades fired mortar shells upon the entry and exits of the outpost, cutting off supply lines and preventing easy evacuation.\n@Middle_East_Spectator",
      "timestamp": "2025-08-21T11:37:50.286691Z"
    },
    {
      "original": "Approximate paths of the Russian missiles over Ukraine last night.\nThe following was used:\n~12 Kh-101 cruise missiles, launched from 2 Tu-95MS in Engels District, Saratov Oblast).\n~12 Kalibr cruise missiles, launched from 1 \"Varshavyanka\"-class submarine and 1 \"Admiral Makarov\"-class frigate in the Black Sea, off the coast of Anapa, Krasnodar Krai. \n4 Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31Ks east of Lipetsk City, Lipetsk Oblast.\n1 Zircon hypersonic cruise missile launched from Cape Chauda, Crimea. \nInterception rates are unknown, but 2 Kh-101s are known to have been shot down over Kyiv Oblast. \nOver 500 Geran-2 drones were also launched in several waves from several locations surrounding Ukraine. \nThe targets of the missiles were: \nMukachevo, Zakkarpatia Oblast.\nZaporizhzhia City, Zaporizhzhia Oblast.\nLviv City, Lviv Oblast.\nLutsk, Volyn Oblast.\nDubno, Rivne Oblast.\nSumy City, Sumy Oblast.\nGeran-2 drones targeted the above cities, as well as:\nPavlohrad, Dnipropetrovsk Oblast.\nVinnytsia City, Vinnytsia Oblast.\nOkhtyrka, Sumy Oblast.\nRivne City, Rivne Oblast.\nMezhova, Dnipropetrovsk Oblast.\nPokrovske, Dnipropetrovsk Oblast.",
      "timestamp": "2025-08-21T11:37:50.286709Z"
    },
    {
      "original": "Approximate paths of the Russian missiles over Ukraine last night.  The following was used:  ~12 Kh-101 cruise missiles, launched from 2 Tu-95MS in Engels District, Saratov Oblast).  ~12 Kalibr cruise missiles, launched from 1 \"Varshavyanka\"-class submarine…",
      "timestamp": "2025-08-21T11:37:50.286713Z"
    },
    {
      "original": "One of the targets of last night's combined Russian missile strike was the Flextronics plant owned by the U.S. company \"Flex\", in Mukachevo, Zakarpattia Oblast. As many as 12 Kalibr cruise missiles impacted the plant, resulting in a massive fire breaking out. \nThe plant has been operating in Mukachevo for over 13 years and was originally built for civilian purposes.",
      "timestamp": "2025-08-21T11:37:50.286717Z"
    },
    {
      "original": "One of the targets of last night's combined Russian missile strike was the Flextronics plant owned by the U.S. company \"Flex\", in Mukachevo, Zakarpattia Oblast. As many as 12 Kalibr cruise missiles impacted the plant, resulting in a massive fire breaking out. \nThe plant has been operating in Mukachevo for over 13 years and was originally built for civilian purposes.",
      "timestamp": "2025-08-21T11:37:50.286722Z"
    },
    {
      "original": "Last night, Russian Kh-101 cruise missiles and Geran-2 drones struck the \"Concern Electron\" plant in Lviv City. The full extent of the damage is unknown. \nThis plant was previously targeted on July 12, 2025.\nCoordinates: 49.842332, 24.002155\nEdit: I'm aware the geolocation proof is wrong. The coordinates are correct though.",
      "timestamp": "2025-08-21T11:37:50.286727Z"
    },
    {
      "original": "Last night, 3-4 Russian Kh-101 cruise missiles impacted the Motor Sich Plant in Zaporizhzhia City. \nLocals report that Building 113 was the main target, which was used for producing engines for aircraft, drones and other light aviation. A large fire broke out afterwards.",
      "timestamp": "2025-08-21T11:37:50.286731Z"
    },
    {
      "original": "Russian forces have captured the village of Bezsalivka, Bilopillya direction, Sumy Oblast. \nPre-war population: ~60.\nTotal land area: ~0.62km².",
      "timestamp": "2025-08-21T11:37:50.286740Z"
    },
    {
      "original": "Russian forces have captured the town of Shcherbynivka, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~3,266.\nTotal land area: ~5.92km².",
      "timestamp": "2025-08-21T11:37:50.286744Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Andriivka-Klevtsove, Prosyana direction, Donetsk Oblast.\nPre-war population: ~777.\nTotal land area: ~3.66km².",
      "timestamp": "2025-08-21T11:37:50.286748Z"
    },
    {
      "original": "Russian forces have captured the village of Novoheorhiivka, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~34.\nTotal land area: ~0.25km²",
      "timestamp": "2025-08-21T11:37:50.286753Z"
    },
    {
      "original": "Military Situation In Ukraine On August 20, 2025 (Map Updpate)",
      "timestamp": "2025-08-21T11:37:50.816767Z"
    },
    {
      "original": "Military Situation In Ukraine On August 20, 2025 (Map Updpate)",
      "timestamp": "2025-08-21T11:37:50.816781Z"
    },
    {
      "original": "Russian Hackers Reveal: Ukrainian Military Losses Exceeded 1.7 Million (18+) \nA coalition of Russian-aligned hacker groups claims to have obtained classified data from the Ukrainian General Staff indicating the country’s officially recorded military losses have exceeded a staggering 1.7 million personnel. \nThe information, extracted through a sophisticated cyber operation, paints a grim picture of Ukraine’s human cost since the beginning of the conflict.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816790Z"
    },
    {
      "original": "Russian Hackers Reveal: Ukrainian Military Losses Exceeded 1.7 Million (18+) \nA coalition of Russian-aligned hacker groups claims to have obtained classified data from the Ukrainian General Staff indicating the country’s officially recorded military losses have exceeded a staggering 1.7 million personnel. \nThe information, extracted through a sophisticated cyber operation, paints a grim picture of Ukraine’s human cost since the beginning of the conflict.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816798Z"
    },
    {
      "original": "War Crime On Pokrovsk Front 18+: Ukrainian Soldier Executes Civilian Woman Near Rodinskoe \nAnother horrific video has emerged from Ukrainian front lines several days ago. It clearly Ukrainian soldier committing an egregious war crime against an unarmed civilian woman near Rodinskoe. \nThe footage, which began circulating last week, depicts a uniformed serviceman of the Armed Forces of Ukraine (AFU) shooting a woman at point-blank range on a roadside.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816805Z"
    },
    {
      "original": "Military Situation In Palestine On August 20, 2025 (Map Update)",
      "timestamp": "2025-08-21T11:37:50.816809Z"
    },
    {
      "original": "Russia’s Most Armed Nuclear Battlecruiser Takes To Waters On Trails (Video)\nThe heavy nuclear-powered nuclear-powered battlecruiser Admiral Nakhimov has taken to waters for trials after repairs and a major upgrade, a source in the domestic shipbuilding industry told TASS on August 18.\nAdmiral Nakhimov has been under repairs since 1999. Real work on the battlecruiser, including the integration of new weapon systems, has been carried out since 2013. Earlier in the year, the 28,000-ton warship’s two nuclear reactors went back online.\nAdmiral Nakhimov’s upgrade is centered around a plan to install 174 vertical launch cells, which would provide it with more than any other warship or submarine in the world.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816816Z"
    },
    {
      "original": "Syria Says No ‘Corridor’ For Druze As More Crimes Are Unveiled (+18 Photos, Videos)\nThere will be no “cross-border humanitarian corridor” to al-Suwayda, a Syrian official told the state-run Syrian Arab News Agency (SANA) on August 20, effectively denying recent reports of a plan to ship aid directly from Israel to Druze in the southern Syrian governorate.\nIsrael intervened in al-Suwayda last month, stopping an attack on the governorate by the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes.\nThe intervention, which granted Druze de-facto control over much of the governorate, was justified by Israel’s historic relationship with its own Druze community.\nSince then, the government put al-Suwayda under siege, allowing the entry of limited supplies each day. Reports later revealed a plan backed by the United States, which brokered a ceasefire in the governorate, to open an aid corridor from Israel to al-Suwayda.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816825Z"
    },
    {
      "original": "Syria Says No ‘Corridor’ For Druze As More Crimes Are Unveiled (+18 Photos, Videos)\nThere will be no “cross-border humanitarian corridor” to al-Suwayda, a Syrian official told the state-run Syrian Arab News Agency (SANA) on August 20, effectively denying recent reports of a plan to ship aid directly from Israel to Druze in the southern Syrian governorate.\nIsrael intervened in al-Suwayda last month, stopping an attack on the governorate by the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes.\nThe intervention, which granted Druze de-facto control over much of the governorate, was justified by Israel’s historic relationship with its own Druze community.\nSince then, the government put al-Suwayda under siege, allowing the entry of limited supplies each day. Reports later revealed a plan backed by the United States, which brokered a ceasefire in the governorate, to open an aid corridor from Israel to al-Suwayda.\nRead more: \nHERE",
      "timestamp": "2025-08-21T11:37:50.816837Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 20, 2025\nOn August 20, several videos documenting some of the Russian military recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-21T11:37:50.816844Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 20, 2025\nOn August 20, several videos documenting some of the Russian military recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-21T11:37:50.816850Z"
    },
    {
      "original": "BEYOND THE BATTLEFIELD: WHY RUSSIA IS BOMBING AZERBAIJANI OIL IN UKRAINE",
      "timestamp": "2025-08-21T11:37:50.816853Z"
    },
    {
      "original": "Ukrainian Secret Service Strives To Use Russian Pensioners As Suicide Bombers\nUsing elderly people for terrorist purposes is evidence of the weakness and desperation of the Kiev regime, particularly the Ukrainian intelligence services. Although such methods are vile and cruel, they will not succeed in destabilizing Russian society, which has faced much terrorism perpetrated by the Ukrainian side.\nRussia’s Federal Security Service (FSB) accused the Security Service of Ukraine, the Main Intelligence Directorate of the Ministry of Defense of Ukraine, and Ukrainian nationalist structures of recruiting elderly Russian women as suicide bombers through online fraud and psychological manipulation.\nAccording to the FSB, five elderly women were tricked into selling their homes and losing their savings via calls on Telegram and WhatsApp. The women were then allegedly instructed to track the homes and vehicles of Russian servicemen and deliver improvised explosive devices disguised as household items.\nRead more \nHERE",
      "timestamp": "2025-08-21T11:37:50.816861Z"
    },
    {
      "original": "In Video: Russian German Drone Hit Ukrainian HIMARS Launch Site\nThe Russian military has targeted a forest where Kiev forces deployed a United States-made M142 HIMARS multiple rocket launcher with Geran suicide drones.\nThe system carried out a launch from the small forest, located near the settlement of Rohivka in the Chernihiv direction, before getting detected. The launch site was quickly then targeted with at least two Geran drones. Footage of the strike posted to social networks on August 20 showed multiple secondary explosions after the strike. Rocket pods were clearly destroyed, although the fate of the launcher remains unclear.\nRead more \nHERE",
      "timestamp": "2025-08-21T11:37:50.816869Z"
    }
  ],
  "script_run_time": "2025-08-21T11:37:50.817867Z"
}