{
  "messages": [
    {
      "original": "🛵\nБпЛА в південно-західній частині Чернігівщини, курсом на Київщину.\n🛵\nБпЛА в північній частині Чернігівщини, курс південно-західний.\n🛵\nБпЛА в західній та південній частині Сумщини, постійно змінюють напрямок.",
      "timestamp": "2025-09-21T18:47:00.725801Z"
    },
    {
      "original": "Швидкісна ціль на Сумщині, курс південно-західний.",
      "timestamp": "2025-09-21T18:47:00.725818Z"
    },
    {
      "original": "🚀\nРакети в напрямку Хотінь/ Білопілля на Сумщині.",
      "timestamp": "2025-09-21T18:47:00.725824Z"
    },
    {
      "original": "🛵\nБпЛА в західній частині Чернігівщини, курс південно-західний.",
      "timestamp": "2025-09-21T18:47:00.725829Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на східному напрямку!",
      "timestamp": "2025-09-21T18:47:00.725833Z"
    },
    {
      "original": "🛵\nБпЛА в східній частині Сумщини, курс південно-східний.\n🛵\nБпЛА в південно-східній частині Харківщини, курс південно-західний.",
      "timestamp": "2025-09-21T18:47:00.725839Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА в акваторії Чорного моря в напрямку Одещини  (Білгород-Дністровський р-н).  Залучено засоби для його збиття.",
      "timestamp": "2025-09-21T18:47:00.725844Z"
    },
    {
      "original": "🛵\nБпЛА в східній частині Дніпропетровщини та Харківщини,  курс західний.",
      "timestamp": "2025-09-21T18:47:00.725848Z"
    },
    {
      "original": "🛵\nБпЛА з Сумщини, курсом на Полтавщину.\n🛵\nБпЛА на межі Харківщини та Дніпропетровщини, курс західний.\n🛵\nБпЛА в східній частині Дніпропетровщини, курс східний.\n🛵\nБпЛА в західній частині Запоріжжя, курс південно-західний.",
      "timestamp": "2025-09-21T18:47:00.725857Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-21T18:47:00.725862Z"
    },
    {
      "original": "🛵\nБпЛА з Сумщини, курсом на Чернігівщину.\n🛵\nБпЛА в північній частині Полтавщини, курс південний.\n🛵\nБпЛА в східній частині Сумщини, курс південний.\n🛵\nБпЛА в південній частині Харківщини, курс південно-західний.\n🛵\nБпЛА в східній та північній частинах Дніпропетровщини, курс західний.",
      "timestamp": "2025-09-21T18:47:00.725873Z"
    },
    {
      "original": "🛵\nБпЛА в східній частині Сумщини, курс південно-західний.\n🛵\nБпЛА в північній та південно-західній частинах Полтавщини, курс південно-західний.\n🛵\nБпЛА в південній частині Харківщини, курс західний.\n🛸\n Ворожий розвідувальний БпЛА в акваторії Чорного моря в напрямку Одещини  (Білгород-Дністровський р-н).  Залучено засоби для його збиття.",
      "timestamp": "2025-09-21T18:47:00.725881Z"
    },
    {
      "original": "🛵\nБпЛА в північній частині Чернігівщини, курс південно-західний.",
      "timestamp": "2025-09-21T18:47:00.725886Z"
    },
    {
      "original": "🛵\nБпЛА в північній частині Чернігівщини, курс південно-західний.\n🛵\nБпЛА в центральній та західній частинах Харківщини, курс південно-західний.\n🛵\nБпЛА в центральній частині Сумщини, курс північний.\n🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-09-21T18:47:00.725894Z"
    },
    {
      "original": "🛵\nБпЛА в східній частині Чернігівщини (Гончарівське), постійно змінюють напрямок руху.\n🛵\nБпЛА в південній частині Харківщини, курсом на Полтавщину.\n🛵\nБпЛА на межі Запоріжжя та Дніпропетровщини, курсом на Нікопольський район.",
      "timestamp": "2025-09-21T18:47:00.725902Z"
    },
    {
      "original": "🛵\nБпЛА в східній частині Миколаївщини, курс західний.\n🛵\nБпЛА в східній частині Чернігівщини (Гончарівське), постійно змінюють напрямок руху.\n🛵\nБпЛА в східній частині Чернігівщини, курс західний.\n🛵\nБпЛА в Нікопольському районі Дніпропетровщини, курс західний.",
      "timestamp": "2025-09-21T18:47:00.725910Z"
    },
    {
      "original": "🛵\nБпЛА в північній частині Чернігівщини, курс південно-західний.\n🛵\nБпЛА в східній частині Харківщини, курс західний.\n🛵\nБпЛА в північній частині Запоріжжя, постійно змінюють напрямок руху.\n🛵\nБпЛА в Нікопольському районі Дніпропетровщини, курс західний.\n🛵\nБпЛА в південній частині Миколаївщини, курс західний.\n🛬\n Активність ворожої тактичної авіації  на східному та північно-східному напрямках!",
      "timestamp": "2025-09-21T18:47:00.725921Z"
    },
    {
      "original": "🛵\nБпЛА в північній частині Чернігівщини, курс південно-західний. \n🛵\nБпЛА в східній частині Харківщини, курс західний. \n🛵\nБпЛА в північній частині Запоріжжя, постійно змінюють напрямок руху. \n🛵\nБпЛА в Нікопольському районі Дніпропетровщини, курс західний. \n🛵\nБпЛА в…",
      "timestamp": "2025-09-21T18:47:00.725931Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину (Куп'янський район).",
      "timestamp": "2025-09-21T18:47:00.725935Z"
    },
    {
      "original": "🛵\nБпЛА в напрямку Чернігова зі сходу.",
      "timestamp": "2025-09-21T18:47:00.725939Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-21T18:47:00.725943Z"
    },
    {
      "original": "Interesting...",
      "timestamp": "2025-09-21T18:47:01.137390Z"
    },
    {
      "original": "Russian forces have captured the village of Berezove, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: 585.\nTotal land area: ~2.43 km².",
      "timestamp": "2025-09-21T18:47:01.137407Z"
    },
    {
      "original": "Russian forces have captured the village of Shandryholove, Lyman direction, Donetsk Oblast.\nPre-war population: ~1,040.\nTotal land area: 3.47 km².",
      "timestamp": "2025-09-21T18:47:01.137413Z"
    },
    {
      "original": "In the Dobropillya - Druzhkivka direction, both Russian and Ukrainian forces have advanced, making significant progress. \nUkrainian forces continued their attempts at cutting off the Russian salient to Kucheriv Yar. Prior to these attacks, Ukrainian forces regained control over Dorozhnje and the section of railway line to the south, sometime in the past two weeks. They also cleared the remaining Russian DRGs from the eastern approaches of Bilytske. Once they secured their position in the western part of Nykanorivka, Ukrainian forces pushed southwest and downhill through the treelines on the tactical heights to the western outskirts of Boikivka, where fighting is ongoing for a large trench fortification and nearby forests. \nOn the eastern flank of the salient, Ukrainian forces continued to slowly advance south down the eastern bank of the Kazenyi Torets River and gained a foothold in the northern houses of Novotoretske. They also pushed southeast down a gulley and recaptured the treelines on the heights to the north. West of the Kazenyi Torets River, the Ukrainians recaptured most of Pankivka, and began attacking west towards the Hektova Balka Gulley, supporting the flanking attacks further south. They were able to capture a forest and improve their positions along the treelines running west.\nIn the northern part of the Kucheriv Yar salient, Ukrainian forces continued to advance on Kucheriv Yar, and crossed the Hruzka River at a new point, capturing a U-shaped treeline and gaining a foothold at the southern part of the adjacent chalk quarry. Russian forces continued their assault operations in eastern Nove Shakhove. \nMeanwhile, further east, Russian forces began pushing back from the Popiv Yar area, recapturing previously lost positions in the forested areas north and west of the chalk quarries. The Ukrainians are attempting to counterattack here. \nTo the north, Russian forces significantly intensified their assault operations in the direction of Druzhkivka - possibly marking the beginning of a new offensive. Here, they advanced up both banks of the Poltavka River, capturing treeline positions on the heights to the west, as well as positions in the forests and treelines up to the gulley east of the river. Attacks are also once again underway towards the gulley leading to Sofiivka, although it's unclear how successful they were due to sentinel satellite imagery being completely obscured with clouds. \n+ ~28.14 km² in favour of Ukraine. \n+ ~14.00 km² in favour of Russia.",
      "timestamp": "2025-09-21T18:47:01.137422Z"
    },
    {
      "original": "Russian Su-34s are flying towards their launch lines in Kherson Oblast, likely to launch KAB glide-bombs. They are currently flying over the Rozdolne area of Crimea.",
      "timestamp": "2025-09-21T18:47:01.137425Z"
    },
    {
      "original": "Russian Su-34s are flying towards their launch lines in Kherson Oblast, likely to launch KAB glide-bombs. They are currently flying over the Rozdolne area of Crimea.",
      "timestamp": "2025-09-21T18:47:01.137429Z"
    },
    {
      "original": "They are now approaching Chaplynka, Kherson Oblast. They will launch glide-bombs in the next few minutes.",
      "timestamp": "2025-09-21T18:47:01.137432Z"
    },
    {
      "original": "They are now approaching Chaplynka, Kherson Oblast. They will launch glide-bombs in the next few minutes.",
      "timestamp": "2025-09-21T18:47:01.137435Z"
    },
    {
      "original": "KAB launches to the village of Inhulets once again.",
      "timestamp": "2025-09-21T18:47:01.137438Z"
    },
    {
      "original": "KAB launches to the village of Inhulets once again.",
      "timestamp": "2025-09-21T18:47:01.137441Z"
    },
    {
      "original": "A Russian recon drone is filming. The KABs will impact shortly.",
      "timestamp": "2025-09-21T18:47:01.137444Z"
    },
    {
      "original": "A Russian recon drone is filming. The KABs will impact shortly.",
      "timestamp": "2025-09-21T18:47:01.137447Z"
    },
    {
      "original": "Explosions in Inhulets.",
      "timestamp": "2025-09-21T18:47:01.137450Z"
    },
    {
      "original": "Explosions in Inhulets.",
      "timestamp": "2025-09-21T18:47:01.137453Z"
    },
    {
      "original": "The Su-34s are returning to Crimea with a Su-35 covering them.",
      "timestamp": "2025-09-21T18:47:01.137456Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance towards the Yanchur River, and have captured numerous new positions in a previously static section of the frontline.\nRussian forces advanced on a front from Malynivka to Stepove, pushing along several different treelines towards the Yanchur River, significantly shrinking Ukraine's zone of control east of it. \nThey also pushed northwest along the treelines on the southern bank of the Solona River, and established control over the village of Olhivske. Ukrainian forces have withdrawn to the northern approaches of Poltavka, where fighting is ongoing.\n+ ~20.90 km² in favour of Russia.",
      "timestamp": "2025-09-21T18:47:01.137467Z"
    },
    {
      "original": "Rocket launches from Gaza",
      "timestamp": "2025-09-21T18:47:01.137471Z"
    },
    {
      "original": "Sirens in Ashdod City. These are likely medium-range rockets.",
      "timestamp": "2025-09-21T18:47:01.137474Z"
    },
    {
      "original": "Interceptor launches",
      "timestamp": "2025-09-21T18:47:01.137477Z"
    },
    {
      "original": "Interception over Ashdod",
      "timestamp": "2025-09-21T18:47:01.137480Z"
    },
    {
      "original": "2 rockets have been intercepted.",
      "timestamp": "2025-09-21T18:47:01.137483Z"
    },
    {
      "original": "These seem to be the only two rockets launched. Both were intercepted by the Iron Dome.",
      "timestamp": "2025-09-21T18:47:01.137487Z"
    },
    {
      "original": "No casualties reported. Alerts will be lifted shortly.",
      "timestamp": "2025-09-21T18:47:01.137491Z"
    },
    {
      "original": "Correction: 3 rockets were launched. 1 impacted in Ashdod.",
      "timestamp": "2025-09-21T18:47:01.137494Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to steadily advance west through Zaporizhzhia and Dnipropetrovsk Oblast, and have made progress in three areas.\nIn the south, Russian forces continued pushing west along the road from Temyrivka and entered the southeastern houses of Novoivanivka. Supporting attacks were made through the treelines on the tactical heights south of Novoivanivka, resulting in the southern part of the village being quickly captured. Other forces then captured the northern streets as well as the southern ends of the adjacent treelines. From there, Russian forces went on to push northwest along the treelines in the low-lying ground towards the eastern outskirts of Novohryhorivka, capturing positions there and on the heights to the south. They were also able to eliminate the small Ukrainian salient south of Novomykolaivka, capturing the treelines and forested areas there. \nFurther north, Russian forces stormed Berezove from the east, and after brief consolidation efforts, captured the rest of the village and entered the treelines to the north. Other assault groups advanced along the treelines southwest of Berezove, and reached the northeastern outskirts of Kalynivske where they secured the main Ukrainian defensive node in the area. \nIn the north, after a period of fighting, Russian forces cleared out the encircled Ukrainian soldiers in the western part of Sichneve, finally bringing the village under their control. They also captured the treelines in the grey zone west of the settlement.\n+ ~31.72 km² in favour of Russia.",
      "timestamp": "2025-09-21T18:47:01.137500Z"
    }
  ],
  "script_run_time": "2025-09-21T18:47:01.519116Z"
}