{
  "messages": [
    {
      "original": "🛵\n БпЛА на Харківщині, курсом на південь.\n🛵\n група БпЛА на Чернігівщині, курсом на південь та північ.\n🛵\n БпЛА на півночі Київщини, курсом на південь.",
      "timestamp": "2025-10-25T22:41:27.533311Z"
    },
    {
      "original": "🛵\n нова група БпЛА на межі Чернігівщини та Сумщини, курс південний.",
      "timestamp": "2025-10-25T22:41:27.533325Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-10-25T22:41:27.533331Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини!",
      "timestamp": "2025-10-25T22:41:27.533335Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину",
      "timestamp": "2025-10-25T22:41:27.533339Z"
    },
    {
      "original": "🚀\n КАБ на Донеччину",
      "timestamp": "2025-10-25T22:41:27.533344Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півночі.",
      "timestamp": "2025-10-25T22:41:27.533352Z"
    },
    {
      "original": "🛵\n нова група БпЛА на півночі Сумщини та Чернігівщини, курсом на південний захід.",
      "timestamp": "2025-10-25T22:41:27.533358Z"
    },
    {
      "original": "🛵\n група БпЛА на Донеччині, курсом на Дніпропетровщину.",
      "timestamp": "2025-10-25T22:41:27.533362Z"
    },
    {
      "original": "🛵\n група БпЛА на півночі Чернігівщини, курсом на захід.",
      "timestamp": "2025-10-25T22:41:27.533367Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, курсом на Полтавщину.",
      "timestamp": "2025-10-25T22:41:27.533371Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину",
      "timestamp": "2025-10-25T22:41:27.533375Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курсом на південний-захід.\n🛵\n БпЛА на Харківщині, курсом на південь.",
      "timestamp": "2025-10-25T22:41:27.533381Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Запоріжжя, курсом на північний-схід.",
      "timestamp": "2025-10-25T22:41:27.533386Z"
    },
    {
      "original": "🚀\n КАБ на Донеччині",
      "timestamp": "2025-10-25T22:41:27.533390Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курсом на Дніпропетровщину.",
      "timestamp": "2025-10-25T22:41:27.533394Z"
    },
    {
      "original": "🛵\n група БпЛА на Херсонщині, в північно-західному напрямку.",
      "timestamp": "2025-10-25T22:41:27.533398Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курс південно-західний..\n🛵\n група БпЛА на Харківщині \n➡️\n в напрямку Дніпропетровщини.\n🛵\n група БпЛА на сході Миколаївщини \n➡️\n курсом на північ.\n🛵\n БпЛА на півночі Дніпропетровщини \n➡️\n курсом на захід.",
      "timestamp": "2025-10-25T22:41:27.533423Z"
    },
    {
      "original": "🛵\n група БпЛА на Кіровоградщині \n➡️\n в північно-західному напрямку.",
      "timestamp": "2025-10-25T22:41:27.533428Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря, курсом на Одещину.",
      "timestamp": "2025-10-25T22:41:27.533434Z"
    },
    {
      "original": "Last night, a series of Russian attacks were carried out on Kharkiv Oblast.\n15 Russian Geran-2 drones struck a target in the area of Pivdenne, just south of Kharkiv City. Media 1 & 2 show some of the explosions that were seen from Kharkiv City. At least 3 Geran-2 drones also impacted the railway station in the city of Lozova. \nAdditionally, 6 KAB glide-bombs targeted the industrial zone in northern Kharkiv, as seen in Media 3. The full extent of the damage here is unknown, but 13 civilians were injured due to damage to surrounding apartment buildings.",
      "timestamp": "2025-10-25T22:41:28.317901Z"
    },
    {
      "original": "Last night, a series of Russian attacks were carried out on Kharkiv Oblast.\n15 Russian Geran-2 drones struck a target in the area of Pivdenne, just south of Kharkiv City. Media 1 & 2 show some of the explosions that were seen from Kharkiv City. At least 3 Geran-2 drones also impacted the railway station in the city of Lozova. \nAdditionally, 6 KAB glide-bombs targeted the industrial zone in northern Kharkiv, as seen in Media 3. The full extent of the damage here is unknown, but 13 civilians were injured due to damage to surrounding apartment buildings.",
      "timestamp": "2025-10-25T22:41:28.317914Z"
    },
    {
      "original": "Consequences of the two Russian Iskander-M ballistic missile strikes on Ukrainian energy infrastructure in Kyiv.",
      "timestamp": "2025-10-25T22:41:28.317918Z"
    },
    {
      "original": "Despite firefighting efforts, a massive fire continues to burn in eastern Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T22:41:28.317922Z"
    },
    {
      "original": "Despite firefighting efforts, a massive fire continues to burn in eastern Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T22:41:28.317925Z"
    },
    {
      "original": "Last night, several Ukrainian UAVs attacked the Ryazan Oil Refinery in Ryazan Oblast.   At least two impacts were recorded, including 1 in the area of the hydrotreating unit and another the AVT-2 primary oil processing unit. Some sources reported that \"Peklo\"…",
      "timestamp": "2025-10-25T22:41:28.317929Z"
    },
    {
      "original": "Reuters reports that due to the repeated Ukrainian drone strikes on the Ryazan Oil Refinery, the refinery has shut down its main oil processing unit (ATV-4) for three months. \nThis unit can produce as much as 4 million metric tons of fuel per year (80,000 barrels per day), which equates to 35-50% of the refinery's total production capacity. In addition to this, nearby units such as a reformer, gasoil hydrotreater, and catalytic cracker were also reportedly temporarily halted due to the damage sustained. \nThe Ryazan Oil Refinery is the fourth largest in Russia, and processes approximately 5% of Russia's total refinery output.",
      "timestamp": "2025-10-25T22:41:28.317934Z"
    },
    {
      "original": "Overnight, 2 Russian Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Diaghilev Airbase, Ryazan Oblast.\nOne An-124-100 \"Ruslan\" cargo plane landed at Diaghilev Airbase, carrying Kh-101 cruise missiles for the Tu-95MS. To my knowledge, this is the first recorded instance of Russia using Diaghilev Airbase to equip their bombers. \nMeanwhile, 1 Tu-95MS is stationed at Olenya Airbase, Murmansk Oblast, and 3 are at Engels-2 Airbase, Saratov Oblast. 2 Tu-160s are also stationed at Engels-2. All of these aircraft are equipped with missiles.\nThere is an increased possibility of the next large-scale, combined missile attack on Ukraine taking place tonight, as large launches of Geran-2 drones are expected to take place.",
      "timestamp": "2025-10-25T22:41:28.317940Z"
    },
    {
      "original": "My interview with AMK mapping is now up.\nhttps://youtu.be/pl3bA4Xh9sI?si=q_LkZzJQN1BnSnKl",
      "timestamp": "2025-10-25T22:41:28.317948Z"
    },
    {
      "original": "My interview with AMK mapping is now up.  https://youtu.be/pl3bA4Xh9sI?si=q_LkZzJQN1BnSnKl",
      "timestamp": "2025-10-25T22:41:28.317952Z"
    },
    {
      "original": "This is my fourth episode on Kalibrated, and its interesting seeing how my views have evolved over time since the first time I appeared on the show in June 2024.",
      "timestamp": "2025-10-25T22:41:28.317956Z"
    },
    {
      "original": "Overnight, 2 Russian Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Diaghilev Airbase, Ryazan Oblast.  One An-124-100 \"Ruslan\" cargo plane landed at Diaghilev Airbase, carrying Kh-101 cruise missiles for the Tu-95MS. To my knowledge…",
      "timestamp": "2025-10-25T22:41:28.317959Z"
    },
    {
      "original": "There is a significant chance of Russia launching a large-scale, combined missile and drone attack on Ukraine tonight. \nSo far, launches of Geran-2 drones have been recorded (not confirmed) from Millerovo Airbase, Rostov Oblast, and Primorsko-Akhtarsk Airbase, Krasnodar Krai. Additional preparations for launches of Gerna-2/3 drones has been recorded from Navlya Test Site, Bryansk Oblast.\nDue to recent accumulations of Geran-2 drones at Millerovo Airbase, the numbers of drones launched from here alone could reach as high as 100. \nAdditionally, due to recent deliveries of missiles, there is a high threat of Iskander-M ballistic missile and Iskander-K cruise missile launches from OTRK installations in Bryansk Oblast, Kursk Oblast, and Voronezh Oblast.",
      "timestamp": "2025-10-25T22:41:28.317965Z"
    },
    {
      "original": "For the second time this week, a Russian BM-35 drone struck a wind turbine in Kramatorsk, Donetsk Oblast. No new power outages are reported.",
      "timestamp": "2025-10-25T22:41:28.317968Z"
    },
    {
      "original": "A Russian BM-35 drone has struck a wind turbine near Kramatorsk, Donetsk Oblast for the third time this week.",
      "timestamp": "2025-10-25T22:41:28.317971Z"
    },
    {
      "original": "There is a significant chance of Russia launching a large-scale, combined missile and drone attack on Ukraine tonight.   So far, launches of Geran-2 drones have been recorded (not confirmed) from Millerovo Airbase, Rostov Oblast, and Primorsko-Akhtarsk Airbase…",
      "timestamp": "2025-10-25T22:41:28.317974Z"
    },
    {
      "original": "Over the past 48 hours, as many as 4 Russian MiG-31Ks have been re-equipped with Kinzhal aeroballistic missiles at Akhtubinsk Airbase, Astrakhan Oblast. They may be used tonight.",
      "timestamp": "2025-10-25T22:41:28.317977Z"
    },
    {
      "original": "Over the past 48 hours, as many as 4 Russian MiG-31Ks have been re-equipped with Kinzhal aeroballistic missiles at Akhtubinsk Airbase, Astrakhan Oblast. They may be used tonight.",
      "timestamp": "2025-10-25T22:41:28.317980Z"
    },
    {
      "original": "Here is a map showing the known locations where Russian Iskander-M and Iskander-K OTRK installations are usually situated, as well as the current operational Geran-2 launch points.",
      "timestamp": "2025-10-25T22:41:28.317983Z"
    },
    {
      "original": "Radio activity connected to Russian strategic bombers is recorded at Engels-2 Airbase.",
      "timestamp": "2025-10-25T22:41:28.317988Z"
    },
    {
      "original": "Launches of Russian Geran-2 drones have been recorded from Tsumbulova Test Site, Oryol Oblast. Additional preparations for Geran launches are taking place at Khalino Airbase, Kursk Oblast.",
      "timestamp": "2025-10-25T22:41:28.317991Z"
    },
    {
      "original": "Radio activity connected to Russian strategic bombers is recorded at Engels-2 Airbase.",
      "timestamp": "2025-10-25T22:41:28.317994Z"
    },
    {
      "original": "There are continued communications between Moscow and Engels-2 Airbase. Additional activity is recorded at Diaghilev Airbase, which is also communicating with Moscow. These are taking place on combat-related frequencies.\nDepartures of at least five Tu-95MS bombers are expected in the next few hours.",
      "timestamp": "2025-10-25T22:41:28.317998Z"
    },
    {
      "original": "There are continued communications between Moscow and Engels-2 Airbase. Additional activity is recorded at Diaghilev Airbase, which is also communicating with Moscow. These are taking place on combat-related frequencies.  Departures of at least five Tu-95MS…",
      "timestamp": "2025-10-25T22:41:28.318001Z"
    },
    {
      "original": "There are also 5 Tu-22m3 Strategic bombers stationed at Diaghilev Airbase, which may take part in today's attack. They are all believed to be equipped with Kh-22 cruise missiles.",
      "timestamp": "2025-10-25T22:41:28.318004Z"
    },
    {
      "original": "New Russian turtle tank just dropped.",
      "timestamp": "2025-10-25T22:41:28.318008Z"
    },
    {
      "original": "Over the past 48 hours, as many as 4 Russian MiG-31Ks have been re-equipped with Kinzhal aeroballistic missiles at Akhtubinsk Airbase, Astrakhan Oblast. They may be used tonight.",
      "timestamp": "2025-10-25T22:41:28.318011Z"
    },
    {
      "original": "Additional radio activity is recorded at Akhtubinsk Airbase, Astrakhan Oblast. This is where the 4 equipped MiG-31Ks are currently stationed.\nIt's possible that this activity is not combat-related.",
      "timestamp": "2025-10-25T22:41:28.318017Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers departed from Olenya Airbase, Murmansk Oblast. They are probably redeploying to Engels-2 Airbase.",
      "timestamp": "2025-10-25T22:41:28.318022Z"
    },
    {
      "original": "Currently, the number of Geran-2 drones in Ukrainian remains low, and activity on frequencies is limited.",
      "timestamp": "2025-10-25T22:41:28.318025Z"
    },
    {
      "original": "I have a feeling that there won't be an attack tonight. I will be offline for a while now, but will try to update later on.",
      "timestamp": "2025-10-25T22:41:28.318028Z"
    },
    {
      "original": "Russian Army Advances In Vovchansk, Ukraine Murders Own Troops Near Kupyansk (Videos, Photos)\nOn October 25, the Russian military advanced in Vovchansk, and made a breakthrough close to Kupyansk as Ukraine stepped up efforts to prevent its troops from abandoning their positions in the Khakriv direction.\nThe Sever [North] Group of Forces has reportedly advanced in the western part of Vovchansk, mainly along the streets of Obozna and Zaliznychna. Russian troops are close to blocking the southern entrance of the key settlement, which would prevent Ukraine from sending supplies from Bilyi Kolodyaz.\nMoving to the south in Kharkiv, the Zapad [West] Group of Forces continue to battle Kiev forces inside Kupyansk and in nearby areas.\nMost of the city is already under the control of Russian troops. Ukraine is doing everything possible to force its troops to fight there.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105812Z"
    },
    {
      "original": "Russian Army Advances In Vovchansk, Ukraine Murders Own Troops Near Kupyansk (Videos, Photos)\nOn October 25, the Russian military advanced in Vovchansk, and made a breakthrough close to Kupyansk as Ukraine stepped up efforts to prevent its troops from abandoning their positions in the Khakriv direction.\nThe Sever [North] Group of Forces has reportedly advanced in the western part of Vovchansk, mainly along the streets of Obozna and Zaliznychna. Russian troops are close to blocking the southern entrance of the key settlement, which would prevent Ukraine from sending supplies from Bilyi Kolodyaz.\nMoving to the south in Kharkiv, the Zapad [West] Group of Forces continue to battle Kiev forces inside Kupyansk and in nearby areas.\nMost of the city is already under the control of Russian troops. Ukraine is doing everything possible to force its troops to fight there.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105828Z"
    },
    {
      "original": "Military Situation In Ukraine On October 25, 2025 (Maps Update)",
      "timestamp": "2025-10-25T22:41:29.105833Z"
    },
    {
      "original": "Military Situation In Ukraine On October 25, 2025 (Maps Update)",
      "timestamp": "2025-10-25T22:41:29.105837Z"
    },
    {
      "original": "Ukraine To Get More Outdated Mirage Fighter Jets From France\nFrance will provide Ukraine with additional Mirage 2000-5F fighter jets in the coming days, President Emmanuel Macron announced during a meeting of the so-called “coalition of the willing” on October 24, according to Le Monde.\nMacron was quoted as saying that France would “deliver additional Aster missiles, new training programs, and new Mirage aircraft in the coming days.” He also stressed that it is “very important to continue our efforts to support Ukraine and increase pressure on Russia.”\nFrance has already supplied at least three Mirage 2000-5F fighter jets to Ukraine as a part of an earlier pledge to transfer up to six.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105846Z"
    },
    {
      "original": "Russian Group Strike Leaves Ukrainian Defense Factories, Linked Energy Sites Heavily Damaged (Videos)\nA group strike targeted defense facilities and energy infrastructure that support its work in Ukraine over the night of October 24 and 25, the Russian Ministry of Defense announced.\nThe large-scale strike was carried out in response to “terrorist attacks” launched by Ukraine against civilian facilities on the territory of Russia, the ministry said in a brief statement, noting that “long-range ground-based high-precision weapons” were used.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105854Z"
    },
    {
      "original": "Russian Group Strike Leaves Ukrainian Defense Factories, Linked Energy Sites Heavily Damaged (Videos)\nA group strike targeted defense facilities and energy infrastructure that support its work in Ukraine over the night of October 24 and 25, the Russian Ministry of Defense announced.\nThe large-scale strike was carried out in response to “terrorist attacks” launched by Ukraine against civilian facilities on the territory of Russia, the ministry said in a brief statement, noting that “long-range ground-based high-precision weapons” were used.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105861Z"
    },
    {
      "original": "Frontline Expansion In Ukraine: Russian Forces Enter Outskirts Of Krasny Lyman And Konstantinovka\nRussian units are consolidating their position in an area of Krasny Lyman. The Ukrainian Armed Forces have begun to withdraw from Pokrovsk after losing control of Rodynske. The Ukrainian command is deploying new unmanned aerial vehicle units to the Sumy area. \nUnited States President Donald Trump has announced his intention to enlist China's help in pressuring Russia.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105868Z"
    },
    {
      "original": "Frontline Expansion In Ukraine: Russian Forces Enter Outskirts Of Krasny Lyman And Konstantinovka\nRussian units are consolidating their position in an area of Krasny Lyman. The Ukrainian Armed Forces have begun to withdraw from Pokrovsk after losing control of Rodynske. The Ukrainian command is deploying new unmanned aerial vehicle units to the Sumy area. \nUnited States President Donald Trump has announced his intention to enlist China's help in pressuring Russia.\nRead more \nHERE",
      "timestamp": "2025-10-25T22:41:29.105876Z"
    }
  ],
  "script_run_time": "2025-10-25T22:41:29.106712Z"
}