{
  "messages": [
    {
      "original": "🛵\n БпЛА у бік Полтави з північного сходу.",
      "timestamp": "2025-11-21T15:36:31.527103Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на сході!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-21T15:36:31.527120Z"
    },
    {
      "original": "🛵\nБпЛА з акваторії Чорного моря  у напрямку Миколаївщини/Одещини!",
      "timestamp": "2025-11-21T15:36:31.527125Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА із акваторії Чорного моря \n➡️\n курсом на Одесу/Чорноморськ!",
      "timestamp": "2025-11-21T15:36:31.527140Z"
    },
    {
      "original": "🛵\n Одеса - перебувайте в укриттях, в напрямку міста ударні БпЛА.",
      "timestamp": "2025-11-21T15:36:31.527144Z"
    },
    {
      "original": "Ворожий БпЛА у Білоцерківському районі Київщини північніше Кагарлика, курс - південно-західний.",
      "timestamp": "2025-11-21T15:36:31.527150Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на сході та північному сході!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей! Пуски КАБ на Донеччину та Сумщину.",
      "timestamp": "2025-11-21T15:36:31.527156Z"
    },
    {
      "original": "🚀\n КАБи на південь Сумщини.",
      "timestamp": "2025-11-21T15:36:31.527160Z"
    },
    {
      "original": "БпЛА із Чорного моря \n➡️\n курсом на Одесу!",
      "timestamp": "2025-11-21T15:36:31.527165Z"
    },
    {
      "original": "🚀\n КАБ на Харківщину з півночі.",
      "timestamp": "2025-11-21T15:36:31.527170Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-21T15:36:31.527174Z"
    },
    {
      "original": "🛵\n БпЛА  на півночі Сумщини рухаються у південному напрямку вектором на Шостку/Глухів.\n🛵\n БпЛА у Білопільському районі Сумщини рухаються у південному напрямку.",
      "timestamp": "2025-11-21T15:36:31.527180Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА із акваторії Чорного моря \n➡️\n курсом на Одесу/Чорноморськ!",
      "timestamp": "2025-11-21T15:36:31.527185Z"
    },
    {
      "original": "🛵\n БпЛА  на сході та півночі Сумщини рухаються у південно-східному напрямку  на Харкіщину.",
      "timestamp": "2025-11-21T15:36:31.527189Z"
    },
    {
      "original": "🛵\n БпЛА наближаються до Одеси з Чорного моря.",
      "timestamp": "2025-11-21T15:36:31.527193Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини, курс південний",
      "timestamp": "2025-11-21T15:36:31.527197Z"
    },
    {
      "original": "🛵\n Група БпЛА на межі Харківської, Сумської, Полтавської областей \n➡️\n курсом на південь.",
      "timestamp": "2025-11-21T15:36:31.527202Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА рухаються східної межі Потавщини у південному напрямку;\n🛵\n БпЛА наближаються до Одеси з Чорного моря з південно-східного напрямку.",
      "timestamp": "2025-11-21T15:36:31.527208Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА перебувають в центральні та південній частинах Харківщини, курс південний.",
      "timestamp": "2025-11-21T15:36:31.527212Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА наближається до Харкова з півночі",
      "timestamp": "2025-11-21T15:36:31.527215Z"
    },
    {
      "original": "7 Kh-101 cruise missiles striking a radio equipment factory in Ternopil.",
      "timestamp": "2025-11-21T15:36:32.421368Z"
    },
    {
      "original": "Fighting has once again broken out between STG government forces and the SDF near the town of Ghanem Ali, east of Raqqa.\nThe SDF carried out strikes on ISIS-affiliated FPV drone operators reportedly working for the STG in the surrounding desert, which resulted in clashes subsequently resuming on the frontline east of Ghanem Ali. Earlier fighting also took place in this same area from Saturday through to Monday.",
      "timestamp": "2025-11-21T15:36:32.421381Z"
    },
    {
      "original": "Fighting has once again broken out between STG government forces and the SDF near the town of Ghanem Ali, east of Raqqa.\nThe SDF carried out strikes on ISIS-affiliated FPV drone operators reportedly working for the STG in the surrounding desert, which resulted in clashes subsequently resuming on the frontline east of Ghanem Ali. Earlier fighting also took place in this same area from Saturday through to Monday.",
      "timestamp": "2025-11-21T15:36:32.421385Z"
    },
    {
      "original": "Typical 2025 Ukrainian trench system: completely covered by even 2 meters of dirt, leaving only firing positions and entry/exit sticking out uncovered (anti-drone grates can be added to firing positions but are not always present).\nThis trench in particular was dug behind a natural obstacle, in this case the Yanchur river, and a barbed wire line was added right after the river later on.\nThis trench, while not completely camouflaged despite the similar color of the covering and surrounding dirt, is very sturdy and requires dozens and dozens of FPV strikes to even blast a small hole through, multiple direct artillery strikes or a direct FAB hit. Unfortunately for Ukraine, these trenches were and are mostly left undefended to Russian forces because of the lack of infantry to man them, and the Russians gladly accept them as mid-way accumulation points for further offensive operations, as if they were artificial settlements/basements.\nOnce again, I want to stress that even this way of building is not perfect, and would be only in the case of complete camouflage of the trench system inside a treeline or forest area. Camouflage is everything for a position: if you're found, you're automatically a target and you will, eventually, be destroyed.\nIf you're never found, you can't become a target in the first place, and even ambush attacking infantry under the right conditions. \nThe same video offers even more information: it shows a failed Russian flagging operation. Once again, I advise caution while mapping Russian or Ukrainian advancements by using flags: everything that moves in the battlefield is struck, and even the primary task itself of the flaggers is to record a video and retreat, and not to occupy a new position and definitely not to consolidate it.\nGeolocation: \nhttps://x.com/ukrliberation/status/1990498077749465495\nSource video: \nt.me/svarog_usf/551\nCoordinates: \n47.84848, 36.30634",
      "timestamp": "2025-11-21T15:36:32.421396Z"
    },
    {
      "original": "Typical 2025 Ukrainian trench system: completely covered by even 2 meters of dirt, leaving only firing positions and entry/exit sticking out uncovered (anti-drone grates can be added to firing positions but are not always present).\nThis trench in particular was dug behind a natural obstacle, in this case the Yanchur river, and a barbed wire line was added right after the river later on.\nThis trench, while not completely camouflaged despite the similar color of the covering and surrounding dirt, is very sturdy and requires dozens and dozens of FPV strikes to even blast a small hole through, multiple direct artillery strikes or a direct FAB hit. Unfortunately for Ukraine, these trenches were and are mostly left undefended to Russian forces because of the lack of infantry to man them, and the Russians gladly accept them as mid-way accumulation points for further offensive operations, as if they were artificial settlements/basements.\nOnce again, I want to stress that even this way of building is not perfect, and would be only in the case of complete camouflage of the trench system inside a treeline or forest area. Camouflage is everything for a position: if you're found, you're automatically a target and you will, eventually, be destroyed.\nIf you're never found, you can't become a target in the first place, and even ambush attacking infantry under the right conditions. \nThe same video offers even more information: it shows a failed Russian flagging operation. Once again, I advise caution while mapping Russian or Ukrainian advancements by using flags: everything that moves in the battlefield is struck, and even the primary task itself of the flaggers is to record a video and retreat, and not to occupy a new position and definitely not to consolidate it.\nGeolocation: \nhttps://x.com/ukrliberation/status/1990498077749465495\nSource video: \nt.me/svarog_usf/551\nCoordinates: \n47.84848, 36.30634",
      "timestamp": "2025-11-21T15:36:32.421405Z"
    },
    {
      "original": "Construction of anti-drone nets continues along the remaining logistical routes used by Ukrainian forces in Donetsk Oblast.",
      "timestamp": "2025-11-21T15:36:32.421409Z"
    },
    {
      "original": "Construction of anti-drone nets continues along the remaining logistical routes used by Ukrainian forces in Donetsk Oblast.",
      "timestamp": "2025-11-21T15:36:32.421412Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Danylivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~355.\nTotal land area: ~0.97 km².\nThe Hulyaipole - Pokrovsk'e road is now unblocked, but is still very dangerous to move along.",
      "timestamp": "2025-11-21T15:36:32.421417Z"
    },
    {
      "original": "Russian forces have captured the village of Zatyshshya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~43.\nTotal land area: ~0.59 km².",
      "timestamp": "2025-11-21T15:36:32.421422Z"
    },
    {
      "original": "Russian forces have captured the town of Yampil, Lyman direction, Donetsk Oblast.\nPre-war population: ~2,150.\nTotal land area: ~5.37 km².",
      "timestamp": "2025-11-21T15:36:32.421426Z"
    },
    {
      "original": "— \n🇺🇸\n/\n🇸🇴\n NEW:\n U.S. AFRICOM has attacked Somalia \n97 times\n this year, setting a new record for the highest number of strikes on the country in a single year\nThe strikes, which are framed as attacks on ISIS-Somalia and Al-Shabaab, have not been without civilian casualties.\nAmerican strikes three days ago led to the deaths of at least 12 civilians, including 8 children.\nSomali sources report that grieving families are pressured by authorities to remain silent about the civilians killed by the United States and the U.S.-backed 'Danab Brigade.'\n@Middle_East_Spectator",
      "timestamp": "2025-11-21T15:36:32.421437Z"
    },
    {
      "original": "Explosions in Slovyansk, Donetsk Oblast. Russian KAB glide-bombs are striking the city. More have been launched.",
      "timestamp": "2025-11-21T15:36:32.421440Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance towards Hulyaipole from the northeast, making additional significant progress in several different areas.\nIn the southeast, Russian advances behind Vesele forced the remaining Ukrainian formations stationed in and around the village to withdraw to Zelenyi Hai. Russian forces subsequently took full control over Vesele, and advanced down the treelines to the west.\nTo the west, Russian forces bypassed the village of Zatyshshya from the east, entrenching north of the Kalmychka River. They then crossed the river to the south, capturing treeline positions on the opposite tactical heights, while other forces began pushing to the southwest. The Russians then secured the rest of the positions north of Zatyshshya, began pushing to the northwest of the village, and captured its northern street. Assault groups from the southern bank of the Kalmychka River then entered the southern street of the village from the east, quickly establishing control over it and a section of the road to the south.\nTo the northwest, Russian forces made additional progress along the tactical heights northeast of Hulyaipole, fleshing out the spearhead towards Varvarivka. They secured the agricultural buildings northwest of Zatyshshya and the treelines to the north, before crossing the Velyka Novosilka - Hulyaipole Road, and entering three parallel treelines to the west. Other assault groups secured the rest of the positions north of the gulley west of Yablukove, and advanced southwest and uphill to the other treelines west of the Velyka Novosilka - Hulyaipole Road. \nTo the north, Russian forces continued taking positions in the direction of the Hulyaipole - Pokrovsk'e Road and captured new positions in three separate treelines north of the initial breakthrough to the reservoirs. Meanwhile, DRGs penetrated further west, and came within 500 metres of the Hulyaipole - Pokrovsk'e Road and the village of Varvarivka.\n+ ~24.07 km² in favour of Russia.",
      "timestamp": "2025-11-21T15:36:32.421446Z"
    },
    {
      "original": "In the Pokrovsk'e direction, both Russian and Ukrainian forces have advanced, each advancing in important areas.\nIn the northeast, Russian forces levelled the frontline southwest of Orestopil, capturing new positions in the treelines and forest plantations south of the Vovcha River. \nTo the west, the Russians advanced beyond the gulley north of Oleksiivka, capturing new treeline positions there, and approaching the village of Tykhe from the south. They also advanced to the treeline northeast of Novooleksandrivka, establishing control over it. \nTo the southwest, Russian forces advanced west of Novooleksandrivka and northwest up the nearby road, entering and capturing the village of Hai. They then levelled the frontline between Yehorivka and Hai, capturing positions in six different treelines.\nMeanwhile, new Ukrainian reinforcements brought in from the Orikhiv direction, along with elements of the 425th Separate Assault Regiment \"Skala\" carried out counterattacks on the village of Danylivka, recently captured by Russia. They advanced east from their positions south of Ostapivske, entering the western part of Danylivka. They quickly advanced further eastwards, recapturing the rest of the village in around two days of fighting. Since then, they have infiltrated the western half of neighbouring Yehorivka where fighting is ongoing.\n+ ~18.68 km² in favour of Russia.\n+ ~3.93 km² in favour of Ukraine.",
      "timestamp": "2025-11-21T15:36:32.421453Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continue to advance, making new progress within Novopavlivka. \nAfter securing the town centre and part of the northern streets, Russian forces made some additional progress closer to the Solena River, where they captured new positions in the residential blocks there. \nAdditionally, the Russians were able to successfully cross the Solena River from the highway bridge and captured positions in the residential area surrounding School No. 2. They then went on to advance further northwest, reaching the northwestern outskirts of Novopavlivka, where fighting is ongoing. Ukrainian forces are making extensive use of FPV drones to kill as many of the Russian soldiers who entered the town as possible. Small Ukrainian assault groups are also operating in the area. \n+ ~1.55 km² in favour of Russia.",
      "timestamp": "2025-11-21T15:36:32.421459Z"
    },
    {
      "original": "Teleporting Russians are back!",
      "timestamp": "2025-11-21T15:36:32.421462Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continue to advance and have made new progress north of Pokrovsk and in the Myrnohrad Pocket.\nNorth of Pokrovsk, Russian forces continued to advance and have cleared additional positions in the treelines outside the city. \nIn southern Myrnohrad, following the withdrawal of Ukrainian forces from the southern part of the pocket, Russian forces made additional progress in the southern part of the city. They advanced northwest through the low-rise residential areas, reaching the cemetery and bringing most of the southern low-rise areas under their control. Additionally, they were able to further expand their zone of control in the high-rise buildings of the Zapadny District, capturing at least seven more high-rise buildings, along with School No. 8 and the local kindergarten. \nIn northern Pokrovsk, Russian forces made some more progress in the northeastern high-rise blocks, bypassing the school from the south, capturing an additional four high-rise buildings, and entering the garage cooperatives to the southwest. Additionally, the Russians levelled the frontline north of Myrnohrad, captured most of the rest of the 3-story buildings in the northern districts, and entered the low-rise residential areas in the direction of the city centre.\nIn Rodynske, heavy fighting continues. Russian forces managed to recapture the southern half of the central-most block of 3-story buildings. They also recaptured Memorial Park and consolidated in several buildings on Tsentralna Street. \n+ ~3.13 km² in favour of Russia.",
      "timestamp": "2025-11-21T15:36:32.421472Z"
    },
    {
      "original": "Deepstate, I’m not sure that the SBU would be pleased with you leaking that the Russians have regained the ability to teleport. \nOPSPEC clearly isn’t being respected \n😁",
      "timestamp": "2025-11-21T15:36:32.421477Z"
    },
    {
      "original": "Deepstate, I’m not sure that the SBU would be pleased with you leaking that the Russians have regained the ability to teleport. \nOPSPEC clearly isn’t being respected \n😁",
      "timestamp": "2025-11-21T15:36:32.421483Z"
    },
    {
      "original": "Taking a break from updates today. \nThe interactive map has been updated as usual. \nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=47.99496961985554%2C36.630639615401606&z=11",
      "timestamp": "2025-11-21T15:36:32.421487Z"
    },
    {
      "original": "Israeli Warplanes Fly Over Syria In Clear Show Of Force As Netanyahu Warns Turkey (Videos)\nA formation of Israeli Air Force fighter jets flew over Syria on November 20 in an apparent show of force, as Prime Minister Benjamin Netanyahu made warnings over Turkey’s military presence in the war-torn country.\nThe formation, made up of at least eight fighter jets, entered Syria from the south, flying at a very high altitude. The contrails of the fighter jets were seen in most of the country, all the way from al-Qunitra, Daraa and al-Suwayda in the south, to the capital, Damascus, then Homs and Hama in the center then ending in the west in Tartus and Latakia on the coast.\nIsraeli Public Broadcasting Corporation, Kan, later reported that the sortie was within normal operational parameters and that the fighter jets were conducting intelligence gathering alongside aerial reconnaissance.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157882Z"
    },
    {
      "original": "Israeli Warplanes Fly Over Syria In Clear Show Of Force As Netanyahu Warns Turkey (Videos)\nA formation of Israeli Air Force fighter jets flew over Syria on November 20 in an apparent show of force, as Prime Minister Benjamin Netanyahu made warnings over Turkey’s military presence in the war-torn country.\nThe formation, made up of at least eight fighter jets, entered Syria from the south, flying at a very high altitude. The contrails of the fighter jets were seen in most of the country, all the way from al-Qunitra, Daraa and al-Suwayda in the south, to the capital, Damascus, then Homs and Hama in the center then ending in the west in Tartus and Latakia on the coast.\nIsraeli Public Broadcasting Corporation, Kan, later reported that the sortie was within normal operational parameters and that the fighter jets were conducting intelligence gathering alongside aerial reconnaissance.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157902Z"
    },
    {
      "original": "Indian Tejas Fighter Jet Crashes During Dubai Airshow. Pilot Didn't Escape (Videos, Photos)\nA HAL Tejas fighter jet from the Indian Air Force taking part in a demonstration at the Dubai Air Show crashed on November 21 afternoon, with the pilot failing to eject.\nAccording to multiple reports, the fighter jet went down around 2:10 pm local time while performing an aerial display before a large crowd.\nThe crash resulted in a large fire ball. The pilot was not seen ejecting, and later photos from the scene of the crash indicate that he was killed.\nThe incident reportedly took place as a Lockheed Martin F-35 Lightning II of the United States Air Force was landing after performing its own display.\nMusic accompanying the F-35 show was even still blasting all around the airport when the Tejas slammed into the ground as the crowd gasped in dismay over the tragedy. \nRead more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157911Z"
    },
    {
      "original": "Indian Tejas Fighter Jet Crashes During Dubai Airshow. Pilot Didn't Escape (Videos, Photos)\nA HAL Tejas fighter jet from the Indian Air Force taking part in a demonstration at the Dubai Air Show crashed on November 21 afternoon, with the pilot failing to eject.\nAccording to multiple reports, the fighter jet went down around 2:10 pm local time while performing an aerial display before a large crowd.\nThe crash resulted in a large fire ball. The pilot was not seen ejecting, and later photos from the scene of the crash indicate that he was killed.\nThe incident reportedly took place as a Lockheed Martin F-35 Lightning II of the United States Air Force was landing after performing its own display.\nMusic accompanying the F-35 show was even still blasting all around the airport when the Tejas slammed into the ground as the crowd gasped in dismay over the tragedy. \nRead more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157921Z"
    },
    {
      "original": "Hegseth Says U.S. Now Has ‘New Options’ Against Venezuela As Fighter Jets Swarm Caribbean\nThe United States government’s decision to designate Venezuela’s Cartel de los Soles a foreign terrorist organization provides the Defense Department with “new options” to go after the alleged drug cartel in the country, Defense Secretary Pete Hegseth said in an interview with One America News Network, which aired on November 20.\nThe designation was announced by the State Department over the weekend and is expected to take effect by November 24.\nThe decision is significant as many in the administration of President Donlad Trump, including Secretary of State Marco Rubio, consider Venezuelan President Nicolás Maduro to be the head of Cartel de los Soles, an accusation that Caracas has denied.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157929Z"
    },
    {
      "original": "Hegseth Says U.S. Now Has ‘New Options’ Against Venezuela As Fighter Jets Swarm Caribbean\nThe United States government’s decision to designate Venezuela’s Cartel de los Soles a foreign terrorist organization provides the Defense Department with “new options” to go after the alleged drug cartel in the country, Defense Secretary Pete Hegseth said in an interview with One America News Network, which aired on November 20.\nThe designation was announced by the State Department over the weekend and is expected to take effect by November 24.\nThe decision is significant as many in the administration of President Donlad Trump, including Secretary of State Marco Rubio, consider Venezuelan President Nicolás Maduro to be the head of Cartel de los Soles, an accusation that Caracas has denied.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157938Z"
    },
    {
      "original": "Mutual Strikes Between Russia and Ukraine Amid Discussions of Trump's Peace Plan\nAgainst the backdrop of active discussion in political and media circles regarding Donald Trump's peace plan, the mutual strikes carried out by both sides on November 20th and 21st were characterized by relatively low intensity. The Russian Ministry of Defense reported that its air defense systems destroyed 39 Ukrainian unmanned aerial vehicles during the evening and night of November 21st. For its part, the Ukrainian Air Force stated that the Russian side launched 115 attack UAVs overnight on November 21st, of which 95 were shot down or suppressed.\nStrikes on Ukrainian territory over the two-day period affected targets in several regions. Overnight on November 21st, attacks targeted Chernihiv, Odesa, Kharkiv, and Dnipropetrovsk regions. In Odesa region, an attack involving kamikaze drones was accompanied by air defense operations, during which debris from downed drones fell on urban areas. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157948Z"
    },
    {
      "original": "Mutual Strikes Between Russia and Ukraine Amid Discussions of Trump's Peace Plan\nAgainst the backdrop of active discussion in political and media circles regarding Donald Trump's peace plan, the mutual strikes carried out by both sides on November 20th and 21st were characterized by relatively low intensity. The Russian Ministry of Defense reported that its air defense systems destroyed 39 Ukrainian unmanned aerial vehicles during the evening and night of November 21st. For its part, the Ukrainian Air Force stated that the Russian side launched 115 attack UAVs overnight on November 21st, of which 95 were shot down or suppressed.\nStrikes on Ukrainian territory over the two-day period affected targets in several regions. Overnight on November 21st, attacks targeted Chernihiv, Odesa, Kharkiv, and Dnipropetrovsk regions. In Odesa region, an attack involving kamikaze drones was accompanied by air defense operations, during which debris from downed drones fell on urban areas. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157956Z"
    },
    {
      "original": "Kupyansk Captured By Russian Army, Krasny Liman And Siversk Are Next\nThe Russian military has captured the city of Kupyansk in Kharkiv and the battles in the cities of Krasny Liman and Siversk in Donetsk have begun to pick up momentum.\nChief of the General Staff Valery Gerasimov announced the capture of Kupyansk during a meeting with Russian President Vladimir Putin at a military command post late on November 20.\nHe said that the city is now under full control, while Putin reviewed the broader battlefield situation and praised the performance of Russian troops.\n“Formations of the West grouping have liberated the city of Kupyansk,” Gerasimov said, noting the Kiev forces were being destroyed on the left bank of the Oskil River and that the conditions had been prepared for them to surrender.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157966Z"
    },
    {
      "original": "Kupyansk Captured By Russian Army, Krasny Liman And Siversk Are Next\nThe Russian military has captured the city of Kupyansk in Kharkiv and the battles in the cities of Krasny Liman and Siversk in Donetsk have begun to pick up momentum.\nChief of the General Staff Valery Gerasimov announced the capture of Kupyansk during a meeting with Russian President Vladimir Putin at a military command post late on November 20.\nHe said that the city is now under full control, while Putin reviewed the broader battlefield situation and praised the performance of Russian troops.\n“Formations of the West grouping have liberated the city of Kupyansk,” Gerasimov said, noting the Kiev forces were being destroyed on the left bank of the Oskil River and that the conditions had been prepared for them to surrender.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-21T15:36:33.157975Z"
    }
  ],
  "script_run_time": "2025-11-21T15:36:33.158726Z"
}