{
  "messages": [
    {
      "original": "🛵\n БпЛА на півночі Харківщини рухається в південному напрямку.",
      "timestamp": "2025-10-20T10:39:06.734710Z"
    },
    {
      "original": "🛵\n  БпЛА на межі Харківщини та Сумщини, рухається в південно-західному напрямку.",
      "timestamp": "2025-10-20T10:39:06.734731Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 38 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 жовтня (з 19:00 19 жовтня) противник атакував трьома балістичними ракетами Іскандер-М/KN-23  із ТОТ Криму та 60-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Орел, Приморсько-Ахтарськ – рф, Чауда – ТОТ Криму, близько 40 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 38 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 3 балістичних ракет та 20 ударних БпЛА на 12 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-20T10:39:06.734754Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Новгород-Сіверський район), курс південно-західний.\n🛵\n БпЛА на сході та півдні Харківщини, постійно змінюють напрямок руху.\n🛵\n БпЛА з Донеччини повз Дніпропетровщину на Харківщину (Лозівський район).",
      "timestamp": "2025-10-20T10:39:06.734763Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-20T10:39:06.734768Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-20T10:39:06.734772Z"
    },
    {
      "original": "Швидкісна ціль на Павлоград!",
      "timestamp": "2025-10-20T10:39:06.734776Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград з південно-східного напрямку!",
      "timestamp": "2025-10-20T10:39:06.734781Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T10:39:06.734786Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Гончарівське (Чернігівська область)",
      "timestamp": "2025-10-20T10:39:06.734792Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-20T10:39:06.734796Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-10-20T10:39:06.734801Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Харків з південно-східного напрямку!",
      "timestamp": "2025-10-20T10:39:06.734805Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T10:39:06.734810Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-20T10:39:06.734814Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-20T10:39:06.734818Z"
    },
    {
      "original": "🚀\nКАБ з Харківщини на Полтавщину.",
      "timestamp": "2025-10-20T10:39:06.734822Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини курсом на Харківщину (Берестинський район).",
      "timestamp": "2025-10-20T10:39:06.734827Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К з ае \"Саваслейка\"",
      "timestamp": "2025-10-20T10:39:06.734835Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-20T10:39:06.734839Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К з ае \"Саваслейка\"",
      "timestamp": "2025-10-20T10:39:06.734846Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К",
      "timestamp": "2025-10-20T10:39:06.734850Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T10:39:06.734854Z"
    },
    {
      "original": "Суми - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-20T10:39:06.734858Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-20T10:39:07.477706Z"
    },
    {
      "original": "The target of the Iskander missile earlier was also attacked by several MLRS rockets and Geran-2 drones. A reconnaissance drone was operating there, filming the strikes, so we will probably get a video of the strikes soon.",
      "timestamp": "2025-10-20T10:39:07.477720Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations south of Novopavlivka and have expanded their bridgehead on the northern bank of the Vovcha River.\nAfter establishing control over Filiya and beginning attacks east of the settlement, Russian forces began making quicker progress towards encircling the remaining Ukrainian formations stationed to the south near Dachne. They advanced uphill from the eastern approaches to Filiya, moving along two treelines to the trench strongpoints west of the highway. These strongpoints were then captured, threatening the encirclement of the Ukrainian forces to the south. \n+ ~3.08 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477727Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Ukrainian forces counterattacked, re-establishing control over the Pokrovsk Coal Mine.\nFollowing the Russian assault groups entering and establishing themselves in the eastern buildings of the mine complex, Ukrainian forces began counterattacking. They first covered the Russian positions with FPV drones, preventing accumulation of infantry, and struck any reinforcements arriving from the south. Assault groups then moved in from the western part of the mine and cleared the positions from the surviving Russian soldiers. A grey zone has now formed up to the anti-tank ditch north of Udachne. \n+ ~0.83 km² in favour of Ukraine.",
      "timestamp": "2025-10-20T10:39:07.477732Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.\nIn the southeast, Russian forces consolidated along the railway line north of Chunyshyne and entered the village of Novopavlivka. They advanced east down the main street, capturing most of the village and pushing the Ukrainians to the northeastern houses.\nIn southern Pokrovsk, Russian forces were able to consolidate in the high-rise buildings of the Shakhtarskyi District and began infiltrating north of the E-50 highway, into the Prospecta, Sobachivka,and Hospital Districts. Assault operations also continued in the high-rise buildings of the Pivdennyi and Soniachnyi Districts, as well as towards Yuvileynyy Park.\nFurther northwest, Russian forces captured the rest of the industrial zone in western Pokrovsk, and re-established control over positions in the Durniak and Pervomaika Districts. Deep infiltrations are now taking place from here, with Russian soldiers and DRGs crossing the railway line into the northwestern factory districts, and into the city centre towards the railway station. Assault operations also continued towards the Prospecta District from the east and deeper into the Market District.\n+ ~4.15 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477739Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to attack the approaches to Myrnohrad, and have made progress in two different areas.\nIn the north, Russian forces advanced from Novoekonomichne to the Kapitalna Mine. They were able to capture the mine along with the positions to the north and begin pushing towards northeastern Myrnohrad. The Russians then secured the forested areas east of the tributary of the Kazenyi Torets River and entered the industrial zone on the edge of the city. Additionally, they were able to advance west of this tributary, pushing from the area of the terkyons to the treelines directly north of Myrnohrad, forcing the Ukrainians to withdraw to the railway line. \nIn the south, Russian forces improved their positions in Kozatske, capturing the central part of the village, and entering its southern houses. This partially secures the southern flank of the formations that managed to enter the first houses of Myrnohrad. \n+ ~6.30 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477746Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance towards Markove and have expanded their bridgehead on the western bank of the Siverskyi Donets Canal.\nRussian forces advanced from their positions in the treelines and trench fortifications east of the canal, establishing control over new trenches and dugouts in and around the windbreak that runs parallel with the canal. The grey zone has also expanded to the adjacent treelines leading towards Markove and Novomarkove.\n+ ~0.29 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477751Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards Lyman and have made progress in three different areas.\nIn the southeast, Russian forces cleared the grey zone in southern and central Yampil, refocusing their efforts on the southwestern part of the village where both sides are attacking each other's positions. \nTo the west, Russian forces broke through Ukrainian positions south of the railway line and linked up with formations in northwestern Yampil. They were able to clear a large part of the Yampil forest, allowing for further assault operations to take place to the southwest in the direction of the Lyman - Siversk Highway. The Russians also advanced along the railway line towards eastern Lyman, capturing more positions in the forests there and to the south of the tracks. \nAdditionally, Russian forces cleared the rest of the salient that formed south of Zarichne by attacking from the northeast and southeast. They then pushed further west along multiple attack vectors in conjunction with the attacks along the railway line. \nIn the north, Russian forces continued to slowly advance along the forested gulley west of Zarichne. They captured new positions towards the western half of the gulley and are repelling additional Ukrainian counterattacks there. Russian forces are also attempting to improve their positions in the treelines northwest of Zarichne, while the Ukrainians have shifted their focus away from the agricultural buildings on the northwestern outskirts of Zarichne, to the area of Slovyanska Street. \n+ ~10.25 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477759Z"
    },
    {
      "original": "A short time ago, a Russian Grom-E1 rocket-powered glide-bomb launched from a Su-34 in southwestern Donetsk Oblast impacted the Lozova area of Kharkiv Oblast. The flight length was 120 - 140 km.",
      "timestamp": "2025-10-20T10:39:07.477762Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.  In the southeast, Russian forces consolidated along the railway line north of Chunyshyne and…",
      "timestamp": "2025-10-20T10:39:07.477766Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.\nLess than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the railway line, including the city centre. The E-50 highway has been cut via Pokrovsk's northwestern industrial zone, meaning supply is now even more difficult. \nWe could be approaching the end of the battle for the city and neighbouring Myrnohrad.",
      "timestamp": "2025-10-20T10:39:07.477771Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.  Less than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the…",
      "timestamp": "2025-10-20T10:39:07.477775Z"
    },
    {
      "original": "\"Pokrovsk isn't strategically important\" cope in 3, 2, 1...",
      "timestamp": "2025-10-20T10:39:07.477778Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards the Siverskyi Donets River and have advanced in two areas.\nIn the southeast, Russian forces were able to consolidate in the northern streets of Drobysheve and the agricultural buildings to the east. They also advanced through the forests northwest of Drobysheve, reaching the Nitrius River from the east, and capturing additional positions to the south and north. Additionally, Russian forces expanded their bridgehead west of the river, capturing new positions in the southwestern residential area of Novoselivka, and entering the forests behind them. \nIn the northwest, after heavy FAB, artillery, and FPV drone strikes, Russian forces were able to make significant progress in the forest northwest of Novoselivka, advancing in the direction of Oleksandrivka. They were also able to enter the large forests to the west where fighting is ongoing.\n+ ~6.96 km² in favour of Rusia.",
      "timestamp": "2025-10-20T10:39:07.477785Z"
    },
    {
      "original": "Footage showing two Russian Iskander-M ballistic missile strikes on a Ukrainian Patriot air defence installation near Pavlohrad, Dnipropetrovsk Oblast.\nThe strikes, which took place 3 days ago on October 15, targeted the Patriot's launcher and radar station. This system has been covering the Pavlohrad area for at least the last 4 months.",
      "timestamp": "2025-10-20T10:39:07.477789Z"
    },
    {
      "original": "2 Tu-95MS Russian strategic bombers have redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast, after being equipped with Kh-101 cruise missiles.   At least 1 Tu-95MS strategic bomber is redeploying from Ukrainka Airbase to Engels…",
      "timestamp": "2025-10-20T10:39:07.477792Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack:\nA Tu-95MS departed from Olenya Airbase, Murmansk Oblast, and landed at Engels-2 Airbase, Saratov Oblast.\nCombat-related radio activity from the Black Sea Fleet at Novorossiysk Naval Base, Krasnodar Krai, was recorded last night.\nRadio activity between Olenya Airbase and Moscow was recorded last night. \nDeliveries of Iskander-M ballistic missiles and possible Iskander-K cruise missiles from Shaykovka and Balitmore Airbases to OTRK installations in Bryansk and Voronezh Oblast took place over the last 48 hours. \nAccumulation of Geran-2/Gebera drones continues at all major launch points. \nSu-24MR reconnaissance aircraft are carrying out significantly more frequent flights over Rostov Oblast, Krasnodar Krai, and areas northeast of Ukraine. \nAn A-50U AWACS aircraft (tail number RF-50608) continues to carry out daily reconnaissance missions over Tambov, Volgograd, and Ryazan Oblast from Ulyanovsk-East Airbase, Ulyanovsk Oblast. \nOne \"Buyan-M\" Corvette and one \"Admiral Makarov\" Frigate remain equipped with Kalibr cruise missiles, although there may be additional vessels equipped too. \n4 MiG-31Ks are still equipped at Savasleika Airbase, Nizhny Novgorod Oblast, but show no relevant signs of activity yet. \n3 Tu-95MS strategic bombers from Ukrainka Airbase, Amur Oblast, carried out a training mission over the Kuril Islands in the Pacific Ocean, in which launches of Kh-101 cruise missiles were simulated with electronic warfare.",
      "timestamp": "2025-10-20T10:39:07.477804Z"
    },
    {
      "original": "Update from Pokrovsk:\nRussian forces continued to quickly advance inside the city and are now present in practically all areas south of the railway line.\nAfter breaking through Ukrainian positions in the southern suburbs, Russian forces consolidated in the Hospital District and entered the Prospecta District where they were able to secure at least the four southern blocks. Soldiers and DRGs are now infiltrating north to the city centre and the railway station, where fighting is ongoing with Ukrainian forces. \nAdditionally, Russian forces managed to completely capture the four high-rise districts in southern Pokrovsk after the remaining Ukrainian soldiers were forced to withdraw. They then crossed the E-50 highway and entered the southeastern streets of the Sobachivka District.\nTo the northwest, Russian forces continued to advance in the Pervomaika District, consolidating in numerous new residential blocks, and infiltrating towards the school, and further to the city centre.\nTo the west, Russian forces were able to secure and consolidate in the rest of the Durniak District, before spearheading east through northern Pervomaika District and into the city centre, where fighting is ongoing. They also captured the areas west of Durniak District and expanded the grey zone further in Pokrovsk's northwestern industrial zone.\nLarge parts of Pokrovsk remains in the grey zone due to the mixed state of fighting, a critical shortage of Ukrainian manpower, and the mixed and layered state of control. \n+ ~4.16 km² in favour of Russia.",
      "timestamp": "2025-10-20T10:39:07.477813Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian HIMARS GMLRS launcher near the village of Kuz'myns'ke, Chernihiv Oblast.",
      "timestamp": "2025-10-20T10:39:07.477816Z"
    },
    {
      "original": "Russian forces have recaptured the village of Myrne, Lyman direction, Donetsk Oblast.\nPre-war population: ~18.\nTotal land area: ~0.12 km².",
      "timestamp": "2025-10-20T10:39:07.477821Z"
    },
    {
      "original": "Russian forces have captured the village of Novoselivka, Lyman direction, Donetsk Oblast.\nPre-war population: ~1,390.\nTotal land area: ~3.06 km².",
      "timestamp": "2025-10-20T10:39:07.477825Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance towards Myrnohrad, and have entered the first houses of the city.  After securing the forests northeastern of Balahan, Russian forces began advancing through the treelines towards Kozatske, before…",
      "timestamp": "2025-10-20T10:39:07.477828Z"
    },
    {
      "original": "The Ukrainian Navy published footage showing a drone-dropped explosive targeting a Russian position in the first houses of Myrnohrad. \nThis is one of the many strikes I was referring to in \nthis post\n, where the Ukrainians are striking every occupied building one after another to eliminate the Russian presence in the city. This is also another example of Ukraine's critical manpower shortages preventing them from putting up significant resistance on the ground.",
      "timestamp": "2025-10-20T10:39:07.477833Z"
    },
    {
      "original": "Russian forces have captured the village of Novomykolaivka, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~457.\nTotal land area: ~1.43 km².",
      "timestamp": "2025-10-20T10:39:07.477842Z"
    },
    {
      "original": "Russian forces have captured the village of Balahan, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~35.\nTotal land area: ~0.50 km².",
      "timestamp": "2025-10-20T10:39:07.477847Z"
    },
    {
      "original": "U.S. Hits Drug Submarine, Another Boat As Trump Extends Threats To Colombia \nThe United States military has struck a submarine and a boat which were allegedly sailing in the Caribbean with drugs on board as a part of its ongoing “counter narco-terror operation,” as President Donald Trump extended his threats to Colombia.\nThe strike on the “drug-carrying submarine” was announced on October 18 by Trump, who said that two men who survived had been repatriated to their home countries.\n“It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route. U.S. Intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics,” Trump said in a Truth Social post.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269452Z"
    },
    {
      "original": "U.S. Hits Drug Submarine, Another Boat As Trump Extends Threats To Colombia \nThe United States military has struck a submarine and a boat which were allegedly sailing in the Caribbean with drugs on board as a part of its ongoing “counter narco-terror operation,” as President Donald Trump extended his threats to Colombia.\nThe strike on the “drug-carrying submarine” was announced on October 18 by Trump, who said that two men who survived had been repatriated to their home countries.\n“It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route. U.S. Intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics,” Trump said in a Truth Social post.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269472Z"
    },
    {
      "original": "Rows Without Names: Inside Ukraine’s Fields of Unknown Soldiers\nOn the outskirts of Dnipro, neat rows of fresh graves are marked with identical plaques: “temporarily unidentified defender of Ukraine.” No names. No dates. Just a plot number. Similar sections have appeared in Zaporizhzhia, Kharkiv, and Cherkasy — cemeteries where death, not people, keeps the count.\nIn official briefings, Ukraine’s military losses appear modest. But the ground tells a different story. After especially heavy fighting, truckloads of bodies arrive from the frontlines and shelling sites. Drones and artillery leave little chance for identification — the remains are burned, torn apart, unrecognizable. Morgues are overflowing, DNA analysis drags on for months, and the lists of the identified move forward as slowly as a bureaucratic convoy. Until a match is found, the dead remain “unidentified.” On paper, they’re “temporarily missing.” For families, there is only silence.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269482Z"
    },
    {
      "original": "Rows Without Names: Inside Ukraine’s Fields of Unknown Soldiers\nOn the outskirts of Dnipro, neat rows of fresh graves are marked with identical plaques: “temporarily unidentified defender of Ukraine.” No names. No dates. Just a plot number. Similar sections have appeared in Zaporizhzhia, Kharkiv, and Cherkasy — cemeteries where death, not people, keeps the count.\nIn official briefings, Ukraine’s military losses appear modest. But the ground tells a different story. After especially heavy fighting, truckloads of bodies arrive from the frontlines and shelling sites. Drones and artillery leave little chance for identification — the remains are burned, torn apart, unrecognizable. Morgues are overflowing, DNA analysis drags on for months, and the lists of the identified move forward as slowly as a bureaucratic convoy. Until a match is found, the dead remain “unidentified.” On paper, they’re “temporarily missing.” For families, there is only silence.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269490Z"
    },
    {
      "original": "‘Tanker War’ Returns With Reports Of Attack On Iranian Gas Shipment Near Yemen\nA tanker with alleged links to Iran caught fire on October 18 in the Gulf of Aden off the coast of Yemen after being struck by a projectile, in what may have been an Israeli attack.\nThe attack was first reported by the United Kingdom Maritime Trade Operations (UKMTO) center, which is run by the Royal Navy. The center issued an alert about the vessel, describing the incident as taking place some 210 kilometers to the east of Aden.\n“A vessel has been hit by an unknown projectile, resulting with a fire,” the UKMTO said. “Authorities are investigating.”\nLater, the British maritime security firm Ambrey described the vessel as a Cameroon-flagged tanker that was “en route from Sohar, Oman, to Djibouti.” It said radio traffic suggested the crew was preparing to abandon ship and a search-and-rescue effort was underway.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269501Z"
    },
    {
      "original": "The Battle Closes In: Fierce Fighting For Pleshcheevka And Logistical Routes To Konstantinovka\nThe highway leading to Pokrovsk has been cut by Russian forces. The Russian Armed Forces have taken control of the settlements of Poltavka and Okhotniche in the Zaporizhzhia area. Russian units have completed an operation to clear the area south of the Kleban-Byk Reservoir. \nFinancial support for Kyiv from Western nations is consistently decreasing.\nRead more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269509Z"
    },
    {
      "original": "The Battle Closes In: Fierce Fighting For Pleshcheevka And Logistical Routes To Konstantinovka\nThe highway leading to Pokrovsk has been cut by Russian forces. The Russian Armed Forces have taken control of the settlements of Poltavka and Okhotniche in the Zaporizhzhia area. Russian units have completed an operation to clear the area south of the Kleban-Byk Reservoir. \nFinancial support for Kyiv from Western nations is consistently decreasing.\nRead more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269516Z"
    },
    {
      "original": "Mutual Strikes by Ukraine and Russia: Can the Budapest Negotiations Change the Situation?\nOn October 18-19, Russia and Ukraine exchanged strikes. Russia targeted transport infrastructure, defense enterprises, a UAV training center, UAV workshops, an air defense radar, and Ukrainian deployment points in 156 districts. Simultaneously, the Ukrainian side attacked gas processing and oil refining facilities in several regions of Russia.\nAgainst the backdrop of ongoing hostilities, some details emerged about the meeting between the US and Ukrainian presidents on Friday, October 17. According to the Financial Times, Donald Trump told Volodymyr Zelensky that he was losing the war and urged him to agree to Moscow’s terms to end the conflict, warning that otherwise he would be \"destroyed\" by Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269524Z"
    },
    {
      "original": "Mutual Strikes by Ukraine and Russia: Can the Budapest Negotiations Change the Situation?\nOn October 18-19, Russia and Ukraine exchanged strikes. Russia targeted transport infrastructure, defense enterprises, a UAV training center, UAV workshops, an air defense radar, and Ukrainian deployment points in 156 districts. Simultaneously, the Ukrainian side attacked gas processing and oil refining facilities in several regions of Russia.\nAgainst the backdrop of ongoing hostilities, some details emerged about the meeting between the US and Ukrainian presidents on Friday, October 17. According to the Financial Times, Donald Trump told Volodymyr Zelensky that he was losing the war and urged him to agree to Moscow’s terms to end the conflict, warning that otherwise he would be \"destroyed\" by Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T10:39:08.269533Z"
    },
    {
      "original": "HIMARS Destroyed: Summary Of Russian Combat Footage From October 19, 2025\nOn October 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-20T10:39:08.269540Z"
    },
    {
      "original": "HIMARS Destroyed: Summary Of Russian Combat Footage From October 19, 2025\nOn October 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-20T10:39:08.269547Z"
    }
  ],
  "script_run_time": "2025-10-20T10:39:08.270448Z"
}