{
  "messages": [
    {
      "original": "🛵\n БпЛА на півночі Сумщини, курс - південний.",
      "timestamp": "2025-11-09T18:40:53.111128Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п.Чорноморськ (Одещина).",
      "timestamp": "2025-11-09T18:40:53.111156Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-09T18:40:53.111167Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Дніпропетровщини біля н.п.Васильківка.",
      "timestamp": "2025-11-09T18:40:53.111179Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на Сумщині на/повз Шостку з північного сходу.",
      "timestamp": "2025-11-09T18:40:53.111192Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-09T18:40:53.111211Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку н.п.Ромни з півночі.",
      "timestamp": "2025-11-09T18:40:53.111221Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область!",
      "timestamp": "2025-11-09T18:40:53.111231Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку н.п.Вороніж з північного сходу.",
      "timestamp": "2025-11-09T18:40:53.111242Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині курсом на Павлоград з південного сходу.",
      "timestamp": "2025-11-09T18:40:53.111252Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку н.п.Конотоп, Дубов'язівка з півночі та БпЛА на південному заході Сумщини курсом на/повз н.п.Дмитрівка (Чернігівщина).",
      "timestamp": "2025-11-09T18:40:53.111262Z"
    },
    {
      "original": "🛸\n У напрямку Харкова з північного сходу - ворожий  БпЛА, ймовірно, розвідувальний. Можлива робота ППО. У разі оголошення тривоги, - прямуйте в укриття.",
      "timestamp": "2025-11-09T18:40:53.111272Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку Бахмача і Батурина.",
      "timestamp": "2025-11-09T18:40:53.111281Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п.Чорноморськ (Одещина).",
      "timestamp": "2025-11-09T18:40:53.111290Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п.Чорноморськ (Одещина).",
      "timestamp": "2025-11-09T18:40:53.111300Z"
    },
    {
      "original": "Змінив курс в напрямку Одеси.",
      "timestamp": "2025-11-09T18:40:53.111307Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Миколаївщини між н.п.Рибаківка і Тузли, курс - північно-західний.",
      "timestamp": "2025-11-09T18:40:53.111317Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в районі н.п.Бахмач, Батурин, курс - північно-західний.",
      "timestamp": "2025-11-09T18:40:53.111331Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на/повз Васильківку з півночі.",
      "timestamp": "2025-11-09T18:40:53.111405Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси;\n🛵\n БпЛА на Чернігівщині південніше Батурина в південному напрямку;\n🛵\n БпЛА на сході Дніпропетровщини курсом на/повз Васильківку з південного сходу.",
      "timestamp": "2025-11-09T18:40:53.111430Z"
    },
    {
      "original": "🛵\n БпЛА в Ізюмському районі Харківщини, курс - південно-західний (вектор на/повз Лозову).",
      "timestamp": "2025-11-09T18:40:53.111441Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, over the past five days Russian forces have continued their offensive operations, capturing new positions in several different areas. \nIn the north, Russian forces advanced from positions east of Oleksivika towards Orestopil, establishing control over two separate treelines and some nearby forest plantations. DRGs were able to enter the residential part of Orestopil. \nTo the southwest, the Russians continued expanding their zone of control around Zlahoda. They advanced down two perpendicular treelines south and southwest of the village, capturing new positions there. \nTo the south, after securing the central part of Uspenivka, Russian forces managed to capture the rest of the village, along with the agricultural buildings on its southern outskirts. They then crossed the Yanchur River at a new point from Pryvilne, and began advancing down a gulley and adjacent treelines towards Solodke. Russian soldiers quickly captured Solodke due to a lack of Ukrainian manpower in the area and consolidated in the treelines to the east.\nTo the southeast, the Russians advanced south and downhill from Uspenivka towards Nove, capturing positions in several different treelines and entering the village. Other forces advanced towards Novouspenivske from the southeast, crossing a gulley and capturing a forest along with nearby treeline positions to the north, northeast and south. As a result, any remaining Ukrainian soldiers still stationed west of Okhotnyche withdrew further west, allowing for the Russians to establish control over the treelines west of the Yanchur River there.\nFurther south, Russian forces continued to slowly advance west of Malynivka. They captured the rest of the gulley leading west from the village and secured new positions in two separate treelines, therefore reaching the eastern outskirts of Zelenyi Hai.\n+ ~30.98 km² in favour of Russia.",
      "timestamp": "2025-11-09T18:40:53.878809Z"
    },
    {
      "original": "Fun fact that a lot of people need to hear: both sides advance in Ukraine. \nJust because the side you don't support makes progress, it doesn't automatically mean its fake or cope, even though one country obviously advances more than the other.",
      "timestamp": "2025-11-09T18:40:53.878821Z"
    },
    {
      "original": "Ukrainian source Deepstate has provided some additional information regarding the deteriorating situation for Ukraine in the Hulyaipole and Pokrovsk'e directions. This, along with some information from other sources allows for us to paint a clearer picture of the events that unfolded here over the past 10 days. \nThey report that 50% of the Ukrainian soldiers defending the area of Uspenivka were withdrawn to improve the deteriorating situation near Vyshneve. At the time, Russia had quickly captured this relatively large village, crossed two rivers, and were advancing well beyond it to the north and west. These reinforcements somewhat stabilised the situation there, but it left a large gap in the defence of the Uspenivka area.\nAs a result, at least 200 Russian soldiers from the 14th Guards Spetsnaz Brigade, 218th Tank Regiment, and the 394th Motorized Rifle Brigade were able to enter Uspenivka, and bring it under their control relatively quickly. The 394th brigade consolidated in the village while the 14th brigade and 218th regiment began pushing to the nearby villages of Nove, Novouspenivske, Solodke, and Rivnopillya. \nIn order to try save the situation, one unspecified battalion of Ukraine's 102nd Territorial Defence Brigade was deployed to Uspenivka, but suffered heavy casualties due to Russia having already brought in significant reinforcements to the village, and just because of the fact that the battalion was low on manpower. \nA severe lack of coordination in cohesion in this sector, along with commanders not accurately reporting the situation to headquarters or neighbouring units, is partially responsible for these rapid losses in ground that should have been able to hold for some time. Critical manpower shortages also play a major role in this. These levels of incompetence, shortages, and inability to coordinate properly are beyond anything I have ever seen for Ukraine so far. \nAs a result of this chain of events over the past 10 days, Russia has been able to fully compromise Ukrainian defences on the western bank of the Yanchur River and is now pushing through the fields further west. Fighting is ongoing for the villages of Nove, Novouspenivske, and Rivnopillya, while Solodke was captured a few days ago. Rybne is also under threat of being encircled due to Russian advances near Zlahoda and Solodke, and all the while, the newly reinforced front further north is still not stabilised.",
      "timestamp": "2025-11-09T18:40:53.878829Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T18:40:53.878834Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T18:40:53.878838Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n 1 was killed in the israeli drone strike that targeted Kherbet Selm.\n@wfwitness",
      "timestamp": "2025-11-09T18:40:53.878846Z"
    },
    {
      "original": "Russian FPV drones continue to fly relatively freely over Kramatorsk, Donetsk Oblast. Interestingly, this video shows that Ukraine has begun constructing trenches in the city park.",
      "timestamp": "2025-11-09T18:40:53.878849Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T18:40:53.878852Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T18:40:53.878856Z"
    },
    {
      "original": "Last night, at least 7 Russian Geran-2 drones attacked energy infrastructure in the city of Lozova, Kharkiv Oblast. Power outages occurred as a result. A Grom-E1 rocket-powered glide-bomb also impacted the city, although it's unclear if it also targeted energy infrastructure. \nMeanwhile, due to previous missile and drone strikes in Kharkiv City, large parts of the city remain without power.",
      "timestamp": "2025-11-09T18:40:53.878860Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T18:40:53.878864Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T18:40:53.878872Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T18:40:53.878876Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T18:40:53.878880Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T18:40:53.878884Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T18:40:53.878887Z"
    },
    {
      "original": "Russian forces have captured the village of Rybne, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~50.\nTotal land area: ~0.62 km².",
      "timestamp": "2025-11-09T18:40:53.878892Z"
    },
    {
      "original": "While everyone focuses on Pokrovsk, the situation in the Hulyaipole direction continues to deteriorate even further for Ukraine. \nRussia is advancing to new areas while facing minimal resistance and is now approaching the rear of Hulyaipole itself.",
      "timestamp": "2025-11-09T18:40:53.878895Z"
    },
    {
      "original": "Regarding the Myrnohrad pocket, I think a lot of people are significantly overestimating the number of Ukrainian soldiers encircled there.\nMyrnohrad is a big city, and when you include its surroundings there are a lot of other positions to hold. But Ukraine has become increasingly reliant on drones, often spreading infantry very thin across lines, creating a disorganised and often incoherent ground defence. Myrnohrad is an example of this, and there are a lot of nearby settlements that are good for concentrations of drone operators. \nAdditionally, many Ukrainian soldiers actually escaped this pocket back when it was still a salient. This is what allowed for Russia to penetrate deeper into the northern and southern parts of the city. \nFor an area of its size, with a significantly reduced garrison, I estimate that there are anywhere between 300 and 700 Ukrainian soldiers currently trapped there. It's impossible to know how many right now, but with the state the war is in today and other patterns observed from this front, it will be less than many people expect.",
      "timestamp": "2025-11-09T18:40:53.878901Z"
    },
    {
      "original": "TOS Attack: Summary Of Russian Combat Footage From November 8, 2025\nOn November 8, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-09T18:40:54.604850Z"
    },
    {
      "original": "TOS Attack: Summary Of Russian Combat Footage From November 8, 2025\nOn November 8, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-09T18:40:54.604866Z"
    },
    {
      "original": "Inside Trump’s C5+1 Push: Can America Rewrite Geopolitics Of Central Asia?\nThe C5+1 summit brought together the leaders of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, and Uzbekistan with President Donald Trump. The format, created in 2015, aims to boost cooperation between the US and Central Asia on security, trade, and connectivity. It has evolved into a platform through which Washington seeks influence in a region traditionally shaped by Russian and Chinese presence.\nTrump’s renewed push is largely about rare-earth minerals and energy security: the American president has repeatedly framed access to strategic resources as a national priority. Central Asia’s reserves of rare-earth metals, particularly in Kazakhstan and Uzbekistan, are central to this renewed interest. These minerals underpin everything from smartphones to advanced weapons systems. Today Beijing dominates the sector, processing 90% of the world’s rare earths...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604876Z"
    },
    {
      "original": "Operational Success Of Russian Forces In The Zaporizhzhia Direction: Control Over Rybnoe Opens The Way To Rovnopolie\nOn the Zaporizhzhia and South-Dnepropetrovsk directions, Russian forces continued offensive operations, achieving operational success on several sectors of the front. According to statements from the Ministry of Defence of the Russian Federation, servicemen of the 37th Guards Motorized Rifle Brigade of the 36th Combined Arms Army, after forcing the Yanchur River, established full control over the settlement of Rybnoe in the Zaporizhzhia region. During fierce battles, despite Ukrainian forces’ resistance and difficult weather conditions, a Ukrainian defence area of over two square kilometres was brought under control.\nThe capture of Rybnoe is of significant operational importance, as this settlement was the last stronghold of a major Ukrainian fortified area on the Yanchur River as part of the so-called Uspenovka defensive line. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604884Z"
    },
    {
      "original": "Operational Success Of Russian Forces In The Zaporizhzhia Direction: Control Over Rybnoe Opens The Way To Rovnopolie\nOn the Zaporizhzhia and South-Dnepropetrovsk directions, Russian forces continued offensive operations, achieving operational success on several sectors of the front. According to statements from the Ministry of Defence of the Russian Federation, servicemen of the 37th Guards Motorized Rifle Brigade of the 36th Combined Arms Army, after forcing the Yanchur River, established full control over the settlement of Rybnoe in the Zaporizhzhia region. During fierce battles, despite Ukrainian forces’ resistance and difficult weather conditions, a Ukrainian defence area of over two square kilometres was brought under control.\nThe capture of Rybnoe is of significant operational importance, as this settlement was the last stronghold of a major Ukrainian fortified area on the Yanchur River as part of the so-called Uspenovka defensive line. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604892Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 9, 2025 (Map Update)",
      "timestamp": "2025-11-09T18:40:54.604896Z"
    },
    {
      "original": "Large-Scale Destruction Of Ukraine's Energy Infrastructure Is Complicating Repair Efforts And Causing Blackouts\nRussia and Ukraine continued exchanging strikes on the night of November 8-9. According to the Russian Ministry of Defense, Russian air defense forces destroyed 44 Ukrainian unmanned aerial vehicles (UAVs). The Ukrainian Air Force stated that Russian forces launched 69 UAVs, of which 34 were shot down or suppressed.\nThe First Deputy Minister of Energy of Ukraine, Artem Nekrasov, said that the repair of Ukraine's power generation infrastructure is significantly hampered due to large-scale destruction. All thermal power plants (TPPs) of the state-owned company «Centrenergo», which until recently accounted for about 18% of the country's total generation, have ceased operation. Nekrasov noted:\n«There is a power deficit, and spare parts are lacking. Under these conditions, hourly power outages are inevitable, and they have already been introduced in most regions...»\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604906Z"
    },
    {
      "original": "Large-Scale Destruction Of Ukraine's Energy Infrastructure Is Complicating Repair Efforts And Causing Blackouts\nRussia and Ukraine continued exchanging strikes on the night of November 8-9. According to the Russian Ministry of Defense, Russian air defense forces destroyed 44 Ukrainian unmanned aerial vehicles (UAVs). The Ukrainian Air Force stated that Russian forces launched 69 UAVs, of which 34 were shot down or suppressed.\nThe First Deputy Minister of Energy of Ukraine, Artem Nekrasov, said that the repair of Ukraine's power generation infrastructure is significantly hampered due to large-scale destruction. All thermal power plants (TPPs) of the state-owned company «Centrenergo», which until recently accounted for about 18% of the country's total generation, have ceased operation. Nekrasov noted:\n«There is a power deficit, and spare parts are lacking. Under these conditions, hourly power outages are inevitable, and they have already been introduced in most regions...»\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604915Z"
    },
    {
      "original": "Military Situation In Ukraine On November 9, 2025 (Maps Update)",
      "timestamp": "2025-11-09T18:40:54.604922Z"
    },
    {
      "original": "Military Situation In Ukraine On November 9, 2025 (Maps Update)",
      "timestamp": "2025-11-09T18:40:54.604928Z"
    },
    {
      "original": "Drugs & Drones: The Cartelization Of The Ukrainian Front\nSince the intensification of hostilities across eastern Ukraine, a disturbing transformation has taken place within the country’s armed forces. What was once presented as a national resistance effort supported by ideologically motivated foreign volunteers has increasingly given way to a fragmented, crisis-driven force reliant on irregular fighters with deep ties to transnational organized crime. Among the most consequential is the presence of operatives linked to Latin American drug cartels operating within Ukraine’s International Legion.\nThese individuals are active participants in some of the Western Hemisphere’s most violent criminal syndicates, including Colombia’s Clan del Golfo and Mexico’s Sinaloa and Jalisco Nueva Generación cartels. Their recruitment is coordinated through Segurcol Ltd., a private military entity headquartered in Medellín, which serves as the central hub for channeling cartel-affiliated personnel...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604937Z"
    },
    {
      "original": "Drugs & Drones: The Cartelization Of The Ukrainian Front\nSince the intensification of hostilities across eastern Ukraine, a disturbing transformation has taken place within the country’s armed forces. What was once presented as a national resistance effort supported by ideologically motivated foreign volunteers has increasingly given way to a fragmented, crisis-driven force reliant on irregular fighters with deep ties to transnational organized crime. Among the most consequential is the presence of operatives linked to Latin American drug cartels operating within Ukraine’s International Legion.\nThese individuals are active participants in some of the Western Hemisphere’s most violent criminal syndicates, including Colombia’s Clan del Golfo and Mexico’s Sinaloa and Jalisco Nueva Generación cartels. Their recruitment is coordinated through Segurcol Ltd., a private military entity headquartered in Medellín, which serves as the central hub for channeling cartel-affiliated personnel...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T18:40:54.604945Z"
    }
  ],
  "script_run_time": "2025-11-09T18:40:54.605858Z"
}