{
  "messages": [
    {
      "original": "🛵\n Група БпЛА на Дніпропетровщині курсом на захід.\n🛵\n БпЛА на півночі Сумщини курсом на Чернігівщину.\n🛵\n БпЛА на Чернігівщині курсом на південь.\n🛵\n БпЛА на сході Львівщини продовжує рух на захід.",
      "timestamp": "2025-10-30T14:46:54.403838Z"
    },
    {
      "original": "🛵\n Сумщина -  БпЛА в напрямку Конотопа!",
      "timestamp": "2025-10-30T14:46:54.403858Z"
    },
    {
      "original": "🛵\n Чернігівщина -  група БпЛА на півночі та центрі в південному напрямку.",
      "timestamp": "2025-10-30T14:46:54.403865Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 623 ЦІЛІ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 30 жовтня (з 19:00 29 жовтня) противник завдав комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного, наземного та морського базування. Загалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 705 засобів повітряного нападу – 52 ракет (9 із них – «балістика») та 653 БпЛА різних типів (близько 400 із них – «шахеди»):\n- 653 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Міллерово, Орел, Приморсько-Ахтарськ – рф, Чауда – ТОТ АР Крим);\n-  4 аеробалістичних ракет Х-47М2 \"Кинджал\" (із Нижнєгородської обл. – рф);\n-  5 балістичних ракет Іскандер-М/KN-23 (із Ростовської обл. – рф);\n-  8 крилатих ракет \"Калібр\";\n-  2 крилатих ракет Іскандер-К (із Курська, Воронезька обл. – рф);\n- 30 крилатих ракет Х-101 (із Саратовської обл. - рф);\n- 2 керованих авіаційних ракет Х-59/69 (із акваторії Чорного моря);\n- 1 керованої авіаційної ракети Х-31П (із акваторії Чорного моря).\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\nЗа попередніми даними, станом на 11.30, протиповітряною обороною збито/подавлено 623 повітряні цілі:\n- 592 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів);\n- 7 крилатих ракет \"Калібр\";\n- 1 крилату ракету Іскандер-К;\n- 21 крилатих ракет Х-101;\n- 2 керовані авіаційні ракети Х-59/69.\nНаразі зафіксовано прямі влучання 16 ракет та 63 ударних БпЛА на 20 локаціях та падіння збитих (уламки) на 19 локаціях в різних регіонах України.\nКрім того, 3 ворожі ракети (станом на 11.30) локаційно втрачені, інформація щодо місць падіння та наслідків уточнюється.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-10-30T14:46:54.403911Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Черкащини, курсом на Золотоношу.",
      "timestamp": "2025-10-30T14:46:54.403920Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-30T14:46:54.403933Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з Криму.",
      "timestamp": "2025-10-30T14:46:54.403943Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Дніпропетровщині курс північний",
      "timestamp": "2025-10-30T14:46:54.403949Z"
    },
    {
      "original": "🛵\n Черкащина - БпЛА в напрямку міста",
      "timestamp": "2025-10-30T14:46:54.403956Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на півночі Харківщини, в південно-західному напрямку.",
      "timestamp": "2025-10-30T14:46:54.403963Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-10-30T14:46:54.403971Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з Криму.",
      "timestamp": "2025-10-30T14:46:54.403979Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-10-30T14:46:54.403986Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-10-30T14:46:54.403992Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-30T14:46:54.404000Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя зі сходу.",
      "timestamp": "2025-10-30T14:46:54.404008Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі та зі сходу.",
      "timestamp": "2025-10-30T14:46:54.404013Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n на південно-західний напрямок.",
      "timestamp": "2025-10-30T14:46:54.404021Z"
    },
    {
      "original": "💥\nБойова робота у зоні відповідальності Повітряного командування \"Схід\".\n✊\nТримаємо небо!",
      "timestamp": "2025-10-30T14:46:54.404031Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-30T14:46:54.404036Z"
    },
    {
      "original": "🛵\n БпЛА на заході Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-30T14:46:54.404043Z"
    },
    {
      "original": "Further to Chernihiv Oblast",
      "timestamp": "2025-10-30T14:46:55.087538Z"
    },
    {
      "original": "Approaching Kyiv",
      "timestamp": "2025-10-30T14:46:55.087555Z"
    },
    {
      "original": "2 Kinzhals in the airspace, entering Kyiv Oblast",
      "timestamp": "2025-10-30T14:46:55.087559Z"
    },
    {
      "original": "2 Kinzhals in the airspace, entering Kyiv Oblast",
      "timestamp": "2025-10-30T14:46:55.087563Z"
    },
    {
      "original": "Now over Zhytomyr Oblast. Flying one after another",
      "timestamp": "2025-10-30T14:46:55.087567Z"
    },
    {
      "original": "Now over Zhytomyr Oblast. Flying one after another",
      "timestamp": "2025-10-30T14:46:55.087570Z"
    },
    {
      "original": "Flying over Rivne Oblast towards Dobrotvir, Lviv Oblast",
      "timestamp": "2025-10-30T14:46:55.087573Z"
    },
    {
      "original": "Flying over Rivne Oblast towards Dobrotvir, Lviv Oblast",
      "timestamp": "2025-10-30T14:46:55.087576Z"
    },
    {
      "original": "They will hit the power plant in Dobrotvir. Kh-101s hit it earlier",
      "timestamp": "2025-10-30T14:46:55.087580Z"
    },
    {
      "original": "Explosions in Dobrotvir.",
      "timestamp": "2025-10-30T14:46:55.087583Z"
    },
    {
      "original": "The missile attack is now over. More than 60 missiles of various types were used. I will publish a full report + the consequences later on. \nIf you wish to support my work, you can do so here: \nhttps://buymeacoffee.com/amk_mapping\n. \nThank you for following along.",
      "timestamp": "2025-10-30T14:46:55.087590Z"
    },
    {
      "original": "Last night, another large-scale, combined missile and drone attack was carried out on Ukraine: \nMissiles launched:\n~25 Kh-101 cruise missiles launched from 7 Tu-95MS strategic bombers at the launch lines in Mokshansky District, Penza Oblast.\n~7 Iskander-M ballistic missiles launched from OTRK installations northwest of Feodosia, Crimea.\n~5 Iskander-M ballistic missiles launched from OTRK northeast of Simfereopol, Crimea.\n~3 Iskander-M ballistic missiles launched from OTRK installations near Taganrog, Rostov Oblast. \n~6 Kalibr cruise missiles launched from 1 \"Admiral Makarov\" frigate.\n~6 Kalibr cruise missiles launched from 1 \"Admiral Essen\" frigate.\n~4 Kinzhal aeroballistic hypersonic missiles launched from 4 MiG-31Ks at the launch lines in Rasskazovsky District, Tambov Oblast.\n~2 Kinzhal aeroballistic hypersonic missiles launched from 2 MiG-31Ks at the launch lines in the area of Lipetsk City. \n~2 Kh-59 cruise missiles launched from 2 Su-34 fighters at the launch lines near Starobilsk, Luhansk Oblast.\n~1 Kh-31P anti-radar missile launched from a Su-30SM fighter at the launch lines over the Black Sea west of Yevpatoriya, Crimea.\nInterceptions rates are currently unknown but are very low. A minimum of 2 Kh-59s, 2 Kalibrs and 2 Kh-101s were shot down. \nThe main targets for this strike were once again Ukrainian energy infrastructure. The following was hit:\nDnipro Hydroelectric Power Plant, Zaporizhzhia Oblast (47.86934, 35.08132) by ~8 Iskander-M ballistic missiles.\nUnknown target in northern Zaporizhzhia City, Zaporizhzhia Oblast by ~5 Iskander-M ballistic missiles.\nUnknown target in Dnipro, Dnipropetrovsk Oblast by 2 Iskander-Ms. \nLadyzhyn Thermal Power Plant, Vinnytsia Oblast (48.70478, 29.22006) by ~2 Kinzhals, ~10 Kh-101s, and 2 Kalibrs. \nDobrotvirska Thermal Power Plant, Lviv Oblast (50.21388, 24.37588) by ~2 Kinzhals and ~5 Kh-101s.\nBurshtyn Thermal Power Plant, Ivano-Frankivak Oblast (49.20971, 24.66424) by ~3 Kh-101s and 2 Kalibrs.\nKalush Coal Power Plant, Ivano-Frankivsk Oblast (49.07006, 24.31860) by ~2 Kh-101s. \nDashava Underground Gas Storage Facility, Lviv Oblast (49.40383, 23.89924) by ~2 Kalibrs.\nStarokostyantyniv Airbase, Khmelnytskyi Oblast. (49.74558, 27.26758) by ~2 Kinzhals.\nDniester Hydroelectric Power Plant, Chernivtsi Oblast (48.59357, 27.45283) by ~4 Kh-101s.\nUnknown target near Sarata, Odesa Oblast by 1 Kh-31P.\nAdditional places targeted by Geran-2 drones, but not by missiles, include:\nChernihiv City, Chernihiv Oblast.\nBoryspil, Kyiv Oblast.\nKrolevets, Sumy Oblast. \nPodilsk area, Odesa Oblast.\nKropyvnytskyi area, Kirovohrad Oblast.\nOpishnia area, Poltava Oblast.\nKramatorsk area, Donetsk Oblast.\nOleksandrivka area, Donetsk Oblast.\nLubny area, Poltava Oblast.\nPryluky area, Chernihiv Oblast. \nAdditionally, several Tornado-S rockets and KAB glide-bombs also impacted Zaporizhzhia City last night. \nKeep in mind, the numbers of missiles launched are slightly higher than what I've listed, as the number of missiles detected was lower than actual launches.",
      "timestamp": "2025-10-30T14:46:55.087619Z"
    },
    {
      "original": "A large fire is burning at the Burshtyn Thermal Power Plant in Ivano-Frankivsk Oblast after multiple Russian Kh-101 cruise missiles and more than 50 Geran-2 drones struck it. \nElectricity, heating, and water has been halted for the entire city of Burshtyn.",
      "timestamp": "2025-10-30T14:46:55.087623Z"
    },
    {
      "original": "Footage showing one of the many Geran-2 drone strikes on the Ladyzhyn Thermal Power Plant in Vinnytsia Oblast. Several cruise missiles also struck it.",
      "timestamp": "2025-10-30T14:46:55.087627Z"
    },
    {
      "original": "Scenes from the massive missile strike on Zaporizhzhia City. More than 45 missiles, drones, rockets, and KABs were used on targets in the city.",
      "timestamp": "2025-10-30T14:46:55.087630Z"
    },
    {
      "original": "Scenes from the massive missile strike on Zaporizhzhia City. More than 45 missiles, drones, rockets, and KABs were used on targets in the city.",
      "timestamp": "2025-10-30T14:46:55.087634Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones impacted Boryspil International Airport in Kyiv Oblast. NASA FIRMS data shows a large fire burning in the area of the hangars.",
      "timestamp": "2025-10-30T14:46:55.087637Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones impacted Boryspil International Airport in Kyiv Oblast. NASA FIRMS data shows a large fire burning in the area of the hangars.",
      "timestamp": "2025-10-30T14:46:55.087640Z"
    },
    {
      "original": "Emergency power outages have been implemented in several regions of Ukraine due to the massive Russian missile strikes tonight. \nKeep in mind, this is on top of the already scheduled rolling power outages currently in place for almost all regions.",
      "timestamp": "2025-10-30T14:46:55.087648Z"
    },
    {
      "original": "Russian forces have captured the village of Vyshneve, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~926.\nTotal land area: ~1.94 km².",
      "timestamp": "2025-10-30T14:46:55.087653Z"
    },
    {
      "original": "The Ukrainian soldiers still stationed and effectively encircled at the bottom of the Pokrovsk pocket in Lysivka and Sukhyi Yar remind me of those who were encircled in the industrial zones outside Avdiivka. \nNeither time were they given the order to withdraw in time, even though there were weeks of opportunities to do so. \nThe Ukrainian command does not care about these soldiers and is happy to use them to delay the collapse of their PR cities for propaganda purposes. This is absolutely disgusting and should be a wakeup call for those who still think otherwise.",
      "timestamp": "2025-10-30T14:46:55.087658Z"
    },
    {
      "original": "The next round of map updates will come tomorrow once I have the energy to post about it. I covered the missile attack for over 12 hours straight with no breaks today lol.\nThis means some of the info provided will be slightly delayed, but there will be a lot to talk about regarding Pokrovsk. It also means some of the other Ukraine-related news I planned to post about wont be covered today.",
      "timestamp": "2025-10-30T14:46:55.087662Z"
    },
    {
      "original": "Over 130 Killed In Deadliest Police Raid In History Of Brazil (Videos)\nOver 130 people, including several police officers, died in a massive raid by Brazilian security forces aimed at organized crime in Rio de Janeiro on October 28.\nRio de Janeiro State Governor Cláudio Castro told reporters at a press conference that police confiscated a “large quantity of drugs” in the raid, according to Reuters. Authorities also claimed on social media that 81 people were arrested and at least 42 rifles were seized during the operation.\nCastro went on to pronounce the raid “the biggest operation in the history of Rio de Janeiro” in a post to the X social network.\nRead more \nHERE",
      "timestamp": "2025-10-30T14:46:55.808931Z"
    },
    {
      "original": "Over 130 Killed In Deadliest Police Raid In History Of Brazil (Videos)\nOver 130 people, including several police officers, died in a massive raid by Brazilian security forces aimed at organized crime in Rio de Janeiro on October 28.\nRio de Janeiro State Governor Cláudio Castro told reporters at a press conference that police confiscated a “large quantity of drugs” in the raid, according to Reuters. Authorities also claimed on social media that 81 people were arrested and at least 42 rifles were seized during the operation.\nCastro went on to pronounce the raid “the biggest operation in the history of Rio de Janeiro” in a post to the X social network.\nRead more \nHERE",
      "timestamp": "2025-10-30T14:46:55.808958Z"
    },
    {
      "original": "UKRAINE'S POKROVSK GAMBIT: GATHERING THE LAST RESERVES IN ATTEMPTS TO STOP THE RUSSIANS",
      "timestamp": "2025-10-30T14:46:55.808963Z"
    },
    {
      "original": "Situation Is ‘Very Negative’ For Ukraine: Russian Forces Break Through Pokrovsk Line\nUnits of the «Center» group have taken control of the villages of Rog and Gnatovka, and are fighting for control of the industrial zone to the north of Pokrovsk. In Zaporizhzhia, the «East» grouping has seized control of the Vishnevoe area. \nThe Ukrainian command is planning to withdraw its units from the Pokrovsk-Mirnograd district.\nRead more \nHERE",
      "timestamp": "2025-10-30T14:46:55.808971Z"
    },
    {
      "original": "Situation Is ‘Very Negative’ For Ukraine: Russian Forces Break Through Pokrovsk Line\nUnits of the «Center» group have taken control of the villages of Rog and Gnatovka, and are fighting for control of the industrial zone to the north of Pokrovsk. In Zaporizhzhia, the «East» grouping has seized control of the Vishnevoe area. \nThe Ukrainian command is planning to withdraw its units from the Pokrovsk-Mirnograd district.\nRead more \nHERE",
      "timestamp": "2025-10-30T14:46:55.808979Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 29, 2025\nOn October 29, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-30T14:46:55.808987Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 29, 2025\nOn October 29, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-30T14:46:55.808994Z"
    },
    {
      "original": "Kyiv Wants Land, Not People: Former US State Department Adviser Warns\nJames Carden, former US State Department Russia Policy Adviser has faced criticism in certain circles over his otherwise underreported comments during a recent interview to Australian Sky News — especially for mentioning some hard truths about the ethnopolitics of Ukraine.\nIn that interview, Mr. Carden noted that, like HIMARS or F-16s, Tomahawks won’t be a gamechanger, and argued that Putin’s proposal — EU but not NATO membership — was a fair enough bargain. When the host replied that, in this case, that would involve land concessions as part of a land-for-peace deal, the former State Department Adviser argued that the land Kyiv would be ceding is a land that: “they themselves have been attacking since 2014. The Ukrainians are being a bit disingenuous here... They claim to want the land in the Donbass, Eastern Ukraine. But they don’t want the ethnic Russian citizens on that land. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-30T14:46:55.809005Z"
    },
    {
      "original": "U.S. Will Build Nuclear Submarine For South Korea To Strangle Chinese Navy\nUnited States President Donald Trump announced on October 30 that he had given South Korea approval to build a nuclear-powered submarine as a part of the new trade deal between the two countries.\nThe submarine will be built in a Philadelphia shipyard, where South Korean firms have increased investment, according to Trump.\n“South Korea will be building its Nuclear Powered Submarine in the Philadelphia Shipyards, right here in the good ol’ U.S.A. Shipbuilding in our Country will soon be making a BIG COMEBACK,” Trump wrote on his Truth Social network.\nOn October 29, Trump announced that the U.S. and South Korea reached a trade deal in which South Korea would pay the U.S. $350 billion in exchange for lower tariffs. The president also said that South Korea agreed to purchase U.S. oil and gas in “vast quantities.” \n👉\n Read more \nHERE",
      "timestamp": "2025-10-30T14:46:55.809017Z"
    },
    {
      "original": "Russian Army Is Few Kilometers Away From Locking Up Pokrovsk, Securing Yanchur Line \nOn October 30, the Russian military reached the northern outskirts of the city of Pokrovsk in Donetsk and captured another settlement along the Yanchur River in Zaporozhye.\nThe Tsentr [Center] Group of Forces reached the northern outskirts of Pokrovsk in several areas after breaking through Ukrainian defenses in the center of the city. One of these areas is between the streets of Provulok Yakuba Kolasa and Vulytsya Zavods’ka, close to the cemetery along the road leading to Dobropillia further to the north.\nAt the same time, the Tsentr Group of Forces advanced to the south of Rodynske, along Dobropillia road, approaching Pokrovsk.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-30T14:46:55.809027Z"
    },
    {
      "original": "Russian Army Is Few Kilometers Away From Locking Up Pokrovsk, Securing Yanchur Line \nOn October 30, the Russian military reached the northern outskirts of the city of Pokrovsk in Donetsk and captured another settlement along the Yanchur River in Zaporozhye.\nThe Tsentr [Center] Group of Forces reached the northern outskirts of Pokrovsk in several areas after breaking through Ukrainian defenses in the center of the city. One of these areas is between the streets of Provulok Yakuba Kolasa and Vulytsya Zavods’ka, close to the cemetery along the road leading to Dobropillia further to the north.\nAt the same time, the Tsentr Group of Forces advanced to the south of Rodynske, along Dobropillia road, approaching Pokrovsk.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-30T14:46:55.809036Z"
    },
    {
      "original": "Military Situation In Syria On October 30, 2025 (Map Update)",
      "timestamp": "2025-10-30T14:46:55.809039Z"
    }
  ],
  "script_run_time": "2025-10-30T14:46:55.810900Z"
}