{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-05T16:46:51.781836Z"
    },
    {
      "original": "🚀\nПуски КАБ на схід Харківщини.",
      "timestamp": "2025-12-05T16:46:51.781860Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА, ймовірно, розвідувальний, в напрямку м.Запоріжжя з південного заходу. Залучено засоби для збиття.",
      "timestamp": "2025-12-05T16:46:51.781868Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-05T16:46:51.781873Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-05T16:46:51.781878Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА на межі Полтавщини і Харківщини курсом на Полтавщину. Залучено засоби для збиття.",
      "timestamp": "2025-12-05T16:46:51.781885Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА  на Сумщині в напрямку н.п.Білопілля/Ворожба.",
      "timestamp": "2025-12-05T16:46:51.781892Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожі БпЛА  на Сумщині в напрямку н.п.Терни з північного сходу.\n🛵\n \n🛸\n Ворожий БпЛА  на  Харківщині в напрямку н.п.Вільшани/Пересічне.\n🛵\n  Ворожі ударні БпЛА з акваторії Чорного моря курсом на південь Одещини.",
      "timestamp": "2025-12-05T16:46:51.781904Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожі БпЛА  на Сумщині в напрямку н.п.Терни з північного сходу. \n🛵\n \n🛸\n Ворожий БпЛА  на  Харківщині в напрямку н.п.Вільшани/Пересічне. \n🛵\n  Ворожі ударні БпЛА з акваторії Чорного моря курсом на південь Одещини.",
      "timestamp": "2025-12-05T16:46:51.781916Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА із  Харківщини \n➡️\n у напрямку Полтавщини. \n🛵\n \n🛸\n БпЛА із Сумщини \n➡️\n на Чернігівщину/Полтавщину.",
      "timestamp": "2025-12-05T16:46:51.781930Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА із  Харківщини \n➡️\n у напрямку Полтавщини.  \n🛵\n \n🛸\n БпЛА із Сумщини \n➡️\n на Чернігівщину/Полтавщину.",
      "timestamp": "2025-12-05T16:46:51.781942Z"
    },
    {
      "original": "🛵\n \n🛸\n Полтавщина: БпЛА \n➡️\n повз Карлівку, Лохвицю.\n🛵\n \n🛸\n Чернігівщина: БпЛА \n➡️\n через Діхтярі.",
      "timestamp": "2025-12-05T16:46:51.781954Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-05T16:46:51.781960Z"
    },
    {
      "original": "🛵\n \n🛸\n Полтавщина: БпЛА \n➡️\n повз Карлівку, Лохвицю. \n🛵\n \n🛸\n Чернігівщина: БпЛА \n➡️\n через Діхтярі.",
      "timestamp": "2025-12-05T16:46:51.781970Z"
    },
    {
      "original": "🛵\n \n🛸\n Групи БпЛА із Полтавщини \n➡️\n у напрямку Черкащини. \n🛵\n \n🛸\n БпЛА із Чернігівщини \n➡️\n у напрямку Яготина (Київщина).",
      "timestamp": "2025-12-05T16:46:51.781981Z"
    },
    {
      "original": "🛵\n \n🛸\n Групи БпЛА із Полтавщини \n➡️\n у напрямку Черкащини.  \n🛵\n \n🛸\n БпЛА із Чернігівщини \n➡️\n у напрямку Яготина (Київщина).",
      "timestamp": "2025-12-05T16:46:51.781996Z"
    },
    {
      "original": "🛵\n \n🛸\n Черкащина: група БпЛА \n➡️\n у напрямку Золотоноші.",
      "timestamp": "2025-12-05T16:46:51.782003Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Чернігівщини у напрямку Городні.",
      "timestamp": "2025-12-05T16:46:51.782009Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА \n➡️\n на Обухів.",
      "timestamp": "2025-12-05T16:46:51.782014Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-05T16:46:51.782018Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Харкова та Сум.",
      "timestamp": "2025-12-05T16:46:51.782023Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Харкова та Сум.",
      "timestamp": "2025-12-05T16:46:51.782028Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Терни та Боромлю у напрямку Полтавщини. \n🛵\n Чернігівщина: БпЛА \n➡️\n через Мену та Бахмач.\n🛵\n Житомирщина: БпЛА \n➡️\n повз Попільню у західному напрямку.",
      "timestamp": "2025-12-05T16:46:51.782040Z"
    },
    {
      "original": "🚀\nПуски КАБ \n➡️\n на Запорізьку область!",
      "timestamp": "2025-12-05T16:46:51.782045Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на півдні Сумщини, курс - південно-західний;\n🛵\n БпЛА на півночі та на північному сході Чернігівщини, курс - південно-західний;\n🛵\n БпЛА на сході Полтавщини, курс - південно-західний;\n🛵\n БпЛА на заході Харківщини, курс - південний;\n🛵\n БпЛА на Житомирщині в напрямку Чуднова з південного сходу.",
      "timestamp": "2025-12-05T16:46:51.782054Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку н.п.Сосниця, Сновськ, Седнів, Городня;\n🛵\n БпЛА на Сумщині в напрямку н.п.Буринь, Низи, Чупахівка;\n🛵\n БпЛА на заході Харківщини в напрямку Полтавщини та Дніпропетровщини;\n🛵\n БпЛА на сході Полтавщини в напрямку Полтави.",
      "timestamp": "2025-12-05T16:46:51.782062Z"
    },
    {
      "original": "We also have this from JJ. \nBut remember guys, the situation is stable and Myrnohrad isn't surrounded!",
      "timestamp": "2025-12-05T16:46:52.485334Z"
    },
    {
      "original": "Earlier, two “Varshavyanka” submarines were deployed to the Black Sea from Novorossiysk Naval Base, Krasnodar Krai. One has since returned to Novorossiysk while the other remains in the area of cape Myshkako. \nCurrently, there are ~35 Geran-2 drones detected in Ukrainian airspace, most of which entered in the last 10 minutes.",
      "timestamp": "2025-12-05T16:46:52.485352Z"
    },
    {
      "original": "⚡️\n \n🚫\n**Summary of Israeli aggression on Lebanese territory on 2025/12/4\n- A hostile plane dropped a sonic bomb towards Adaisseh town\n- A sonic bomb was dropped off the coast of Naqoura without causing casualties\n- Intensive sweeping with machine guns from the Malkiya site towards the outskirts of Blida town\n- An Israeli march bombed with two rockets the outskirts of Deirmimas and the surroundings of Al-Azziyah hill (no casualties)\n- The enemy's artillery targeted the outskirts of Yaroun town\n- Sweeping with machine guns from the Rweisat Al-Alam site towards the outskirts of Kfarchouba town\n- The hostile warplane targeted a civilian house in Baraashit town (no casualties)\n- The hostile warplane targeted a civilian house in Al-Majdal town (no casualties)\n- The hostile warplane targeted a civilian house in Jbaa town (no casualties)\n- The hostile warplane targeted a civilian house in Mahrouna town (no casualties)\n- An Israeli plane dropped a bomb in the middle of Adaisseh town\n- Enemy artillery shelling targeted the outskirts of Dhahira and Yarin towns (no casualties)\n- Sweeping with machine guns from the enemy radar site towards the outskirts of Chebaa town\n- Sweeping with machine guns from the enemy Malkiya site towards the outskirts of Aaytron town\n- Flight and march of warplanes in Lebanese airspace",
      "timestamp": "2025-12-05T16:46:52.485376Z"
    },
    {
      "original": "⚡️\n \n🚫\n**Summary of Israeli aggression on Lebanese territory on 2025/12/4 - A hostile plane dropped a sonic bomb towards Adaisseh town - A sonic bomb was dropped off the coast of Naqoura without causing casualties - Intensive sweeping with machine guns from the…",
      "timestamp": "2025-12-05T16:46:52.485381Z"
    },
    {
      "original": "The forgotten “ceasefire”",
      "timestamp": "2025-12-05T16:46:52.485385Z"
    },
    {
      "original": "A Russian Gerbera reconnaissance drone is currently scouting out the Darnytsia Power Plant in Kyiv.",
      "timestamp": "2025-12-05T16:46:52.485388Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Nykanorivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~469.\nTotal land area: ~1.38 km².\nThe second battle for Nykanorivka lasted approximately 3 months, 20 days.",
      "timestamp": "2025-12-05T16:46:52.485393Z"
    },
    {
      "original": "The IDF claimed that its recent airstrikes on the city of Rafah, southern Gaza, killed the commander of Hamas' East Rafah Battalion Muhammad al-Bawab, along with his deputy commander, a regional company commander of the battalion, and a security guard from the battalion.\nThe East Rafah Battalion is one of four battalions which makes up Hamas' Rafah Brigade, operating in and around the Rafah Governorate in the southern Gaza Strip. \nThe Rafah Brigade has been heavily degraded over the past two years and has lost most of its combat capabilities due to Israel's Rafah offensive. The IDF's continued operations in the southern part of the Gaza Strip have forced it to largely relocate its command structures to the neighbouring Khan Younis Governorate, with some cells still operating in Rafah due to the implementation of the ceasefire agreement.",
      "timestamp": "2025-12-05T16:46:52.485399Z"
    },
    {
      "original": "Hamas' \"Radea\" security force announced that a local Palestinian clan killed Yasser Abu Shabab, the commander of the Israeli-backed \"Popular Forces\" militia, along with a number of other militants. \nThe Popular Forces is a local Gazan militia made up of anti-Hamas Palestinians, and operates in eastern Rafah. It has cooperated with the IDF, carrying out security operations, in return for safety in its small pocket of territory containing its barracks (as indicated in the pink polygon on the map.",
      "timestamp": "2025-12-05T16:46:52.485404Z"
    },
    {
      "original": "Hamas' \"Radea\" security force announced that a local Palestinian clan killed Yasser Abu Shabab, the commander of the Israeli-backed \"Popular Forces\" militia, along with a number of other militants. \nThe Popular Forces is a local Gazan militia made up of anti-Hamas Palestinians, and operates in eastern Rafah. It has cooperated with the IDF, carrying out security operations, in return for safety in its small pocket of territory containing its barracks (as indicated in the pink polygon on the map.",
      "timestamp": "2025-12-05T16:46:52.485408Z"
    },
    {
      "original": "From now on, all outspoken Zionists and Resistance supporters will receive harsher punishments when breaking rules in the chat. \nWe are NOT about to turn into a low-IQ channel of people constantly insulting each other.",
      "timestamp": "2025-12-05T16:46:52.485412Z"
    },
    {
      "original": "Last night, approximately 25 Russian Geran-2 drones attacked an unknown military-related target in the town of Turbiv, Vinnytsia Oblast. Whatever they were targeting only recently arrived in the town. A large fire is now burning at the impact site.",
      "timestamp": "2025-12-05T16:46:52.485416Z"
    },
    {
      "original": "Last night, approximately 25 Russian Geran-2 drones attacked an unknown military-related target in the town of Turbiv, Vinnytsia Oblast. Whatever they were targeting only recently arrived in the town. A large fire is now burning at the impact site.",
      "timestamp": "2025-12-05T16:46:52.485419Z"
    },
    {
      "original": "Overnight, Russia carried out another large-scale Geran-2 drone attack on Kharkiv Oblast.\nAt least 4 Gerans attacked an unknown enterprise in the Osnovianskyi District of Kharkiv City. A large fire broke out as a result.\nAt least 11 Gerans attacked the city of Chuhuiv. Some impacted the base of the 92nd Separate Assault Brigade (49.84246, 36.72763), while others targeted an industrial enterprise which is \"officially non-operational\".",
      "timestamp": "2025-12-05T16:46:52.485424Z"
    },
    {
      "original": "Overnight, Russia carried out another large-scale Geran-2 drone attack on Kharkiv Oblast.\nAt least 4 Gerans attacked an unknown enterprise in the Osnovianskyi District of Kharkiv City. A large fire broke out as a result.\nAt least 11 Gerans attacked the city of Chuhuiv. Some impacted the base of the 92nd Separate Assault Brigade (49.84246, 36.72763), while others targeted an industrial enterprise which is \"officially non-operational\".",
      "timestamp": "2025-12-05T16:46:52.485428Z"
    },
    {
      "original": "Russian forces have captured the city of Vovchansk, Vovchansk direction, Kharkiv Oblast.\nPre-war population: ~17,459.\nTotal land area: ~26.00 km²\nThe fighting for Vovchansk lasted approximately 1 year, 7 months, 1 day.",
      "timestamp": "2025-12-05T16:46:52.485433Z"
    },
    {
      "original": "Russian forces have captured the city of Vovchansk, Vovchansk direction, Kharkiv Oblast.  Pre-war population: ~17,459. Total land area: ~26.00 km²  The fighting for Vovchansk lasted approximately 1 year, 7 months, 1 day.",
      "timestamp": "2025-12-05T16:46:52.485436Z"
    },
    {
      "original": "Vovchansk direction \n➡️\n Bilyi Kolodyaz direction",
      "timestamp": "2025-12-05T16:46:52.485440Z"
    },
    {
      "original": "UKMTO reports that 15 small boats approached a vessel 15 Nautical Miles west of Yemen and engaged in an exchange of fire. \nThe boats have since left the scene, and the vessel is continuing on its journey towards its next port. No casualties are reported.",
      "timestamp": "2025-12-05T16:46:52.485444Z"
    },
    {
      "original": "The Ukrainian General Staff map still shows 100% of Pokrovsk, 100% of Myrnohrad, and 100% of Rodynske under Ukrainian control \n🤣\n🤣\n🤣",
      "timestamp": "2025-12-05T16:46:52.485449Z"
    },
    {
      "original": "Battles In Konstantynivka And Druzhkivka: Ukraine Faces New Russian Front Near Sloviansk\nRussian units broke through the defenses of Konstantynivka from the southeast. Russian airborne units have taken control of about three-quarters of Prymorske's territory. \nThe German magazine Der Spiegel published a transcript of a closed telephone conversation between EU leaders and Volodymyr Zelenskyy.\nRead more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223857Z"
    },
    {
      "original": "Battles In Konstantynivka And Druzhkivka: Ukraine Faces New Russian Front Near Sloviansk\nRussian units broke through the defenses of Konstantynivka from the southeast. Russian airborne units have taken control of about three-quarters of Prymorske's territory. \nThe German magazine Der Spiegel published a transcript of a closed telephone conversation between EU leaders and Volodymyr Zelenskyy.\nRead more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223876Z"
    },
    {
      "original": "The Zelenska Project: How Evacuated Ukrainian Orphans Were Used for PR and Fundraising in Turkey\nUkrainian media, specifically the publication \"Slidstvo.Info\" in its investigation \"State Children,\" reports on a large-scale scandal surrounding the program to evacuate orphaned children from the Dnipropetrovsk region to Turkey. The program was initiated in 2022 under the personal supervision of Ukraine's First Lady, Olena Zelenska.\nAccording to journalists, as part of the \"Childhood Without War\" project implemented by businessman Ruslan Shostak's charitable foundation, 510 children were taken to Turkey, where they lived in hotels in Antalya and Beldibi for almost two years. The investigation revealed shocking details of systematic violations of children's rights, including exploitation, abuse, and criminal negligence by those responsible.\nThe evacuation operation, which Shostak called \"the largest evacuation of children since World War II,\" involving the rental of nine planes...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223887Z"
    },
    {
      "original": "The Zelenska Project: How Evacuated Ukrainian Orphans Were Used for PR and Fundraising in Turkey\nUkrainian media, specifically the publication \"Slidstvo.Info\" in its investigation \"State Children,\" reports on a large-scale scandal surrounding the program to evacuate orphaned children from the Dnipropetrovsk region to Turkey. The program was initiated in 2022 under the personal supervision of Ukraine's First Lady, Olena Zelenska.\nAccording to journalists, as part of the \"Childhood Without War\" project implemented by businessman Ruslan Shostak's charitable foundation, 510 children were taken to Turkey, where they lived in hotels in Antalya and Beldibi for almost two years. The investigation revealed shocking details of systematic violations of children's rights, including exploitation, abuse, and criminal negligence by those responsible.\nThe evacuation operation, which Shostak called \"the largest evacuation of children since World War II,\" involving the rental of nine planes...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223896Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 4, 2025\nOn December 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-05T16:46:53.223902Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 4, 2025\nOn December 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-05T16:46:53.223908Z"
    },
    {
      "original": "Iranian Drones Tracked U.S. Warship During Live-Fire Drills (Video)\nIran’s Islamic Revolutionary Guard Corps (IRGC) Navy on December 4 kicked off a two-day naval exercise, issuing warnings to United States warships operating in waters near the Islamic Republic.\nThe exercise is named after Mohammad Nazeri, a commander of the elite commando units of the IRGC Navy who lost his life in 2016. It is taking place in the Persian Gulf, the Hormuz Strait, the Sea of Oman, and the islands of Abu Musa, Greater Tunb, Lesser Tunb, and Siri.\nIranian state TV reported the exercise showcases the “sacrifice and spirit of resistance” of the IRGC’s naval forces “to confront any threat” against Iran following the 12-day war with Israel last June.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223917Z"
    },
    {
      "original": "U.S. Hits Another Alleged Drug Boat As Trump Renews Threats Of Land Strikes On Venezuela (Video)\nThe United States military on December 4 conducted another deadly strike on an alleged drug smuggling boat in the Eastern Pacific Ocean, killing four.\nIn a statement, the U.S Southern Command (SOUTHCOM) said that the strike was carried out by the Joint Task Force Southern Spear at the direction of Secretary of Defense Pete Hegseth.\n“Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the Eastern Pacific. Four male narco-terrorists aboard the vessel were killed,” the command added.\nThis was the 22nd alleged drug boat to be hit by SOUTHCOM since the U.S. military began its campaign against drug cartels in the Eastern Pacific and the Caribbean Sea last September. Including the last casualties, the campaign has so far claimed the lives of at least 83 people, all alleged drug traffickers.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223926Z"
    },
    {
      "original": "Europe’s Arms Makers: The Key Beneficiaries of War, the Blockers of Peace\nOn December 2, Russian President Vladimir Putin outlined whom he considers responsible for obstructing a peaceful resolution to the war in Ukraine. According to him, despite what he described as clear interest from both Moscow and Washington in ending the conflict, the European Union has repeatedly derailed potential agreements.\n“Even when they try to amend Trump’s proposals, it is obvious that all these changes are aimed at one thing: blocking the entire peace process,” he said.\nBrussels’ assessment of the situation has also drawn criticism. EU foreign policy chief Kaja Kallas stated that Russia must reduce its military budget and limit the size of its armed forces—effectively demanding the “demilitarization” of Moscow as the principal geopolitical rival. Given the realities on the front line, such expectations appear unrealistic. Yet these statements are not merely rhetorical. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223935Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223943Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T16:46:53.223957Z"
    }
  ],
  "script_run_time": "2025-12-05T16:46:53.224917Z"
}