{
  "messages": [
    {
      "original": "⚠\nУВАГА\nЧеркаська, Кіровоградська, Полтавська, Миколаївська, Херсонська, Дніпропетровська області - ракетна небезпека!",
      "timestamp": "2026-01-10T18:00:17.627126Z"
    },
    {
      "original": "⚠\nУВАГА Черкаська, Кіровоградська, Полтавська, Миколаївська, Херсонська, Дніпропетровська області - ракетна небезпека!",
      "timestamp": "2026-01-10T18:00:17.627140Z"
    },
    {
      "original": "📢\n Відбій загрози",
      "timestamp": "2026-01-10T18:00:17.627146Z"
    },
    {
      "original": "ПІДГОТОВКА ПОВІТРЯНИХ СИЛ ПІД ЧАС ВІЙНИ: СИСТЕМА, ЩО НАРОДЖУЄТЬСЯ В БОЮ\n--------------------\nКоротко про головне у навчанні та підготовці Повітряних Сил, про те, як гартується система в умовах війни, розповідає генерал-майор Олександр Турінський.\n--------------------\nЧитати \nза посиланням",
      "timestamp": "2026-01-10T18:00:17.627153Z"
    },
    {
      "original": "ПІДГОТОВКА ПОВІТРЯНИХ СИЛ ПІД ЧАС ВІЙНИ: СИСТЕМА, ЩО НАРОДЖУЄТЬСЯ В БОЮ\n--------------------\nКоротко про головне у навчанні та підготовці Повітряних Сил, про те, як гартується система в умовах війни, розповідає генерал-майор Олександр Турінський.\n--------------------\nЧитати \nза посиланням",
      "timestamp": "2026-01-10T18:00:17.627159Z"
    },
    {
      "original": "🛵\n🛸\n Ворожий БпЛА в напрямку міста Запоріжжя з півночі.",
      "timestamp": "2026-01-10T18:00:17.627165Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА на півдні області, курс - західний.",
      "timestamp": "2026-01-10T18:00:17.627169Z"
    },
    {
      "original": "🛵\n  БпЛА на південь Одещини з акваторії Чорного моря.",
      "timestamp": "2026-01-10T18:00:17.627173Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину!",
      "timestamp": "2026-01-10T18:00:17.627178Z"
    },
    {
      "original": "🛵\n Чернігівщина - БпЛА поблизу Корюківки, курс південно-східний.",
      "timestamp": "2026-01-10T18:00:17.627182Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2026-01-10T18:00:17.627186Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі!",
      "timestamp": "2026-01-10T18:00:17.627191Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2026-01-10T18:00:17.627195Z"
    },
    {
      "original": "Харківщина - ракетна небезпека!",
      "timestamp": "2026-01-10T18:00:17.627199Z"
    },
    {
      "original": "Харківщина - ракетна небезпека!",
      "timestamp": "2026-01-10T18:00:17.627202Z"
    },
    {
      "original": "📢\n Відбій загрози",
      "timestamp": "2026-01-10T18:00:17.627206Z"
    },
    {
      "original": "🛵\n Дніпропетровщина - БпЛА повз Шахтарське, курсом на Павлоград.",
      "timestamp": "2026-01-10T18:00:17.627210Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини - курсом на Чернігівщиную\n🛵\n Чернігівщина - група БпЛА курсом на Мену.",
      "timestamp": "2026-01-10T18:00:17.627216Z"
    },
    {
      "original": "🛵\n Чернігівщина -  БпЛА курсом на Олишівку, Батурин, Ніжин, Носівку.",
      "timestamp": "2026-01-10T18:00:17.627221Z"
    },
    {
      "original": "🛵\n БпЛА на південному заході Чернігівщини, курс - південно-західний (Київщина).",
      "timestamp": "2026-01-10T18:00:17.627229Z"
    },
    {
      "original": "Iskander on Chernihiv Oblast, then to Kyiv",
      "timestamp": "2026-01-10T18:00:18.185517Z"
    },
    {
      "original": "Flying to Obolon District, northern Kyiv",
      "timestamp": "2026-01-10T18:00:18.185529Z"
    },
    {
      "original": "Flying to Obolon District, northern Kyiv",
      "timestamp": "2026-01-10T18:00:18.185533Z"
    },
    {
      "original": "20 seconds away",
      "timestamp": "2026-01-10T18:00:18.185536Z"
    },
    {
      "original": "20 seconds away",
      "timestamp": "2026-01-10T18:00:18.185539Z"
    },
    {
      "original": "2 missiles, flying to the city centre, then to southwestern Kyiv",
      "timestamp": "2026-01-10T18:00:18.185543Z"
    },
    {
      "original": "Another Iskander to Chernihiv Oblast",
      "timestamp": "2026-01-10T18:00:18.185546Z"
    },
    {
      "original": "2 Iskanders are flying to Vasylkiv, Kyiv Oblast",
      "timestamp": "2026-01-10T18:00:18.185549Z"
    },
    {
      "original": "Explosions in Kyiv",
      "timestamp": "2026-01-10T18:00:18.185552Z"
    },
    {
      "original": "The missile attack appears to be over. More than 40 missiles of various types, including an Oreshnik IRBM, were used. I will publish a full report + the consequences later on. \nIf you wish to support my work, you can do so here: \nhttps://buymeacoffee.com/amk_mapping\n. \nThank you for following along.",
      "timestamp": "2026-01-10T18:00:18.185565Z"
    },
    {
      "original": "Additionally, at least 100 Geran-2 drones are flying in the direction of Kyiv. There is a high likelihood of additional missiles being used (not Oreshnik or Kh-101).",
      "timestamp": "2026-01-10T18:00:18.185568Z"
    },
    {
      "original": "Last night, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~10 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~2 Iskander-M ballistic missiles launched from an OTRK installation in the vicinity of Bryansk City, Bryansk Oblast.\n~8 Kalibr cruise missiles launched from 1 \"Admiral Makarov\" Frigate at Novorossiysk Bay, Krasnodar Krai.\n~8 Kalibr cruise missiles launched from 1 \"Admiral Essen\" Frigate at Novorossiysk Bay, Krasnodar Krai.\n~6 Kalibr cruise missiles launched from 1 \"Varshavyanka\" Submarine in the waters of the Black Sea, off the coast of Cape Myshkako, Krasnodar Krai. \n~1 Oreshnik IRBM launched from the Kapustin Yar Testing Ground, Astrakhan Oblast.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 3 Kalibr cruise missiles.\n-----------------------\nThe main targets for this strike was Ukrainian energy infrastructure in Kyiv. The following was targeted:\nCHP-5 Power & Heat Plant, Kyiv Oblast (50.39403, 30.56928) by ~6 Kalibrs & ~4 Iskander-Ms.\nCHP-4 Power and Heat Plant, Kyiv Oblast (50.44693, 30.64255) by ~2 Kalibrs.\nCHP-6 Power and Heat Plant, Kyiv Oblast (50.53188, 30.66309) by ~5 Kalibrs and ~6 Iskander-Ms.\nUnderground gas infrastructure in Lviv Oblast by 1 Oreshnik IRBM. \nUnknown target near the Kherson-Mykolaiv regional border by ~6 Kalibrs.\nUnknown target southwest of Kyiv by ~2 Iskander-Ms.\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2026-01-10T18:00:18.185587Z"
    },
    {
      "original": "Clearer footage of the Oreshnik strike.  Reportedly, this was not the Stryi underground gas facility. I'm working to confirm this now.",
      "timestamp": "2026-01-10T18:00:18.185591Z"
    },
    {
      "original": "Based on a geolocation of the POV of footage showing the Oreshnik IRBM strike on Lviv, we can determine that the target was the Lviv State Aviation Repair Plant.\nThe plant, which repairs MiG-29 fighter jets, appears to have still be in operation prior to the strike. It was hit by 36 MIRVs from the Oreshnik missile. \nPOV coordinates: 49.79611, 23.94444\nPlant coordinates: 49.81721, 23.9351",
      "timestamp": "2026-01-10T18:00:18.185598Z"
    },
    {
      "original": "Under heavy artillery cover, STG government forces have launched their full-scale ground offensive against the SDF-held Kurdish-majority Al-Ashrafiya and Shekh Masoud Neighbourhoods in northern Aleppo.  The two main epicentres of fighting right now are in…",
      "timestamp": "2026-01-10T18:00:18.185602Z"
    },
    {
      "original": "Approximate situation in northern Aleppo:\nAfter around 36 hours of intense fighting, STG government forces have managed to clear around 75% of SDF-held territory in the Kurdish-majority neighbourhoods, and is beginning its final assault on the central Sheikh Maqsoud District. \nSo far during the offensive, they were able to capture the industrial district (very quickly) and the youth housing district in the north, reaching the northern edge of Sheikh Maqsoud. \nIn the east, the STG secured the rest of the Ayn at-Tal Industrial Zone, the Hulluk District, and the Bustan al-Pasha District, which lie east of the river and previously acted as a buffer for Sheikh Maqsoud. From there, they crossed the river and entered the Farouj Ammar Neighbourhood in the southeastern part of Sheikh Maqsoud, which contains one of the highest elevation points in the area. Due to heavy shelling, the SDF largely withdrew from the exposed areas towards the centre of Sheikh Maqsoud, while STG soldiers are attempting to accumulate in the large grey-zone. \nIn the south, following earlier setbacks, STG forces captured the entirety of the Ashrafiyeh and Assyrian Quarter Districts, reaching Sheikh Maqsoud from the south.\nIn the west, the STG captured the entirety of the Bani Zaid District, and began attacking STG defences in western Sheikh Maqsoud.",
      "timestamp": "2026-01-10T18:00:18.185609Z"
    },
    {
      "original": "Based on a geolocation of the POV of footage showing the Oreshnik IRBM strike on Lviv, we can determine that the target was the Lviv State Aviation Repair Plant.  The plant, which repairs MiG-29 fighter jets, appears to have still be in operation prior to…",
      "timestamp": "2026-01-10T18:00:18.185612Z"
    },
    {
      "original": "I'm seeing a lot of people claim that this is the wrong location, so I've lined up the two houses to show that they are exactly the same.\nThe issue with the security camera footage is that its warped to show a larger area, and is much more blurry. But this is the exact POV.",
      "timestamp": "2026-01-10T18:00:18.185617Z"
    },
    {
      "original": "I'm seeing a lot of people claim that this is the wrong location, so I've lined up the two houses to show that they are exactly the same.  The issue with the security camera footage is that its warped to show a larger area, and is much more blurry. But this…",
      "timestamp": "2026-01-10T18:00:18.185620Z"
    },
    {
      "original": "People are still denying that it's the correct place... I don't know how that is even possible.",
      "timestamp": "2026-01-10T18:00:18.185623Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Novoselivka, Svyatohirsk direction, Donetsk Oblast.\nPre-war population: ~1,390.\nTotal land area: ~3.06 km².\nThe second battle for Novoselivka lasted approximately 60 days.",
      "timestamp": "2026-01-10T18:00:18.185628Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made additional progress towards the large forests north of Sumy.\nIn the west, after repelling a Ukrainian counterattack towards Andriivka, Russian forces began pushing southeast from the village, advancing along the gulley and capturing positions in the adjacent forest plantations and treelines. Ukrainian forces are responding by intensifying their FPV drone strikes and artillery shelling of Russian units, in an attempt to contain their advance. \nIn the east, Russian forces continued advancing southwest of Yablunivka, improving their positions further in the forested areas east of the Snahist River.\n+ ~3.30 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185635Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued incrementally advancing, and have made new progress in three different areas.\nIn the west, Russian forces continued slowly dislodging the Ukrainians from Starytsya, and are approaching the centre of the village from the east.\nTo the southeast, the Russians advanced on a wide front from the northern approaches to Hrafskse to Symynivka, improving their positions in the forests and reaching the Hrafske - Symynivka Road.\nIn the northeast, Russian forces continued incrementally advancing in Vovchanski-Khutory, and captured the last parts of the central section of the village.\n+ ~1.12 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185643Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing on both sides of the Oskil River.\nIn the north, following the arrival of additional reinforcements from the 47th Tank Division, Russian forces resumed their assault operations from the Holubivka area and have captured new positions in the forests east of Radkivka. Attacks are now underway in the direction of the village. Other assault groups managed to consolidate in part of northern Kindrashivka, before infiltrating further west past poorly consolidated Ukrainian positions into Tyshchenivka, which currently resides in the grey-zone. \nTo the southeast, Russian forces began counterattacking east of Kupyansk and recaptured a number of industrial buildings in the northeastern part of the city. From there, a number of Russian soldiers infiltrated down the road to the eastern part of Podoly.\nIn the south, Ukrainian forces managed to clear the last parts of southwestern Kupyansk, including the Yuvileynyi high-rise micro-district, and captured the city central market. Clearing operations continue in other parts of the city centre, while airstrikes are being carried out on encircled Russian formations in the Kupyansk Central Hospital. \n+ ~5.10 km² in favour of Russia.\n+ ~1.75 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185651Z"
    },
    {
      "original": "In the Borova direction, both Ukrainian and Russian forces are advancing in western Luhansk Oblast, each making progress in the area of the regional border with Donetsk Oblast.\nIn the east, Ukrainian forces re-entered the village of Hrekivka from the north and recaptured the northern part of the village. Fighting continues in the southern houses, which are partly in the grey-zone.\nIn the west, after entering the forest northwest of Hrekivka, Russian forces expanded their foothold and began pushing west, establishing control over most of the forest.\n+ ~0.56 km² in favour of Russia. \n+ ~0.85 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185658Z"
    },
    {
      "original": "In the Borova and Svyatohirsk directions, Russian forces intensified their assault operations and have made significant progress across multiple areas.\nIn the north, Russian forces captured multiple Ukrainian strongpoints east of Korovii Yar allowing for them to break through to the north, physically cutting the Korovii Yar - Karpivka Road and capturing positions in several different treelines further north. \nTo the southwest, the Russians advanced further west down the gulley from Seredjne, capturing positions in the forest plantations there. Other assault groups captured positions in two different treelines and entered the eastern part of Oleksandrivka. \nTo the south, the Russians captured the remaining parts of the forests northwest of Yarova. From there, DRGs infiltrated the western part of the village and continued moving southwest to the Siverskyi Donets River, entering the eastern part of the city of Svyatohirsk. \nTo the east, Russian forces continued clearing the forests north of Yarova and captured the northeastern streets of the village. Other assault groups broke through Ukrainian positions further east, forcing the remaining Ukrainian formations to withdraw from southern Novoselivka due to the risk of encirclement, allowing Russia to bring the settlement, as well as some of the forests to the south, under their full control. \n+ ~16.59 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185666Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced, each making progress across four different areas.\nIn the north, following earlier penetrations by Russian DRGs, Russian forces advanced further down the treelines north of Lyman and captured the agricultural buildings on the northern outskirts of Lyman. \nTo the south, Ukrainian forces cleared central and eastern Lyman from Russian DRGs and recaptured School No. 2, allowing for them to advance further east through the treelines. Additionally, they managed to re-enter the Masliakivka District in the easternmost part of the city, recapturing around half of it. Fighting is ongoing for its eastern streets. \nIn the south, Russian forces began advancing north from their spearhead south of Lyman, where they managed to capture a large section of the forest and reach the Lyman - Raihorodok Highway. Other assault groups continued to strengthen the southern flank of this spearhead and further improved their positions in the forests there. \n+ ~4.33 km² in favour of Ukraine.\n+ ~4.03 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-10T18:00:18.185674Z"
    },
    {
      "original": "A Russian IL-76MD cargo plane landed at Baltimore Airbase, Voronezh Oblast, this morning. \nThe cargo consists of Iskander-M ballistic missiles for OTRK installations near Liski, Voronezh Oblast.",
      "timestamp": "2026-01-10T18:00:18.185678Z"
    },
    {
      "original": "A NEW WEAPON'S DEBUT: 'ORESHNIK' MISSILE STRIKES LARGEST GAS STORAGE IN UKRAINE",
      "timestamp": "2026-01-10T18:00:18.734605Z"
    },
    {
      "original": "From Redkodub To Svyatohirsk: Ukraine Faces Russian Tactical Successes In Slaviansk And Izyum Sectors\nIn the Zaporizhzhia sector, Russian units crossed the Haichur River to the west of Huliaipole. They established control over Zelenoye and reached the outskirts of Sviatopetrivka. This created conditions for an envelopment of Zaliznychne. In the Kharkiv sector, the Russian \"North\" grouping intensified its offensive in the Staritsa area, advancing on multiple fronts and gaining up to 800 meters.\nIn the Kostiantynivka sector, capturing a key strongpoint near the traffic police post and the southern bank of the Kleban-Byk Reservoir enabled units to reach the western outskirts of Kostiantynivka. In the Krasnyi Liman sector, Russian assault groups entered the city limits of Svyatohirsk near the \"Time-Out\" beach. \nIn the Izyum sector, the Russians successfully broke through and cut the road between Karpivka and Korovyi Yar, threatening to envelop the latter from the flank.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734621Z"
    },
    {
      "original": "From Redkodub To Svyatohirsk: Ukraine Faces Russian Tactical Successes In Slaviansk And Izyum Sectors\nIn the Zaporizhzhia sector, Russian units crossed the Haichur River to the west of Huliaipole. They established control over Zelenoye and reached the outskirts of Sviatopetrivka. This created conditions for an envelopment of Zaliznychne. In the Kharkiv sector, the Russian \"North\" grouping intensified its offensive in the Staritsa area, advancing on multiple fronts and gaining up to 800 meters.\nIn the Kostiantynivka sector, capturing a key strongpoint near the traffic police post and the southern bank of the Kleban-Byk Reservoir enabled units to reach the western outskirts of Kostiantynivka. In the Krasnyi Liman sector, Russian assault groups entered the city limits of Svyatohirsk near the \"Time-Out\" beach. \nIn the Izyum sector, the Russians successfully broke through and cut the road between Karpivka and Korovyi Yar, threatening to envelop the latter from the flank.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734631Z"
    },
    {
      "original": "Pinpoint Airstrikes: Summary Of Russian Combat Footage From January 9, 2026\nOn January 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-10T18:00:18.734638Z"
    },
    {
      "original": "Pinpoint Airstrikes: Summary Of Russian Combat Footage From January 9, 2026\nOn January 9, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-10T18:00:18.734645Z"
    },
    {
      "original": "The 'Emir' Of Al-Qaeda In Arabian Peninsula Could Soon Become President Of Yemen\nRecent weeks saw long time allies Saudi Arabia and the United Arab Emirates engaged in a surprising struggle over control of much of Yemen.\nThe kingdom emerged victorious from the conflict, with its allies, mainly represented by the Presidential Leadership Council (PLC), defeating those of Abu Dhabi, namely the Southern Transitional Council (STC).\nAmid this conflict, the Emir [Prince] of Al-Qaeda in the Arabian Peninsula (AQAP) Sa'ad bin Atef al-Awlaki popped his head up to indirectly praise efforts against the STC and the UAE.\nAl-Awlaki’s joy over the end of Emirate influence in Yemen is not surprising. The UAE has for long played a key role in combating AQAP.\nLooking at al-Qaeda emir-turned-president Ahmad al-Sharaa in Syria, some in Riyadh may be inclined to believe that someone like al-Awlaki could bring the order and discipline their allies need.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734655Z"
    },
    {
      "original": "Operation \"Absolute Resolve\": The Midnight Raid That Changed the Rules of the Game\nBetween January 2nd and 3rd, 2026, the silence of the night over Caracas was not shattered by the wail of sirens but by the nearly imperceptible hum of helicopter rotors. The shadows of the CH-47 Chinook transport helicopters, which were painted the color of the night sky, slipped over the rooftops of residential districts. Their target was the residence of Venezuelan President Nicolás Maduro. At that same moment, thousands of kilometers away in the North Atlantic, a U.S. destroyer forced an empty Russian-flagged tanker, the Marinera, to halt.\nThese two seemingly unrelated events were part of the same grand plan. The Delta Force assault team landed and immediately moved toward the bedroom. They had rehearsed this countless times in an exact replica of the compound built from the ground-based agents' specifications. The commandos captured Maduro and his wife, Cilia Flores, in their bedroom. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734664Z"
    },
    {
      "original": "Besieged In Hospital, Kurds Fight To Death As Their Drones Hit Syrian Army HQs In Aleppo (Videos)\nThe forces of Syria’s Islamist-led Interim Government took control of Ashrafieh and much of neighboring Sheikh Maqsoud by January 11, besieging Kurdish fighters affiliated with the Syrian Democratic Forces (SDF) in Khaled Fajr Hospital and nearby areas in the latter neighborhood in the northern Syrian city of Aleppo.\nGovernment forces advanced in the two Kurdish neighborhoods rapidly overnight, forcing Kurdish fighters to retreat to the hospital, which was struck more than once since the start of the battle.\nAmid the clashes in Sheikh Maqsoud, multiple fixed-wing suicide drones attacked Aleppo city, with one hitting the governro’s building and another hitting the military intelligence headquarters. State media said that the drones were launched from the town of Deir Hafer in the eastern Aleppo countryside by the SDF, but the group denied any involvement. SANA said that four people were wounded.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734672Z"
    },
    {
      "original": "Besieged In Hospital, Kurds Fight To Death As Their Drones Hit Syrian Army HQs In Aleppo (Videos)\nThe forces of Syria’s Islamist-led Interim Government took control of Ashrafieh and much of neighboring Sheikh Maqsoud by January 11, besieging Kurdish fighters affiliated with the Syrian Democratic Forces (SDF) in Khaled Fajr Hospital and nearby areas in the latter neighborhood in the northern Syrian city of Aleppo.\nGovernment forces advanced in the two Kurdish neighborhoods rapidly overnight, forcing Kurdish fighters to retreat to the hospital, which was struck more than once since the start of the battle.\nAmid the clashes in Sheikh Maqsoud, multiple fixed-wing suicide drones attacked Aleppo city, with one hitting the governro’s building and another hitting the military intelligence headquarters. State media said that the drones were launched from the town of Deir Hafer in the eastern Aleppo countryside by the SDF, but the group denied any involvement. SANA said that four people were wounded.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734680Z"
    },
    {
      "original": "North Korea Says Drone Launched By South Violated Its Airspace In Sign Of Near Escalation (Photos)\nNorth Korea said on January 10 that South Korea flew another drone into its airspace on January 4.\nSouth Korea “committed another grave infringement upon the sovereignty of the DPRK (North Korea) by making its drone violate the DPRK's airspace from the outset of the year,” said a spokesman for the General Staff of the Korean People's Army.\nState-run KCNA said that the army detected and monitored the drone as it flew north from the airspace above the South Korean city of Incheon.\nIt added that the army used specialized electronic warfare equipment to disable the drone, causing it to crash 1,200 meters from the town of Muksan-ri.\nThe drone was equipped with surveillance cameras to record \"major\" North Korean facilities, according to KCNA, which shared photos of the wreckage, including electronic parts, along with aerial photos of buildings that agency said the drone had taken.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734690Z"
    },
    {
      "original": "North Korea Says Drone Launched By South Violated Its Airspace In Sign Of Near Escalation (Photos)\nNorth Korea said on January 10 that South Korea flew another drone into its airspace on January 4.\nSouth Korea “committed another grave infringement upon the sovereignty of the DPRK (North Korea) by making its drone violate the DPRK's airspace from the outset of the year,” said a spokesman for the General Staff of the Korean People's Army.\nState-run KCNA said that the army detected and monitored the drone as it flew north from the airspace above the South Korean city of Incheon.\nIt added that the army used specialized electronic warfare equipment to disable the drone, causing it to crash 1,200 meters from the town of Muksan-ri.\nThe drone was equipped with surveillance cameras to record \"major\" North Korean facilities, according to KCNA, which shared photos of the wreckage, including electronic parts, along with aerial photos of buildings that agency said the drone had taken.\nRead more \nHERE",
      "timestamp": "2026-01-10T18:00:18.734699Z"
    }
  ],
  "script_run_time": "2026-01-10T18:00:18.735427Z"
}