{
  "messages": [
    {
      "original": "🛵\n БпЛА з Чернігівщини курсом на Київщину.",
      "timestamp": "2025-12-04T07:00:12.891820Z"
    },
    {
      "original": "🛵\n БпЛА в Бориспільському та Броварському районах Київщини, напрямок Бориспіль.",
      "timestamp": "2025-12-04T07:00:12.891840Z"
    },
    {
      "original": "🛵\n БпЛА в Обухівському районі Київщини, напрямок Обухів.",
      "timestamp": "2025-12-04T07:00:12.891846Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині в напрямку м.Київ з півдня.",
      "timestamp": "2025-12-04T07:00:12.891851Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА з Донеччини на Дніпропетровщину, курс на захід.",
      "timestamp": "2025-12-04T07:00:12.891855Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині в напрямку м.Київ з півдня.",
      "timestamp": "2025-12-04T07:00:12.891860Z"
    },
    {
      "original": "🛵\n БпЛА на Миколаївщині, напрямок н.п.Березанка, курс на Одещину.",
      "timestamp": "2025-12-04T07:00:12.891864Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині, курс західний.",
      "timestamp": "2025-12-04T07:00:12.891869Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині змінили курс на м.Одеса.",
      "timestamp": "2025-12-04T07:00:12.891873Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курс південний.\n🛵\n БпЛА на Миколаївщині, курс Одещина.",
      "timestamp": "2025-12-04T07:00:12.891879Z"
    },
    {
      "original": "🛵\n БпЛА в Синельниківському районі Дніпропетровської області, курс на захід.",
      "timestamp": "2025-12-04T07:00:12.891884Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину.",
      "timestamp": "2025-12-04T07:00:12.891889Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Павлограда.",
      "timestamp": "2025-12-04T07:00:12.891893Z"
    },
    {
      "original": "🚀\n Продовжуються пуски КАБ на Харківщину.",
      "timestamp": "2025-12-04T07:00:12.891898Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в р-ні Петропавлівка та Шахтарське (Дніпропетровщина), курсом на Павлоград.",
      "timestamp": "2025-12-04T07:00:12.891902Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на сході Дніпропетровщини, вектор руху Дніпро.",
      "timestamp": "2025-12-04T07:00:12.891906Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у напрямку Павлограду з південного сходу.",
      "timestamp": "2025-12-04T07:00:12.891910Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на північному заході Чернігівщини, курс південно-західний.",
      "timestamp": "2025-12-04T07:00:12.891917Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півдні  Харківщини.",
      "timestamp": "2025-12-04T07:00:12.891921Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА наближається до Сум з південного-сходу.",
      "timestamp": "2025-12-04T07:00:12.891925Z"
    },
    {
      "original": "Two Russian Iskander-M ballistic missiles launched from Crimea impacted a target in the city of Bashtanka, Mykolaiv Oblast. \nOne of the missiles was equipped with a cluster warhead. A large fire is now burning within the city limits.",
      "timestamp": "2025-12-04T07:00:13.646388Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued their assault operations northwest of Chasiv Yar and have made new progress in two different areas over the last week.\nIn the southeast, Russian forces continued pushing west down the windbreaks on either side of the railway tracks, capturing new positions northwest of Mykolaivka. They also secured additional positions in a forested area north of the railway line.\nIn the northwest, Russian forces began advancing towards the village of Virolyubivka from the captured section of the former Ukrainian defensive line. They were able to improve their positions along a treeline, capturing an intersection with a perpendicular treeline.\n+ ~0.89 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646403Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance in and around Kostyantynivka, making new progress in multiple different areas.\nIn the northeast, following a Ukrainian withdrawal, Russian forces were able to secure the remaining isolated trenches south of the reservoirs and completed the capture of Predtechyne. \nTo the west, Russian forces continued to advance in Santurinivka District of Kostyantynivka and captured the tram depot, along with the adjacent trench fortifications. From there, DRGs infiltrated northwest over the Dovhenka Arroyo Gulley to the edge of the Hora District of northeastern Kostyantynivka. Russia was also able to consolidate further in the western streets of Santurinivka District, capturing Kindergarten No. 9. \nTo the south, Ukrainian forces launched a series of counterattacks, crossing the Kryvyi Torets River and re-entering the Mychuryna Dachas, where they linked up with small pockets of resistance previously encircled by Russian soldiers. The situation in the Mychuryna Dachas is very dynamic, with both sides holding positions behind each other.\nFurther south, Russian assault groups crossed the Kryvyi Torets River and entered the small residential area northwest of Ivanopillya. Ukrainian forces, who had accumulated reinforcements in the treelines and forested areas southeast of the Stara Santurynivka District are counterattacking. \nIn the south, Ukrainian forces withdrew from the treelines west of Ivanopillya, allowing for the Russians to capture additional positions in the windbreaks along the railway line. Russian forces also captured additional positions in the forests on the northern bank of the Kleban-Bykske Reservoir and are attacking further west.\n+ ~5.21 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646412Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, over the last 10 days both Russian and Ukrainian forces have advanced, with Russian forces making significant progress across several different areas.\nIn the northeast, Russian forces were able to consolidate in the southern part of Sofiivka and the forested areas northeast of the village following earlier assault operations. They were also able to clear the centre of Shakhove and are accumulating additional infantry for further attacks. Ukrainian forces managed to retake some positions in the forest plantations north of Shakhove and are engaged in fighting for the trenches north of the village.\nTo the southwest, Russian forces intensified their assault operations. They advanced along the Shakhove - Nove Shakhove Road, as well as along the parallel forested areas, reaching one of the clay quarries which they are now trying to bypass from the north. \nAdditionally, Russian forces recaptured numerous treeline positions northwest of Mayak and secured the southern part of the Hektova Gulley. During the fighting for the northern part of the Hektova Gulley, Ukrainian forces carried out multiple counterattacks, but were eventually forced back, allowing for the Russians to advance even further north and entrench in the eastern houses of Nove Shakhove. Russian forces also consolidated in the southern part of Dorozhnje, captured the Dorozhnje Freight Train Station and are attempting to seize the northern part of the village.\nTo the south, the Russians continued pushing west from the Fedorivka - Boikivka line and recaptured the treelines north of Zatyshok. From there, they recaptured the gulley stretching to the northwestern approaches to Zatyshok and attempted to regain a foothold along the railway windbreaks. The outcome of the latter attacks is currently unknown.\n+ ~17.16 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646419Z"
    },
    {
      "original": "I think I should mention this so people aren't confused:\nGoogle My Maps (the website I use for my interactive maps) is one of the most infuriating things to ever use. This advance pictured above has deleted itself a total of SIX times now. Lots of other people have been experiencing the same problems, but this website is one of those things that is just never updated anymore and left to rot. \nSo, that said, if you see something unusual or out of the ordinary on my interactive map, its likely just google my maps glitching again. Please DM me when this happens so I can fix it asap.",
      "timestamp": "2025-12-04T07:00:13.646424Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance northwest of Pokrovsk and in the Myrnohrad pocket. \nIn the northwest, Russian forces continued pushing west down the railway line, capturing new positions in the windbreaks. They also consolidated in the southeastern part of Hryshyne, before pushing further north into the eastern streets of the village. \nIn the southeast, Russian forces captured the last section of the railway line west of Myrnohrad. They also captured another 11 high-rise buildings in the Zapadny District of Myrnohrad, along with School No. 6, and entered the low-rise residential area to the north where they captured at least six blocks of houses.\n+ ~4.02 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646430Z"
    },
    {
      "original": "In the Prosyana direction, Ukrainian forces launched a series of counterattacks, recapturing the village of Ivanivka.\nUkrainian forces advanced south down the treelines north of Ivanivka, and southwest down the forested gulley, recapturing previously lost Russian positions there. They then re-entered Ivanivka, which for some reason was held by only a very small Russian force stretched across several scattered positions. \nAfter Ukrainian forces breached the centre of the village, the rest of it fell fairly quickly, with the Ukrainians entrenching along the northern bank of the Vovcha River. They also secured the rest of the forests southwest of Ivanivka. \n+ ~28.60 km² in favour of Ukraine.",
      "timestamp": "2025-12-04T07:00:13.646436Z"
    },
    {
      "original": "In the Pokrovs'ke direction, Russian forces continued to advance and have made new progress in three different areas.\nIn the northeast, Russian forces continued advancing through the Dibrovsky Forest and captured the rest of the positions south of the Vovcha River.\nTo the west, the Russians consolidated in the forest west of Tykhe and captured the gulley west of the initial spearhead to Tykhe. They also improved their positions north along the treelines and forest plantations north and northeast of Novooleksandrivka. \nIn the southwest, Russian forces advanced west from Vidradne, capturing new positions in the treelines and along the Hulyaipole - Pokrovs'ke Highway. They also established control over the gulley and forest plantations north of the Yanchur River. \nMore recently, under the cover of fog, Russian DRGs infiltrated the villages of Danylivka, Pishchane, Ostapivske, Andriivka, and Harasymivka. It's unlikely that assault groups followed and consolidated, however. \n+ ~13.26 km in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646447Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n NEW:\n Five Israeli soldiers of the 'Golani' Brigade were injured last night in Rafah, southern Gaza, two of them in 'serious condition'\nThe IDF claims that Palestinian fighters fired an RPG at them.\n@Middle_East_Sepectator",
      "timestamp": "2025-12-04T07:00:13.646457Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n NEW: Five Israeli soldiers of the 'Golani' Brigade were injured last night in Rafah, southern Gaza, two of them in 'serious condition'  The IDF claims that Palestinian fighters fired an RPG at them.  @Middle_East_Sepectator",
      "timestamp": "2025-12-04T07:00:13.646463Z"
    },
    {
      "original": "A couple of Israeli airstrikes on the Rafah-Khan Younis area of southern Gaza were reported a short time ago, but no major retaliatory strikes have happened yet.\nEDIT: The IDF stated earlier that it carried out an airstrike, reportedly targeting a senior Hamas fighter in the \"Rafah Brigade\".",
      "timestamp": "2025-12-04T07:00:13.646467Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance, albeit at a somewhat slower pace than before.\nIn the northwest, after capturing the village of Nove Zaporizhzhya, Russian forces advanced further south into the northern part of Dobropillya. Other assault groups advanced further west down the earlier attack vectors, capturing numerous new treeline positions. They also pushed west down the treelines and forest plantations further south in the direction of southern Dobropillya, allowing for the rest of the settlement to be captured.\nFurther south, Russian forces continued to outflank Hulyaipole from the north and are approaching the village of Varvarivka from the tactical heights. They also secured new positions behind the reservoirs, linking this sector with the front further north near Dobropillya together. \nIn the southeast, Russian forces advanced down the Hulyaipole - Velyka Novosilka Road, reaching the northeastern edge of Hulaipole. They were able to capture the second set of agricultural buildings and consolidated on Bochanska and Nabrezhna Streets. Fierce fighting is ongoing for the other streets of Hulyaipole north of the Haichur River, however Ukrainian counterattacks have so far only managed to slow Russian advances and have been unable to elminate their presence in the city. Russian soldiers also managed to consolidate on Krasna and Zarichna Streets in eastern Hulyaipole.\n+ ~31.12 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646474Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces continued their intensified assault operations aimed at reaching the city of Orikhiv.\nRussian forces advanced west from their initial spearhead into Novodanylivka, capturing new positions in the treelines there and reaching and entrenching along the highway from Robotyne. They also secured the highway intersection on the southwestern outskirts of Novodanylivka and advanced further northwest, with some assault groups crossing the gulley and infiltrating even further.\nTo the east, Russian forces expanded from the initial spearhead, advancing down the highway and capturing numerous new positions in the treelines to the south. They are also continuing their attempts at advancing further in southern Novodanylivka. \n+ ~4.14 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646479Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces continued their intensified assault operations aimed at reaching the city of Orikhiv.  Russian forces advanced west from their initial spearhead into Novodanylivka, capturing new positions in the treelines there and…",
      "timestamp": "2025-12-04T07:00:13.646483Z"
    },
    {
      "original": "There isn't much territory left here until Russia finally reverses the last gains made by Ukraine in the 2023 counteroffensive.",
      "timestamp": "2025-12-04T07:00:13.646486Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces intensified their assault operations and have made significant progress.\nIn Stepnohirsk, Russian forces managed to consolidate in the northern high-rise buildings of the 3rd Micro-district, before advancing further north, where they entrenched along Ahrarna Street which was already a grey zone. Due to recent emergency Ukrainian redeployments to the Hulyaipole direction, the Ukrainians were unable to carry out their usual clearing operations on Ahrarna Street, allowing for Russian soldiers to accumulate and cross the river at multiple points.\nFrom there, the Russians secured Tavriivska Street and outflanked the block of high-rise buildings in central Stepnohirsk from the east and west, capturing additional positions in the residential areas. Infiltrations are now taking place towards the rear of the high-rises, as well as into its southern buildings, where grey-zones have formed.\nMeanwhile, in the southeast, Russian forces resumed their assault operations, recapturing previously lost positions in eight different treelines northeast of Kamyanske.\nIn the northwest, the Russians consolidated additional positions in the southern part of Prymorske, while DRGs continue infiltrating to the second gulley.\n+ ~6.37 km² in favour of Russia.",
      "timestamp": "2025-12-04T07:00:13.646493Z"
    },
    {
      "original": "Over the last 12 days, local Palestinian armed groups affiliated with the Palestinian Islamic Jihad's Saraya Al-Quds Brigades claimed responsibility for 19 attacks across the West Bank.\nThe \"Jenin Battalion\" stated that their fighters carried out 10 IED attacks, 2 small arms attacks, and 1 hand-grenade attack on IDF soldiers and vehicles in the towns of Silat al-Harithiya and Qabatiya, as well as the village of Marek. The IDF didn't report any casualties among their forces.\nThe \"Nablus Battalion\" stated that their fighters carried out 1 IED attack, 1 hand-grenade attack, and 1 small arms attack on IDF military vehicles in the Balata Refugee Camp in Nablus City. The IDF didn't report any casualties among their forces. \nThe \"Tubas Battalion\" stated that their fighters carried out 2 IED attacks and 1 small arms attack in the city of Tubas. The IDF didn't report any casualties among their forces.\nThe PIJ reported that multiple Israeli soldiers were wounded as a result of these recent attacks, however this has not been confirmed. The PIJ also announced the deaths of 6 of its fighters, while the Al-Aqsa Martyrs Brigades announced the death of 1 of its fighters. \nAs usual with these attacks, limited coordination between militant cells and a lack of training means that the results are very limited.",
      "timestamp": "2025-12-04T07:00:13.646500Z"
    },
    {
      "original": "lol what",
      "timestamp": "2025-12-04T07:00:13.646504Z"
    },
    {
      "original": "Consequences of the combined Russian KAB and MLRS strikes on Slovyansk, Donetsk Oblast. Energy infrastructure was the primary target.",
      "timestamp": "2025-12-04T07:00:13.646507Z"
    },
    {
      "original": "Consequences of the combined Russian KAB and MLRS strikes on Slovyansk, Donetsk Oblast. Energy infrastructure was the primary target.",
      "timestamp": "2025-12-04T07:00:13.646511Z"
    },
    {
      "original": "This evening, 1 Iskander-M ballistic missile launched from the vicinity of Liski, Voronezh Oblast impacted an unknown target in the Slobidskyi District of Kharkiv City.",
      "timestamp": "2025-12-04T07:00:13.646514Z"
    },
    {
      "original": "Last night's Russian Iskander-M ballistic missile strike on Kharkiv City likely targeted the \"Kharkivska\" 330 kV Electrical Substation. \nCoordinates: 49.96166, 36.28000",
      "timestamp": "2025-12-04T07:00:13.646519Z"
    },
    {
      "original": "Last night's Russian Iskander-M ballistic missile strike on Kharkiv City likely targeted the \"Kharkivska\" 330 kV Electrical Substation. \nCoordinates: 49.96166, 36.28000",
      "timestamp": "2025-12-04T07:00:13.646523Z"
    },
    {
      "original": "Military Situation In Ukraine On December 3, 2025 (Maps Update)",
      "timestamp": "2025-12-04T07:00:14.416021Z"
    },
    {
      "original": "Military Situation In Ukraine On December 3, 2025 (Maps Update)",
      "timestamp": "2025-12-04T07:00:14.416035Z"
    },
    {
      "original": "Kiev Forces Are Losing Two Key Towns Near Pokrovsk And Siversk (Videos)\nOn December 3, the Russian military advanced around the city of Pokrovsk, which is already under its control, and near the city of Sivers, where it is already engaged in a fierce battle with Kiev forces, in Donetsk.\nThe Tsentr [Center] Group of Forces expanded its control in the southern part of Grishino, also known as Hryshyne, approaching the center of the settlement, which is located to the northwest of Pokrovsk.\nTo the east in Donetsk, Ukraine is about to receive another defeat in Siversk, where the Yug [South] Group of Forces is advancing.\nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416045Z"
    },
    {
      "original": "Kiev Forces Are Losing Two Key Towns Near Pokrovsk And Siversk (Videos)\nOn December 3, the Russian military advanced around the city of Pokrovsk, which is already under its control, and near the city of Sivers, where it is already engaged in a fierce battle with Kiev forces, in Donetsk.\nThe Tsentr [Center] Group of Forces expanded its control in the southern part of Grishino, also known as Hryshyne, approaching the center of the settlement, which is located to the northwest of Pokrovsk.\nTo the east in Donetsk, Ukraine is about to receive another defeat in Siversk, where the Yug [South] Group of Forces is advancing.\nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416054Z"
    },
    {
      "original": "Syria Seized Weapons Bound For Hezbollah, Still Got Hit By Israeli Strikes (Video, Photos)\nMultiple Israeli drone strikes hit the governorate of Rif Dimashq in southern Syria on December 3, just a day after the country’s security forces announced the seizure of a weapon shipment allegedly bound to Hezbollah in neighboring Lebanon.\nThe Syrian Arab News Agency said that the strikes targeted Bat al-Ward hill and the road leading to it close to the town of Beit Jinn, which is located right on the front with the Israeli-occupied Golan Heights.\nOn December 2, The Syrian Ministry of Interior said that its forces seized a large shipment of landmines that was bound to Hezbollah in neighboring Lebanon. \nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416063Z"
    },
    {
      "original": "Syria Seized Weapons Bound For Hezbollah, Still Got Hit By Israeli Strikes (Video, Photos)\nMultiple Israeli drone strikes hit the governorate of Rif Dimashq in southern Syria on December 3, just a day after the country’s security forces announced the seizure of a weapon shipment allegedly bound to Hezbollah in neighboring Lebanon.\nThe Syrian Arab News Agency said that the strikes targeted Bat al-Ward hill and the road leading to it close to the town of Beit Jinn, which is located right on the front with the Israeli-occupied Golan Heights.\nOn December 2, The Syrian Ministry of Interior said that its forces seized a large shipment of landmines that was bound to Hezbollah in neighboring Lebanon. \nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416072Z"
    },
    {
      "original": "TALKS OF PEACE, REALITIES OF WAR: U.S. - RUSSIA DIALOGUE AMID UKRAINIAN SETBACKS",
      "timestamp": "2025-12-04T07:00:14.416076Z"
    },
    {
      "original": "A Shift in Narrative: Why Europe's Insistent Statements Are in Tune with Ukraine's Defeats on the Battlefield\nRussian assault groups are fighting for the control of the road to Rodinskoye within the Pokrovsk agglomeration. Russian units have crossed the Bakhmutka River and entered the Sviato-Pokrovske settlement. \nAmid Ukraine's crumbling defenses, European ministers warn of an imminent peace deal.\nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416083Z"
    },
    {
      "original": "A Shift in Narrative: Why Europe's Insistent Statements Are in Tune with Ukraine's Defeats on the Battlefield\nRussian assault groups are fighting for the control of the road to Rodinskoye within the Pokrovsk agglomeration. Russian units have crossed the Bakhmutka River and entered the Sviato-Pokrovske settlement. \nAmid Ukraine's crumbling defenses, European ministers warn of an imminent peace deal.\nRead more \nHERE",
      "timestamp": "2025-12-04T07:00:14.416091Z"
    },
    {
      "original": "TOS Attacks: Summary Of Russian Combat Footage From December 3, 2025\nOn December 3, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-04T07:00:14.416098Z"
    },
    {
      "original": "TOS Attacks: Summary Of Russian Combat Footage From December 3, 2025\nOn December 3, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-04T07:00:14.416105Z"
    }
  ],
  "script_run_time": "2025-12-04T07:00:14.416972Z"
}