{
  "messages": [
    {
      "original": "🛵\n БпЛА з Київського водосховища в напрямку столиці!",
      "timestamp": "2026-01-12T16:52:39.196193Z"
    },
    {
      "original": "🛵\n БпЛА на Київ з півночі.",
      "timestamp": "2026-01-12T16:52:39.196210Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова із заходу.",
      "timestamp": "2026-01-12T16:52:39.196216Z"
    },
    {
      "original": "🛸\n Поблизу Запоріжжя розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-12T16:52:39.196221Z"
    },
    {
      "original": "🛸\n В Чорному морі поблизу Одещини розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-12T16:52:39.196225Z"
    },
    {
      "original": "📢\n Відбій загрози застосування  балістичного озброєння.",
      "timestamp": "2026-01-12T16:52:39.196230Z"
    },
    {
      "original": "🛸\n  БпЛА в напрямку Одеси з Чорного моря.",
      "timestamp": "2026-01-12T16:52:39.196234Z"
    },
    {
      "original": "🛸\n  БпЛА в напрямку Одеси з Чорного моря.",
      "timestamp": "2026-01-12T16:52:39.196238Z"
    },
    {
      "original": "Ударний безпілотник.",
      "timestamp": "2026-01-12T16:52:39.196242Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс на захід.\n🛵\n БпЛА в напрямку Кривого Рогу зі сходу.",
      "timestamp": "2026-01-12T16:52:39.196249Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-12T16:52:39.196253Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з воронежу.",
      "timestamp": "2026-01-12T16:52:39.196258Z"
    },
    {
      "original": "🛵\n БпЛА на заході Чернігівщини, курс на північ Київщини.",
      "timestamp": "2026-01-12T16:52:39.196262Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2026-01-12T16:52:39.196267Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2026-01-12T16:52:39.196271Z"
    },
    {
      "original": "🛵\n БпЛА на півдні від н.п.Покровське на Дніпропетровщині, курс на Запоріжжя.",
      "timestamp": "2026-01-12T16:52:39.196280Z"
    },
    {
      "original": "🛸\n На Одещині розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-12T16:52:39.196284Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з воронежу.",
      "timestamp": "2026-01-12T16:52:39.196289Z"
    },
    {
      "original": "Та південного напрямку!",
      "timestamp": "2026-01-12T16:52:39.196292Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Київщини, курс на Житомирщину.",
      "timestamp": "2026-01-12T16:52:39.196299Z"
    },
    {
      "original": "📢\n Відбій загрози застосування  балістичного озброєння.",
      "timestamp": "2026-01-12T16:52:39.196303Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Кривого Рогу з півночі.",
      "timestamp": "2026-01-12T16:52:39.196308Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time.   The Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2).   According to…",
      "timestamp": "2026-01-12T16:52:39.797496Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T16:52:39.797508Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T16:52:39.797513Z"
    },
    {
      "original": "Russian forces have captured the village of Zelene, Omelnyk direction, Zaporizhzhia Oblast.\nPre-war population: ~50.\nTotal land area: ~0.95 km².\nThe fighting for Zelene lasted <5 days.",
      "timestamp": "2026-01-12T16:52:39.797519Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Ridkodub, Borova direction, Donetsk Oblast.\nPre-war population: ~531.\nTotal land area: ~2.73 km².\nThe second battle for Ridkodub lasted approximately 200 days.",
      "timestamp": "2026-01-12T16:52:39.797524Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.\nPre-war population: ~4,294.\nTotal land area: ~5.10 km².\nThe fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T16:52:39.797530Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.  Pre-war population: ~4,294. Total land area: ~5.10 km².  The fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T16:52:39.797533Z"
    },
    {
      "original": "Stepnohirsk direction \n➡️\n Komyshuvakha direction",
      "timestamp": "2026-01-12T16:52:39.797538Z"
    },
    {
      "original": "Over the last few days, Russia has significantly intensified their artillery and MLRS shelling of frontline areas in western Zaporizhzhia Oblast.\nThis is being done in coordination with intensified assault operations, which have resulted in the town of Stepnohirsk being captured, and the large village of Prymorske being almost fully captured. \nAdditionally, Russian reconnaissance drones have been very active both in frontline settlements and in Zaporizhzhia City itself, scouting out targets and adjusting strikes.",
      "timestamp": "2026-01-12T16:52:39.797543Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing a number of FP-1 drone strikes carried out on Russian oil drilling platforms in the Caspian Sea.\nThe following was hit:\nLSP-1 platform by 2 drones. LSP-1 is situated on the Filanovsky oil field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged. \nLSP-R platform by 3 drones. LSP-R is situated on the Graifer Oil Field. As a result of the strikes, the power module was damaged, which reportedly forced the platform to temporarily shut down.\nLSP platform by 1 drone. LSP is situated o the Kochagin Oil Field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged.\nLSP-1 coordinates: 45.002180,48.479140\nLSP-R coordinates: 45.0628000,48.6108000\nLSP coordinates: 44.914090,48.958680\nThe distance from the nearest Ukrainian-controlled territory is approximately 940 km.",
      "timestamp": "2026-01-12T16:52:39.797553Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T16:52:39.797558Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T16:52:39.797562Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T16:52:39.797569Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T16:52:39.797576Z"
    },
    {
      "original": "Overnight, Russia carried out another Geran-2 drone attack on Kharkiv Oblast with at least 12 drones. \n- At least 6 Geran-2 drones attacked unknown targets near the town of Pechenihy and the city of Chuhuiv.\n- Multiple Gerans attacked an agricultural complex in the town of Zolochiv.\n- Multiple Gerans attacked the railway station in the village of Mayak (50.16481, 35.95208).\n- At least 2 Gerans attacked the town of Velykyi Burluk. A fire broke out and secondary detonations could be heard (as seen in the attached video).",
      "timestamp": "2026-01-12T16:52:39.797582Z"
    },
    {
      "original": "The Ukrainian GUR reports that Russia has added a new anti-air modification to their Geran-2 drones. \nThese Geran-2 drones can be equipped with a \"Verba\" anti-aircraft missile. All drones equipped with Verba missiles are directly controlled by drone operators in real time, using an optical camera in the nose of the drone. \nThis allows the drone operator to remotely launch the \"Verba\" missile in the event of a Ukrainian aircraft being detected. \nGeran-2 drones recently gained the ability to be equipped with R-60 anti-aircraft missiles, however the main difference with this new drone is that they still have their usual 90 kg warhead. This means that even after firing its missile, the drone can still carry out its primary task of striking a target. This action can also be controlled by the drone operator.",
      "timestamp": "2026-01-12T16:52:39.797588Z"
    },
    {
      "original": "This morning, a large scale attack was carried out by tribal fighters on the SMC (Druze) controlled town of Al-Majdal in southern Syria.\nThe attacks were launched from STG (government) controlled territory in the town of Al-Mazraa and supported by STG drone and artillery fire. After more than 9 hours of intense fighting, the attacks were ultimately repelled by the SMC, and the frontline remains unchanged.",
      "timestamp": "2026-01-12T16:52:39.797592Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the Novocherkasskaya Thermal Power Plant in Rostov Oblast. A fire broke out after the strike(s).\nCoordinates: 47.4001, 40.23248",
      "timestamp": "2026-01-12T16:52:39.797596Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the Novocherkasskaya Thermal Power Plant in Rostov Oblast. A fire broke out after the strike(s).\nCoordinates: 47.4001, 40.23248",
      "timestamp": "2026-01-12T16:52:39.797600Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".  The drones attacked in 3 waves, flying at low altitude before all impacting the same…",
      "timestamp": "2026-01-12T16:52:39.797607Z"
    },
    {
      "original": "The target of the Geran-2 drone strikes on Kyiv today was the \"Veda\" enterprise.\nCoordinates: 50.450036, 30.445657\nCredit to \n@geran_gerbera\n for the geolocation.",
      "timestamp": "2026-01-12T16:52:39.797613Z"
    },
    {
      "original": "After the fall of Redkodub to Russia, Lyman direction seems to be an area of significant Ukrainian manpower shortage currently. Recently, Russian forces have taken Novoselovka, Dibrova, Redkodub, and advanced around Korovyy Yar, Syatogorsk, and Lyman city. Again, it seems the Russian goal is to anchor the front along the Severskyy Donets river before crossing it, coordinated with a frontal assault from Seversk to Slavyansk.",
      "timestamp": "2026-01-12T16:52:39.797616Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388170Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388187Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388196Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388205Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388214Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388224Z"
    },
    {
      "original": "Trump Threatens Iran With ‘Very Strong’ Military Options As Crowds Gather In Support Of Government \nUnited States President Donald Trump on January 12 threatened Iran with “very strong” military options over the ongoing wave of protests, as large crowds of Iranians marched across the Islamic Republic in support of the government.\nThe protests began late in December as a result of the worsening economic conditions, and escalated significantly early in January after Trump set a red line, vowing to punish the Iranian government if protesters are killed.\nRecent days an uptake in violence, with protestors clashing with security forces. The Human Rights Activists News Agency reported the death of 544 people from both sides. In an attempt to contain the situation, the government has cut off the internet for the last four days or so.\nFollowing Trump's latest threats, large crowds of Iranians gathered in Tehran and all other cities across the Islamic Republic to show support to the government.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388233Z"
    },
    {
      "original": "Trump Threatens Iran With ‘Very Strong’ Military Options As Crowds Gather In Support Of Government \nUnited States President Donald Trump on January 12 threatened Iran with “very strong” military options over the ongoing wave of protests, as large crowds of Iranians marched across the Islamic Republic in support of the government.\nThe protests began late in December as a result of the worsening economic conditions, and escalated significantly early in January after Trump set a red line, vowing to punish the Iranian government if protesters are killed.\nRecent days an uptake in violence, with protestors clashing with security forces. The Human Rights Activists News Agency reported the death of 544 people from both sides. In an attempt to contain the situation, the government has cut off the internet for the last four days or so.\nFollowing Trump's latest threats, large crowds of Iranians gathered in Tehran and all other cities across the Islamic Republic to show support to the government.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388241Z"
    },
    {
      "original": "Ukraine Received Air Defense Buggy From U.S. (Video, Photos)\nUkraine has received the Tempest short-range air defense system from the United States, according to footage released by the country’s air force on January 10.\nThe Ukrainian Air Force’ Command Center published a video that shows the Tempest repelling an attack in a new year’s post, without announcing or identifying the system. Later, a photo emerged online suggesting that the country may have gotten at least two such systems.\nThe main armament of the Tempest is two side-mounted AGM-114L Hellfire Longbow missiles. The AGM-114L, which has a range of around eight kilometers and carries a nine kilogram warhead, is guided via equipped with millimeter-wave active radar homing seeker.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388250Z"
    },
    {
      "original": "Ukraine Received Air Defense Buggy From U.S. (Video, Photos)\nUkraine has received the Tempest short-range air defense system from the United States, according to footage released by the country’s air force on January 10.\nThe Ukrainian Air Force’ Command Center published a video that shows the Tempest repelling an attack in a new year’s post, without announcing or identifying the system. Later, a photo emerged online suggesting that the country may have gotten at least two such systems.\nThe main armament of the Tempest is two side-mounted AGM-114L Hellfire Longbow missiles. The AGM-114L, which has a range of around eight kilometers and carries a nine kilogram warhead, is guided via equipped with millimeter-wave active radar homing seeker.\nRead more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388258Z"
    },
    {
      "original": "Russia’s Oreshnik Hit Lviv Plant Where Ukraine Repairs Fighter Jets And Manufactures Drones\nThe target of the January 9 Oreshnik missile strike was the Lviv State Aviation Repair Plant in western Ukraine, the Russian Ministry of Defense revealed.\nIn a statement released on January 12, the ministry said, citing several independent sources, that the intermediate-range ballistic missile (IRBM) disabled the aviation repair plant.\nAt the time of the strike, fighter jets of the Ukrainian Air Force, including American-made F-16s and Soviet-made MiG-29s supplied by the Western countries, were being maintained at the plant, the ministry added, noting that the plant also produced long-range and medium-range attack drones used to hit civilian facilities in “the depth of Russian territory.”\n“The Oreshnik system engaged production workshops, warehouses with products (UAVs), as well as the infrastructure of the factory airfield,” the statement reads.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388268Z"
    },
    {
      "original": "Russian S-300 Unit Shot Down Ukrainian F-16 In Carefully-Planned Operation\nA Russian air defense division has shot down an American-made F-16 fighter jet of the Ukrainian Air Force (UAF) in a carefully-planned operation, the division commander revealed in an interview aired by Russia 1 TV on January 11.\nThe commander, who goes by the call sign “Sever,” told the news channel that his unit destroyed the aircraft using two missiles.\nAccording to him, the division received the modernized S-300 system in December 2024, completed training by March 2025, and has since engaged numerous high-value targets.\n“We have downed a colossal number of targets—we’ve lost count. These include ATACMS missiles, HIMARS rockets, guided aerial bombs, and other aerodynamic targets. The most interesting one was the F-16,” he said. “Our opponent praises these aircraft highly, claiming they are nearly indestructible. It turns out they can be shot down just the same.”\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T16:52:40.388278Z"
    }
  ],
  "script_run_time": "2026-01-12T16:52:40.389054Z"
}