{
  "messages": [
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-19T05:15:51.887745Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини на Дніпропетровщину (Павлоградський район).",
      "timestamp": "2025-10-19T05:15:51.887765Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини курсом на Чернігів.\n🛵\n Декілька БпЛА на межі Чернігівщини та Сумщини.",
      "timestamp": "2025-10-19T05:15:51.887772Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівшині курсом на Ніжин.",
      "timestamp": "2025-10-19T05:15:51.887778Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини на Сумщину (Роменський район).",
      "timestamp": "2025-10-19T05:15:51.887782Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину зі сходу.",
      "timestamp": "2025-10-19T05:15:51.887787Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-19T05:15:51.887794Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-19T05:15:51.887799Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини повз Холми.",
      "timestamp": "2025-10-19T05:15:51.887804Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку область.",
      "timestamp": "2025-10-19T05:15:51.887808Z"
    },
    {
      "original": "🛵\n Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-19T05:15:51.887813Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Дніпропетровщині курсом на Кривий Ріг.",
      "timestamp": "2025-10-19T05:15:51.887819Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА на Донеччину (Покровський район).",
      "timestamp": "2025-10-19T05:15:51.887823Z"
    },
    {
      "original": "🛵\n Група БпЛА на Чернігівщині повз Бахмач.\n🛵\n БпЛА на сході Дніпропетровщини курсом на захід.\n🛵\n Декілька груп БпЛА на Донеччині (Покровський район).\n🛵\n БпЛА на півночі Харківщини (Старий Салтів).",
      "timestamp": "2025-10-19T05:15:51.887832Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Бахмач.\n🛵\n БпЛА на Харківщині курсом на Шевченкове.\n🛵\n БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-19T05:15:51.887840Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину зі сходу.",
      "timestamp": "2025-10-19T05:15:51.887845Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-19T05:15:51.887849Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-19T05:15:51.887855Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини повз Холми.",
      "timestamp": "2025-10-19T05:15:51.887862Z"
    },
    {
      "original": "🛵\n Група БпЛА з Дніпропетровщини на Харківщину (Лозівський район).\n🛵\n БпЛА на Полтавщині повз Гребінку курсом на Черкащину.",
      "timestamp": "2025-10-19T05:15:51.887868Z"
    },
    {
      "original": "Recently, the situation east of Kostyantynivka has become very mixed and complicated as Russian forces attempt to consolidate outside the city and begin entering the more built-up area.\nAs a result, I have decided to add a very large grey zone, where Russian and Ukrainian positions are mixed and layered, often operationally encircling each other. This map below shows areas where Russian and Ukrainian soldiers have been recorded, although this doesn't necessarily show consolidation. In the future, once the situation clears up and one side clearly regains the initiative, the map will be updated to show additional control zones. But for now, it will look something like this.\nThis has happened due to the large open areas here, with limited cover from treelines and individual, isolated buildings. Additionally, Ukraine's manpower shortages have forced them to resort to increased drone usage. Kostyantynivka provides practically endless hiding spots for drone operators, while Russia has Chasiv Yar and the surrounding forests and villages to use for this. Both Russian and Ukrainian soldiers are operating in small assault groups of usually 2-4 people, clearing each other out of their positions. A similar situation was observed (and still is to some extent) in the Dobropillya direction.\nMeanwhile, extensive preparatory bombing and shelling continues on Kostyantynivka, primarily targeting its eastern districts, ahead of the Russian storming operation on the city.",
      "timestamp": "2025-10-19T05:15:52.457469Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance over the last week, and have captured the rest of Poltavka.\nAfter crossing the Yanchur River and securing a bridgehead on its western bank, Russian forces pushed further under heavy drone and artillery cover, expanding their zone of control to the northern outskirts of Poltavka. Other forces advanced south, linking up with the formations north of Malynivka. \nAdditionally, the Russians improved their positions north of Malynivka, capturing the rest of the forests there and beginning a push west of Poltavka. However, the arrival of Ukrainian reinforcements has slowed their advance, and counterattacks will likely begin in the near future. \n+ ~4.55 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457485Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued their offensive operations, and have made significant progress in three areas.\nIn the southwest, Russian forces broke through from Verbove to the village of Pryvillya. They moved downhill and southwest from the treelines on the tactical heights, establishing control over positions east of Pryvillya, before entering and capturing the village itself. Further east, they captured most of the rest of the tactical heights and began clearing more areas in the low-lying ground northwest of Novohryhorivka. \nTo the northwest, after capturing Oleksiivka, Russian forces continued pushing through the treelines southeast of the village, and levelled the frontline towards the southern bank of the Vovcha River. They also began advancing up the treelines west of Sosnivka, attempting to reach the intersection of the Vovcha and Vorona Rivers. \nFurther east, Russian forces were able to re-enter the village of Novoselivka. They established control over the northern part and are now engaged in fierce fighting for the southern streets. \n+ ~39.69 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457493Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-19T05:15:52.457496Z"
    },
    {
      "original": "High-resolution satellite imagery published by Ukrainian outlet Radio Svoboda of the Feodosia Oil Depot in Crimea shows the extent of the damage from repeated Ukrainian UAV attacks. \nAs a result of the recent attacks on October 7 and October 13, 11 oil tanks were destroyed and 4 others sustained varying levels of damage.",
      "timestamp": "2025-10-19T05:15:52.457501Z"
    },
    {
      "original": "2 Tu-95MS Russian strategic bombers have redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast, after being equipped with Kh-101 cruise missiles. \nAt least 1 Tu-95MS strategic bomber is redeploying from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast. \nThe movements, plus additional information, suggest that there increased possibility for a large-scale, combined missile and drone attack tonight, however nothing is certain at this moment. \nI will continue to provide updates today and inform if anything changes.",
      "timestamp": "2025-10-19T05:15:52.457507Z"
    },
    {
      "original": "UKTMO reports that a ship operating 116 Nautical Miles east of Aden, Yemen, has been hit by an unknown projectile, resulting in a fire. \nEarlier, there were reports that a Cameroon-flagged tanker experienced an explosion, with the crew requesting to abandon the ship. Rescue operations are currently ongoing, and an investigation is underway.",
      "timestamp": "2025-10-19T05:15:52.457511Z"
    },
    {
      "original": "A reconnaissance drone is operating off the coast of Odesa City. It has been in that general area for the past 2 hours.",
      "timestamp": "2025-10-19T05:15:52.457518Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-19T05:15:52.457522Z"
    },
    {
      "original": "The target of the Iskander missile earlier was also attacked by several MLRS rockets and Geran-2 drones. A reconnaissance drone was operating there, filming the strikes, so we will probably get a video of the strikes soon.",
      "timestamp": "2025-10-19T05:15:52.457525Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations south of Novopavlivka and have expanded their bridgehead on the northern bank of the Vovcha River.\nAfter establishing control over Filiya and beginning attacks east of the settlement, Russian forces began making quicker progress towards encircling the remaining Ukrainian formations stationed to the south near Dachne. They advanced uphill from the eastern approaches to Filiya, moving along two treelines to the trench strongpoints west of the highway. These strongpoints were then captured, threatening the encirclement of the Ukrainian forces to the south. \n+ ~3.08 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457530Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Ukrainian forces counterattacked, re-establishing control over the Pokrovsk Coal Mine.\nFollowing the Russian assault groups entering and establishing themselves in the eastern buildings of the mine complex, Ukrainian forces began counterattacking. They first covered the Russian positions with FPV drones, preventing accumulation of infantry, and struck any reinforcements arriving from the south. Assault groups then moved in from the western part of the mine and cleared the positions from the surviving Russian soldiers. A grey zone has now formed up to the anti-tank ditch north of Udachne. \n+ ~0.83 km² in favour of Ukraine.",
      "timestamp": "2025-10-19T05:15:52.457536Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.\nIn the southeast, Russian forces consolidated along the railway line north of Chunyshyne and entered the village of Novopavlivka. They advanced east down the main street, capturing most of the village and pushing the Ukrainians to the northeastern houses.\nIn southern Pokrovsk, Russian forces were able to consolidate in the high-rise buildings of the Shakhtarskyi District and began infiltrating north of the E-50 highway, into the Prospecta, Sobachivka,and Hospital Districts. Assault operations also continued in the high-rise buildings of the Pivdennyi and Soniachnyi Districts, as well as towards Yuvileynyy Park.\nFurther northwest, Russian forces captured the rest of the industrial zone in western Pokrovsk, and re-established control over positions in the Durniak and Pervomaika Districts. Deep infiltrations are now taking place from here, with Russian soldiers and DRGs crossing the railway line into the northwestern factory districts, and into the city centre towards the railway station. Assault operations also continued towards the Prospecta District from the east and deeper into the Market District.\n+ ~4.15 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457542Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to attack the approaches to Myrnohrad, and have made progress in two different areas.\nIn the north, Russian forces advanced from Novoekonomichne to the Kapitalna Mine. They were able to capture the mine along with the positions to the north and begin pushing towards northeastern Myrnohrad. The Russians then secured the forested areas east of the tributary of the Kazenyi Torets River and entered the industrial zone on the edge of the city. Additionally, they were able to advance west of this tributary, pushing from the area of the terkyons to the treelines directly north of Myrnohrad, forcing the Ukrainians to withdraw to the railway line. \nIn the south, Russian forces improved their positions in Kozatske, capturing the central part of the village, and entering its southern houses. This partially secures the southern flank of the formations that managed to enter the first houses of Myrnohrad. \n+ ~6.30 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457550Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance towards Markove and have expanded their bridgehead on the western bank of the Siverskyi Donets Canal.\nRussian forces advanced from their positions in the treelines and trench fortifications east of the canal, establishing control over new trenches and dugouts in and around the windbreak that runs parallel with the canal. The grey zone has also expanded to the adjacent treelines leading towards Markove and Novomarkove.\n+ ~0.29 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457555Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards Lyman and have made progress in three different areas.\nIn the southeast, Russian forces cleared the grey zone in southern and central Yampil, refocusing their efforts on the southwestern part of the village where both sides are attacking each other's positions. \nTo the west, Russian forces broke through Ukrainian positions south of the railway line and linked up with formations in northwestern Yampil. They were able to clear a large part of the Yampil forest, allowing for further assault operations to take place to the southwest in the direction of the Lyman - Siversk Highway. The Russians also advanced along the railway line towards eastern Lyman, capturing more positions in the forests there and to the south of the tracks. \nAdditionally, Russian forces cleared the rest of the salient that formed south of Zarichne by attacking from the northeast and southeast. They then pushed further west along multiple attack vectors in conjunction with the attacks along the railway line. \nIn the north, Russian forces continued to slowly advance along the forested gulley west of Zarichne. They captured new positions towards the western half of the gulley and are repelling additional Ukrainian counterattacks there. Russian forces are also attempting to improve their positions in the treelines northwest of Zarichne, while the Ukrainians have shifted their focus away from the agricultural buildings on the northwestern outskirts of Zarichne, to the area of Slovyanska Street. \n+ ~10.25 km² in favour of Russia.",
      "timestamp": "2025-10-19T05:15:52.457562Z"
    },
    {
      "original": "A short time ago, a Russian Grom-E1 rocket-powered glide-bomb launched from a Su-34 in southwestern Donetsk Oblast impacted the Lozova area of Kharkiv Oblast. The flight length was 120 - 140 km.",
      "timestamp": "2025-10-19T05:15:52.457566Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces intensified their assault operations in and around Pokrovsk and have made additional progress in three different areas.  In the southeast, Russian forces consolidated along the railway line north of Chunyshyne and…",
      "timestamp": "2025-10-19T05:15:52.457569Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.\nLess than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the railway line, including the city centre. The E-50 highway has been cut via Pokrovsk's northwestern industrial zone, meaning supply is now even more difficult. \nWe could be approaching the end of the battle for the city and neighbouring Myrnohrad.",
      "timestamp": "2025-10-19T05:15:52.457574Z"
    },
    {
      "original": "Since I published this map update, it has become apparent that the situation in Pokrovsk has significantly worsened for Ukraine.  Less than 50% of the city is now under solid Ukrainian control, with the Russians now present in most of the city south of the…",
      "timestamp": "2025-10-19T05:15:52.457577Z"
    },
    {
      "original": "\"Pokrovsk isn't strategically important\" cope in 3, 2, 1...",
      "timestamp": "2025-10-19T05:15:52.457580Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations towards the Siverskyi Donets River and have advanced in two areas.\nIn the southeast, Russian forces were able to consolidate in the northern streets of Drobysheve and the agricultural buildings to the east. They also advanced through the forests northwest of Drobysheve, reaching the Nitrius River from the east, and capturing additional positions to the south and north. Additionally, Russian forces expanded their bridgehead west of the river, capturing new positions in the southwestern residential area of Novoselivka, and entering the forests behind them. \nIn the northwest, after heavy FAB, artillery, and FPV drone strikes, Russian forces were able to make significant progress in the forest northwest of Novoselivka, advancing in the direction of Oleksandrivka. They were also able to enter the large forests to the west where fighting is ongoing.\n+ ~6.96 km² in favour of Rusia.",
      "timestamp": "2025-10-19T05:15:52.457586Z"
    },
    {
      "original": "Footage showing two Russian Iskander-M ballistic missile strikes on a Ukrainian Patriot air defence installation near Pavlohrad, Dnipropetrovsk Oblast.\nThe strikes, which took place 3 days ago on October 15, targeted the Patriot's launcher and radar station. This system has been covering the Pavlohrad area for at least the last 4 months.",
      "timestamp": "2025-10-19T05:15:52.457589Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055876Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055893Z"
    },
    {
      "original": "Is Quad Group Dying Or Just Being Outsourced To Fight China?\nThe Quadrilateral Security Dialogue — or “Quad” — has long been hyped as the seeds of an “Asian NATO.” Made up of the US, Japan, India, and Australia, the Quad has been Washington’s big play for the Indo-Pacific. But with US President Donald Trump’s “America First” approach, many are asking if the group has a future.\nSqueezed by Trump’s neo-Monroeist foreign policy and his deal-making style with allies, QUAD is fading fast. Analysts such as Michael Shoebridge (Director of Strategic Analysis Australia) are calling it “the incredible shrinking Quad”: its July 2025 ministers’ statement for instance boiled down to vague talk on sea security and cyber issues, ditching the meatier promises from Biden’s time.\nDu Lan (Deputy Director at Asia-Pacific Institute) notes that Washington has “concentrated mostly on domestic reforms and ending conflicts in Ukraine and the Middle East conflict”...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055905Z"
    },
    {
      "original": "Zelensky-Trump Meeting: A Path to Peace or Escalation?\nOn October 17, a meeting took place in Washington between US President Donald Trump and Ukrainian President Volodymyr Zelensky. The Ukrainian side had held high hopes, but the outcome of the talks did not meet Kyiv's expectations. The primary disappointment was Washington's refusal to provide Ukraine with Tomahawk strike missile systems and clear guarantees on expanding military assistance.\nDespite a dialogue lasting over two hours, the details of which remained largely undisclosed, no concrete progress was made on key issues. Following the meeting, Zelensky refrained from direct commentary, suggesting that questions should be directed to the American side.\nThe central point of discussion was the issue of a territorial settlement. Ukraine insists on a ceasefire along the current front lines followed by peace talks, whereas Russia demands the withdrawal of Ukrainian troops from the entire territory of the Donetsk... \n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055915Z"
    },
    {
      "original": "Doped And Depleted: How Substance Abuse Is Becoming Kyiv’s Strategic Liability\nSince September 2025, there has been an increased number of reports on substance use in the Ukrainian army. While combat drugs can be necessary in modern warfare, the current situation goes far beyond simple medical applications and enhancing soldiers’ performance on the battlefield.\nThe Russians are advancing. Ukrainian fighters are extremely tired and outnumbered, and they cannot see an end to this seemingly endless struggle. Many of them have already spent several years on the front line. In such circumstances, it is difficult to resist the temptation to take a single pill – or an injection – that will solve all your problems, at least for the time being. They take that pill for various reasons: to stay awake and alert on surveillance missions, to ease the pain of a new wound, to relax and forget the horrors, even if only for a few hours.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055924Z"
    },
    {
      "original": "Doped And Depleted: How Substance Abuse Is Becoming Kyiv’s Strategic Liability\nSince September 2025, there has been an increased number of reports on substance use in the Ukrainian army. While combat drugs can be necessary in modern warfare, the current situation goes far beyond simple medical applications and enhancing soldiers’ performance on the battlefield.\nThe Russians are advancing. Ukrainian fighters are extremely tired and outnumbered, and they cannot see an end to this seemingly endless struggle. Many of them have already spent several years on the front line. In such circumstances, it is difficult to resist the temptation to take a single pill – or an injection – that will solve all your problems, at least for the time being. They take that pill for various reasons: to stay awake and alert on surveillance missions, to ease the pain of a new wound, to relax and forget the horrors, even if only for a few hours.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055933Z"
    },
    {
      "original": "Russian Army Advances Deep In Pokrovsk, As Kiev Forces Attack Civilians Fleeing \nOn October 18, the Russian military advanced in several parts of Pokrovsk in the Donetsk direction, amid what appears to be a collapse in Ukrainian defenses inside the city.\nThe Tsentr [Center] Group of Forces broke through Ukrainian defenses in the urban part of the city’s center, specifically in the Yuzhny microdistrict. Russian troops even managed to reach the city’s main train station, according to preliminary reports, which note that some of the newly-captured areas have not been cleared yet.\nAdvance was also reported in the western parts of Pokrovsk. Russian troops are said to have taken over the entrance of the city there, effectively cutting off the route leading to Andronivka.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055946Z"
    },
    {
      "original": "Russian Army Advances Deep In Pokrovsk, As Kiev Forces Attack Civilians Fleeing \nOn October 18, the Russian military advanced in several parts of Pokrovsk in the Donetsk direction, amid what appears to be a collapse in Ukrainian defenses inside the city.\nThe Tsentr [Center] Group of Forces broke through Ukrainian defenses in the urban part of the city’s center, specifically in the Yuzhny microdistrict. Russian troops even managed to reach the city’s main train station, according to preliminary reports, which note that some of the newly-captured areas have not been cleared yet.\nAdvance was also reported in the western parts of Pokrovsk. Russian troops are said to have taken over the entrance of the city there, effectively cutting off the route leading to Andronivka.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055956Z"
    },
    {
      "original": "Squeezing The Bridgehead: Russian Forces Tighten Control Along Oskol River Near Kupyansk\nRussian forces established control over Okhotniche on the Pokrovsk axis. Preparations are ongoing for an assault on Vovchanskie Khutora on the Kharkiv axis. \nAustria has reversed its stance and is ready to support the 19th EU sanctions package.\nRead more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055964Z"
    },
    {
      "original": "Squeezing The Bridgehead: Russian Forces Tighten Control Along Oskol River Near Kupyansk\nRussian forces established control over Okhotniche on the Pokrovsk axis. Preparations are ongoing for an assault on Vovchanskie Khutora on the Kharkiv axis. \nAustria has reversed its stance and is ready to support the 19th EU sanctions package.\nRead more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055971Z"
    },
    {
      "original": "Ukraine Amid an Energy Crisis and Waning Western Support\nOn October 17-18, the conflict between Russia and Ukraine continued with an exchange of strikes, a key feature of which was the record-breaking activity of Russian aviation in employing KAB guided aerial bombs. According to the Ukrainian Armed Forces General Staff, 268 instances of these munitions being used were recorded in a single day—an absolute maximum for 2025, significantly exceeding the previous record of 193 aerial bombs set in September.\nThe Russian side claims that during the strikes, it hit critical transport infrastructure facilities, defense industrial enterprises, a GUR drone operator training center, an unmanned aerial vehicle (UAV) assembly workshop, an air defense radar station, and numerous Ukrainian unit deployment points—across 156 districts in total.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055982Z"
    },
    {
      "original": "Ukraine Amid an Energy Crisis and Waning Western Support\nOn October 17-18, the conflict between Russia and Ukraine continued with an exchange of strikes, a key feature of which was the record-breaking activity of Russian aviation in employing KAB guided aerial bombs. According to the Ukrainian Armed Forces General Staff, 268 instances of these munitions being used were recorded in a single day—an absolute maximum for 2025, significantly exceeding the previous record of 193 aerial bombs set in September.\nThe Russian side claims that during the strikes, it hit critical transport infrastructure facilities, defense industrial enterprises, a GUR drone operator training center, an unmanned aerial vehicle (UAV) assembly workshop, an air defense radar station, and numerous Ukrainian unit deployment points—across 156 districts in total.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-19T05:15:53.055990Z"
    }
  ],
  "script_run_time": "2025-10-19T05:15:53.056952Z"
}