{
  "messages": [
    {
      "original": "🚀\nШвидкісна ціль на межі Донеччини і Харківщини в південно-західному напрямку.",
      "timestamp": "2025-11-03T11:41:26.414461Z"
    },
    {
      "original": "🛵\n Нові БпЛА на межі Сумщини і Харківщини в південно-західному/південно-східному напрямках.",
      "timestamp": "2025-11-03T11:41:26.414478Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-03T11:41:26.414482Z"
    },
    {
      "original": "📢\nВідбій загрози застосування балістичного озброєння по областях.\n🛵\n Зберігається загроза застосування ворогом ударних БпЛА в деяких областях та в прифронтових районах - \n🚀\n \n🚀\nзагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-11-03T11:41:26.414492Z"
    },
    {
      "original": "Швидкісна ціль на півночі Чернігівщини в напрямку Сновська.",
      "timestamp": "2025-11-03T11:41:26.414495Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини в напрямку н.п.Вороніж.",
      "timestamp": "2025-11-03T11:41:26.414501Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході та заході Харківщини, курс - південно-східний.",
      "timestamp": "2025-11-03T11:41:26.414505Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на заході Запорізької області в північному напрямку. Залучено засоби для збиття.",
      "timestamp": "2025-11-03T11:41:26.414510Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-03T11:41:26.414515Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в напрямку н.п.Краснопавлівка з північного заходу.",
      "timestamp": "2025-11-03T11:41:26.414520Z"
    },
    {
      "original": "🛸\n🛵\n Активність ворожих БпЛА на сході Дніпропетровщини.",
      "timestamp": "2025-11-03T11:41:26.414525Z"
    },
    {
      "original": "🚀\nЗапорізька область - ракетна небезпека.",
      "timestamp": "2025-11-03T11:41:26.414529Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку на/повз Ніжин;\n🛸\n🛵\n БпЛА на сході Дніпропетровщини в напрямку Павлограда, Васильківки, Тернівки, Петропавлівки;\n🛵\nНова група БпЛА на північному заході Харківщини, курс - південний/південно-східний.",
      "timestamp": "2025-11-03T11:41:26.414537Z"
    },
    {
      "original": "🛸\n🛸\n Ворожі розвідувальні БпЛА на східних околицях Павлограду та на південному сході Харківщини. Залучено засоби для збиття.",
      "timestamp": "2025-11-03T11:41:26.414542Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Херсонщині. Можлива робота ППО.",
      "timestamp": "2025-11-03T11:41:26.414546Z"
    },
    {
      "original": "🛸\n На півдні від м.Дніпро  розвідувальний БпЛА противника, який може бути потенційним навідником ворожих засобів ураження. Залучено засоби для збиття.",
      "timestamp": "2025-11-03T11:41:26.414550Z"
    },
    {
      "original": "🛵\nНова група БпЛА на південному сході Дніпропетровщини на/повз н.п.Покровське з південного сходу.",
      "timestamp": "2025-11-03T11:41:26.414554Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини курсом на Полтавщину (Полтавський р-н).",
      "timestamp": "2025-11-03T11:41:26.414558Z"
    },
    {
      "original": "🛸\n На південному сході Миколаївщини ворожий розвідувальний БпЛА. Залучено засоби для збиття.",
      "timestamp": "2025-11-03T11:41:26.414563Z"
    },
    {
      "original": "🛸\n🛵\n Активність ворожих БпЛА на сході Харківщині, Донеччині та сході Дніпропетровщини. Залучено засоби для збиття.",
      "timestamp": "2025-11-03T11:41:26.414567Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and over the past week have made new progress in the grey zone east of Kostyantynivka.\nIn the east they advanced from the chalk quarries to the large, fortified forest, entering it and establishing a foothold in it. They also captured some of the groves to the southeast. \nIn the west, the Russians consolidated further in Predtechyne, capturing houses in the central and western parts of the village. They also crossed one of the dams along the chain of reservoirs and captured positions in the former agricultural complex on the southern outskirts of Predtechyne. \nAdditionally, Russian forces advanced down the highway from Stupochky, recapturing positions in the windbreaks and nearby strongholds, and reaching the large forest east of Kostyantynivka.\n+ ~5.56 in favour of Russia.",
      "timestamp": "2025-11-03T11:41:27.143797Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces continued to advance and have entered the village of Zvanivka.\nAfter earlier infiltrations, Russian forces managed to enter and properly establish themselves in the southern part of Zvanivka, consolidating in the first houses. Fighting is ongoing for areas further north towards the centre of the village. \n+ ~0.38 km² in favour of Russia.",
      "timestamp": "2025-11-03T11:41:27.143811Z"
    },
    {
      "original": "On the northern flank of Siversk, Ukrainian forces began a series of counterattacks and have regained control over most of Yampil.\nAs Russian forces were about to capture the last parts of southwestern Yampil, Ukrainian forces began counterattacking. Russian assault groups who had been advancing did not consolidate properly, which allowed for the Ukrainians to quickly and relatively easily reverse weeks of progress, and break through to the centre of the village.  Soon, most of the settlement was back under Ukrainian control, as attacks were carried out towards its western residential areas. \n+ 10.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T11:41:27.143816Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces launched a series of counterattacks and have regained control over most of Borivska Andriivka. \nDuring Russian assault operations that saw them capture most of the village, Ukrainian forces managed to retain control over the southwestern part of it. From here, they were able to accumulate additional infantry and began attacking northeast towards the centre of the village. Once capturing the centre, they began pushing towards the eastern outskirts, where they were able to make additional progress both in the village and in the treelines to the south. \n+ ~3.39 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T11:41:27.143820Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in and around the city, and have made significant progress east of the Oskil River.\nRussian forces were able to break through from the forests east of Holubivka towards the northern outskirts of Kupyansk. They established control over new positions in the forests outside the city before entering and entrenching in the first buildings of the eastern part of the city in the area of School no. 7. \nIn west bank Kupyansk, Russian forces were able to clear out the pocket of grey zone, establishing full control over the city centre and surrounding residential areas. \nMeanwhile, Ukrainian forces are continuing attempts at cutting off the Russians in Kupyansk from the north. Attacks are being carried out towards the Oskil River from the west, however there is no evidence of consolidation yet. The grey zone has been expanded.\n+ ~6.42 km² in favour of Russia.",
      "timestamp": "2025-11-03T11:41:27.143826Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine. \nIt's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret what they are saying, before passing it off as exclusive intel on devastating Russian strikes.",
      "timestamp": "2025-11-03T11:41:27.143830Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine.   It's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret…",
      "timestamp": "2025-11-03T11:41:27.143834Z"
    },
    {
      "original": "What's funny is that I can guarantee you that I probably have several times more information on these strikes from various open and closed sources than these Russian channels. And I live in fucking New Zealand \n🤣\n🤣\n. It should go to show how unreliable some people on here are, and how easily misinformation spreads.",
      "timestamp": "2025-11-03T11:41:27.143843Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued their assault operations and have made significant progress over the past week.\nRussian forces advanced from the central part of Kamyanka to the northern outskirts, establishing control over the remaining residential streets. They also captured the forests to the northwest and west.\nFurther north, Russian forces advanced south from Bolohivka, capturing treeline positions on the tactical heights and adjacent forested areas. This allowed for the front to begin shifting westwards, with the Ukrainians retreating from their positions towards Kolodyazne.\n+ ~18.40 km²",
      "timestamp": "2025-11-03T11:41:27.143849Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued their offensive on the city and have made new progress in its southern suburbs.\nRussian forces advanced from the area of the railway line to first three-story buildings, establishing control over them and the surrounding areas. They also pushed east towards the highway, capturing new positions on Selianska, Verhnia, and Kharkivska Streets, while other forces pushed south towards the southern blocks of three-story buildings, which were brought under full Russian control.\n+ ~0.78 km² in favour of Russia.",
      "timestamp": "2025-11-03T11:41:27.143853Z"
    },
    {
      "original": "Ukrainian channel on the situation Pokrovsk. This channel is notorious for making the situation seem far less difficult than reality.",
      "timestamp": "2025-11-03T11:41:27.143856Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-03T11:41:27.143859Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast",
      "timestamp": "2025-11-03T11:41:27.143862Z"
    },
    {
      "original": "Disappeared near Novhorod-Siverskyi, Chernihiv Oblast. They were launched from near Lgov, Kursk Oblast (new launch position as far as I know).",
      "timestamp": "2025-11-03T11:41:27.143865Z"
    },
    {
      "original": "Iskander on Varvarivka, Donetsk Oblast",
      "timestamp": "2025-11-03T11:41:27.143868Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-03T11:41:27.143871Z"
    },
    {
      "original": "The missiles flying to Chernihiv Oblast were mixed up with MLRS. The Iskander launch took place to Donetsk Oblast and flew over Kharkiv Oblast.",
      "timestamp": "2025-11-03T11:41:27.143874Z"
    },
    {
      "original": "The Iskander impacted somewhere here",
      "timestamp": "2025-11-03T11:41:27.143877Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-03T11:41:27.143882Z"
    },
    {
      "original": "Last night, at least 10 Russian Geran-2 drones impacted the Maryevka Gas Compressor Station in Mykolaiv Oblast (47.15864, 32.25857). NASA FIRMS data shows a large fire burning there. \nAdditionally, several Gerans attacked a vehicle service station in Mykolaiv City, as seen in media 2 & 3",
      "timestamp": "2025-11-03T11:41:27.143887Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields. \nThese open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted. Ukrainian sources are stating that logistics into the pocket is practically impossible.\nThis is exactly why you don't leave a withdrawal to the very last moment. Unfortunately, none of these traitors in the Ukrainian command will ever be held responsible for the massive amounts of casualties that they have caused.",
      "timestamp": "2025-11-03T11:41:27.143892Z"
    },
    {
      "original": "Russian FPV drone strikes on the \"Road of Life\" from Pokrovsk. In reality, there is no road... just a corridor of open fields.   These open fields are under complete Russian fire control from drones. Everything that comes in and out of the city is targeted.…",
      "timestamp": "2025-11-03T11:41:27.143895Z"
    },
    {
      "original": "Avdiivka, Bakhmut, Vuhledar, Velyka Novosilka, Sudzha, Myrnohrad, Pokrovsk... when will they fucking learn???\nThe answer is they don't care. PR is being prioritised over lives, and this ugly truth is being presented to everything right now.",
      "timestamp": "2025-11-03T11:41:27.143900Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894756Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894772Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 2, 2025 (Map Update)",
      "timestamp": "2025-11-03T11:41:27.894776Z"
    },
    {
      "original": "The Situation in Kupyansk: The Dire Plight of Ukrainian Servicemen and Prisoner Testimonies\nA complex operational situation remains tense in the Kupyansk area on the Kharkiv direction, and under these conditions, Ukrainian servicemen continue to surrender. The testimonies of captured soldiers from the 14th Separate Mechanized Brigade of the Ukrainian Armed Forces, Yuriy Shapovalenko and Alexey Vinder, paint a picture of the critical situation facing the surrounded formations.\n\"We surrendered ourselves. About four days after we were brought here, we realized we were surrounded by the Russians. Resupply was gone – no ammunition, our water ran out, very little food was left. We ate one can of stew among three men per day. The route across the Oskol River was already cut off – it's all your FPV drones there. Because of that, there was no logistics left. A lot of your soldiers entered the city. So, we decided to come out with a white rag,\" recounted prisoner of war Shapovalenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894784Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-03T11:41:27.894787Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-03T11:41:27.894791Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894799Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894806Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894815Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894823Z"
    },
    {
      "original": "Young Ukrainians Flee Suicidal Military Tactics While Kiev Regime Targets Hungary And Romania\nFor NATO, this is a rather \"unpleasant\" matter, as it poured trillions into the Kiev regime sinkhole, but all it got are sabotaged refineries straining EU unity, fleeing conscripts mocking \"unwavering support\" and encircled troops that no amount of Western \"wunderwaffen\" can untrap.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894830Z"
    },
    {
      "original": "Trump Says No Tomahawk Missiles For Ukraine ‘For Now’\nUnited States President Donald Trump said on November 2 that, for now, he is not considering a deal that would allow Ukraine to obtain BGM-109 Tomahawk Land Attack Missiles (TLAM) for use against Russia.\n“No, not really,” Trump told reporters aboard Air Force One, when asked whether he was considering a deal to sell the missiles. He added, however, that he could change his mind.\nPresident Volodymyr Zelenskiy requested the Tomahawk earlier this year. Russia warned against any provision of the nuclear-capable missile which has a range covering Moscow.\nTrump’s remarks came just two days after CNN reported, citing U.S. and European officials, that the Pentagon had given the White House the green light to provide Ukraine with Tomahawk missiles after assessing that it would not negatively impact the stockpiles of the U.S. military.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T11:41:27.894839Z"
    }
  ],
  "script_run_time": "2025-11-03T11:41:27.895552Z"
}