{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину/Дніпропетровщину.",
      "timestamp": "2026-01-13T11:52:20.147750Z"
    },
    {
      "original": "🛵\n \n🛸\n Запорізька область: БпЛА в напрямку Оріхова, Вільнянська, Комишувахи.",
      "timestamp": "2026-01-13T11:52:20.147770Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Запоріжжя з північного сходу.",
      "timestamp": "2026-01-13T11:52:20.147778Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/Дніпропетровщину.",
      "timestamp": "2026-01-13T11:52:20.147784Z"
    },
    {
      "original": "🚀\nКАБ в напрямку Петропавлівки (Дніпропетровщина).",
      "timestamp": "2026-01-13T11:52:20.147788Z"
    },
    {
      "original": "🛵\n \n🛸\n Сумщина: БпЛА на сході від Ямполя, курс - південний/південно-західний.",
      "timestamp": "2026-01-13T11:52:20.147794Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини в напрямку на/повз Письменне.",
      "timestamp": "2026-01-13T11:52:20.147799Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА в напрямку Сум з північного сходу.",
      "timestamp": "2026-01-13T11:52:20.147805Z"
    },
    {
      "original": "🛵\n \n🛸\n Чернігівщина: БпЛА в районі н.п.Ріпки і Городня.",
      "timestamp": "2026-01-13T11:52:20.147811Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Синельникового (Дніпропетровщина) з півдня та Вільнянська (Запорізька обл.) з північного сходу.",
      "timestamp": "2026-01-13T11:52:20.147816Z"
    },
    {
      "original": "🚀\nКАБ в напрямку Петропавлівки (Дніпропетровщина).",
      "timestamp": "2026-01-13T11:52:20.147820Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Павлограда з південного заходу.",
      "timestamp": "2026-01-13T11:52:20.147825Z"
    },
    {
      "original": "🛸\n БпЛА, ймовірно, розвідувальні на Чернігівщині в напрямку н.п.Михайло-Коцюбинське та н.п.Славутич/Любеч.",
      "timestamp": "2026-01-13T11:52:20.147829Z"
    },
    {
      "original": "🛸\n БпЛА, ймовірно, розвідувальні на Чернігівщині в напрямку н.п.Михайло-Коцюбинське та н.п.Славутич/Любеч.",
      "timestamp": "2026-01-13T11:52:20.147834Z"
    },
    {
      "original": "🛸\nБпЛА в напрямку Чернігова із заходу.",
      "timestamp": "2026-01-13T11:52:20.147838Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА в напрямку Сум з півночі.",
      "timestamp": "2026-01-13T11:52:20.147844Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини курсом на Харківщину (вектор - н.п. Сахновщина/Орілька).",
      "timestamp": "2026-01-13T11:52:20.147848Z"
    },
    {
      "original": "Ракета на Сумщині в напрямку н.п.Боромля",
      "timestamp": "2026-01-13T11:52:20.147852Z"
    },
    {
      "original": "Ракета на Сумщині в напрямку н.п.Боромля",
      "timestamp": "2026-01-13T11:52:20.147855Z"
    },
    {
      "original": "Ракета продовжує рух на Полтавщину (вектор - н.п.Зіньків)",
      "timestamp": "2026-01-13T11:52:20.147858Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини курсом на Харківщину (вектор - н.п. Сахновщина/Орілька).",
      "timestamp": "2026-01-13T11:52:20.147862Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в напрямку на/повз н.п.Слобожанське з півдня.",
      "timestamp": "2026-01-13T11:52:20.147869Z"
    },
    {
      "original": "🛵\n🛸\n Сумщина: БпЛА в напрямку на/повз Путивль з південного сходу.",
      "timestamp": "2026-01-13T11:52:20.147877Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харківщину з Білгородщини.",
      "timestamp": "2026-01-13T11:52:20.147883Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харківщину з Білгородщини.",
      "timestamp": "2026-01-13T11:52:20.147887Z"
    },
    {
      "original": "Ракети в напрямку Старого Салтова з півночі.",
      "timestamp": "2026-01-13T11:52:20.147890Z"
    },
    {
      "original": "Multiple impacts to the 750 kV substation in Nalyvaikivka",
      "timestamp": "2026-01-13T11:52:20.697621Z"
    },
    {
      "original": "Repeated impacts to the 750 kV substation in Nalyvaikivka",
      "timestamp": "2026-01-13T11:52:20.697634Z"
    },
    {
      "original": "1 group left, flying northwest to Fastiv, Kyiv Oblast.",
      "timestamp": "2026-01-13T11:52:20.697638Z"
    },
    {
      "original": "1 group changed course to Tarashcha, flying west.",
      "timestamp": "2026-01-13T11:52:20.697641Z"
    },
    {
      "original": "1 group changed course to Tarashcha, flying west.",
      "timestamp": "2026-01-13T11:52:20.697645Z"
    },
    {
      "original": "Flying to Bila Tserkva, ~30 km away",
      "timestamp": "2026-01-13T11:52:20.697648Z"
    },
    {
      "original": "Flying to Bila Tserkva, ~30 km away",
      "timestamp": "2026-01-13T11:52:20.697652Z"
    },
    {
      "original": "After maneuvering for a while, its now flying east to Trypillya TPP",
      "timestamp": "2026-01-13T11:52:20.697655Z"
    },
    {
      "original": "There was only one missile here, and it was intercepted. \nUkrainian airspace is now clear of missiles.",
      "timestamp": "2026-01-13T11:52:20.697660Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.  Missiles launched:  ~10 Kh-101 cruise missiles launched from 5 Tu-95MS strategic bombers at their launch lines in Kalachyovksy District…",
      "timestamp": "2026-01-13T11:52:20.697664Z"
    },
    {
      "original": "(Updated report)\nLast night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~8 Iskander-M ballistic missiles launched from OTRK installations northeast of Simferopol, Crimea.\n~6 Iskander-M ballistic missiles launched from OTRK installations near Yeysk, Krasnodar Krai.\n~4 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~3 Iskander-M ballistic missiles launched from OTRK installations in the vicinity of Belgorod City, Belgorod Oblast.\n~2 Iskander-M ballistic missiles launched from OTRK installations at Millerovo Airbase, Rostov Oblast.\n~4 Iskander-K cruise missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~2 Iskander-K cruise missiles launched from an OTRK installation near Khalino Airbase, Kursk Oblast.\n~2 Iskander-K cruise missiles launched from an OTRK installation northwest of Klintsy, Bryansk Oblast.\n-----------------------\nTotal missiles launched:\n~23 Iskander-M ballistic missiles.\n~8 Iskander-K cruise missiles.\n~31 missiles in total.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 2 Iskander-Ms and 4 Iskander-Ks.\n-----------------------\nThe main targets for this strike was Ukrainian energy infrastructure. The following was targeted:\nTrypillya Thermal Power Plant, Kyiv Oblast (50.13416, 30.74705) by ~1 Iskander-M.\nKryvyi Rih Thermal Power Plant, Dnipropetrovsk Oblast (47.5436, 33.66164) by ~8 Iskander-Ms.\n\"Zaporizka\" 750 kV electrical substation, Zaporizhzhia Oblast (47.99956, 35.50957) by ~6 Iskander-Ms.\nKharkiv TEC-5 Combined Heat and Power Plant, Kharkiv Oblast (49.9707, 36.11154) by ~3 Iskander-Ms.\n\"Kyiv\" 750 kV electrical substation, Kyiv Oblast (50.49441, 29.69235) by ~4 Iskander-Ks.\nUnknown target in Petropavlivka, Dnipropetrovsk Oblast by ~2 Iskander-Ms. \nUnknown target in southern Kyiv City by ~1 Iskander-M.\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2026-01-13T11:52:20.697691Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast. \nExplosions were heard and a large fire broke out at the production buildings. \nAtlant Aero specialises in the production of of aircraft and spacecraft. It also produces drones, including Molniya FPV drones, as well as components for Orion drones, other drone related equipment, and electronic warfare systems.",
      "timestamp": "2026-01-13T11:52:20.697701Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast. \nExplosions were heard and a large fire broke out at the production buildings. \nAtlant Aero specialises in the production of of aircraft and spacecraft. It also produces drones, including Molniya FPV drones, as well as components for Orion drones, other drone related equipment, and electronic warfare systems.",
      "timestamp": "2026-01-13T11:52:20.697706Z"
    },
    {
      "original": "Footage showing a Russian Geran-2 drone strike on a facility in the village of Krupets, Sumy Oblast, reportedly used by Ukraine as a drone assembly point. \nWhile this footage only shows one strike, multiple other drones impacted the complex too. \nCoordinates: 51.91402, 33.56219",
      "timestamp": "2026-01-13T11:52:20.697712Z"
    },
    {
      "original": "Russian forces have captured the village of Lukyanivske,  Komyshuvakha direction, Zaporizhzhia Oblast.\nPre-war population: ~143.\nTotal land area: ~0.73 km².\nThe fighting for Lukyanivske lasted approximately 25 days.",
      "timestamp": "2026-01-13T11:52:20.697717Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their offensive operations and have made significant progress in the direction of the Konka River.\nIn the west, Russian forces completed the clearing of central and northern Stepnohirsk, bringing the town under their full control. This allowed for them to fully shift their focus to areas further north, with assault groups taking up new positions in the treelines and forest plantations there. \nOther forces continued infiltrating west from Primorske, and finally consolidated in the area of the pumping station and orchards. Infiltrations are now being carried out further north up the highway and then to the northeast through the fields in the direction of Mahdalynivka. Russian MLRS shelling is constantly targeting these areas, supporting the offensive effort. \nAdditionally, Russian forces advanced from the central part of Prymorske to the northern streets of the village, consolidating in the last part of the main residential area. Fighting is now ongoing for the dachas on the northern outskirts, and infiltrations are taking place further northeast, where they managed to reach the bridge over the Konka River and cut the E-105 Highway. The Ukrainians responded by blowing up the bridge to prevent further Russian advancement. Russian forces also continued infiltrating east from northern Prymorske and captured part of the forests there.\nIn the east, Russian forces managed to consolidate in the western part of Lukyanivske, including in the agricultural buildings, and captured treeline positions to the south and southeast. As a result of these advances, they were able to bring the rest of the village under their control, and seize the treeline to the north, from which infiltrations are now being carried out even further north in the direction of Mahdalynivka. Due to these sudden advances, Russian DRGs managed to ambush Ukrainian drone operators in the village, probably resulting in casualties for the Ukrainians. \n+ ~17.52 km² in favour of Russia.",
      "timestamp": "2026-01-13T11:52:20.697725Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their offensive operations and have made significant progress in the direction of the Konka River.  In the west, Russian forces completed the clearing of central and northern Stepnohirsk, bringing the…",
      "timestamp": "2026-01-13T11:52:20.697729Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that due to the rapidly deteriorating situation western Zaporizhzhia Oblast, Ukrainian forces blew up the highway bridge over the Konka River in the village of Hryhorivka.\nRussian forces recently achieved a localised breakthrough in this direction, quickly reaching the bridge. These Russian actions are aimed at capturing everything south of the Konka River, and creating a large right flank for the stronghold city of Orikhiv, which will eventually be used to encircle and capture the city. The Ukrainians are attempting to contain this advance against the Konka River.",
      "timestamp": "2026-01-13T11:52:20.697733Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces continued their assault operations in Mala Tokmachka and have made new progress.\nAfter regaining the initiative and expanding their foothold in the eastern part of Mala Tokmachka again, Russian forces continued advancing west and have captured new positions along the highway north of the ruins of the prison. They also improved their positions in the streets to the north, approaching the centre of the village.\n+ ~0.44 km² in favour of Russia.",
      "timestamp": "2026-01-13T11:52:20.697739Z"
    },
    {
      "original": "In the Omelnyk direction, both Russian and Ukrainian forces have advanced, with Russian forces continuing their intensified assault operations aimed at establishing a large bridgehead west of the Haichur River.\nIn the north, the Russians began clearing the grey-zone that formed east of the Haichur River in November/December. They were able to recapture positions in numerous treelines, primarily north of the gulley that stretches southeast from southern Dobropillya. From there, they managed to infiltrate west through a gap in Ukrainian defences and entered the village of Pryluky and the trench fortifications to the west. Ukrainian forces are counterattacking, with heavy fighting ongoing for the trenches there. \nTo the south, following earlier infiltrations by DRGs, Russian forces advanced from northwestern Hulyaipole and managed to enter and capture the village of Zelene. From there, they continued infiltrating the village of Sviatopetrivka from the northeast, which remains in the grey-zone for now. They also captured new treeline positions southwest of Zelene. Additionally, the Russians continued their infiltrations across the Haichur River from Varvarivka, into the southern part of Olenokostiantynivka.\nIn the south, Russian forces continued incrementally advancing southwest of Hulyaipole, and managed to captured new treeline positions in the treelines west of the highway. Meanwhile, Ukrainian forces managed to complete the clearing operations in eastern Zaliznychne, bringing the town back under their control.\n+ ~13.17 km² in favour of Russia.\n+ ~0.62 km² in favour of Ukraine.",
      "timestamp": "2026-01-13T11:52:20.697746Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces resumed their counterattacks in the direction of Udachne, making new progress.\nFollowing their earlier failed attempts at entering the town from the northwest, Ukrainian forces launched a new series of attacks from the west. They first advanced south down the Donetsk-Dnipropetrovsk Regional Border to the poorly consolidated Russian positions in northern Molodetske, which subsequently shifted into the grey-zone. \nThen, without consolidating, the Ukrainians infiltrated further east along the railway line and are trying to accumulate just west of Udachne. Russian FPV drone operators are attempting to cover the infiltration routes in order to limit the number of soldiers reaching the western approaches to the town. \nIn the east, Ukrainian forces counterattacked in the direction of the railway line between Kotlyne and Udachne, recapturing positions along three parallel treelines. \nMeanwhile, Russian forces continued their attacks both east and west of the Pokrovsk Coal Mine's waste dumps, while DRGs began infiltrating further northwest through the forest plantations in the direction of Serhiivka. \n+ ~1.44 km² in favour of Ukraine.",
      "timestamp": "2026-01-13T11:52:20.697753Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.\nLaunched from a Su-57",
      "timestamp": "2026-01-13T11:52:20.697757Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued their assault operations on a wide front, making new progress in four different areas.\nIn the south, following several attempts, Russian infantry managed to gain a foothold in the railway windbreaks north of Rodynske and began accumulating infantry for additional attacks through the windbreaks further west. Other forces in central Rodynske managed to infiltrate the former \"Zaporozhskaya\" Mine west of the city. Fighting also continues for central Zatyshok, where the Russians are trying to dislodge the remaining Ukrainian soldiers.\nTo the north, Russian forces managed to consolidate in two more clay mines, along with additional forested areas and treelines. Attacks are now being carried out further north, where assault groups have reached the southern outskirts of Kucheriv Yar once again. Renewed fighting is also ongoing for Ivanivka, and Russian soldiers are continuing their attacks in western Nove Shakhove.\nTo the northeast, Russian forces continued advancing north from Shakhove and captured new positions southwest of Toretske. Fighting is ongoing for a large trench fortification there. Additionally, Russian forces managed to further improve their positions in the treelines northeast of Sofiivka. \n+ ~7.55 km² in favour of Russia.",
      "timestamp": "2026-01-13T11:52:20.697763Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.  Launched from a Su-57",
      "timestamp": "2026-01-13T11:52:20.697766Z"
    },
    {
      "original": "The Kh-59/69 cruise missile was shot down as it approached the Sumy-Poltava border. \nAn explosion was heard in Sumy, likely from the launch of a patriot missile which intercepted the Russian missile. \nA Russian Su-57 continues to fly in Kursk Oblast, covered by a Su-35.",
      "timestamp": "2026-01-13T11:52:20.697771Z"
    },
    {
      "original": "Military Situation In Ukraine On January 12, 2026 (Maps Update)",
      "timestamp": "2026-01-13T11:52:21.334316Z"
    },
    {
      "original": "Military Situation In Ukraine On January 12, 2026 (Maps Update)",
      "timestamp": "2026-01-13T11:52:21.334330Z"
    },
    {
      "original": "Ukraine Is Losing Ground To Russian Army In Zaporozhye Faster Than Ever (Videos)\nOn January 12, the Russian military captured another settlement in Zaporozhye from Kiev forces, with reports suggesting that sever other settlements are about to be cleared.\nThe capture of Novoboykovskoye, located to the east of Stepnohirsk, by the Vostok [East] Group of Forces was confirmed by the Russian Ministry of Defense. Russian troops stormed the settlement just a few days earlier. Kiev forces failed to put on any real resistance.\nA similar situation is reportedly developing in Prymorske, to the northwest of Stepnohirsk, where Kiev forces have very much lost control of the large settlement.\nAccording to preliminary reports, the last Ukrainian positions in the northern part of the Prymorske had been already captured, and work to fully secure the settlement is nearing completion. The Russian MoD could confirm the capture of the settlement within a few days.\nRead more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334340Z"
    },
    {
      "original": "Ukraine Is Losing Ground To Russian Army In Zaporozhye Faster Than Ever (Videos)\nOn January 12, the Russian military captured another settlement in Zaporozhye from Kiev forces, with reports suggesting that sever other settlements are about to be cleared.\nThe capture of Novoboykovskoye, located to the east of Stepnohirsk, by the Vostok [East] Group of Forces was confirmed by the Russian Ministry of Defense. Russian troops stormed the settlement just a few days earlier. Kiev forces failed to put on any real resistance.\nA similar situation is reportedly developing in Prymorske, to the northwest of Stepnohirsk, where Kiev forces have very much lost control of the large settlement.\nAccording to preliminary reports, the last Ukrainian positions in the northern part of the Prymorske had been already captured, and work to fully secure the settlement is nearing completion. The Russian MoD could confirm the capture of the settlement within a few days.\nRead more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334350Z"
    },
    {
      "original": "A WEEKEND OF STRATEGIC SHIFTS: RUSSIA GAINS GROUND AMID HIGH-INTENSITY FIGHTING",
      "timestamp": "2026-01-13T11:52:21.334354Z"
    },
    {
      "original": "Russian-Ukrainian Strike Exchange: Black Sea Vessel Attacks, UK Unveils New Rocket Project For Ukraine\nOn the night of January 12, Russian air defense forces destroyed or suppressed 13 Ukrainian drones. The highest number was intercepted over the Rostov region. Simultaneously, the Ukrainian side reported intercepting or suppressing 135 out of 156 Russian attack UAVs. \nThe day before, attention was drawn to published information about the start of design work in the UK on an operational-tactical ballistic missile for the Armed Forces of Ukraine, codenamed Nightfall. The $12.1 million R&D contract is distributed among three industrial groups, one of which is presumably MBDA Missile Systems. According to data that emerged as early as August 2025, the project's goal is to create a highly mobile missile system with a range exceeding 500 km (some reports say up to 600 km) and with low infrared and radar signatures.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334363Z"
    },
    {
      "original": "Russian-Ukrainian Strike Exchange: Black Sea Vessel Attacks, UK Unveils New Rocket Project For Ukraine\nOn the night of January 12, Russian air defense forces destroyed or suppressed 13 Ukrainian drones. The highest number was intercepted over the Rostov region. Simultaneously, the Ukrainian side reported intercepting or suppressing 135 out of 156 Russian attack UAVs. \nThe day before, attention was drawn to published information about the start of design work in the UK on an operational-tactical ballistic missile for the Armed Forces of Ukraine, codenamed Nightfall. The $12.1 million R&D contract is distributed among three industrial groups, one of which is presumably MBDA Missile Systems. According to data that emerged as early as August 2025, the project's goal is to create a highly mobile missile system with a range exceeding 500 km (some reports say up to 600 km) and with low infrared and radar signatures.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334372Z"
    },
    {
      "original": "Control of Communications in Zaporizhzhia: Fight for Orikhiv’s Highways Escalates in Ukraine \n▪️\nIn the Zaporizhzhia sector, the Russian army's control of Bilohiria and the interaction of the \"Dnepr\" and \"West\" groupings are creating prerequisites for an operational encirclement of the Orikhiv district. The key objective is to intercept the H-08 and T-04-08 highways. \n▪️\nIn the Pokrovsk sector, following the conclusion of combat operations in Pokrovsk and Myrnohrad, Russian forces have advanced towards Bilytske and Shevchenko, while intense fighting continues in Hryshyne. \n▪️\nIn the Kostiantynivka sector, fighting continues for Novodmytrivka and Predtechyne. Meanwhile, Russian assault detachments have advanced into the southeastern part of Kostiantynivka and captured strongpoints west of Stepanivka. \n▪️\nIn the Sumy sector, Russian \"North\" assault units have significantly expanded their offensive front, advancing 14 sections in the Sumy district for a total of up to 850 meters. \nRead more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334385Z"
    },
    {
      "original": "Control of Communications in Zaporizhzhia: Fight for Orikhiv’s Highways Escalates in Ukraine \n▪️\nIn the Zaporizhzhia sector, the Russian army's control of Bilohiria and the interaction of the \"Dnepr\" and \"West\" groupings are creating prerequisites for an operational encirclement of the Orikhiv district. The key objective is to intercept the H-08 and T-04-08 highways. \n▪️\nIn the Pokrovsk sector, following the conclusion of combat operations in Pokrovsk and Myrnohrad, Russian forces have advanced towards Bilytske and Shevchenko, while intense fighting continues in Hryshyne. \n▪️\nIn the Kostiantynivka sector, fighting continues for Novodmytrivka and Predtechyne. Meanwhile, Russian assault detachments have advanced into the southeastern part of Kostiantynivka and captured strongpoints west of Stepanivka. \n▪️\nIn the Sumy sector, Russian \"North\" assault units have significantly expanded their offensive front, advancing 14 sections in the Sumy district for a total of up to 850 meters. \nRead more \nHERE",
      "timestamp": "2026-01-13T11:52:21.334397Z"
    },
    {
      "original": "Ships And Radars Hit: Summary Of Russian Combat Footage From January 12, 2026\nOn January 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-13T11:52:21.334404Z"
    },
    {
      "original": "Ships And Radars Hit: Summary Of Russian Combat Footage From January 12, 2026\nOn January 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-13T11:52:21.334411Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – January 13, 2026",
      "timestamp": "2026-01-13T11:52:21.334414Z"
    }
  ],
  "script_run_time": "2026-01-13T11:52:21.335251Z"
}