{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-20T07:15:17.363229Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-20T07:15:17.363245Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із акваторії Чорного моря \n➡️\n курсом на Одещину.",
      "timestamp": "2025-08-20T07:15:17.363252Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Київщини. Курс \n➡️\n на Житомирщину.",
      "timestamp": "2025-08-20T07:15:17.363259Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із акваторії Чорного моря \n➡️\n курсом на Одещину.",
      "timestamp": "2025-08-20T07:15:17.363265Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Татарбунари.",
      "timestamp": "2025-08-20T07:15:17.363274Z"
    },
    {
      "original": "🛵\n Групи БпЛА з Харківщини \n➡️\n на Полтавщину.",
      "timestamp": "2025-08-20T07:15:17.363279Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на Татарбунари.",
      "timestamp": "2025-08-20T07:15:17.363285Z"
    },
    {
      "original": "🛵\n  Одещина: під атакою \n➡️\n Ізмаїл.",
      "timestamp": "2025-08-20T07:15:17.363290Z"
    },
    {
      "original": "Миколаївська, Херсонська області - ракетна небезпека!",
      "timestamp": "2025-08-20T07:15:17.363294Z"
    },
    {
      "original": "Миколаївська, Херсонська області - ракетна небезпека!",
      "timestamp": "2025-08-20T07:15:17.363297Z"
    },
    {
      "original": "Швидкісна ціль на Миколаївщині!",
      "timestamp": "2025-08-20T07:15:17.363300Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Чернігівщини!",
      "timestamp": "2025-08-20T07:15:17.363308Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Чернігівщини!",
      "timestamp": "2025-08-20T07:15:17.363314Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на Новгород - Сіверський, Борзну",
      "timestamp": "2025-08-20T07:15:17.363319Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n повз Борову.",
      "timestamp": "2025-08-20T07:15:17.363325Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА \n➡️\n на Сумщину. Курс \n➡️\n на Хотінь.",
      "timestamp": "2025-08-20T07:15:17.363332Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n курсом на Миргород",
      "timestamp": "2025-08-20T07:15:17.363337Z"
    },
    {
      "original": "🛸\n  Ворожі розвідувальні БпЛА \n➡️\n у Запорізькій, Чернігівській, Харківській областях. Залучено засоби для збиття!",
      "timestamp": "2025-08-20T07:15:17.363343Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Сумщини. Курс \n➡️\n на Чернігівщину.",
      "timestamp": "2025-08-20T07:15:17.363350Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному та південно-східному напрямках зберігається!\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-20T07:15:17.363357Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО БАЛІСТИЧНУ РАКЕТУ ТА 62 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 серпня (із 19.30 19 серпня) противник атакував 2-ма балістичними ракетами Іскандер-М (із ТОТ Криму), а також та 93-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Брянськ, Міллерово, Приморсько-Ахтарськ – рф., Чауда – ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено балістичну ракету Іскандер-М та 62 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання ворожої ракети та ударних БпЛА на 20 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-20T07:15:17.363376Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-20T07:15:17.363380Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Чернігівщині поблизу н.п. Березна. Залучено засоби для збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-08-20T07:15:17.363387Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-08-20T07:15:17.363391Z"
    },
    {
      "original": "Last night, 2 Russian Iskander-M ballistic missiles launched from Taganrog, Rostov Oblast, impacted Slovyansk, Donetsk Oblast. A reconnaissance drone was operating at the time of the strikes.   Later on, at least 10 Geran-2 drone strikes targeted the city…",
      "timestamp": "2025-08-20T07:15:18.030426Z"
    },
    {
      "original": "The target of the 2 Iskander-M strikes on Slovyansk was a temporary deployment point used by Azov (confirmed by locals). This is why it took over 12 hours for official photos to be released, compared to the usual 1-4 hours.\nCoordinates: 48.8547272, 37.5837133",
      "timestamp": "2025-08-20T07:15:18.030440Z"
    },
    {
      "original": "The target of the 2 Iskander-M strikes on Slovyansk was a temporary deployment point used by Azov (confirmed by locals). This is why it took over 12 hours for official photos to be released, compared to the usual 1-4 hours.\nCoordinates: 48.8547272, 37.5837133",
      "timestamp": "2025-08-20T07:15:18.030445Z"
    },
    {
      "original": "Another large-scale combined Russian missile and drone attack was carried out on Ukraine last night. The main target was Poltava Oblast, where Kremenchuk, Hlobyne, and Lubny were all hit.  Kremenchuk bore the brunt of the attack, with all missiles flying there.…",
      "timestamp": "2025-08-20T07:15:18.030449Z"
    },
    {
      "original": "Massive fires continue to burn uncontained at the Kremenchuk Oil Refinery in Poltava Oblast.",
      "timestamp": "2025-08-20T07:15:18.030453Z"
    },
    {
      "original": "Satellite imagery shows that Ukrainian drones (likely FPV drones launched from USVs) attacked a \"Kasta-2E2\" radar station near the village of Khutorok, Crimea. Afterwards, a fire was recorded and a net was placed over the destroyed station, obscuring it from view. \nCoordinates: 45.258430, 33.152500\nCredit: \nhttps://t.me/kiber_boroshno/11935",
      "timestamp": "2025-08-20T07:15:18.030458Z"
    },
    {
      "original": "This morning, ~4 Russian Geran-2 drones attacked the town of Vasylkivka, Dnipropetrovsk Oblast. The target was the secondary school, where a large fire is now burning. \nCoordinates: 48.217675, 36.011639",
      "timestamp": "2025-08-20T07:15:18.030465Z"
    },
    {
      "original": "This morning, ~4 Russian Geran-2 drones attacked the town of Vasylkivka, Dnipropetrovsk Oblast. The target was the secondary school, where a large fire is now burning. \nCoordinates: 48.217675, 36.011639",
      "timestamp": "2025-08-20T07:15:18.030470Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance, making further progress on the tactical heights.\nRussian forces advanced in two areas. Most of the progress was made in the south, where Russian forces pushed outwards from the newly captured village of Zelenyi Hai. They advanced over the gulley and secured a forested area, as well as the northern ends of three parallel treelines. They were also able to advance west from Zelenyi Hai, capturing positions in the treeline on the northern edge of that same gulley.\nIn the north, Russian forces began securing the northern flank of their wedge that runs to the north of Borivska Andriivka. They were able to improve their positions in the treelines here. \n+ ~8.16km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030479Z"
    },
    {
      "original": "Ukrainian MLRS (not HIMARS) attacked Horlivka, Donetsk Oblast a few minutes ago. Russian S-300/400 air defence missiles from Makiivka engaged the rockets. The rockets were launched from the southwestern outskirts of Druzhkivka.",
      "timestamp": "2025-08-20T07:15:18.030482Z"
    },
    {
      "original": "Ukrainian MLRS (not HIMARS) attacked Horlivka, Donetsk Oblast a few minutes ago. Russian S-300/400 air defence missiles from Makiivka engaged the rockets. The rockets were launched from the southwestern outskirts of Druzhkivka.",
      "timestamp": "2025-08-20T07:15:18.030485Z"
    },
    {
      "original": "It seems that the MLRS hit something near Avdiivka.",
      "timestamp": "2025-08-20T07:15:18.030489Z"
    },
    {
      "original": "On the northeastern flank of Siversk, Russian forces have captured most, if not all of the rest of the village of Serebryanka.\nRussian forces advanced from their positions in the centre of the settlement, pushing towards the western outskirts. They were able to establish control over numerous positions in the ruined residential area, eventually forcing a Ukrainian withdrawal to the nearby tactical heights.\nIt's reported that the westernmost houses remain in the grey zone, and that the Russians haven't consolidated their positions, however flags were raised there earlier. \n+ ~1.87km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030494Z"
    },
    {
      "original": "Pokrovsk city centre today. \nSupply into the city has improved for Ukraine following the clearing of DRGs to the north. All of Pokrovsk has also been cleared of Russian DRGs, except for half of the Kalynivka District in the south, which is under actual Russian control. The lines have solidified for now.",
      "timestamp": "2025-08-20T07:15:18.030502Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance and have made new progress north and northeast of Chasiv Yar.\nRussian forces advanced in two areas. In the east, they improved their positions north of the chalk quarries, and captured a chain of trenches and dugouts along the western bank of the Siverskyi Donets Canal.\nIn the west, after securing a section of heavily fortified trench line, they advanced further west, capturing the southern part of the next treeline over. \n+ ~4.60km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030508Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have completed the capture of the Siverskyi Donets Line. \nAfter the fall of Predtechyne, defence at the easternmost part of the salient became untenable for Ukraine, forcing them to begin the withdrawal to the Kostyantynivka - Ivanopillya Line. Russian forces quickly followed, capturing the line of trenches and dugouts along the western bank of the Siverskyi Donets Canal, and the positions at the southern chalk quarry.\nFrom there, they cleared two forested areas which hold heavily fortified areas, as well as numerous treeline positions both on the heights and in the low-lying ground. As a result, the last section of the tactical heights running from Chasiv Yar to Horlivka has fallen.\nAdditionally, Russian forces continued to clear the treelines north of Bila Hora, and made progress in Oleksandro-Shultyne, where they secured the southern bank of Naumykha River and established a bridgehead over it in the eastern part of the settlement.\n+ ~12.79km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030514Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces made new progress towards Kleban-Byk from the east, establishing control over an important stronghold. \nAfter securing positions east of the railway line on approach to the Kleban-Bykske Reservoir, Russian forces began storming the St. Matrona Mine to the south. Due to its position in relation to the nearby Russian controlled territory, Ukrainian forces had to withdraw to the northern outskirts of Shcherbynivka, resulting in the mine's capture.\n+ ~1.64km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030519Z"
    },
    {
      "original": "On the southwestern flank of Kostyantynivka, Russian forces continued to advance towards Sofiivka, further outflanking the stronghold village of Shakhove.\nAfter securing the top of the tactical heights, Russian forces began advancing downhill. They pushed west and northwest down treelines, securing new positions there and in the forest plantations in the gulley running down the middle. \n+ ~3.35km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030524Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations and began recapturing previously lost positions. \nAfter the successful Ukrainian counterattacks, Russian forces were able to regroup and hold their ground in and around Kucheriv Yar. They then began advancing in two directions outward from the village.\nIn the west, they advanced north up the Velyka Balka Gulley, securing the forests and fortified positions there. They then went on to advance northwest and uphill, gaining a foothold on the series of treelines northeast of Stepy. The Russians were able to advance further, capturing numerous new treeline positions on the tactical heights, before pushing downhill and re-entering the village of Rubizhne. Currently, the village is mostly in the grey zone, with neither side holding a significant presence there. Russia holds their main presence in the forest plantations southeast of the settlement, near the pond. \nIn the east, they advanced from Kucheriv Yar, recapturing a trench strongpoint and part of an adjacent treeline. They then went on to advance northeast up another treeline, recapturing part of the forest plantations on the western edge of the gulley that leads to Hruzke.\n+ ~9.98km² in favour of Russia.",
      "timestamp": "2025-08-20T07:15:18.030530Z"
    },
    {
      "original": "In the Pokrovsk direction, Ukrainian forces have re-secured control over most of Pokrovsk. \nFollowing the Russian failure to break through at Zolotyi Kolodyaz, Ukrainian forces managed to clear the remaining part of the city of Russian DRGs. They moved into positions in the Shakhtarskyi District, as well as in the city centre, and the forest south of the E50 highway.\nIn the west of the city, Russian assault groups were pushed out of the low-rise residential areas, with Ukrainian forces re-entering the village of Leontovychi. Russian forces maintain control over around half of the southern Kalynivka District.\n+ ~3.93km² in favour of Ukraine.",
      "timestamp": "2025-08-20T07:15:18.030535Z"
    },
    {
      "original": "In the Novopavlivka direction, over the past month and a half, Ukrainian forces have slowly begun pushing back against Russian forces north and northwest of Horikhove. \nAfter regrouping, Ukrainian forces began advancing east down the treelines towards the Donetsk-Dnipropetrovsk regional border, reaching it and recapturing the trenches along it. They then went further, re-entering Donetsk Oblast, and capturing positions nearly 2.3km beyond the border, while improving their positions in the treelines west of the reservoir.\nAdditionally, Ukrainian forces recaptured positions in the forested areas on the border, pushing the Russians back into Horikhove. \n+ ~10.80km² in favour of Ukraine.",
      "timestamp": "2025-08-20T07:15:18.030540Z"
    },
    {
      "original": "The \"Triton\" Oil Depot in Izmail, Odesa Oblast after at least 28 Russian Geran-2 drones impacted it.",
      "timestamp": "2025-08-20T07:15:18.030545Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:\nThe IDF is continuing its large operation aimed at securing the Zeitoun Neighbourhood of Gaza City, and has made progress into the more \"dangerous\" parts of the neighbourhood.\nAfter securing the school and destroyed buildings in the southwestern part, under heavy air and artillery cover, Israeli armoured units pushed into the less destroyed and more dense urban areas. They quickly reached Al Shawa Al Khasa Street, clearing the blocks in front of it. They then advanced further northwest, clearing a commercial area and at least five more blocks. \nAdditionally, the IDF cleared new residential areas west of the Salah Al-Deen Highway, and also began operating west of the highway near the old city, although no consolidation has occurred there yet.\nPalestinian factions responded with their usual sporadic mortar shelling of Israeli positions, IED detonations against military vehicles, as well as shooting down reconnaissance drones. Rocket launches also continued against Israeli border settlements. \n+ ~0.58km² in favour of the IDF.",
      "timestamp": "2025-08-20T07:15:18.030552Z"
    },
    {
      "original": "UPDATED: \nTensions Simmer on Bryansk Border: Another Ukrainian Sabotage Group Neutralized\nUkrainian sabotage group was discovered and eliminated in the Bryansk region, 40 kilometers from the state border. Three were killed, three surrendered, including the commander. They planned to blow up a major railway junction and take a series of photos for new media victories. The group of Special Operation Forces were detected in the Komarichi district of the Bryansk region....\nRead more: \nHERE",
      "timestamp": "2025-08-20T07:15:18.630267Z"
    },
    {
      "original": "UPDATED: \nTensions Simmer on Bryansk Border: Another Ukrainian Sabotage Group Neutralized\nUkrainian sabotage group was discovered and eliminated in the Bryansk region, 40 kilometers from the state border. Three were killed, three surrendered, including the commander. They planned to blow up a major railway junction and take a series of photos for new media victories. The group of Special Operation Forces were detected in the Komarichi district of the Bryansk region....\nRead more: \nHERE",
      "timestamp": "2025-08-20T07:15:18.630283Z"
    },
    {
      "original": "U.S. Officials Admit Failure In Stopping Arms Shipments To Yemen’s Houthis\nThe Houthis (Ansar Allah) are still arming themselves with help from Iran and efforts by the United States and its allies to cut the group’s supply lines have been ineffective, Al-Arabiya reported on August 19, citing U.S. officials.\nRecent weeks saw forces loyal to the internationally-recognized Yemeni government, which is allied to the U.S., seizing two weapons shipments en-route to the Houthis, one from Iran loaded with advanced anti-aircraft and anti-ship missiles, and another from China containing advanced drones...\nRead more: \nHERE",
      "timestamp": "2025-08-20T07:15:18.630291Z"
    },
    {
      "original": "1,000 To 19 Somber Exchange: Unspoken Language of War’s Toll\nIn the grim arithmetic of modern conflict, few events speak more plainly than the exchange of the fallen. On August 19th, Russia and Ukraine conducted another such transfer of bodies, a stark procedure that lays bare the brutal realities of the war’s human cost. The terms of the exchange were profoundly asymmetrical: Ukraine received the bodies of one thousand of its soldiers, while Russia recovered nineteen...\nRead more: \nHERE",
      "timestamp": "2025-08-20T07:15:18.630298Z"
    },
    {
      "original": "Military Situation in Palestine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T07:15:18.630302Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T07:15:18.630309Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T07:15:18.630315Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T07:15:18.630319Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T07:15:18.630324Z"
    },
    {
      "original": "ISKANDER OVER UKRAINE PUSHES ZELENSKY TO PEACE IN WASHINGTON",
      "timestamp": "2025-08-20T07:15:18.630327Z"
    },
    {
      "original": "Zelensky's Strategy. Kiev Is Betting On Dragging Out Negotiations\nVladimir Zelensky's visit to the White House showed that he had learned from his previous unsuccessful visit to Washington. The Ukrainian leader chose to avoid direct confrontation with Donald Trump in front of the cameras. The European leaders who arrived in the US capital to support Zelensky also avoided a confrontational tone. \nTheir statements to the press seemed rather vague and meaningless. Based on these statements, one might conclude that all parties want a peaceful settlement and that there has been \"incredible progress\" in the negotiations. Yet we still do not see any concrete achievements. It's clear that the Ukrainian president won't make any concessions to the Kremlin. This means that the war will continue — through Kiev's fault.\nThere is no doubt that Donald Trump intends to end the war in Ukraine. Vladimir Zelensky is equally certain in his desire to continue the fighting...\nRead more \nHERE",
      "timestamp": "2025-08-20T07:15:18.630338Z"
    }
  ],
  "script_run_time": "2025-08-20T07:15:18.631161Z"
}