{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-16T14:49:15.779914Z"
    },
    {
      "original": "🛸\nНа північ від Сум - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження.",
      "timestamp": "2025-10-16T14:49:15.779928Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-16T14:49:15.779935Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-10-16T14:49:15.779939Z"
    },
    {
      "original": "❗️\n Інформуємо стосовно повітряної цілі на Миколаївщині\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nБлизько 12.00 16 жовтня було зафіксовано пуск із літака Су-34 з акваторії Чорного моря.\nЗасіб повітряного нападу було спрямовано у бік міста Миколаїв.\nМісце падіння встановлено, попередньо без постраждалих. На місці працюють відповідні служби, які встановлюють тип авіаційного засобу ураження.\nДотримуйтесь заходів безпеки під час сигналів повітряної тривоги.",
      "timestamp": "2025-10-16T14:49:15.779953Z"
    },
    {
      "original": "💥\n📹\nНа відео бойова робота у зоні відповідальності \nПовітряне командування \"Схід\"\n.\n🇺🇦\n Продовжуємо нашу боротьбу!",
      "timestamp": "2025-10-16T14:49:15.779961Z"
    },
    {
      "original": "Ворожий БпЛА з півночі курсом на Харків.",
      "timestamp": "2025-10-16T14:49:15.779964Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на сході Дніпропетровщини курсом на захід.",
      "timestamp": "2025-10-16T14:49:15.779972Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Херсонщині! Залучено засоби для його збиття.",
      "timestamp": "2025-10-16T14:49:15.779979Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА з Харківщини на Полтавщину.",
      "timestamp": "2025-10-16T14:49:15.779984Z"
    },
    {
      "original": "Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-16T14:49:15.779987Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину зі сходу.",
      "timestamp": "2025-10-16T14:49:15.779992Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-16T14:49:15.779996Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА з Харківщини на Дніпропетровщину (Самарівський район).",
      "timestamp": "2025-10-16T14:49:15.780001Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Берестинський район), курс західний.",
      "timestamp": "2025-10-16T14:49:15.780006Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-16T14:49:15.780010Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північ Харківщини.",
      "timestamp": "2025-10-16T14:49:15.780014Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південний.",
      "timestamp": "2025-10-16T14:49:15.780018Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-16T14:49:15.780063Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на схід від Сум! Залучено засоби для його збиття.",
      "timestamp": "2025-10-16T14:49:15.780068Z"
    },
    {
      "original": "How time flies...",
      "timestamp": "2025-10-16T14:49:16.400902Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards the Siverskyi Donets River from the northeast and have made significant progress in five different areas.\nIn the east, Russian forces continued to clear positions west of Stavky, and have advanced from the newly captured strongpoints in the forested gulley, down two parallel treelines on the tactical heights towards the Drobysheve - Zarichne Road. \nTo the west, the Russians began their attacks into Drobysheve. They made further progress in the forest northwest of the town, before Russian soldiers on motorbikes advanced down the road from Shandryholove, and entered the town. Positions were captured in the outermost buildings, and fighting is ongoing in the grey-zone further south. Additionally, Russian forces continued attacking from the Derylove area, where they were able to capture positions in three separate treelines on the tactical heights overlooking Drobysheve. Fighting is now underway for the agricultural buildings on the outskirts of the town. \nFurther west, Russian forces were able to cross the Nitrius River from the Drobysheve Fish Farm into Novoselivka. They established a foothold in the houses on Tsentralna Street and Ukrayinska Street, before pushing northwest towards the western part of the village. Other forces advanced north towards the centre of the village where they are attempting to squeeze the Ukrainians out from multiple directions. Heavy fighting continues here.\nTo the north, Russian forces managed to break through Ukrainian positions in the forests northwest of Novoselivka under heavy FAB, artillery, and drone cover, establishing control over additional positions there. They then went on to advance south, cutting the  Novoselivka - Oleksandrivka road at the graveyard, while capturing further forested positions down the road to the northwest. Additionally, Russian FPV drone strikes on Ukrainian logistics and bridges has increased in intensity in this sector, complicating supply to critical parts of the frontline like Novoselivka.\nIn the north, Russian forces advance from their positions west of Shandryholove, into the forested gulley to the west, establishing full control over it. Additional positions were captured in the treeline to the northwest. \n+ ~5.46 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400918Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards Borivska Andriivka and have entered the village.\nAfter securing the trench fortification on the tactical heights northeast of the village, Russian forces continued to improve their positions in the area. They secured another trench fortification, this time in the low-lying ground directly east of Boriivska Andriivka. From there they attacked the village from the north and northeast, establishing control over the eastern and central parts of it.\n+ ~1.31 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400924Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued their assault operations east of the Oskil River and have made new progress along the tactical heights towards the village of Pishchane. \nFollowing the Ukrainian infiltration attempts into Stepova Novosilka and its surroundings last month, Russian forces began attempting to regain lost territory in this direction. Recently, they were able to recapture the trench strongpoints in the area of the destroyed railway overpass. From there the Russians advanced further west down the railway windbreaks, seizing further trench positions there and along the highway to the north.  \n+ ~2.78 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400929Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, with Ukrainian forces beginning attempts to cut off the Russians in Kupyansk City from the north.\nUkrainian forces advanced from their positions along the railway line, down a perpendicular treeline, and into two forested areas where they established control over new positions. Russian soldiers holding these areas hadn't properly consolidated, which made clearing them easier for the AFU. With this, Russian supply into Kupyansk is now constricted into a 2.4 km wide corridor.\nMeanwhile, in Kupyansk itself, the Russians continued to advance. Following the withdrawal of most Ukrainian units in the north and centre of the city, Russian forces began advancing east on a wide front, clearing new residential areas, and entering the small industrial zone next to the railway line. \nAdditionally, Russian forces advanced in the southwestern suburbs of the city. They cleared additional parts of the low-rise residential areas, and entered the Yuvileynyi Microdistrict from the north, capturing at least six 5-story buildings. Other forces began attacking the western buidings of the microdistrict, increasing the grey zone slightly. \n+ ~2.21 km² in favour of Ukraine. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400937Z"
    },
    {
      "original": "In the Vovchansk direction, over the past week, Russian forces continued to advance in and around Vovchansk City, and have made significant progress in its western suburbs.\nRussian forces were able to clear the rest of the Vovchansk Oil Extraction Plant and consolidated their positions in the residential areas along the railway line. Further west, they pushed deeper into the western suburbs of the city, advancing southwest as far as T. Bulby Street. \nAdditionally, Russian forces continued to expand their zone of control in the Synelnykove Forest, advancing for more than 500 metres south towards the village of Synelnykove.\n+ ~3.84 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400947Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are advancing, each taking new positions in and around the village of Oleksiivka.\nAfter a series of assault operations were carried out, Ukrainian forces were able to enter the southern houses of Oleksiivka, and consolidate in the treeline to the southwest. Due to the earlier threat from the Ukrainian positions in the agricultural buildings on the western outskirts of the village, the Russians withdrew from the south and part of the centre of the settlement, allowing for the Ukrainians to advance further north and consolidate in new positions. \nSince then, the Russians have continued their advance to the northwest, taking control over new positions in the gulley directly west of Oleksiivka. These advances forced the Ukrainians to withdraw from the agricultural buildings, back into the village of Andriivka. \n+ ~1.79 km² in favour of Ukraine.\n+ ~0.93 km² in favour of Russia.",
      "timestamp": "2025-10-16T14:49:16.400953Z"
    },
    {
      "original": "Earlier this evening, as many as 6 Russian Geran-2 drones struck the Nova Poshta (postal) building in the city of Nizhyn, Chernihiv Oblast. A fire is now burning at the impact site.",
      "timestamp": "2025-10-16T14:49:16.400957Z"
    },
    {
      "original": "Earlier this evening, as many as 6 Russian Geran-2 drones struck the Nova Poshta (postal) building in the city of Nizhyn, Chernihiv Oblast. A fire is now burning at the impact site.",
      "timestamp": "2025-10-16T14:49:16.400961Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-10-16T14:49:16.400964Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace yet",
      "timestamp": "2025-10-16T14:49:16.400967Z"
    },
    {
      "original": "No Iskander threat. It was mixed up with Russian S-300/400 air defence activity.",
      "timestamp": "2025-10-16T14:49:16.400970Z"
    },
    {
      "original": "German Defense Minister Boris Postorius has announced a new military aid package for Ukraine worth approximately 500 million euros, as a part of 2 additional billion euros previously allocated in June 2025.\nIt will include the following:\nRadar systems\nArtillery systems\nPrecision-guided artillery ammunition\n2 IRIS-T air defence systems with a large number of guided missiles\nOther air defence systems\nPatriot interceptors\nPortable anti-aircraft systems\nAnti-tank weapons\nModern communications equipment\nLight weapons\nGermany will also begin a project aimed at modernising already delivered weapons to extend their service life and adapt to changing war conditions. A memorandum of cooperation will also be signed between the defence industries of Germany and Ukraine.",
      "timestamp": "2025-10-16T14:49:16.400981Z"
    },
    {
      "original": "Regarding the large-scale, combined missile and drone attack on Ukraine last night.\nThe following targets were hit by Iskander-M ballistic missiles, Kinzhal hypersonic ballistic missiles, Iskander-K cruise missiles, Kh-59 cruise missiles, and Geran-2 drones:\nYulievsky oil and gas field, Kharkiv Oblast (49.988756, 35.710855).\nOpishnia gas processing plant, Poltava Oblast (49.93758, 34.59529).\nShebelinka Gas Condensate and Oil Processing Plant, Kharkiv Oblast (49.55414, 36.63091).\nChervonodonetsk booster compressor station, Kharkiv Oblast (49.47511, 36.59069).\nUnknown targets in Nizhyn (Chernihiv Oblast) and Chernihiv City.",
      "timestamp": "2025-10-16T14:49:16.400989Z"
    },
    {
      "original": "Regarding the large-scale, combined missile and drone attack on Ukraine last night.\nThe following targets were hit by Iskander-M ballistic missiles, Kinzhal hypersonic ballistic missiles, Iskander-K cruise missiles, Kh-59 cruise missiles, and Geran-2 drones:\nYulievsky oil and gas field, Kharkiv Oblast (49.988756, 35.710855).\nOpishnia gas processing plant, Poltava Oblast (49.93758, 34.59529).\nShebelinka Gas Condensate and Oil Processing Plant, Kharkiv Oblast (49.55414, 36.63091).\nChervonodonetsk booster compressor station, Kharkiv Oblast (49.47511, 36.59069).\nUnknown targets in Nizhyn (Chernihiv Oblast) and Chernihiv City.",
      "timestamp": "2025-10-16T14:49:16.400997Z"
    },
    {
      "original": "Ukraine's Operational Command “South” announced that 2 Russian Iskander-M ballistic missiles impacted a training ground being used by the Ukrainian Armed Forces, located in the \"rear and relatively calm part\" of Ukraine. \nThe strikes likely took place on Poltava Oblast. They did not comment on casualty figures, unlike previous statements on these attacks.",
      "timestamp": "2025-10-16T14:49:16.401001Z"
    },
    {
      "original": "For the first time ever today, a Russian Grom-E1 rocket-powered glide-bomb impacted Mykolaiv City, approximately 49 km from the nearest Russian-controlled territory. \nIt was launched from a Russian Su-34 over the Black Sea, south of Russian-controlled Kherson Oblast. There were no civilian casualties, as per the Ukrainian Airforce.",
      "timestamp": "2025-10-16T14:49:16.401005Z"
    },
    {
      "original": "Some are upset by yesterday's images in Moscow, but the reality is what it is. Russia intervened to help the former Syrian government fight terrorists and secure its position in the eastern Mediterranean. Between 2015 and 2020, the government regained more than half of the country, and it seemed that the Syrian state would prevail.\nHowever, Russia's entry into the Syrian civil war also involved a series of decisions and reforms that the previous political regime in Damascus was unwilling to allow, so relations between Russia and Syria were not always cordial, despite what was intended to be shown. These relations began to deteriorate in 2024, with the worsening standard of living, rampant corruption, and the stagnation of the political regime. The start of the “Special Military Operation” in Ukraine in 2022 deprived Syria of Russian support to maintain military operations in the country. With its hands tied by Ukraine and unable to focus on another front, it is clear that Moscow sought an agreed exit for Al-Assad with Turkey to allow Jolani to come to power, and with Iran, whose power in the region had been diminished after setbacks in Lebanon and the bloodshed in Syria. Iran maintained good relations with Syria until the costs outweighed the benefits, prompting a withdrawal of its support to neighboring Iraq.\nIsrael did not participate in that agreement (Astana), but it did contribute until December 2024 to the fall of the previous Syrian political regime by attacking the allies of the resistance axis and supporting terrorist groups. After that, it has a free hand to occupy the rest of Quneitra and de facto control the demilitarized south of Syria.\nFor those who claim that the SAA had no will to fight and that Russia was not obliged to defend them, it should be noted that before November, the situation was irreversible with or without Russian help. The SAA commanders were either bribed or aware of the betrayal, abandoned their posts, and went into exile (specifically Suhayl al-Hasan and Ghiath Dalla) while the soldiers fought on the front lines. On the terrorist side, the commanders knew the plans, while the rank-and-file militants believed in a limited offensive.\nIn those days, Russia saved its image by eliminating more than a thousand terrorists with the limited air power it had, knowing in advance that it would not change the agreed situation and the end of the previous government.\nFinally, playing devil's advocate, the fall of al-Assad allows Russia to more easily influence a weakened Syria that is more likely to reach agreements due to the new authorities' desperation to consolidate their power. However, pragmatism prevails over Moscow's preferences, which would prefer a secular government to an Islamist one in Syria. (Although more flexible than the previous one), so just as Al-Assad was betrayed, Jolani will also be betrayed when the agreements are not respected and Russia has freed itself from the war in Ukraine. But what is clear is that Russia will not abandon the eastern Mediterranean.",
      "timestamp": "2025-10-16T14:49:16.401012Z"
    },
    {
      "original": "Some are upset by yesterday's images in Moscow, but the reality is what it is. Russia intervened to help the former Syrian government fight terrorists and secure its position in the eastern Mediterranean. Between 2015 and 2020, the government regained more…",
      "timestamp": "2025-10-16T14:49:16.401016Z"
    },
    {
      "original": "This is all part of the west's greater geopolitical strategy. They don't want to fight Russia directly, so they engage them through a proxy (Ukraine). This frees up other areas which they can focus on, such as China. \nIts also part of the reason why Israel will always receive massive amounts of support - they operate in American interests (at least on the theatre-level) and will expand control over Syria and the West Bank. With Assad gone, Hezbollah's main supply routes from Iran are no longer usable to the same degree, and they can now successfully be starved with the help of the new Lebanese government. \nMinority groups in southern Syria, especially the Druze, will always choose Israel over Jolani, further increasing Israeli and American influence in the region, and preventing Iran from building any form of proxy here. \nIt's all part of a larger plan by the west to dismantle opposing states that endanger their dying hegemony indirectly and silently, engaging with those who will do their bidding, but only as long as its worth it for them. Ukraine is a perfect example of this. \nGone are the times of publicly invading and overthrowing regimes, and promoting hegemony and modern imperialism. That isn't worth it, instead its easier and more convenient to go about things more quietly. The U.S. political system allows this as both parties have the same foreign policy goals in mind. They are able to keep America strong and stable on the inside, allowing for them to continue what they do best on the outside. \nGlobalisation is one of the reasons why it has to be done this way. One of America's biggest weaknesses is having to deal with everyone all at once. Their decline has meant they can only focus in on specific goals directly, which is why they need proxies. And that's without considering what could happen if people in the U.S. actually woke up and used their brains for once to look at the bigger picture - not just which party tells them they are right.\nOf course, this isn't considering what Russia and China want. They too have the same selfish goals in mind, as with any great power throughout history. But the difference is that multipolarity currently favours China and Russia, while America requires unipolarity at this point.",
      "timestamp": "2025-10-16T14:49:16.401025Z"
    },
    {
      "original": "U.S. B-52 Bombers Flew Near Venezuela Following Fifth Strike On ‘Drug Boat’ (Video)\nUnited States bombers flew close to Venezuela on October 15, just a day after United States President Donald Trump announced another strike on a boat alleged to be trafficking drugs off the coast of the country.\nTrump said that the boat was “affiliated with a Designated Terrorist Organization,” without providing any evidence backing his claims.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059286Z"
    },
    {
      "original": "U.S. B-52 Bombers Flew Near Venezuela Following Fifth Strike On ‘Drug Boat’ (Video)\nUnited States bombers flew close to Venezuela on October 15, just a day after United States President Donald Trump announced another strike on a boat alleged to be trafficking drugs off the coast of the country.\nTrump said that the boat was “affiliated with a Designated Terrorist Organization,” without providing any evidence backing his claims.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059302Z"
    },
    {
      "original": "With Thousands Of Troops Dead, Ukraine Is Losing Battles In Pokrovsk And Dnepropetrovsk (Videos)\nDespite sacrificing thousands of troops to defend Pokrovsk in the Donetsk direction, Kiev forces continue to lose one position after another in the key city and nearby. A similar slow collapse is also taking place in the direction of Dnepropetrovsk.\nOn October 15, the Russian Ministry of Defense announced that the Tsentr [Center] Group of Forces had taken over Novopavlovka, located right to the south of Porkovsk.\nKiev forces took another blow in Dnepropetrovsk, with the Russian MoD announcing the capture of Alekseyevka by the Vostok [East] Group of Forces.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059311Z"
    },
    {
      "original": "With Thousands Of Troops Dead, Ukraine Is Losing Battles In Pokrovsk And Dnepropetrovsk (Videos)\nDespite sacrificing thousands of troops to defend Pokrovsk in the Donetsk direction, Kiev forces continue to lose one position after another in the key city and nearby. A similar slow collapse is also taking place in the direction of Dnepropetrovsk.\nOn October 15, the Russian Ministry of Defense announced that the Tsentr [Center] Group of Forces had taken over Novopavlovka, located right to the south of Porkovsk.\nKiev forces took another blow in Dnepropetrovsk, with the Russian MoD announcing the capture of Alekseyevka by the Vostok [East] Group of Forces.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059319Z"
    },
    {
      "original": "WINTER IS COMING: KYIV BLACKOUTS LOOM AS RUSSIA TIGHTENS THE GRIP ON THE FRONTLINES",
      "timestamp": "2025-10-16T14:49:17.059323Z"
    },
    {
      "original": "The Break Is Over: Russian Troops Back On The Offensive In Kramatorsk\nRussian forces have taken control of the Novopavlovka settlement on the Pokrovsk axis. The 36th Separate Guards Motorised Rifle Brigade has captured Alekseevka. Russian units have resumed offensive operations in the Kramatorsk area.\nSlovak Prime Minister Robert Fico has demanded that the European Union shift its focus from Ukraine to the EU's internal economic problems.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059331Z"
    },
    {
      "original": "The Break Is Over: Russian Troops Back On The Offensive In Kramatorsk\nRussian forces have taken control of the Novopavlovka settlement on the Pokrovsk axis. The 36th Separate Guards Motorised Rifle Brigade has captured Alekseevka. Russian units have resumed offensive operations in the Kramatorsk area.\nSlovak Prime Minister Robert Fico has demanded that the European Union shift its focus from Ukraine to the EU's internal economic problems.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059338Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From October 15, 2025\nOn October 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-16T14:49:17.059344Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From October 15, 2025\nOn October 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-16T14:49:17.059351Z"
    },
    {
      "original": "Deals On Bases, Arms & Infrastructure Reported After Syria’s Sharaa First Visit To Russia\nMoscow has always been guided by the Syrian people’s interests in its relations with Damascus, Russian President Vladimir Putin said while meeting with Syria's Interim President Ahmed al-Sharaa for the first time on October 15.\nThe meeting came close to a year after rebels led by Sharaa overthrew former Syrian President Bashar al-Assad. It came amid reports suggesting that the two sides may be close to a deal on the fate of Russian bases in Syria and other important matters.\nRead more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059358Z"
    },
    {
      "original": "Is NATO Really '25 Times Bigger And Infinitely Superior To The Russian Military'?\nOn October 13, NATO Secretary General Mark Rutte visited Ljubljana, Slovenia, for the 71st Annual Session of the NATO Parliamentary Assembly. Among many of his statements was one that has long been part of the political West's propaganda discourse. Namely, he talked about the Russian economy and its military, claiming that NATO member states are supposedly \"25 times bigger than the Russian economy\" and \"infinitely superior\" in terms of military power. \nInterestingly, he used the example of Russian MiG-31 interceptors as the alleged \"proof\" of the mythical Western \"superiority\", insisting that these jets \"cannot even stand in our shadow\", supposedly due to \"their not well-trained fighter pilots\".\n\"We are 25 times bigger than the Russian economy. Our military is infinitely superior to the military, to the Russian military, when it comes to our air force... \"\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059368Z"
    },
    {
      "original": "Dead Body Captured In Gaza Raises Suspicion Of Shadowy Israeli Mercenary Force\nOne of the dead bodies handed over by Hamas to Israel under the Gaza deal recently brokered by the United States turned out to be that of a Palestinian who the group insists was killed while taking part in an Israeli Defense Forces (IDF) operation in the Strip last year. The whole affair brought back to light accusations of Israel recruiting foreign mercenaries, especially after it admitted deploying such “agents” during the 12-day war with Iran.\nThe body suspected of belonging to a Palestinian was among four handed over by Hamas to Israel in Gaza City on October 13.\nAfter examinations at Abu Kabir Forensic Institute, the IDF confirmed two days later that only three of the bodies belonged to Israeli hostages, Tamir Nimrodi, Uriel Baruch, and Eitan Levy.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059376Z"
    },
    {
      "original": "Dead Body Captured In Gaza Raises Suspicion Of Shadowy Israeli Mercenary Force\nOne of the dead bodies handed over by Hamas to Israel under the Gaza deal recently brokered by the United States turned out to be that of a Palestinian who the group insists was killed while taking part in an Israeli Defense Forces (IDF) operation in the Strip last year. The whole affair brought back to light accusations of Israel recruiting foreign mercenaries, especially after it admitted deploying such “agents” during the 12-day war with Iran.\nThe body suspected of belonging to a Palestinian was among four handed over by Hamas to Israel in Gaza City on October 13.\nAfter examinations at Abu Kabir Forensic Institute, the IDF confirmed two days later that only three of the bodies belonged to Israeli hostages, Tamir Nimrodi, Uriel Baruch, and Eitan Levy.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059385Z"
    },
    {
      "original": "The Grey Cardinal of War: The Role of Foggy Albion in the Ukrainian Conflict\nIs the United Kingdom the main beneficiary of the war in Ukraine? Revelations from the head of Russia's Federal Security Service suggest as much. The situation is escalating, with new countries becoming involved in the current conflict.\nOn 16 October, the Council of Heads of Security Agencies and Special Services of CIS Countries (SORB) held a meeting in Samarkand, Uzbekistan. During the event, Alexander Bortnikov, the Director of Russia's Federal Security Service, made a number of statements.\nUnlike in Western political cultures, media coverage and publicity of heads of state security and intelligence services is extremely limited in former Soviet Union countries. Any public statement is strictly coordinated and is often used by the country's leadership to communicate important information on urgent issues to its international partners.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T14:49:17.059393Z"
    }
  ],
  "script_run_time": "2025-10-16T14:49:17.059932Z"
}