{
  "messages": [
    {
      "original": "🛵\n Ворожий БпЛА на сході Сумщини, курс південно-західний.",
      "timestamp": "2025-09-30T06:56:39.573390Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-09-30T06:56:39.573417Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-09-30T06:56:39.573424Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-09-30T06:56:39.573434Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Чернігівщині, курсом на Київщину.",
      "timestamp": "2025-09-30T06:56:39.573441Z"
    },
    {
      "original": "🛵\n Дніпропетровська область (Синельниківський р-н) - загроза застосування ворожих БпЛА!",
      "timestamp": "2025-09-30T06:56:39.573449Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у напрямку Дніпра з південного-сходу.",
      "timestamp": "2025-09-30T06:56:39.573457Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на південно-східному напрямку.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-09-30T06:56:39.573466Z"
    },
    {
      "original": "📢\n Відбій загрози застосування ворожих БпЛА по областях.",
      "timestamp": "2025-09-30T06:56:39.573472Z"
    },
    {
      "original": "🛵\n Дніпропетровська область (Синельниківський р-н) - загроза застосування ворожих БпЛА!",
      "timestamp": "2025-09-30T06:56:39.573478Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині рухаються у напрямку Павлограду.",
      "timestamp": "2025-09-30T06:56:39.573484Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Кам'янського з північного сходу.",
      "timestamp": "2025-09-30T06:56:39.573491Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА продовжує рух у напрямку Кременчука.",
      "timestamp": "2025-09-30T06:56:39.573497Z"
    },
    {
      "original": "🛵\n На сході Сумщини ворожі БпЛА.\n⚡\n Залучено засоби для їх збиття.",
      "timestamp": "2025-09-30T06:56:39.573506Z"
    },
    {
      "original": "🛵\n Загроза застосування ворожих БпЛА на Чернігівщині.",
      "timestamp": "2025-09-30T06:56:39.573511Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-09-30T06:56:39.573519Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА у центральній частині Чернігівщини, курс південно-західний (Київщина) та південний (Полтавщина).",
      "timestamp": "2025-09-30T06:56:39.573525Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 46 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 30 вересня (із 21.00 29 вересня) противник атакував 65-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Курськ, Міллєрово, Приморсько-Ахтарськ – рф., Чауда - ТОТ Криму, понад 40 із них – шахеди.\nПовітряний напад відбивали авіація, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 46 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 19 ударних БпЛА на 6 локаціях, падіння збитих (уламки) на 2 локаціях.\nАтака триває – на півночі та сході зайшли нові групи ударних БпЛА. Дотримуйтесь заходів безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-30T06:56:39.573548Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Черкас з півдня!",
      "timestamp": "2025-09-30T06:56:39.573553Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини на південно-західний напрямок та частина безпілотників на схід.",
      "timestamp": "2025-09-30T06:56:39.573557Z"
    },
    {
      "original": "Deepstate confirms Russian control over parts of Pokrovsk for the first time ever.   As of now, my map shows that around 11.3% of Pokrovsk is under Russian control, however their presence goes further than that.",
      "timestamp": "2025-09-30T06:56:40.122356Z"
    },
    {
      "original": "I present to you: Deepstate's spiky front. \nA true work of art.",
      "timestamp": "2025-09-30T06:56:40.122370Z"
    },
    {
      "original": "Russian forces have captured the village of Serebryanka, northern flank of Siversk, Donetsk Oblast.\nPre-war population: ~1,110.\nTotal land area: ~3.57 km²",
      "timestamp": "2025-09-30T06:56:40.122376Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-30T06:56:40.122380Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-30T06:56:40.122384Z"
    },
    {
      "original": "Preparations for the next large-scale, combined Russian missile attack on Ukraine have begun.\n 3 Tu-160M strategic bombers have redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast. They are now being equipped with Kh-101 cruise missiles. \n2 Tu-22M3 strategic bombers redeployed from Diaghilev Airbase, Ryazan Oblast, to Olenya Airbase, Murmansk Oblast. These were already equipped with Kh-22 cruise missiles at Engels-2.\n1 Tu-95MS strategic bomber redeployed from Olenya Airbase to Engels-2 Airbase to be equipped with Kh-101 cruise missiles.\n1 Tu-95MS strategic bomber redeployed from Diaghilev Airbase to Engels-2 Airbase. It will likely be equipped with missiles, although there is a possibility that it will only take part in training missions. \n1 IL-76MD military transport aircraft landed at Baltimore Airbase, Voronezh Oblast. The cargo likely consists of Iskander-M ballistic missiles for OTRK installations near Liski, Voronezh Oblast. \n1 IL-78 tanker aircraft landed at Olenya Airbase. It will likely assist with redeployments/combat sorties of Tu-95MS. \nAccumulation of Geran-2/3 and Gerbera drones has begun at all of the major launch sites. These drones will take part in the next major missile attack.",
      "timestamp": "2025-09-30T06:56:40.122393Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-30T06:56:40.122396Z"
    },
    {
      "original": "Preparations for the next large-scale, combined Russian missile attack on Ukraine have begun.   3 Tu-160M strategic bombers have redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast. They are now being equipped with Kh-101 cruise…",
      "timestamp": "2025-09-30T06:56:40.122400Z"
    },
    {
      "original": "Additionally, 2 Tu-95MS bombers from Olenya and 2 Tu-95MS bombers from Engels-2 redeployed to Ukrainka Airbase, Amur Oblast. The 2 bombers from Engels-2 were already equipped with missiles prior to taking off.",
      "timestamp": "2025-09-30T06:56:40.122403Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-30T06:56:40.122407Z"
    },
    {
      "original": "Correction: Based on the nose, I'm pretty sure this is an Mi-8.",
      "timestamp": "2025-09-30T06:56:40.122410Z"
    },
    {
      "original": "Ukrainian Commander-in-chief Oleksandr Syrskyi has made a claim stating that Ukraine has recaptured around 175 km² and cleared an additional 195 km² from Russian DRGs in the \"Dobropillya Counteroffensive\".  \nI can personally confirm that approximately 110 km² were recaptured by Ukrainian forces, not including areas cleared by DRGs or areas since recaptured by Russian forces.",
      "timestamp": "2025-09-30T06:56:40.122414Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-30T06:56:40.122417Z"
    },
    {
      "original": "POV of the Ukrainian FPV drone strike on a Russian Mi-8 helicopter.",
      "timestamp": "2025-09-30T06:56:40.122421Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it. \nThe plan includes the following main points:\n1: Gaza will be a \"terror-free\" zone, meaning that militants from Hamas, and organisations fighting alongside Hamas such as the PIJ, PFLP, DFLP, Al-Aqsa Martyrs Brigades, etc, would have to leave the strip.\n2. Gaza will be \"redeveloped for the benefit of the people of Gaza\". \n3. The war will immediately end in all sectors, including artillery and air bombardment. IDF forces will withdraw to the yellow line shown on the map. (Please note that the current control line shown on Trump's map is completely wrong). A staged withdrawal will begin once conditions are met. \n4. 72 hours later, all hostages, alive and deceased, will be handed over to Israel.\n5. After the hostages are released, Israel will release 250 life sentence prisoners, as well as 1700 Gazans who were detained after October 7th, 2023, including all women and children. Additionally, for every Israeli hostage whose body is released, Israel will release the bodies of 15 deceases Gazans. \n6. After the hostage exchanges, all Hamas members who commit to \"peaceful co-existence\" and to decommission their weapons will be allowed safe passage out of the Gaza Strip to receiving countries. It is unknown if this will include members from other, Hamas-aligned organisations in Gaza. \n7. Full aid will then be sent to the Gaza Strip without interference, through the UN and its agencies, the red crescent, and other international institutions not associated with either party. The Rafah Border Crossing will also be opened, which the map below shows would be under IDF occupation.\n8. Gaza will be governed under a temporary, transitional government. It will be made up of \"qualified Palestinians\" and international experts and supervised by a new international transitional body headed by Trump. \n9. The Palestinian Authority will undergo a reform program. Once it has completed this, it will regain control over the Gaza Strip.\n10. No one will be forced to leave Gaza, but those who wish to can move to and from the strip.\n11. All military-related infrastructure in the Gaza Strip will be demolished and not rebuilt. \n12. The UN will work with Arab and international partners to develop a temporary International Stabilisation Force to immediately deploy to Gaza. It will train and provide support to Palestinian police forces in Gaza, as well as help secure Gaza's borders. \n13. The IDF will remain in the small perimeter zone shown on the map until Gaza is properly secured from any resurgence. \n14. An \"interfaith dialogue\" process will be established to change the mindsets of Palestinians and Israelis towards peace and co-existence. \n15. While Gaza is redeveloping and the PA is carrying out its reform program, there is a possibility for the recognition of a Palestinian state.",
      "timestamp": "2025-09-30T06:56:40.122436Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment.   The…",
      "timestamp": "2025-09-30T06:56:40.122440Z"
    },
    {
      "original": "The Ukrainian Navy reports that four Neptune cruise missiles were used to strike Karachev, Bryansk Oblast, rather than ATACMs.",
      "timestamp": "2025-09-30T06:56:40.122443Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it.   The plan includes the following main points:  1: Gaza will be a \"terror-free\" zone, meaning that militants from…",
      "timestamp": "2025-09-30T06:56:40.122446Z"
    },
    {
      "original": "Hamas and PIJ have denounced the U.S. peace plan as an \"American-Israeli agreement\" and a \"recipe for the continuation of aggression against the Palestinian people\". \nHamas stated that the plan is vague and not guaranteed, and that they will not accept any proposal that does not include self-determination for the Palestinian people.",
      "timestamp": "2025-09-30T06:56:40.122453Z"
    },
    {
      "original": "Russian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.47 km².",
      "timestamp": "2025-09-30T06:56:40.122458Z"
    },
    {
      "original": "⚡️\n🇺🇸\n🇵🇸\n🇮🇱\n \nNYT:\n A New York Times/Siena poll shows American sympathies have shifted, with 35% siding with Palestinians and 34% with Israel. \nSix in ten voters say Israel should end its campaign even if hostages remain in captivity or Hamas survives, while a majority now oppose sending further US military or economic aid.\nPro-Palestinian sentiment among Democrats has surged with 54% now supporting Israel while Republicans remain largely supportive of Israel at 64%.\n@wfwitness",
      "timestamp": "2025-09-30T06:56:40.122469Z"
    },
    {
      "original": "⚡️\n🇺🇸\n🇵🇸\n🇮🇱\n NYT: A New York Times/Siena poll shows American sympathies have shifted, with 35% siding with Palestinians and 34% with Israel.   Six in ten voters say Israel should end its campaign even if hostages remain in captivity or Hamas survives, while a…",
      "timestamp": "2025-09-30T06:56:40.122475Z"
    },
    {
      "original": "It will be interesting to see how much this affects the 2028 elections. Democrats may have to take a less pro-Israel stance if trump doesn’t do anything drastic push moderates away from him.",
      "timestamp": "2025-09-30T06:56:40.122479Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-09-30T06:56:40.122482Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-09-30T06:56:40.122487Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.\nUkrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high ground overlooking the village. They also began attacks over the Nitrius River to the rear of Hlushchenkove, supported by attacks from Novyi Myr towards the treelines along the Donetsk - Kharkiv regional border. \nUkrainian forces also resumed assault operations along the Donetsk - Luhansk Regional border towards the forest plantations southwest of Hrekivka, and have entered the forest west of Hrekivka. To the southwest, the Ukrainians continued to attack east through Ridkodub towards the agricultural buildings and the eastern houses, and across the Nitrius River into northeastern Karpivka, but for now Russia is holding their ground. \nMeanwhile, Russian forces continued to slowly advance around Novomykhailivka. They were able to recapture most of the rest of the village and entered the forest to the west from the south, which the Ukrainians are simultaneously attempting to infiltrate from the north. They also cleared the rest of the forests on approach to the gulley north of Novomykhailivka.\nAdditionally, Russian forces are carrying out attacks from Hrekivka towards the Luhansk - Kharkiv regional border, and from the treelines southwest of Hrekivka towards the next large forest. In the southwest, they are attempting to advance into the rear of Ridkodub from which the Ukrainians are attacking, as well as across one of the dams over the Nitrius River at the northern edge of Karpivka. \n+ ~5.85 km² in favour of Ukraine. \n+ ~2.69 km² in favour of Russia.",
      "timestamp": "2025-09-30T06:56:40.122496Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.  Ukrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high…",
      "timestamp": "2025-09-30T06:56:40.122499Z"
    }
  ],
  "script_run_time": "2025-09-30T06:56:40.505559Z"
}