{
  "messages": [
    {
      "original": "❗️\n ЗБИТО ВОРОЖИЙ СУ-34!\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nБлизько 04.00 25 вересня 2025 року на Запорізькому напрямку збито російський літак Су-34, який здійснював терористичні атаки по місту Запоріжжя, із застосуванням керованих авіабомб.\n🇺🇦\n Разом до перемоги!",
      "timestamp": "2025-09-25T10:20:28.195708Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 150 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 25 вересня (із 18.00 24 вересня) противник атакував 176-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллєрово, Приморсько-Ахтарськ – рф., Чауда - ТОТ Криму, близько 100 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.30, протиповітряною обороною збито/подавлено 150 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 13 ударних БпЛА на 8 локаціях, а також падіння збитих (уламки) на 1 локації.\nАтака триває! Крім того, з півночі зайшли нові групи ударних БпЛА. Дотримуйтесь заходів безпеки! \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-25T10:20:28.195740Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на східному та південно-східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-25T10:20:28.195749Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-25T10:20:28.195754Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-09-25T10:20:28.195758Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Чернігівщини! Залучено засоби для його збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-09-25T10:20:28.195762Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-25T10:20:28.195770Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину та Донеччину.",
      "timestamp": "2025-09-25T10:20:28.195777Z"
    },
    {
      "original": "🛵\n \n🛸\n На Суми ворожі БпЛА, під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-09-25T10:20:28.195784Z"
    },
    {
      "original": "🛸\n Розвідувальний безпілотник в Чернігівському районі, який може бути навідником ворожих засобів ураження! Не нехтуйте сигнал повітряної тривоги!",
      "timestamp": "2025-09-25T10:20:28.195789Z"
    },
    {
      "original": "🛵\n \n🛸\n Поблизу Чернігова БпЛА!",
      "timestamp": "2025-09-25T10:20:28.195795Z"
    },
    {
      "original": "🛵\n На північно-західному напрямку Сумщини БпЛА, курсом на Чернігівщину!",
      "timestamp": "2025-09-25T10:20:28.195799Z"
    },
    {
      "original": "🛵\n \n🛸\n На півночі від Харкова БпЛА, вектор руху на схід!",
      "timestamp": "2025-09-25T10:20:28.195805Z"
    },
    {
      "original": "🛵\n В Новгород-Сіверському районі на Чернігівщині ворожі БпЛА, південно-західним напрямком!",
      "timestamp": "2025-09-25T10:20:28.195809Z"
    },
    {
      "original": "🚀\nПуски КАБ на межі Донеччини та Запоріжжя, в напрямку півдня Дніпропетровщини.",
      "timestamp": "2025-09-25T10:20:28.195815Z"
    },
    {
      "original": "🛵\n \n🛸\n Поблизу Сум та Чернігова БпЛА!",
      "timestamp": "2025-09-25T10:20:28.195821Z"
    },
    {
      "original": "https://youtu.be/C0IeHVxlP14",
      "timestamp": "2025-09-25T10:20:28.195825Z"
    },
    {
      "original": "🛵\n БпЛА на Суми.",
      "timestamp": "2025-09-25T10:20:28.195829Z"
    },
    {
      "original": "🛵\n У Ніжинський район на Чернігівщині БпЛА!",
      "timestamp": "2025-09-25T10:20:28.195833Z"
    },
    {
      "original": "⚠\n Увага!\nЧернігів - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-09-25T10:20:28.195838Z"
    },
    {
      "original": "Russian forces have captured the village of Kalynivske, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~259.\nTotal land area: ~0.94 km².",
      "timestamp": "2025-09-25T10:20:28.815216Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇸🇾\n Ukrainian President Zelenskyy and Syrian President Al-Sharaa met in New York today and signed and agreement to resume diplomatic relations between the two countries after they had ceased since 2022. \n@wfwitness",
      "timestamp": "2025-09-25T10:20:28.815233Z"
    },
    {
      "original": "These drone sightings in Denmark today are gonna be a giant nothingburger btw. Likely either civilians messing around or a false flag. If they were larger military-style drones we would know by now, which is what Russia would use if they wanted to send a message.",
      "timestamp": "2025-09-25T10:20:28.815237Z"
    },
    {
      "original": "These drone sightings in Denmark today are gonna be a giant nothingburger btw. Likely either civilians messing around or a false flag. If they were larger military-style drones we would know by now, which is what Russia would use if they wanted to send a message.",
      "timestamp": "2025-09-25T10:20:28.815241Z"
    },
    {
      "original": "Also, Russia doesn't need to spy on Danish airports with tiny drones. They have satellites.",
      "timestamp": "2025-09-25T10:20:28.815244Z"
    },
    {
      "original": "Ukraine’s Air Force says it shot down a Russian Su-34 this morning in the Zaporozhye region.",
      "timestamp": "2025-09-25T10:20:28.815247Z"
    },
    {
      "original": "Update from the Gaza Strip - Northern and Gaza Governorates:\nOver the past week, the IDF has continued to significantly expand their operations in the area of Gaza City and have almost cut off the rest of the northern Governorate from the rest of the strip. \nIn the Al-Nasser neighbourhood (advance 1), IDF armoured units continued pushing southwest down Al-Jala Street, branching off into the dense residential areas to the west. Individual, separated blocks have been cleared, which are being used to push deeper and encircle other blocks. East of Al-Jala Street, the IDF continued to clear the dense residential blocks towards Gaza City Centre and penetrate southwest through the Al-Daraj Neighbourhood. \nIn the area of Jabalia Al-Balad (advance 2), the IDF continued clearing the old city and surrounding neighbourhood. Armoured units also entered the Sheikh Radwan Neighbourhood of Gaza City via Al-Saftawy Street, establishing themselves in residential buildings on either side of the street, as well as in the blocks further north.\nIn the Nazla and Ebad Al-Rahman neighbourhoods of Jabalia City, Israeli forces advanced north to the intersection of Al-Saftawy and Al-Bahr streets, and pushed into the high-rise residential blocks to the east and west. \nIn the Al-Karamah Neighbourhood (advance 4) Israeli forces continued to rapidly push through the largely destroyed residential areas near the coast and reached Ebad Al-Rahman Neighbourhood from the northwest, which is the only non-cleared area connecting Gaza City with Northern Gaza. They also advanced into the Port Gaza neighbourhood from the north, capturing previously destroyed residential blocks. \n+ ~2.92 km² in favour of the IDF.",
      "timestamp": "2025-09-25T10:20:28.815255Z"
    },
    {
      "original": "🇷🇺\n⚡\n- Russia has finally admitted the fuel shortage crisis that has struck the country over the past few weeks.\nAccording to Russian outlet Kommersant, 50% of all gas stations in Crimea have closed, an incredible 360 (or 2.6%) across all of Russia have shut down, mostly impacting the south and south-west. The Russian Ministry of Energy is considering extending the ban on exporting gasoline until the end of the year.\nKremlin sources tell Kommersant that gasoline production has fallen by 10%, but without explaining why. Ukrainian media claims their attacks on refineries and energy facilities are responsible for the crisis.",
      "timestamp": "2025-09-25T10:20:28.815262Z"
    },
    {
      "original": "Footage showing 10 Russian Geran-2 and Geran-3 drone strikes on the Honcharivske Training Ground in Chernihiv Oblast. Prior to these strikes, 2 Iskander-M ballistic missiles impacted. \nThe Ukrainian Armed Forces admitted to an unspecified number of casualties from the attack. This training ground has been targeted by missiles multiple times this year.",
      "timestamp": "2025-09-25T10:20:28.815266Z"
    },
    {
      "original": "Smoke is rising over Dnipro",
      "timestamp": "2025-09-25T10:20:28.815270Z"
    },
    {
      "original": "Footage showing the consequences of yesterday's Russian Iskander-M ballistic missile strike on the outskirts of Dnipro. It targeted a small airstrip occupied by Yak-52 trainer aircraft. It is also used as a launch site for long-range strike UAVs. Ukraine uses Yak-52 aircraft to shoot down Russian drones. \nCoordinates: 48.54971, 35.01764",
      "timestamp": "2025-09-25T10:20:28.815274Z"
    },
    {
      "original": "Last night's Russian Geran-2 drone attack focused mainly on Ukraine's energy infrastructure. \nAs a result, the following targets were hit:\n154/35/27.5/10 kV substation in Kavuny, Mykolaiv Oblast (47.91593, 31.27147).\n330/110/35/10 kV substation in Nizhyn, Chernihiv Oblast (51.03075, 31.95625).\n110/35/10 kV substation in Berezivka, Mykolaiv Oblast (47.21555, 30.91465).\n110/27.5/10 kV railway substation in Zhmerynka, Vinnytsia Oblast.\nOther railway electrical infrastructure in Kirovohrad Oblast.",
      "timestamp": "2025-09-25T10:20:28.815282Z"
    },
    {
      "original": "Last night's Russian Geran-2 drone attack focused mainly on Ukraine's energy infrastructure. \nAs a result, the following targets were hit:\n154/35/27.5/10 kV substation in Kavuny, Mykolaiv Oblast (47.91593, 31.27147).\n330/110/35/10 kV substation in Nizhyn, Chernihiv Oblast (51.03075, 31.95625).\n110/35/10 kV substation in Berezivka, Mykolaiv Oblast (47.21555, 30.91465).\n110/27.5/10 kV railway substation in Zhmerynka, Vinnytsia Oblast.\nOther railway electrical infrastructure in Kirovohrad Oblast.",
      "timestamp": "2025-09-25T10:20:28.815289Z"
    },
    {
      "original": "The Ukrainian GUR published a new video showing four recent FPV drone strikes on valuable Russian targets in Crimea. \nThe following was hit:\n1 Surface situation radar station.\n1 Coastal MR-10M1 “Mys M1” radar.\n2 An-26 military transport aircraft.\nAs usual, the drones were either launched from USVs in the waters of the Black Sea, or from a larger mother drone acting as a relay point.",
      "timestamp": "2025-09-25T10:20:28.815296Z"
    },
    {
      "original": "The Ukrainian GUR published a new video showing four recent FPV drone strikes on valuable Russian targets in Crimea.   The following was hit:  1 Surface situation radar station. 1 Coastal MR-10M1 “Mys M1” radar. 2 An-26 military transport aircraft.  As usual…",
      "timestamp": "2025-09-25T10:20:28.815303Z"
    },
    {
      "original": "If there's two things Ukraine is better than Russia at, its deep FPV drone strikes and editing skills.",
      "timestamp": "2025-09-25T10:20:28.815306Z"
    },
    {
      "original": "Ukrainian UAVs attacked the EuroChem-Belorechensk mineral fertilizers plant near Belorechensk, Krasnodar Krai, last night. At least one impact was recorded. \nThis plant, which contains 10 workshops, produces phosphate, complex water-soluble mineral fertilizers, nitrogen compounds, sulfuric and phosphoric acids, and complex fertilizers. \nCoordinates: 44.75974, 39.76288",
      "timestamp": "2025-09-25T10:20:28.815324Z"
    },
    {
      "original": "Ukrainian UAVs attacked the EuroChem-Belorechensk mineral fertilizers plant near Belorechensk, Krasnodar Krai, last night. At least one impact was recorded. \nThis plant, which contains 10 workshops, produces phosphate, complex water-soluble mineral fertilizers, nitrogen compounds, sulfuric and phosphoric acids, and complex fertilizers. \nCoordinates: 44.75974, 39.76288",
      "timestamp": "2025-09-25T10:20:28.815330Z"
    },
    {
      "original": "The IDF carried out an operation today targeting two Palestinian militants in the West Bank town of Tamoun, as a part of their continued low-intensity and relatively quiet effort to dismantle the rest of the Tubas Battalion. \nAfter receiving intelligence about the whereabouts of a commander from the Tamoun Company (part of the Tubas Battalion), as well as another fighter, Israeli special forces were dispatched to Tamoun, where they encircled a residential building and engaged in armed clashes. Both fighters were killed in the exchanges of fire (as confirmed by the IDF and the Palestinian Islamic Jihad). There were no casualties among Israeli soldiers.\nAfter a brief pause in their operations in the Tubas Governorate of the West Bank, the IDF has recently resumed attempts to eliminate individual cells from the Tubas Battalion and disrupt their attempts to re-establish their full presence in the area following the Israeli and Palestinian Authority operations from late 2024.",
      "timestamp": "2025-09-25T10:20:28.815335Z"
    },
    {
      "original": "Ukraine’s Air Force says it shot down a Russian Su-34 this morning in the Zaporozhye region.",
      "timestamp": "2025-09-25T10:20:28.815338Z"
    },
    {
      "original": "According to a reliable Ukrainian source, the Su-34 that was reportedly shot down launched KAB glide-bombs from its launch lines southwest of Tokmak, Zaporizhzhia Oblast, in the direction of Zaporizhzhia City at around 4:11 am. They state that crew survived and was evacuated by an Mi-8 helicopter.\nThis suggests that the distant explosion heard from Zaporizhzhia city at around 4:05 am was unrelated to this aircraft. While there was an air raid alert in place for all of Ukrainian-controlled Zaporizhzhia Oblast at the time, no tactical aircraft activity or launch maneuvers were reported.\nKeep in mind, launch maneuvers can be missed, and a declared target can be misidentified if the glide-bombs are targeting something \"in front\" of it (e.g. hitting Lyman instead of Slovyansk). If the Su-34 was shot down, the Ukrainian Airforce could be stating that it was targeting Zaporizhzhia City for informational effect due to the intensity of attacks on the city over the past 5 days.",
      "timestamp": "2025-09-25T10:20:28.815343Z"
    },
    {
      "original": "Update: Russian VKS affiliated source Fighterbomber has confirmed the loss of a Su-34.",
      "timestamp": "2025-09-25T10:20:28.815346Z"
    }
  ],
  "script_run_time": "2025-09-25T10:20:29.334937Z"
}