{
  "messages": [
    {
      "original": "🛵\n БпЛА на півночі Харківщини, курсом на південь.",
      "timestamp": "2025-11-24T20:42:32.055340Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nОдеса - в районі міста ворожі БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-24T20:42:32.055362Z"
    },
    {
      "original": "🛵\n БпЛА в південній частині Черкащини, курс південно-західний.",
      "timestamp": "2025-11-24T20:42:32.055367Z"
    },
    {
      "original": "🛵\n БпЛА в центральній частині Харківщини, курсом на південь.",
      "timestamp": "2025-11-24T20:42:32.055371Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини, курсом на захід.",
      "timestamp": "2025-11-24T20:42:32.055375Z"
    },
    {
      "original": "🛵\nОдеса - в районі міста ворожий БпЛА.",
      "timestamp": "2025-11-24T20:42:32.055380Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на півночі Харківщини, курсом на південь.",
      "timestamp": "2025-11-24T20:42:32.055384Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-24T20:42:32.055392Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-24T20:42:32.055399Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-24T20:42:32.055404Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на сході Харківщини, курсом на захід.",
      "timestamp": "2025-11-24T20:42:32.055409Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з Криму.",
      "timestamp": "2025-11-24T20:42:32.055414Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-24T20:42:32.055418Z"
    },
    {
      "original": "🛵\n Групи БпЛА на Харківщині, курсом на південний-захід.",
      "timestamp": "2025-11-24T20:42:32.055422Z"
    },
    {
      "original": "🛵\n Група БпЛА на північному сході Дніпропетровщини, курсом на південний-захід.",
      "timestamp": "2025-11-24T20:42:32.055426Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-24T20:42:32.055430Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nСуми - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-24T20:42:32.055436Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Херсонщину.",
      "timestamp": "2025-11-24T20:42:32.055443Z"
    },
    {
      "original": "🚨\nОновлення щодо БпЛА:\n🛵\n БпЛА у центрі та на півдні Сумщини \n➡️\n курсом на захід.\n🛵\n Кілька груп БпЛА на півдні Харківщини \n➡️\n курсом на захід.\n🛵\n Кілька груп  на  сході Херсонщини \n➡️\n курсом на Дніпропетровщину.\n🛵\n БпЛА в центральній частині Полтавщини \n➡️\n курсом на Полтаву.",
      "timestamp": "2025-11-24T20:42:32.055457Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nПолтава - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-24T20:42:32.055462Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches",
      "timestamp": "2025-11-24T20:42:32.733477Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T20:42:32.733488Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T20:42:32.733496Z"
    },
    {
      "original": "Its flying in the general direction of the launch lines. Flight characteristics suggest training.",
      "timestamp": "2025-11-24T20:42:32.733500Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T20:42:32.733503Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T20:42:32.733506Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T20:42:32.733509Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T20:42:32.733513Z"
    },
    {
      "original": "The 3 MiG-31K fighters landed back at Savasleika Airbase after carrying out simulated launched of Kinzhals in Lipetsk Oblast.",
      "timestamp": "2025-11-24T20:42:32.733516Z"
    },
    {
      "original": "In the Dobropillya direction, after around four months of battles, Russian forces have captured the city of Pokrovsk. Additional progress has been made in other areas too.\nWest of Pokrovsk, Russian forces continued the assault on the Pokrovsk Coal Mine, where they established control over its southern buildings, including the power station. Fighting is ongoing for the other parts of the mine; however most Ukrainian soldiers have already withdrawn. \nIn northern Pokrovsk, Russian forces advanced from their newly captured positions north of the Hrishynka River, capturing the rest of the houses along the northernmost residential streets as well as the adjacent \"Druzhba\" dachas and treelines.\nNortheast of Pokrovsk, Russian forces consolidated in the Zaporozhskiy residential area and the forested areas along the T-05-15 Highway, physically encircling the remaining Ukrainian formations in the Myrnohrad pocket.\nNortheast of Pokrovsk, Russian forces broke through along the railway windbreaks and entered the northwestern part of Myrnohrad. They also captured the poultry farm and warehouses along the H-32 Highway. \nEast and southeast of Pokrovsk, Russian forces captured the Kohozhkine residential area on the eastern edge of Pokrovsk, along with the former industral zone to the north. Other assault groups captured the remaining treeline positions south of the railway line.\nIn southern Myrnohrad, Russian forces cleared the last streets of the southern low-rise residential area, capturing the Ozerka Cemetery and linking up with assault groups clearing the high-rise Zapadny District. Further north, Russian forces captured six more high-rise buildings in the southwestern part of the Zapadny District, while other forces crossed the park into the northeastern part of the district where they seized the former cinema along with another 6 high-rises. \nIn northeastern Myrnohrad, Russian forces captured School No. 5, School No. 10, and at least 19 more high-rise buildings in the Damanskyi, 5-23, and Skhidnyi Districts. Additionally, they were able to improve their positions further in low-rise residential areas of the 8th District, reaching Prokovyeva Street from the north.\nIn Rodynske, Russian forces continued to slowly advance back through the city. They captured the rest of the central-most block, along with the rest of the three-story buildings further north and reached School No. 35 from the northern low-rise residential areas. Heavy fighting is ongoing for the rest of the city centre and western blocks. \n+ ~8.71 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733528Z"
    },
    {
      "original": "The airspace over large parts of Astrakhan Oblast, including the Kapustin Yar Test Site will be temporarily closed for 24 hours on December 1.\nThere is a possibility of Oreshnik IRBM tests during that time, which would likely trigger sirens for all regions of Ukraine. The chances of an Oreshnik strike are practically zero.",
      "timestamp": "2025-11-24T20:42:32.733533Z"
    },
    {
      "original": "30k on Telegram and now 50k on Twitter. \nIts incredible seeing these numbers go up, and its been a privilege to bring the news to you all.",
      "timestamp": "2025-11-24T20:42:32.733536Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued to advance and have made progress in four different areas.\nIn the southwest, Russian forces pushed the Ukrainians back from the Fedorivka - Boikivka area, recapturing positions in the forests and at one of the ventilation shafts for the Krasnolimanskaya Mine. They were also able to recapture the rest of the residential part of Nykanorivka in the western part of the village.\nTo the northeast, Russian forces broke into eastern Shakhove from the south, quickly advancing up the street along the eastern bank of the Kazenyi Torets River, reaching its northern end. They also captured the rest of the forested areas east of Shakove, partially securing their eastern flank. \nFurther northeast, Russian forces intensified their assault operations in the direction of Sofiivka. They captured positions in four different treelines southeast and east of the village and secured the major Ukrainian strongpoints in the forested gulley, from which they are infiltrating the agricultural buildings on the eastern outskirts of Sofiivka. \n+ ~13.62 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733544Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault operations in and around Kostyantynivka, making new progress in four different areas.\nIn the southwest, Russian forces resumed their assault operations along the H-32 Highway after a long operational pause. Small groups of infantry advanced east towards the intersection with the H-20 Highway, but they quickly came under Ukrainian FPV drone fire. Despite casualties early on in the assault, several groups of soldiers managed to capture positions in the windbreaks on either side of the highway, as well as in the adjacent treelines. Attacks are now underway on the forested areas on the southeastern outskirts of Stepanivka.\nFurther east, after securing the southern part of Ivanopillya, Russian forces pushed north with large numbers of infantry, capturing the village centre. Other forces consolidated in the northeastern streets, and began attacks on the rest of the northern part of the village, capturing additional residential areas and the industrial buildings. \nUkrainian forces then attempted to cross the Kryvyi Torets River to seize northwestern Ivanopillya, but suffered heavy casualties in the process. Nevertheless, the Russian consolidation process was disrupted, and work is underway to strike the surviving Ukrainian soldiers with FPV drones. Additionally, Ukrainian forces managed to re-enter the northern part of Pleshchiivka, however there is no evidence of consolidation here yet. \nTo the north, Russian forces consolidated in additional positions in the Santurinivka and Stare Selyshche Districts of Kostyantynivka and continued pushing towards the railway station and the two high-rise buildings south of the T-0504 Highway. Additionally, the Russians captured five more blocks of houses in the eastern part of the Santurinivka District, entering the Tram Depot and the forests to the north. Ukrainian forces attempted a flanking counterattack southward from the forests to the trenches in the fields west of Predtechyne. Due to a lack of cover, they suffered heavy casualties in the process. Russian drones are now working on finding and striking the survivors.\n+ ~4.99 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733551Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces continued their assault operations and have made new progress in two different areas. \nIn the northeast, after breaking into the centre of Zvanivka, Russian forces quickly secured the western edge of the settlement along the eastern bank of the Bakhmutovka River, as well as the northern streets, completing its capture. They also established control over the rest of the railway windbreaks outside of Zvanivka, linking up with formations to the northeast. \nIn the southwest, Russian forces resumed their assault operations on Vasyukivka. After their failed attacks on the western part of the village earlier in the year, Russian forces once again crossed the tributary of the Vasyukivka River into the centre of the settlement, re-establishing control over it. Fighting is ongoing in the direction of the agricultural complex. \n+ ~3.96 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733557Z"
    },
    {
      "original": "On the northern flank of Siversk and in the Lyman direciton, Russian forces continued their assault operations on a wide front, making new progress in five different areas.\nIn the northwest, Russian forces completed the capture of the Masliakivka District of eastern Lyman and broke through Ukrainian positions to the northwest. They advanced north along a treeline, capturing a strongpoint at an intersection with a perpendicular treeline, before advancing west to the northeastern outskirts of Lyman. They entered the city from this direction and captured School No. 2 where fighting is now ongoing. \nTo the southeast, Russian forces continued their assault operations in the Sviati Hory National Park, reaching Varadero Lake and capturing new positions in the forests there. \nFurther southeast, Russian forces advanced from southern Yampil towards the strongpoints next to the T-05-13 Highway, capturing new positions in the forests west of the swamps.\nTo the east, Russian forces continued to build on their success along the Siverskyi Donets River. They pushed further through the forests of the Sviati Hory National Park along the southern bank of the river and have reached the village of Zakitne from the northeast. They also cleared additional positions in the forests along the northern bank of the River. Other forces began advancing south from Platonivka, capturing new positions in the Kritsina Gulley.\n+ ~3.46 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733563Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations north and northwest of Lyman, making new advances in two different areas. \nIn the east, after capturing the central part of Stavky, Russian forces advanced through the southern part of the village, capturing the remaining positions there. They also seized the second agricultural complex on its western outskirts after days of fighting and began pushing southwest towards the nearby gulley. \nIn the west, Russian forces continued their assault operations in Novoselivka aimed at re-establishing full control over the village. They were able to recapture positions in the western, central, and eastern parts of the settlement, slowly pushing the Ukrainians back towards the forests to the south.\n+ ~1.76 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733568Z"
    },
    {
      "original": "There is an increased threat of a large-scale, combined Russian missile and drone attack on Ukraine from November 27 onwards. \nI will publish more details about this once some things are clarified.",
      "timestamp": "2025-11-24T20:42:32.733572Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations towards the Oskil River and have entered the village of Bohuslavka.\nAfter securing the tactical heights northwest of Borivska Andriivka, Russian forces began advancing northwest along the treeline towards Bohuslavka. They were able to establish control over additional positions in 6 different treelines, while some soldiers entered southern Bohuslavka. There is no evidence of consolidation in the village, and Ukrainian FPV drones are actively striking the surviving Russian soldiers.\n+ ~3.32 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733576Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, with Ukrainian forces continuing their coordinated attempts aimed at regaining control over Kupyansk.\nIn the south, following earlier Russian DRG infiltrations, Ukrainian forces began pushing north from the area of Osynovo, clearing the village of Sadove along with the surrounding forested areas. From there, they advanced further north alongside other assault groups, re-entering the southern streets of Kupyansk and beginning attacks towards the Yuvileynyi high-rise micro-district.\nTo the north, Russian forces began advancing west from the area of the Yuvileynyi micro-district and captured new positions in the forests southeast of Sobolivka where DRGs previously operated.\nTo the northwest, Ukrainian forces cleared the forests northwest, north, and northeast of Sobolivka from Russian DRGs, using them as accumulation points for infiltrations into western Kupyansk, where the grey-zone has expanded towards the H-26 Highway. \nAdditionally, Ukrainian forces consolidated in northwestern Moskovka and continued attempts at entering the northwestern part of Kupyansk. They also captured part of warehouse complex northwest of Kupyansk, however additional attacks from here into the adjacent residential area have so far been unsuccessful.\n+ ~11.22 km² in favour of Ukraine.\n+ ~1.16 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733583Z"
    },
    {
      "original": "Moral is at the lowest level for Ukrainian besieged soldiers in the city. Russians advance slowly and without haste, forcing the troops to surrender.",
      "timestamp": "2025-11-24T20:42:32.733586Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces resumed their assault operations towards Novovasylivka from the east, making new progress along the tactical heights.\nRussian forces advanced from their positions in the Dvorichansky National Park, pushing west down the forested gulley towards the northern outskirts of Novovasylivka, as well as down a parallel treeline further south. Additionally, Russian forces advanced south down another treeline, and are attempting to enter the forested gulley which leads towards Mytrofanivka.\n+ ~3.80 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733590Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations, regaining the imitative in large parts of the frontline. \nIn the east, Russian forces advanced from their newly captured positions in southern Yunakivka, capturing positions in the forests on the southern approaches to the village. They also captured positions along the Loknya River to the west and are now attempting to push southwest down the treelines towards the village of Marine. \nAdditionally, unsuccessful attacks were carried out on the northern part of the forests surrounding Sadky, in an attempt at improving the situation for Russian assault groups failing to take ground in the eastern parts of the forests. \nTo the northwest, Russian forces resumed their assault operations southwest of Yablunivka. They captured new positions in the forested area on both banks of the Snahist River, in coordination with efforts to re-enter Varachyne from the north.\nIn the west, Russian forces managed to clear the rest of southern Oleksiivka and consolidate in the positions there. They also recaptured the agricultural buildings on the western outskirts of the village.\n+ ~3.74 km² in favour of Russia.",
      "timestamp": "2025-11-24T20:42:32.733598Z"
    },
    {
      "original": "The Ukrainian command has sent reinforcements to Vovchansk, in order to save the city from falling.\nThe immediate goal of the recent Russian advances in Vovchansk is to help tie down Ukrainian units and distract from operations in Kupyansk. \nThe longer-term goal is to use their improved positions in the Vovchansk area to help collapse the massive Ukrainian salient behind the Siverskyi Donets River in northeastern Kharkiv Oblast.",
      "timestamp": "2025-11-24T20:42:32.733604Z"
    },
    {
      "original": "Russian Army Reaches Huliaipole After Breaking Through Ukrainian Defenses East Of City (Videos)\nOn November 24, the Russian military reached the eastern outskirts of Huliaipole in Zaporozhye after breaking through Ukrainian defenses and capturing Zatyshshya, the last settlement before the key city from that direction.\nAccording to the Russian Ministry of Defense, the attack on Zatyshshya was led by the 114th Guards Motorized Rifle Regiment of the 5th Guards Combined Arms Army, which is a part of the Vostok [East] Group of Forces.\nAssault groups broke through a line of fortification before taking over the settlement, the ministry said in a statement, adding that Kiev forces suffered significant losses, including “more than 20 armored and motor vehicles and a large number of manpower were neutralized.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454033Z"
    },
    {
      "original": "Russian Army Reaches Huliaipole After Breaking Through Ukrainian Defenses East Of City (Videos)\nOn November 24, the Russian military reached the eastern outskirts of Huliaipole in Zaporozhye after breaking through Ukrainian defenses and capturing Zatyshshya, the last settlement before the key city from that direction.\nAccording to the Russian Ministry of Defense, the attack on Zatyshshya was led by the 114th Guards Motorized Rifle Regiment of the 5th Guards Combined Arms Army, which is a part of the Vostok [East] Group of Forces.\nAssault groups broke through a line of fortification before taking over the settlement, the ministry said in a statement, adding that Kiev forces suffered significant losses, including “more than 20 armored and motor vehicles and a large number of manpower were neutralized.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454050Z"
    },
    {
      "original": "Russian-Ukrainian Strikes Amid Another Scandal: Kyiv Purchased Chinese Drones at a 20-Fold Markup\nRussia and Ukraine continued their mutual exchange of strikes on November 23-24. The Ukrainian Air Force reported that on the night of November 24, Russian forces deployed 162 attack unmanned aerial vehicles (UAVs), of which 125 units were shot down or suppressed by air defense systems. \nIn Kharkiv and the surrounding region, preliminary data indicates at least 16 objects were hit. A key episode was a strike on the \"Serp i Molot\" 110/35/6 kV substation, which left approximately 10,000 subscribers without power.\nIn Dnipropetrovsk region, strikes affected the energy system, leaving more than 60,000 consumers without electricity. Significant damage was inflicted in Pavlohrad, where the targets included fuel and lubricant storage facilities near the railway depot and the unloading platform of a central processing plant used by the military for logistics and equipment storage\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454058Z"
    },
    {
      "original": "Russian-Ukrainian Strikes Amid Another Scandal: Kyiv Purchased Chinese Drones at a 20-Fold Markup\nRussia and Ukraine continued their mutual exchange of strikes on November 23-24. The Ukrainian Air Force reported that on the night of November 24, Russian forces deployed 162 attack unmanned aerial vehicles (UAVs), of which 125 units were shot down or suppressed by air defense systems. \nIn Kharkiv and the surrounding region, preliminary data indicates at least 16 objects were hit. A key episode was a strike on the \"Serp i Molot\" 110/35/6 kV substation, which left approximately 10,000 subscribers without power.\nIn Dnipropetrovsk region, strikes affected the energy system, leaving more than 60,000 consumers without electricity. Significant damage was inflicted in Pavlohrad, where the targets included fuel and lubricant storage facilities near the railway depot and the unloading platform of a central processing plant used by the military for logistics and equipment storage\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454070Z"
    },
    {
      "original": "Military Situation In Ukraine On November 24, 2025 (Maps Update)",
      "timestamp": "2025-11-24T20:42:33.454074Z"
    },
    {
      "original": "Military Situation In Ukraine On November 24, 2025 (Maps Update)",
      "timestamp": "2025-11-24T20:42:33.454077Z"
    },
    {
      "original": "Russia Army Cuts Last Route To Myrnohrad, Besieging Ukrainian Troops There (Videos)\nOn November 24, the Russian military imposed full control on the road linking Pokrovsk with Rodynske to the north, effectively besieging all remaining Ukrainian troops in Myrnohrad, which is also known as Dimitrov.\nThe push came after the military, namely the Tsentr [Center] Group of Forces, completed mopping-up vast parts of Pokrovsk.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army “completely liberated” the Gornyak and Shakhtersky microdistricts inside the city. It added that operations were still ongoing in Rovnoye, located to the east right before Myrnohrad. Reports from other sources, however, suggest that the small settlement has been captured.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454086Z"
    },
    {
      "original": "Russia Army Cuts Last Route To Myrnohrad, Besieging Ukrainian Troops There (Videos)\nOn November 24, the Russian military imposed full control on the road linking Pokrovsk with Rodynske to the north, effectively besieging all remaining Ukrainian troops in Myrnohrad, which is also known as Dimitrov.\nThe push came after the military, namely the Tsentr [Center] Group of Forces, completed mopping-up vast parts of Pokrovsk.\nIn its daily briefing, the Russian Ministry of Defense said that the 2nd Army “completely liberated” the Gornyak and Shakhtersky microdistricts inside the city. It added that operations were still ongoing in Rovnoye, located to the east right before Myrnohrad. Reports from other sources, however, suggest that the small settlement has been captured.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T20:42:33.454094Z"
    },
    {
      "original": "FROM BAD TO WORSE: UKRAINE FORCED TO SACRIFICE MIRNOGRAD AMID GULYAIPOLE COLLAPSE",
      "timestamp": "2025-11-24T20:42:33.454097Z"
    }
  ],
  "script_run_time": "2025-11-24T20:42:33.454811Z"
}