{
  "messages": [
    {
      "original": "⚠\nУвага!\n🛵\n Ударний БпЛА в північній частині Черкащини, курсом на захід.",
      "timestamp": "2025-09-26T10:16:50.008148Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 128 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 26 вересня (із 18.00 25 вересня) противник атакував 154-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Міллєрово – рф., близько 80 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 07.30, протиповітряною обороною збито/подавлено 128 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 26 ударних БпЛА на 9 локаціях, а також падіння збитих (уламки) на 1 локації.\nВорог продовжує атакувати безпілотниками. З північного напрямку зайшли нові групи ударних БпЛА. Дотримуйтесь заходів безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-26T10:16:50.008182Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігова, курсом на південь.",
      "timestamp": "2025-09-26T10:16:50.008187Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південно-західний.\n🛵\n БпЛА в південно-східній частині Чернігівщини, курс південний.",
      "timestamp": "2025-09-26T10:16:50.008194Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на східному напрямку!",
      "timestamp": "2025-09-26T10:16:50.008198Z"
    },
    {
      "original": "🛵\n Білоцерківський р-н., Київської області -  загроза застосування ворожих БпЛА.",
      "timestamp": "2025-09-26T10:16:50.008202Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Київщини на Черкащину, курс південно-західний.",
      "timestamp": "2025-09-26T10:16:50.008206Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-09-26T10:16:50.008210Z"
    },
    {
      "original": "🛵\n Гайсинський р-н. (Вінниччина) -  загроза застосування ворожих БпЛА.",
      "timestamp": "2025-09-26T10:16:50.008215Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-26T10:16:50.008219Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА в акваторії Чорного моря в напрямку Одещини. Залучено засоби для його збиття.\n🛵\n БпЛА з Чернігівщини, курсом на Київщину.",
      "timestamp": "2025-09-26T10:16:50.008225Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини, курс південний/південно-західний.",
      "timestamp": "2025-09-26T10:16:50.008229Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-09-26T10:16:50.008233Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-26T10:16:50.008238Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-09-26T10:16:50.008243Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Сум з північно-східного напрямку!",
      "timestamp": "2025-09-26T10:16:50.008247Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини та Сумщини, курс південно-західний.\n🛵\n Запорізька область - загроза застосування ворожих ударних БпЛА.",
      "timestamp": "2025-09-26T10:16:50.008254Z"
    },
    {
      "original": "🛵\n БпЛА з Донеччини, курсом на Дніпропетровщину (Синельниківський р-н).",
      "timestamp": "2025-09-26T10:16:50.008258Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-09-26T10:16:50.008262Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-26T10:16:50.008266Z"
    },
    {
      "original": "The Ukrainian GUR published a new video showing four recent FPV drone strikes on valuable Russian targets in Crimea.   The following was hit:  1 Surface situation radar station. 1 Coastal MR-10M1 “Mys M1” radar. 2 An-26 military transport aircraft.  As usual…",
      "timestamp": "2025-09-26T10:16:50.757656Z"
    },
    {
      "original": "If there's two things Ukraine is better than Russia at, its deep FPV drone strikes and editing skills.",
      "timestamp": "2025-09-26T10:16:50.757668Z"
    },
    {
      "original": "Ukrainian UAVs attacked the EuroChem-Belorechensk mineral fertilizers plant near Belorechensk, Krasnodar Krai, last night. At least one impact was recorded. \nThis plant, which contains 10 workshops, produces phosphate, complex water-soluble mineral fertilizers, nitrogen compounds, sulfuric and phosphoric acids, and complex fertilizers. \nCoordinates: 44.75974, 39.76288",
      "timestamp": "2025-09-26T10:16:50.757674Z"
    },
    {
      "original": "Ukrainian UAVs attacked the EuroChem-Belorechensk mineral fertilizers plant near Belorechensk, Krasnodar Krai, last night. At least one impact was recorded. \nThis plant, which contains 10 workshops, produces phosphate, complex water-soluble mineral fertilizers, nitrogen compounds, sulfuric and phosphoric acids, and complex fertilizers. \nCoordinates: 44.75974, 39.76288",
      "timestamp": "2025-09-26T10:16:50.757679Z"
    },
    {
      "original": "The IDF carried out an operation today targeting two Palestinian militants in the West Bank town of Tamoun, as a part of their continued low-intensity and relatively quiet effort to dismantle the rest of the Tubas Battalion. \nAfter receiving intelligence about the whereabouts of a commander from the Tamoun Company (part of the Tubas Battalion), as well as another fighter, Israeli special forces were dispatched to Tamoun, where they encircled a residential building and engaged in armed clashes. Both fighters were killed in the exchanges of fire (as confirmed by the IDF and the Palestinian Islamic Jihad). There were no casualties among Israeli soldiers.\nAfter a brief pause in their operations in the Tubas Governorate of the West Bank, the IDF has recently resumed attempts to eliminate individual cells from the Tubas Battalion and disrupt their attempts to re-establish their full presence in the area following the Israeli and Palestinian Authority operations from late 2024.",
      "timestamp": "2025-09-26T10:16:50.757684Z"
    },
    {
      "original": "Ukraine’s Air Force says it shot down a Russian Su-34 this morning in the Zaporozhye region.",
      "timestamp": "2025-09-26T10:16:50.757687Z"
    },
    {
      "original": "According to a reliable Ukrainian source, the Su-34 that was reportedly shot down launched KAB glide-bombs from its launch lines southwest of Tokmak, Zaporizhzhia Oblast, in the direction of Zaporizhzhia City at around 4:11 am. They state that crew survived and was evacuated by an Mi-8 helicopter.\nThis suggests that the distant explosion heard from Zaporizhzhia city at around 4:05 am was unrelated to this aircraft. While there was an air raid alert in place for all of Ukrainian-controlled Zaporizhzhia Oblast at the time, no tactical aircraft activity or launch maneuvers were reported.\nKeep in mind, launch maneuvers can be missed, and a declared target can be misidentified if the glide-bombs are targeting something \"in front\" of it (e.g. hitting Lyman instead of Slovyansk). If the Su-34 was shot down, the Ukrainian Airforce could be stating that it was targeting Zaporizhzhia City for informational effect due to the intensity of attacks on the city over the past 5 days.",
      "timestamp": "2025-09-26T10:16:50.757692Z"
    },
    {
      "original": "Update: Russian VKS affiliated source Fighterbomber has confirmed the loss of a Su-34.",
      "timestamp": "2025-09-26T10:16:50.757695Z"
    },
    {
      "original": "Sirens are sounding in Erez, north of Gaza, due to the threat of Rocket launches.",
      "timestamp": "2025-09-26T10:16:50.757698Z"
    },
    {
      "original": "1 rocket was intercepted",
      "timestamp": "2025-09-26T10:16:50.757701Z"
    },
    {
      "original": "1 rocket was intercepted",
      "timestamp": "2025-09-26T10:16:50.757704Z"
    },
    {
      "original": "Correction: This was a false alarm. It was triggered by the launch of an Israeli air defence missile.",
      "timestamp": "2025-09-26T10:16:50.757707Z"
    },
    {
      "original": "Correction: This was a false alarm. It was triggered by the launch of an Israeli air defence missile.",
      "timestamp": "2025-09-26T10:16:50.757710Z"
    },
    {
      "original": "Interestingly, the air defence missile was launched by Hamas at an Israeli helicopter over Gaza City. It missed by a few metres. This is the first usage of a Surface-to-air missile by Al-Qassam in over a year.",
      "timestamp": "2025-09-26T10:16:50.757717Z"
    },
    {
      "original": "test",
      "timestamp": "2025-09-26T10:16:50.757720Z"
    },
    {
      "original": "Russian FAB-3000 glide-bomb strike on a reported Ukrainian command post in Hulyaipole, Zaporizhzhia Oblast.\nThis is the town that Russian forces are advancing towards with their recent pushes along the Dnipropetrovsk-Zaporizhzhia Regional Border.\nOne thing to keep in mind is that the majority of videos posted claiming to show FAB-3000 strikes are showing FAB-1500s or even 500s. This is a 3000.",
      "timestamp": "2025-09-26T10:16:50.757724Z"
    },
    {
      "original": "Russian forces have captured Odradne, Velykyi Burluk direction, Kharkiv Oblast.\nPre-war population: ~183.\nTotal land area: ~1.02 km².",
      "timestamp": "2025-09-26T10:16:50.757729Z"
    },
    {
      "original": "Footage showing 10 Russian Geran-2 and Geran-3 drone strikes on the Honcharivske Training Ground in Chernihiv Oblast. Prior to these strikes, 2 Iskander-M ballistic missiles impacted.   The Ukrainian Armed Forces admitted to an unspecified number of casualties…",
      "timestamp": "2025-09-26T10:16:50.757732Z"
    },
    {
      "original": "From a prominent Ukrainian channel with close connections with Ukrainian air defence and ground forces. He's talking about the strikes on the Honcharivske Training Ground in Chernihiv Oblast.",
      "timestamp": "2025-09-26T10:16:50.757735Z"
    },
    {
      "original": "From a prominent Ukrainian channel with close connections with Ukrainian air defence and ground forces. He's talking about the strikes on the Honcharivske Training Ground in Chernihiv Oblast.",
      "timestamp": "2025-09-26T10:16:50.757738Z"
    },
    {
      "original": "Another prominent Ukrainian source with close connections to air defence units.\nChernihiv Oblast seems to be wide open and not prioritised.",
      "timestamp": "2025-09-26T10:16:50.757742Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-26T10:16:50.757745Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-26T10:16:50.757748Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that groups of Ukrainian soldiers were encircled in the western part of Sichneve around four days ago, after Russian forces bypassed the village and continued advancing further west.   Russian forces are now striking them…",
      "timestamp": "2025-09-26T10:16:50.757752Z"
    },
    {
      "original": "We have geolocations confirming my earlier reports that Ukrainian forces were encircled in Sichneve and were being hit by FPV drones.",
      "timestamp": "2025-09-26T10:16:50.757754Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n IDF: The Air Force, guided by Military Intelligence, struck a alleged Hezbollah precision missile production site in Lebanon’s Bekaa region.\nThe IDF said the site’s existence violates understandings between Israel and Lebanon and vowed to continue acting against threats to Israel.\n@wfwitness",
      "timestamp": "2025-09-26T10:16:50.757764Z"
    }
  ],
  "script_run_time": "2025-09-26T10:16:51.317733Z"
}