{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-08T23:58:01.908765Z"
    },
    {
      "original": "🛵\n БпЛА  в акваторії Чорного моря курсом на Одещину.",
      "timestamp": "2025-11-08T23:58:01.908781Z"
    },
    {
      "original": "🛵\n Одеса - перебувайте в укриттях, в напрямку  міста ударні БпЛА.",
      "timestamp": "2025-11-08T23:58:01.908786Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-08T23:58:01.908791Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-11-08T23:58:01.908796Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-08T23:58:01.908804Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини, курс південний.",
      "timestamp": "2025-11-08T23:58:01.908809Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-11-08T23:58:01.908813Z"
    },
    {
      "original": "🛵\n Група БпЛА з Чорного моря рухаються у напрямку Одеси!",
      "timestamp": "2025-11-08T23:58:01.908817Z"
    },
    {
      "original": "🛵\n Група БпЛА на Харківщині курсом на Чугуїв.",
      "timestamp": "2025-11-08T23:58:01.908821Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-11-08T23:58:01.908825Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини курсом на Харківщину.",
      "timestamp": "2025-11-08T23:58:01.908829Z"
    },
    {
      "original": "🛵\n Група БпЛА на заході Харківщини курсом на південь.",
      "timestamp": "2025-11-08T23:58:01.908840Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини курсом на Полтавщину.",
      "timestamp": "2025-11-08T23:58:01.908844Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-08T23:58:01.908849Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря  у напрямку Одеси!",
      "timestamp": "2025-11-08T23:58:01.908853Z"
    },
    {
      "original": "🛵\n БпЛА в Павлоградському районі Дніпропетровщини, курс на Павлоград.",
      "timestamp": "2025-11-08T23:58:01.908857Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини,курс південно-західний.",
      "timestamp": "2025-11-08T23:58:01.908861Z"
    },
    {
      "original": "🛵\n БпЛА в Шосткинському та  Конотопському районах Сумської області, курс південний.",
      "timestamp": "2025-11-08T23:58:01.908866Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-11-08T23:58:01.908870Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини,курс західний.\n🚀\nПуски КАБ на Донеччину.\n🛵\n БпЛА в Ніжинському районі Чернігівщини,курс південний.",
      "timestamp": "2025-11-08T23:58:01.908877Z"
    },
    {
      "original": "A massive attack is ongoing on the cities of Svitlodovsk and Kremenchuk, Poltava Oblast. More than 40 Geran-2 drones are attacking energy infrastructure there. Power outages are reported.",
      "timestamp": "2025-11-08T23:58:02.614058Z"
    },
    {
      "original": "Still more than 15 Gerans over Kremenchuk. Air defence isn't being effective, over 20 drones have hit the area",
      "timestamp": "2025-11-08T23:58:02.614069Z"
    },
    {
      "original": "Pavlohrad, Dnipropetrovsk Oblast is under attack from Geran-2 drones again.",
      "timestamp": "2025-11-08T23:58:02.614075Z"
    },
    {
      "original": "Last night, another large-scale, combined missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~7 Iskander-M ballistic missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~4 Iskander-M ballistic missiles launched from OTRK installations near Kursk City, Kursk Oblast.\n~3 Iskander-M ballistic missiles launched from OTRK installations northeast of Simferopol, Crimea.\n~3 Iskander-M ballistic missiles launched from OTRK installations near Hvardiiske Training Ground, Crimea. \n~2 Iskander-M ballistic missiles launched from OTRK installation(s) northwest of Kliintsy, Bryansk Oblast.\n~1 Iskander-M ballistic missile launched from an OTRK installation near Yeysk, Krasnodar Krai.\n~1 Iskander-M ballistic missiles launched from an OTRK installation near Taganrog, Rostov Oblast. \n~10 Kinzhal hypersonic aeroballistic missiles launched from 10 MiG-31Ks at their launch lines in Rasskazovsky District, Tambov Oblast.\n~9 Iskander-K cruise missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~4 Iskander-K cruise missiles launched from OTRK installations near Khalino Airbase, Kursk Oblast.\n~3 Kalibr cruise missiles launched from a frigate of the \"Admiral Makarov\" type off the coast of Cape Myskhako, Krasnodar Krai. \nInterceptions rates are currently unknown but are very low due to the number of ballistic missiles used. \n-----------------------\nThe main targets for this strike were Ukrainian gas and energy infrastructure. The following was hit:\nBelsk integrated oil and gas processing plant, Poltava Oblast (50.10915, 34.57816) by ~2 Iskander-Ms.\nOil and gas extraction workshop No. 4, Chernihiv Oblast (50.8025, 33.1349) by ~4 Iskander-Ms.\nUKPG Gas treatment plant, Kharkiv Oblast (49.85486, 35.97214) by ~3 Iskander-Ms.\nKharkiv TEC-5 Combined Heat and Power Plant, Kharkiv Oblast (49.97057, 36.11147) by ~3 Iskander-Ms\nSlobozhanske Power Plant, Kharkiv Oblast (49.58516, 36.52387) by ~2 Iskander-Ms\nPrydniprovska Thermal Power Plant, Dnipropetrovsk Oblast (48.40496, 35.11253) by ~6 Iskander-Ms.\nPavlohrad Chermical Plant, Dnipropetrovsk Oblast (48.56746, 35.82358) by ~2 Iskander-Ms.\nUnknown target near Kotelva, Poltava Oblast (likely gas-related) by ~5 Kinzhals and ~9 Iskander-Ks.\nUnknown target near Bucha, Kyiv Oblast by ~3 Kalibrs, ~2 Kinzhals, and ~2 Iskander-Ks.\nUnknown target near Obukhiv, Kyiv Oblast by ~2 Iskander-Ks.\nUnknown target near Fastiv, Kyiv Oblast by ~3 Kinzhals.\n-----------------------\nAdditional places targeted by Geran-2 drones, but not by missiles, include:\nKyiv City, Kyiv Oblast.\nBoryspil, Kyiv Oblast.\nKremenchuk, Poltava Oblast.\nSvitlodovsk, Poltava Oblast.\nPoltava City area, Poltava Oblast.\nLubny area, Poltava Oblast.\nHrebinka area, Poltava Oblast.\nSumy City, Sumy Oblast.\nZlatopil area, Kharkiv Oblast,\nBalakliya area, Kharkiv Oblast.\nZaporizhzhia City, Zaporizhzhia Oblast.\nMykolaiv City, Mykolaiv Oblast.\nPryluky area, Chernihiv Oblast.\nMykolaivka area, Donetsk Oblast.\nAdditionally, MLRS targeted energy infrastructure near Zaporizhzhia City and Kherson City. \nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2025-11-08T23:58:02.614108Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n Israeli drone strikes reported in Bint Jbeil, southern Lebanon.\n@wfwitness",
      "timestamp": "2025-11-08T23:58:02.614115Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n Israeli drone strikes reported in Bint Jbeil, southern Lebanon.\n@wfwitness",
      "timestamp": "2025-11-08T23:58:02.614122Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have captured positions within Kostyantynivka's city limits.\nAfter weeks of DRG infiltrations, Russian assault groups were able to consolidate in the eastern-most houses of the city, capturing at least 13 low-rise residential blocks as well as the nearby trench lines. DRGs continue their infiltrations towards the railway station, significantly disrupting Ukraine's defence.\nTo the south, Russian forces advanced further up the railway line and captured new treeline positions. They also consolidated in the agricultural buildings on the northern outskirts of Ivanopillya, before entering and capturing part of the village.\nIn the southwest, Russian forces continued to expand their zone of control east of the highway, capturing new trenches in the forests, as well as an underground bunker. Attacks are now being carried out further east to the rear of the Kleban-Bykske Reservoir.\n+ ~4.60 km² in favour of Russia.",
      "timestamp": "2025-11-08T23:58:02.614128Z"
    },
    {
      "original": "Large fires are burning in the cities of Kremenchuk and Svitlodovsk, Poltava Oblast, after more than 40 Russian Geran-2 drones attacked energy infrastructure in the region.",
      "timestamp": "2025-11-08T23:58:02.614131Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Dnipro. The main target was the Prydniprovska Thermal Power Plant. Patriot systems were unable to intercept any of the missiles.",
      "timestamp": "2025-11-08T23:58:02.614135Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Dnipro. The main target was the Prydniprovska Thermal Power Plant. Patriot systems were unable to intercept any of the missiles.",
      "timestamp": "2025-11-08T23:58:02.614138Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones attacked a target in the western part of Mykolaiv City last night. A fire was seen burning afterwards.",
      "timestamp": "2025-11-08T23:58:02.614142Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones attacked a target in the western part of Mykolaiv City last night. A fire was seen burning afterwards.",
      "timestamp": "2025-11-08T23:58:02.614145Z"
    },
    {
      "original": "Scenes from last night's combined Russian missile and drone attack on Pavlohrad, Dnipropetrovsk Oblast. \nThe target was the city's chemical plant, as well as energy infrastructure. Power outages lasted a couple of hours, and the fire at the chemical plant has since burned out.",
      "timestamp": "2025-11-08T23:58:02.614149Z"
    },
    {
      "original": "Scenes from last night's combined Russian missile and drone attack on Pavlohrad, Dnipropetrovsk Oblast. \nThe target was the city's chemical plant, as well as energy infrastructure. Power outages lasted a couple of hours, and the fire at the chemical plant has since burned out.",
      "timestamp": "2025-11-08T23:58:02.614153Z"
    },
    {
      "original": "A large fire is burning at the TEC-5 combined heat and power plant in Kharkiv City after it was hit by multiple Iskander-M ballistic missiles and Geran-2 drones.",
      "timestamp": "2025-11-08T23:58:02.614156Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced over the past 10 days, with Ukrainian forces eliminating most of the rest of the former Russian Kucheriv Yar salient.\nIn the north, Ukrainian forces advanced from positions south and east of Kucheriv Yar and recaptured positions in the treelines on the tactical heights and in the clay quarries. They reached the forests leading to western Shakhove where fighting is now ongoing.\nTo the south, Ukrainian forces advanced further east from positions east of Nove Shakhove. They pushed along two parallel gulleys and some treelines, capturing new positions in the direction of Pankivka, and threatening to cut off Russian formations entrenched in western Shakhove.\nTo the southwest, despite Russian FAB bombings, Ukrainian assault groups made additional progress towards the Kazenyi Torets River. They advanced southeast and captured new treeline positions on the tactical heights northwest of Mayak, while other forces entered the Hektova Gulley where they established control over most of the forested areas and began pushing towards the rear of Nykanorivka. Additionally, the Ukrainians advanced east from Dorozhnje, recapturing new positions in the forests west of Nykanorivka. \nOn the other hand, after their withdrawal from northern Pankivka, Russian forces re-entered the forests in the grey-zone northwest of the village, and consolidated in the positions there.\n+ ~24.45 km² in favour of Ukraine.\n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-08T23:58:02.614163Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nOver the last 24 hours, any remaining Ukrainian soldiers in the Dinas District of northeastern Pokrovsk surrendered after being physically encircled earlier. After combing operations, the rest of the district was brought under full Russian control.\nAttacks are now being carried out further east through Rivne. Russian forces were able to capture additional positions in the southern houses of the village as they attempt to advance east along the highway towards the northwestern outskirts of Myrnohrad.\nNorthwest of Myrnohrad, Russian forces levelled the frontline east of the northern pincer. After earlier infiltrations they were able to consolidate in the pig farm complex northwest of Svitle, as well as the treelines to the north. Additionally, Russian forces captured the pig farm complex south of Chervonyi Lyman, as well as the rest of the railway windbreaks further south.\nFierce fighting continues in western Rodynske, with no new confirmed changes. \nWith these new changes, for the first time, not a single part of Pokrovsk City is under Ukrainian control. More than 95% is under Russian control, with the rest in a fluid grey zone.",
      "timestamp": "2025-11-08T23:58:02.614169Z"
    },
    {
      "original": "In the Novopavlivka direction, over the past ten days, Russian forces have made significant progress on both banks of the Solena river.\nIn the northeast, Russian forces advanced further west from their positions west of Kotlyarivka. They established control over the remaining treelines in western Donetsk Oblast, crossing into Dnipropetrovsk Oblast, where they captured more positions on the tactical heights.\nTo the south, Russian forces widened their spearhead to the rear of Dachne by improving their positions in the treelines further north of the nearby gulley. They were able to capture positions in four separate treelines here.\nTo the southwest, following the Ukrainian withdrawal from the salient north of the Vovcha River, Russian forces levelled the frontline south of the gulley, establishing control over the remaining treeline positions there.\nTo the northwest, Russian forces broke through Ukrainian defences south of Novopavlivka and advanced up a treeline to the southeastern outskirts of the town. They then entered the town, capturing the southern streets. Once reinforcements were brought in, and positions were captured on the eastern and western flanks of the breach, the Russians advanced further north through the Novopavlivka, capturing additional residential streets. They also improved their positions further in the fortified forest, capturing additional positions north of Filiya.\nTo the west, Russian forces advanced east from Ivanivka to the forests on the northern bank of the Vovcha River. They established control over the positions there, linking up the Ivanivka bridgehead to the rest of the Novopavlivka direction. \n+ ~31.91 km² in favour of Russia.",
      "timestamp": "2025-11-08T23:58:02.614176Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, over the past five days Russian forces have continued their offensive operations, capturing new positions in several different areas. \nIn the north, Russian forces advanced from positions east of Oleksivika towards Orestopil, establishing control over two separate treelines and some nearby forest plantations. DRGs were able to enter the residential part of Orestopil. \nTo the southwest, the Russians continued expanding their zone of control around Zlahoda. They advanced down two perpendicular treelines south and southwest of the village, capturing new positions there. \nTo the south, after securing the central part of Uspenivka, Russian forces managed to capture the rest of the village, along with the agricultural buildings on its southern outskirts. They then crossed the Yanchur River at a new point from Pryvilne, and began advancing down a gulley and adjacent treelines towards Solodke. Russian soldiers quickly captured Solodke due to a lack of Ukrainian manpower in the area and consolidated in the treelines to the east.\nTo the southeast, the Russians advanced south and downhill from Uspenivka towards Nove, capturing positions in several different treelines and entering the village. Other forces advanced towards Novouspenivske from the southeast, crossing a gulley and capturing a forest along with nearby treeline positions to the north, northeast and south. As a result, any remaining Ukrainian soldiers still stationed west of Okhotnyche withdrew further west, allowing for the Russians to establish control over the treelines west of the Yanchur River there.\nFurther south, Russian forces continued to slowly advance west of Malynivka. They captured the rest of the gulley leading west from the village and secured new positions in two separate treelines, therefore reaching the eastern outskirts of Zelenyi Hai.\n+ ~30.98 km² in favour of Russia.",
      "timestamp": "2025-11-08T23:58:02.614183Z"
    },
    {
      "original": "Fun fact that a lot of people need to hear: both sides advance in Ukraine. \nJust because the side you don't support makes progress, it doesn't automatically mean its fake or cope, even though one country obviously advances more than the other.",
      "timestamp": "2025-11-08T23:58:02.614188Z"
    },
    {
      "original": "Massive Russian Strike With Hundreds Of Drones Wrecks Ukrainian Defense, Energy Facilities (Videos)\nOver the night of November 7 and 8, Russia carried out a massive group strike against Ukraine, launching hundreds of suicide drones in addition to dozens of ballistic and cruise missile at targets across the country, including defense facilities and related energy infrastructure.\nUkrainian President Volodymyr Zelenskyy claimed that more than 450 drones and 45 missiles of various types were launched by Russia.\nAs usual, the Ukrainian Air Force claimed that most of the drones and missiles were intercepted. However, Ukrainian and Russian media reported many hits.\nIn a statement released later, the Russian Ministry of Defense said that the group strike was carried out “in response to terrorist attacks launched by Ukraine against civilian objects on the territory of Russia.”\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201815Z"
    },
    {
      "original": "Massive Russian Strike With Hundreds Of Drones Wrecks Ukrainian Defense, Energy Facilities (Videos)\nOver the night of November 7 and 8, Russia carried out a massive group strike against Ukraine, launching hundreds of suicide drones in addition to dozens of ballistic and cruise missile at targets across the country, including defense facilities and related energy infrastructure.\nUkrainian President Volodymyr Zelenskyy claimed that more than 450 drones and 45 missiles of various types were launched by Russia.\nAs usual, the Ukrainian Air Force claimed that most of the drones and missiles were intercepted. However, Ukrainian and Russian media reported many hits.\nIn a statement released later, the Russian Ministry of Defense said that the group strike was carried out “in response to terrorist attacks launched by Ukraine against civilian objects on the territory of Russia.”\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201831Z"
    },
    {
      "original": "Russian Army Breaks Through Ukrainian Defenses In Dnepropetrovsk Again, Captures Town (Video)\nOn November 8, the Russian military captured yet another settlement in Dnepropetrovsk after breaking through Ukrainian defenses there again.\nThe Russian Ministry of Defense said that the Vostok [East] Group of Forces imposed control of Volchye on the Vovcha River after advancing more than three kilometers to the north of Alekseevka. The attack was led by the 36th Guards Brigade of the 29th Guards Combined Arms Army, according to the ministry.\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201839Z"
    },
    {
      "original": "Military Situation In Ukraine On November 8, 2025 (Maps Update)",
      "timestamp": "2025-11-08T23:58:03.201842Z"
    },
    {
      "original": "Military Situation In Ukraine On November 8, 2025 (Maps Update)",
      "timestamp": "2025-11-08T23:58:03.201846Z"
    },
    {
      "original": "Ukraine Nears Defeat In Kupyansk, Collapse Nearby (Videos)\nOn October 8, the Russian military expanded its control within Kupyansk in Kharkiv after repelling multiple Ukrainian counterattacks.\nIn its daily briefing, the Russian Ministry of Defense said that the 6th Army of the Zapad [West] Group of Forces inflicted more losses on Kiev forces inside Kupyansk and repelled a counterattack by Ukraine’s 1st National Guard Brigade near Osinovo to the south of the city.\nJust a day earlier, Russian media reported additional gains in the eastern outskirts of Kypyansk, with Russian troops approaching Kucherivka.\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201854Z"
    },
    {
      "original": "Ukraine Nears Defeat In Kupyansk, Collapse Nearby (Videos)\nOn October 8, the Russian military expanded its control within Kupyansk in Kharkiv after repelling multiple Ukrainian counterattacks.\nIn its daily briefing, the Russian Ministry of Defense said that the 6th Army of the Zapad [West] Group of Forces inflicted more losses on Kiev forces inside Kupyansk and repelled a counterattack by Ukraine’s 1st National Guard Brigade near Osinovo to the south of the city.\nJust a day earlier, Russian media reported additional gains in the eastern outskirts of Kypyansk, with Russian troops approaching Kucherivka.\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201862Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 8, 2025 (Map Update)",
      "timestamp": "2025-11-08T23:58:03.201865Z"
    },
    {
      "original": "Houthis Say 'Spy Network' Linked To CIA, Mossad & Saudi Intelligence Was Exposed \nThe Interior Ministry of the Houthi-led government in the Yemen capital, Sanaa, announced on November 8 that it had exposed a “spy network” run by the United States’ CIA, the Israeli Mossad agency and the intelligence service of Saudi Arabia.\nThe spy network was exposed as a result of a “high-level security operation, conducted in several stages,” the ministry said in a statement, noting that the operation “uncovered the enemy's plans, the methods of its treacherous agents, and their connections.”\nAccording to the ministry, the network was run by a joint operations room based in Saudi Arabia that coordinated “sabotage and espionage efforts against Yemen” and “established numerous small cells, each operating independently but all linked to the enemy's central operations room.”\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201875Z"
    },
    {
      "original": "U.S. Army Shares Photos Of Bombers, Fighter Jets Near Venezuela In New Escalation\nThe U.S. military has released photos showing strategic bombers and fighter jets flying over the Caribbean Sea, in a new sign of escalation against Venezuela.\nPhotos showing a pair of B-52 Stratofortress the Southern Command (SOUTHCOM) area of responsibility and conducting aerial refueling with a KC-135 Stratotanker were shared by the Air Force Global Strike Command to X on November 7. In the post, the command said that its aircraft “routinely conduct global operations in coordination with other combatant commands, services & participating US govt agencies to defend the US & its Allies”\nThe flight took place a day earlier. Data from aviation tracking websites, including Flightradar24, indicate that the B-52 flew along the coast of Venezuela, of course without violating the country’s airspace. This was the fourth instance of U.S. bombers approaching the country in recent weeks.\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201883Z"
    },
    {
      "original": "U.S. Army Shares Photos Of Bombers, Fighter Jets Near Venezuela In New Escalation\nThe U.S. military has released photos showing strategic bombers and fighter jets flying over the Caribbean Sea, in a new sign of escalation against Venezuela.\nPhotos showing a pair of B-52 Stratofortress the Southern Command (SOUTHCOM) area of responsibility and conducting aerial refueling with a KC-135 Stratotanker were shared by the Air Force Global Strike Command to X on November 7. In the post, the command said that its aircraft “routinely conduct global operations in coordination with other combatant commands, services & participating US govt agencies to defend the US & its Allies”\nThe flight took place a day earlier. Data from aviation tracking websites, including Flightradar24, indicate that the B-52 flew along the coast of Venezuela, of course without violating the country’s airspace. This was the fourth instance of U.S. bombers approaching the country in recent weeks.\nRead more \nHERE",
      "timestamp": "2025-11-08T23:58:03.201891Z"
    }
  ],
  "script_run_time": "2025-11-08T23:58:03.202563Z"
}