{
  "messages": [
    {
      "original": "🛸\n🛵\n Декілька груп ворожих БпЛА на  Чернігівщині \n➡️\n рухаються курсом на Київщину.",
      "timestamp": "2025-09-14T16:31:41.593467Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-09-14T16:31:41.593485Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 52 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 14 вересня (із 21.00 13 вересня) противник атакував балістичною ракетою Іскандер-М/KN-23, та 58-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Брянськ, Міллєрово, Приморсько-Ахтарськ – рф., понад 25 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 52 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання ракети та 6 ударних БпЛА на 3 локаціях, а також падіння збитих (уламки) на 2 локаціях.\n❗️\nУранці ворог атакує новою хвилею БпЛА із північно-східного напрямку. Дотримуйтесь правил безпеки!  \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-14T16:31:41.593506Z"
    },
    {
      "original": "🛸\n🛵\n Група БпЛА в північно-східній частині Чернігівщини, курс південно-західний.\nБпЛА в Ніжинському районі Чернігівщини, постійно змінюють курс.\nБпЛА східніше Чернігова, постійно змінює курс.",
      "timestamp": "2025-09-14T16:31:41.593514Z"
    },
    {
      "original": "🛵\n БпЛА в південній частині Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-09-14T16:31:41.593522Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-14T16:31:41.593526Z"
    },
    {
      "original": "🛵\n Декілька БпЛА в районі Ніжина на Чернігівщині.\n🛵\n БпЛА в північно-східній частині Чернігівщини, курс південно-західний.\n🛵\n БпЛА в південній частині Сумщини, постійно змінюють курс.",
      "timestamp": "2025-09-14T16:31:41.593533Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-14T16:31:41.593537Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Сумщині, курс південно-західний.",
      "timestamp": "2025-09-14T16:31:41.593544Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-14T16:31:41.593548Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-14T16:31:41.593552Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-14T16:31:41.593556Z"
    },
    {
      "original": "🚀\nРакетна небезпека в областях, де оголошено повітряну тривогу!",
      "timestamp": "2025-09-14T16:31:41.593561Z"
    },
    {
      "original": "🚀\nРакетна небезпека в областях, де оголошено повітряну тривогу!",
      "timestamp": "2025-09-14T16:31:41.593567Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-09-14T16:31:41.593571Z"
    },
    {
      "original": "🛵\n БпЛА в північній, східній та південній частинах Чернігівщини, курс південно-західний.",
      "timestamp": "2025-09-14T16:31:41.593577Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-09-14T16:31:41.593581Z"
    },
    {
      "original": "🛵\n БпЛА в північній частині Сумщини та Чернігівщини, курс західний/південно-західний.",
      "timestamp": "2025-09-14T16:31:41.593587Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-14T16:31:41.593593Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-09-14T16:31:41.593598Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-14T16:31:41.593602Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-14T16:31:41.593606Z"
    },
    {
      "original": "🛵\n БпЛА в районі Ніжина на Чернігівщині, постійно змінюють курс.\n🛵\n БпЛА в північній та східній частинах Чернігівщини, курс західний.",
      "timestamp": "2025-09-14T16:31:41.593612Z"
    },
    {
      "original": "Are we really going to continue to use maps showing fake advances? Ukraine failed to cut off the Russians in their salient to Kucheriv Yar and refocused further east after recapturing Volodomyrivka.   Russia still holds Doroznje, while this map shows it 5…",
      "timestamp": "2025-09-14T16:31:42.350661Z"
    },
    {
      "original": "The comments....",
      "timestamp": "2025-09-14T16:31:42.350674Z"
    },
    {
      "original": "Footage showing two Russian Kh-38ML missile strikes on a Ukrainian crossing over the Oskil River near the village of Osynovo, Kupyansk direction.\nCoordinates: 49.64260, 37.63548",
      "timestamp": "2025-09-14T16:31:42.350679Z"
    },
    {
      "original": "Russian forces have captured the village of Obratne, Pokrovske direction, Zaporizhzhia Oblast.\nPre-war population: ~37.\nTotal land area: ~0.18 km².",
      "timestamp": "2025-09-14T16:31:42.350688Z"
    },
    {
      "original": "Russian forces have captured the village of Ternove, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~316.\nTotal land area: ~1.50 km².",
      "timestamp": "2025-09-14T16:31:42.350692Z"
    },
    {
      "original": "A large fire is burning in Vinnytsia City after it was hit by 1-2 Kh-101 cruise missiles this morning. What exactly was hit is currently unknown, but we may get FIRMS data showing active fires.",
      "timestamp": "2025-09-14T16:31:42.350696Z"
    },
    {
      "original": "Sentinel satellite imagery shows that a section of the Vinnytsia Aircraft Repair plant was destroyed after Russian Kh-101 cruise missiles impacted it on September 10. \nAdditional photos from the ground show this same area marked on the map.\nCoordinates: 49.229771, 28.539321\nImage credit: \nhttps://t.me/osint_alarm/312",
      "timestamp": "2025-09-14T16:31:42.350702Z"
    },
    {
      "original": "Sentinel satellite imagery shows that a section of the Vinnytsia Aircraft Repair plant was destroyed after Russian Kh-101 cruise missiles impacted it on September 10. \nAdditional photos from the ground show this same area marked on the map.\nCoordinates: 49.229771, 28.539321\nImage credit: \nhttps://t.me/osint_alarm/312",
      "timestamp": "2025-09-14T16:31:42.350709Z"
    },
    {
      "original": "Scenes from Zhytomyr City after it was hit by several Kalibr and Kh-101 cruise missiles this morning. The first image shows four impacts. The targets remain unknown, but interestingly, it doesn't appear Ozerne Airbase was hit.",
      "timestamp": "2025-09-14T16:31:42.350713Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the two targets hit in Zhytomyr Oblast by Kalibr and Kh-101 cruise missiles on September 10 were the \"Progress Plant (site No. 2 – foundry complex)\", and a complex of warehouses. \nFactory coordinates: 49.886497, 28.644366\nWarehouse coordinates: 50.319050, 28.635220\nImage credit: \nhttps://t.me/osint_alarm/307",
      "timestamp": "2025-09-14T16:31:42.350719Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the two targets hit in Zhytomyr Oblast by Kalibr and Kh-101 cruise missiles on September 10 were the \"Progress Plant (site No. 2 – foundry complex)\", and a complex of warehouses. \nFactory coordinates: 49.886497, 28.644366\nWarehouse coordinates: 50.319050, 28.635220\nImage credit: \nhttps://t.me/osint_alarm/307",
      "timestamp": "2025-09-14T16:31:42.350726Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a reported Ukrainian long-range UAV control point near Kramatorsk, Donetsk Oblast.",
      "timestamp": "2025-09-14T16:31:42.350729Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-09-14T16:31:42.350732Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-09-14T16:31:42.350735Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-09-14T16:31:42.350738Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-09-14T16:31:42.350741Z"
    },
    {
      "original": "Another KAB to Sumy",
      "timestamp": "2025-09-14T16:31:42.350744Z"
    },
    {
      "original": "Another KAB to Sumy",
      "timestamp": "2025-09-14T16:31:42.350747Z"
    },
    {
      "original": "10km from the city",
      "timestamp": "2025-09-14T16:31:42.350750Z"
    },
    {
      "original": "10km from the city",
      "timestamp": "2025-09-14T16:31:42.350754Z"
    },
    {
      "original": "Explosion in Sumy. Impacted outside the city limits.",
      "timestamp": "2025-09-14T16:31:42.350757Z"
    },
    {
      "original": "Siversk direction. \nRussian forces are infiltrating in small groups of 2-3 soldiers for up to 7 km towards Dronivka. \nNo consolidation appears to have taken place yet, but there is a big gap in Ukraine's defence along the tactical heights north of Siversk that threatens their position in and around Serebryanka, and ultimately the whole Siversk salient.",
      "timestamp": "2025-09-14T16:31:42.350762Z"
    },
    {
      "original": "⚡️\n🇪🇬\n🇵🇸\n🇮🇱\n Israel has temporarily blocked fuel aid deliveries from entering Gaza via the Rafah Crossing. \nEgyptian officials claimed that the Israeli military gave no reason for the sudden blockage. \n@wfwitness",
      "timestamp": "2025-09-14T16:31:42.350770Z"
    },
    {
      "original": "⚡️\n🇪🇬\n🇵🇸\n🇮🇱\n Egyptian officials have confirmed that the Israeli military has now allowed the aid to go through. \n@wfwitness",
      "timestamp": "2025-09-14T16:31:42.350777Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 13, 2025\nOn September 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-14T16:31:43.107083Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 13, 2025\nOn September 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-14T16:31:43.107099Z"
    },
    {
      "original": "\"Rats Fleeing a Sinking Ship\": How Ukrainian Officials Save Their Children from Mobilization\nA video investigation by Bihus.Info—a Ukrainian anti-corruption media project founded in 2013 by investigative journalist Denys Bigus—has surfaced online. The team is known for exposing corruption schemes within the highest echelons of power.\nIn this investigation, Bihus.Info focuses on a key contradiction: while officials and public figures urge young people to remain in Ukraine, prepare for war, and \"row in the same boat,\" their own children study at prestigious foreign universities. This exposes a system of double standards where patriotic rhetoric is directed at the general public, while the offspring of the powerful elites are ensured safety and quality education abroad.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107107Z"
    },
    {
      "original": "Egypt Renews Pushes For ‘Arab Nato’ In Wake Of Israeli Attack On Qatar\n \nEgypt has renewed efforts to push for a NATO-style military alliance that would protect Arab countries facing attack, Lebanon’s Al-Akhbar newspaper reported on September 13, citing an unnamed official in Cairo.\nThe proposal was first made some nine years ago by Egyptian President Abdel Fattah El-Sisi, but no progress was made at the time.\nAl-Akhbar suggested that Israel’s recent strike on the leadership of Hamas in Qatar has given new impetus to the Egyptian initiative.\nEgypt is proposing to include some 20,000 of its own troops in the NATO-style alliance and is working on developing the mechanism by which such a force would be activated, “allowing it to be used when necessary and forming it in a manner consistent with the populations of Arab countries and their armed forces...\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107116Z"
    },
    {
      "original": "Russian Mi-28NM Helicopters Join Hunt For Ukrainian Long-Range Drones\nThe Russian military has begun to deploy its latest Mi-28NM attack helicopters to hunt down Ukrainian long-range drones.\nOn September 13, video footage showed one such helicopter taking down two AN-196 Liutyi fixed-wing drones somewhere over the special military operation zone in Ukraine. The first drone was hit by what appears to be an Igla-V missile, while the second was struck by shots from the helicopter’s 30 mm Shipunov 2A42 cannon gun.\nThe Igla-V is an air-launcher version of the Igla man-portable air defense system. The missiles used by the system are guided via infrared homing and have a fire-and-forget capability. The maximum range of the system is reported to be five kilometers.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107125Z"
    },
    {
      "original": "Ukrainian Train Loaded With Ammo Exploded Near Kiev \nA train transporting ammunition for the Armed Forces of Ukraine (AFU) exploded while passing near the settlement of Kalinovka in Ukraine’s Kiev region early on September 14, in what was described by local Governor Mykola Kalashnyk as an “emergency”.\nThe destination of the ammunition went on for around three hours, with secondary blasts heard all the way in the capital, Kiev, some 30 kilometers away.\nThe train reportedly had at least 15 wagons loaded with ammunition in addition to howitzers and other heavy military equipment.\nAt the time of the explosion, passenger train No. 730, en route from the region of Kharkiv to the city of Przemysl in Poland, was nearby. Ukraine’s Dzerkalo Tyzhnia news website reported that hundreds of passengers were evacuated from the train to a nearby force.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107133Z"
    },
    {
      "original": "Ukrainian Train Loaded With Ammo Exploded Near Kiev \nA train transporting ammunition for the Armed Forces of Ukraine (AFU) exploded while passing near the settlement of Kalinovka in Ukraine’s Kiev region early on September 14, in what was described by local Governor Mykola Kalashnyk as an “emergency”.\nThe destination of the ammunition went on for around three hours, with secondary blasts heard all the way in the capital, Kiev, some 30 kilometers away.\nThe train reportedly had at least 15 wagons loaded with ammunition in addition to howitzers and other heavy military equipment.\nAt the time of the explosion, passenger train No. 730, en route from the region of Kharkiv to the city of Przemysl in Poland, was nearby. Ukraine’s Dzerkalo Tyzhnia news website reported that hundreds of passengers were evacuated from the train to a nearby force.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107142Z"
    },
    {
      "original": "Russian Army Captures Dnepr Island, Advances In Kupyansk & Other Directions \nThe Russian military continues to advance in several directions across the special military operation zone, amid heavy losses by Kiev forces.\nIn a lightning amphibious attack, the special forces of the military intelligence of the Dnepr Group of Forces captured Alekseevsky Island, located near the Antovsky Bridge in the Kherson direction.\nOn September 12, troops from one of the formations that took part in the successful attack confirmed the advance to RIA Novosti, adding that all the islands in the floodplain in the Dnepr River are under the complete control of the Russian military.\nTASS reported two days later that 12 Ukrainian troops who attempted to withdraw from the island were eliminated by Russian drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107151Z"
    },
    {
      "original": "Russian Army Captures Dnepr Island, Advances In Kupyansk & Other Directions \nThe Russian military continues to advance in several directions across the special military operation zone, amid heavy losses by Kiev forces.\nIn a lightning amphibious attack, the special forces of the military intelligence of the Dnepr Group of Forces captured Alekseevsky Island, located near the Antovsky Bridge in the Kherson direction.\nOn September 12, troops from one of the formations that took part in the successful attack confirmed the advance to RIA Novosti, adding that all the islands in the floodplain in the Dnepr River are under the complete control of the Russian military.\nTASS reported two days later that 12 Ukrainian troops who attempted to withdraw from the island were eliminated by Russian drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107160Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Drone Attacks and Railway Sabotage\nThe overall ratio of attacking fixed-wing UAVs between Russian and Ukrainian forces last night favored Ukraine, with 80 Ukrainian UAVs shot down over Russia (plus 44 UAVs during the day) compared to 58 Geran/Herber UAVs and 1 Iskander-M missile (targeting Dnipropetrovsk region) launched at Ukraine.\nWhile Kyiv is focused on massive strikes on border areas and sabotage on railway lines, Russian forces during this period are concentrating on precision strikes against military targets—primarily temporary deployment points of the Armed Forces of Ukraine and positions of drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107167Z"
    },
    {
      "original": "Russian-Ukrainian Exchange of Strikes: Drone Attacks and Railway Sabotage\nThe overall ratio of attacking fixed-wing UAVs between Russian and Ukrainian forces last night favored Ukraine, with 80 Ukrainian UAVs shot down over Russia (plus 44 UAVs during the day) compared to 58 Geran/Herber UAVs and 1 Iskander-M missile (targeting Dnipropetrovsk region) launched at Ukraine.\nWhile Kyiv is focused on massive strikes on border areas and sabotage on railway lines, Russian forces during this period are concentrating on precision strikes against military targets—primarily temporary deployment points of the Armed Forces of Ukraine and positions of drone operators.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107174Z"
    },
    {
      "original": "U.S. Guardsmen Raided Venezuelan Vessel \nVenezuela has accused the United States of illegally boarding one of its fishing vessels in the country’s special economic zone.\nTensions between the two countries have been mounting since last month when the administration of President Donald Trump doubled the reward for the arrest of Venezuelan President Maduro to $50 million on drug trafficking charges then deployed a large naval force with more than 4,000 troops close to the country’s shores on a so-called “counter narco-terror operation”.\nIn a statement released on September 13, Venezuela’s Ministry of Foreign Affairs said a vessel with nine “humble” and “harmless” fishermen was intercepted by the USS Jason Dunham, an Arleigh Burke-class guided missile destroyer, a day earlier.\nRead more \nHERE",
      "timestamp": "2025-09-14T16:31:43.107186Z"
    }
  ],
  "script_run_time": "2025-09-14T16:31:43.108023Z"
}