{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-11-24T14:40:34.953058Z"
    },
    {
      "original": "🚀\nПуски КАБ на  Донеччину, в напрямку сходу Дніпропетровщини.",
      "timestamp": "2025-11-24T14:40:34.953076Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-24T14:40:34.953082Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігова \n➡️\n курсом південь.",
      "timestamp": "2025-11-24T14:40:34.953090Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині(на північ від н.п. Корюківка)\n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-11-24T14:40:34.953098Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини \n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-11-24T14:40:34.953106Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-24T14:40:34.953111Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-11-24T14:40:34.953119Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К",
      "timestamp": "2025-11-24T14:40:34.953128Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з півночі.",
      "timestamp": "2025-11-24T14:40:34.953133Z"
    },
    {
      "original": "🛵\n БпЛА на півночі від Сум, курс на захід.\n🛵\n БпЛА в напрямку Дніпра зі сходу.",
      "timestamp": "2025-11-24T14:40:34.953145Z"
    },
    {
      "original": "📢\n Відбій ракетної небезпеки.",
      "timestamp": "2025-11-24T14:40:34.953150Z"
    },
    {
      "original": "🛵\n БпЛА на північ Дніпропетровщини з Харківщини.",
      "timestamp": "2025-11-24T14:40:34.953154Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА в напрямку Суми  з півночі.",
      "timestamp": "2025-11-24T14:40:34.953160Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА в напрямку н.п. Василівка у Запорізькій області зі сходу.",
      "timestamp": "2025-11-24T14:40:34.953166Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-24T14:40:34.953179Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині на південь Миколаївщини та Дніпропетровщини.",
      "timestamp": "2025-11-24T14:40:34.953185Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-24T14:40:34.953189Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Херсона зі сходу.",
      "timestamp": "2025-11-24T14:40:34.953194Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини в районі н.п. Путивль-Ворожба \n➡️\n курсом на південь.",
      "timestamp": "2025-11-24T14:40:34.953200Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches",
      "timestamp": "2025-11-24T14:40:35.568376Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T14:40:35.568388Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T14:40:35.568392Z"
    },
    {
      "original": "Its flying in the general direction of the launch lines. Flight characteristics suggest training.",
      "timestamp": "2025-11-24T14:40:35.568396Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T14:40:35.568411Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T14:40:35.568415Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T14:40:35.568418Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T14:40:35.568422Z"
    },
    {
      "original": "The 3 MiG-31K fighters landed back at Savasleika Airbase after carrying out simulated launched of Kinzhals in Lipetsk Oblast.",
      "timestamp": "2025-11-24T14:40:35.568426Z"
    },
    {
      "original": "In the Dobropillya direction, after around four months of battles, Russian forces have captured the city of Pokrovsk. Additional progress has been made in other areas too.\nWest of Pokrovsk, Russian forces continued the assault on the Pokrovsk Coal Mine, where they established control over its southern buildings, including the power station. Fighting is ongoing for the other parts of the mine; however most Ukrainian soldiers have already withdrawn. \nIn northern Pokrovsk, Russian forces advanced from their newly captured positions north of the Hrishynka River, capturing the rest of the houses along the northernmost residential streets as well as the adjacent \"Druzhba\" dachas and treelines.\nNortheast of Pokrovsk, Russian forces consolidated in the Zaporozhskiy residential area and the forested areas along the T-05-15 Highway, physically encircling the remaining Ukrainian formations in the Myrnohrad pocket.\nNortheast of Pokrovsk, Russian forces broke through along the railway windbreaks and entered the northwestern part of Myrnohrad. They also captured the poultry farm and warehouses along the H-32 Highway. \nEast and southeast of Pokrovsk, Russian forces captured the Kohozhkine residential area on the eastern edge of Pokrovsk, along with the former industral zone to the north. Other assault groups captured the remaining treeline positions south of the railway line.\nIn southern Myrnohrad, Russian forces cleared the last streets of the southern low-rise residential area, capturing the Ozerka Cemetery and linking up with assault groups clearing the high-rise Zapadny District. Further north, Russian forces captured six more high-rise buildings in the southwestern part of the Zapadny District, while other forces crossed the park into the northeastern part of the district where they seized the former cinema along with another 6 high-rises. \nIn northeastern Myrnohrad, Russian forces captured School No. 5, School No. 10, and at least 19 more high-rise buildings in the Damanskyi, 5-23, and Skhidnyi Districts. Additionally, they were able to improve their positions further in low-rise residential areas of the 8th District, reaching Prokovyeva Street from the north.\nIn Rodynske, Russian forces continued to slowly advance back through the city. They captured the rest of the central-most block, along with the rest of the three-story buildings further north and reached School No. 35 from the northern low-rise residential areas. Heavy fighting is ongoing for the rest of the city centre and western blocks. \n+ ~8.71 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568438Z"
    },
    {
      "original": "The airspace over large parts of Astrakhan Oblast, including the Kapustin Yar Test Site will be temporarily closed for 24 hours on December 1.\nThere is a possibility of Oreshnik IRBM tests during that time, which would likely trigger sirens for all regions of Ukraine. The chances of an Oreshnik strike are practically zero.",
      "timestamp": "2025-11-24T14:40:35.568443Z"
    },
    {
      "original": "30k on Telegram and now 50k on Twitter. \nIts incredible seeing these numbers go up, and its been a privilege to bring the news to you all.",
      "timestamp": "2025-11-24T14:40:35.568447Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued to advance and have made progress in four different areas.\nIn the southwest, Russian forces pushed the Ukrainians back from the Fedorivka - Boikivka area, recapturing positions in the forests and at one of the ventilation shafts for the Krasnolimanskaya Mine. They were also able to recapture the rest of the residential part of Nykanorivka in the western part of the village.\nTo the northeast, Russian forces broke into eastern Shakhove from the south, quickly advancing up the street along the eastern bank of the Kazenyi Torets River, reaching its northern end. They also captured the rest of the forested areas east of Shakove, partially securing their eastern flank. \nFurther northeast, Russian forces intensified their assault operations in the direction of Sofiivka. They captured positions in four different treelines southeast and east of the village and secured the major Ukrainian strongpoints in the forested gulley, from which they are infiltrating the agricultural buildings on the eastern outskirts of Sofiivka. \n+ ~13.62 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568456Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault operations in and around Kostyantynivka, making new progress in four different areas.\nIn the southwest, Russian forces resumed their assault operations along the H-32 Highway after a long operational pause. Small groups of infantry advanced east towards the intersection with the H-20 Highway, but they quickly came under Ukrainian FPV drone fire. Despite casualties early on in the assault, several groups of soldiers managed to capture positions in the windbreaks on either side of the highway, as well as in the adjacent treelines. Attacks are now underway on the forested areas on the southeastern outskirts of Stepanivka.\nFurther east, after securing the southern part of Ivanopillya, Russian forces pushed north with large numbers of infantry, capturing the village centre. Other forces consolidated in the northeastern streets, and began attacks on the rest of the northern part of the village, capturing additional residential areas and the industrial buildings. \nUkrainian forces then attempted to cross the Kryvyi Torets River to seize northwestern Ivanopillya, but suffered heavy casualties in the process. Nevertheless, the Russian consolidation process was disrupted, and work is underway to strike the surviving Ukrainian soldiers with FPV drones. Additionally, Ukrainian forces managed to re-enter the northern part of Pleshchiivka, however there is no evidence of consolidation here yet. \nTo the north, Russian forces consolidated in additional positions in the Santurinivka and Stare Selyshche Districts of Kostyantynivka and continued pushing towards the railway station and the two high-rise buildings south of the T-0504 Highway. Additionally, the Russians captured five more blocks of houses in the eastern part of the Santurinivka District, entering the Tram Depot and the forests to the north. Ukrainian forces attempted a flanking counterattack southward from the forests to the trenches in the fields west of Predtechyne. Due to a lack of cover, they suffered heavy casualties in the process. Russian drones are now working on finding and striking the survivors.\n+ ~4.99 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568464Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces continued their assault operations and have made new progress in two different areas. \nIn the northeast, after breaking into the centre of Zvanivka, Russian forces quickly secured the western edge of the settlement along the eastern bank of the Bakhmutovka River, as well as the northern streets, completing its capture. They also established control over the rest of the railway windbreaks outside of Zvanivka, linking up with formations to the northeast. \nIn the southwest, Russian forces resumed their assault operations on Vasyukivka. After their failed attacks on the western part of the village earlier in the year, Russian forces once again crossed the tributary of the Vasyukivka River into the centre of the settlement, re-establishing control over it. Fighting is ongoing in the direction of the agricultural complex. \n+ ~3.96 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568469Z"
    },
    {
      "original": "On the northern flank of Siversk and in the Lyman direciton, Russian forces continued their assault operations on a wide front, making new progress in five different areas.\nIn the northwest, Russian forces completed the capture of the Masliakivka District of eastern Lyman and broke through Ukrainian positions to the northwest. They advanced north along a treeline, capturing a strongpoint at an intersection with a perpendicular treeline, before advancing west to the northeastern outskirts of Lyman. They entered the city from this direction and captured School No. 2 where fighting is now ongoing. \nTo the southeast, Russian forces continued their assault operations in the Sviati Hory National Park, reaching Varadero Lake and capturing new positions in the forests there. \nFurther southeast, Russian forces advanced from southern Yampil towards the strongpoints next to the T-05-13 Highway, capturing new positions in the forests west of the swamps.\nTo the east, Russian forces continued to build on their success along the Siverskyi Donets River. They pushed further through the forests of the Sviati Hory National Park along the southern bank of the river and have reached the village of Zakitne from the northeast. They also cleared additional positions in the forests along the northern bank of the River. Other forces began advancing south from Platonivka, capturing new positions in the Kritsina Gulley.\n+ ~3.46 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568477Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations north and northwest of Lyman, making new advances in two different areas. \nIn the east, after capturing the central part of Stavky, Russian forces advanced through the southern part of the village, capturing the remaining positions there. They also seized the second agricultural complex on its western outskirts after days of fighting and began pushing southwest towards the nearby gulley. \nIn the west, Russian forces continued their assault operations in Novoselivka aimed at re-establishing full control over the village. They were able to recapture positions in the western, central, and eastern parts of the settlement, slowly pushing the Ukrainians back towards the forests to the south.\n+ ~1.76 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568483Z"
    },
    {
      "original": "There is an increased threat of a large-scale, combined Russian missile and drone attack on Ukraine from November 27 onwards. \nI will publish more details about this once some things are clarified.",
      "timestamp": "2025-11-24T14:40:35.568487Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations towards the Oskil River and have entered the village of Bohuslavka.\nAfter securing the tactical heights northwest of Borivska Andriivka, Russian forces began advancing northwest along the treeline towards Bohuslavka. They were able to establish control over additional positions in 6 different treelines, while some soldiers entered southern Bohuslavka. There is no evidence of consolidation in the village, and Ukrainian FPV drones are actively striking the surviving Russian soldiers.\n+ ~3.32 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568492Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, with Ukrainian forces continuing their coordinated attempts aimed at regaining control over Kupyansk.\nIn the south, following earlier Russian DRG infiltrations, Ukrainian forces began pushing north from the area of Osynovo, clearing the village of Sadove along with the surrounding forested areas. From there, they advanced further north alongside other assault groups, re-entering the southern streets of Kupyansk and beginning attacks towards the Yuvileynyi high-rise micro-district.\nTo the north, Russian forces began advancing west from the area of the Yuvileynyi micro-district and captured new positions in the forests southeast of Sobolivka where DRGs previously operated.\nTo the northwest, Ukrainian forces cleared the forests northwest, north, and northeast of Sobolivka from Russian DRGs, using them as accumulation points for infiltrations into western Kupyansk, where the grey-zone has expanded towards the H-26 Highway. \nAdditionally, Ukrainian forces consolidated in northwestern Moskovka and continued attempts at entering the northwestern part of Kupyansk. They also captured part of warehouse complex northwest of Kupyansk, however additional attacks from here into the adjacent residential area have so far been unsuccessful.\n+ ~11.22 km² in favour of Ukraine.\n+ ~1.16 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568499Z"
    },
    {
      "original": "Moral is at the lowest level for Ukrainian besieged soldiers in the city. Russians advance slowly and without haste, forcing the troops to surrender.",
      "timestamp": "2025-11-24T14:40:35.568503Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces resumed their assault operations towards Novovasylivka from the east, making new progress along the tactical heights.\nRussian forces advanced from their positions in the Dvorichansky National Park, pushing west down the forested gulley towards the northern outskirts of Novovasylivka, as well as down a parallel treeline further south. Additionally, Russian forces advanced south down another treeline, and are attempting to enter the forested gulley which leads towards Mytrofanivka.\n+ ~3.80 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568509Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations, regaining the imitative in large parts of the frontline. \nIn the east, Russian forces advanced from their newly captured positions in southern Yunakivka, capturing positions in the forests on the southern approaches to the village. They also captured positions along the Loknya River to the west and are now attempting to push southwest down the treelines towards the village of Marine. \nAdditionally, unsuccessful attacks were carried out on the northern part of the forests surrounding Sadky, in an attempt at improving the situation for Russian assault groups failing to take ground in the eastern parts of the forests. \nTo the northwest, Russian forces resumed their assault operations southwest of Yablunivka. They captured new positions in the forested area on both banks of the Snahist River, in coordination with efforts to re-enter Varachyne from the north.\nIn the west, Russian forces managed to clear the rest of southern Oleksiivka and consolidate in the positions there. They also recaptured the agricultural buildings on the western outskirts of the village.\n+ ~3.74 km² in favour of Russia.",
      "timestamp": "2025-11-24T14:40:35.568516Z"
    },
    {
      "original": "The Ukrainian command has sent reinforcements to Vovchansk, in order to save the city from falling.\nThe immediate goal of the recent Russian advances in Vovchansk is to help tie down Ukrainian units and distract from operations in Kupyansk. \nThe longer-term goal is to use their improved positions in the Vovchansk area to help collapse the massive Ukrainian salient behind the Siverskyi Donets River in northeastern Kharkiv Oblast.",
      "timestamp": "2025-11-24T14:40:35.568521Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-24T14:40:36.233183Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-24T14:40:36.233197Z"
    },
    {
      "original": "Polymarket Bets: Which Cities Could The Russian Army Capture In November And December?\nWhich cities have already had bids placed on Polymarket? Which cities could be captured as early as November? What awaits the Ukrainian market in December?\nBets on the capture of Ukrainian cities on Polymarket have become a popular form of entertainment in many countries. This section is called the Ukrainian Map. To understand the ongoing events, one doesn't need insider information; following our daily reports on the situation in Ukraine is enough. To make analysis easier, we are introducing a new column: \"Polymarket Bets,\" which summarizes information on the most interesting fronts.\nOne of our initial forecasts regarding the capture of Uspenovka was recently confirmed, and the market closed shortly after the article's publication.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233209Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233220Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233230Z"
    },
    {
      "original": "The Operation in Pokrovsk Is Nearing Completion as Russian Units Finish Mopping Up Remaining Ukrainian Forces\nRussian troops taken full control of Novoye Zaporozhye in the Zaporizhzhia sector. In Rodynske, Russian units restored control over part of the urban territory after the Ukrainian army made recent breakthrough attempts. Meanwhile, intensive negotiations are ongoing in Geneva between Ukrainian and US delegations on the Trump administration's peace plan.\nOperations to establish control over Pokrovsk's urban territory are nearing completion. Russian forces' control has been confirmed over most of the urban area. To the north, the operational ring has finally closed around the tree lines west of Rovnoye, where increased fire density has been established.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233239Z"
    },
    {
      "original": "The Operation in Pokrovsk Is Nearing Completion as Russian Units Finish Mopping Up Remaining Ukrainian Forces\nRussian troops taken full control of Novoye Zaporozhye in the Zaporizhzhia sector. In Rodynske, Russian units restored control over part of the urban territory after the Ukrainian army made recent breakthrough attempts. Meanwhile, intensive negotiations are ongoing in Geneva between Ukrainian and US delegations on the Trump administration's peace plan.\nOperations to establish control over Pokrovsk's urban territory are nearing completion. Russian forces' control has been confirmed over most of the urban area. To the north, the operational ring has finally closed around the tree lines west of Rovnoye, where increased fire density has been established.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233247Z"
    },
    {
      "original": "Israel Assassinated Hezbollah’s Military Chief, What Comes Next Is War (Photos, Video)\nThe Israeli escalation against Hezbollah reached a new peak on November 23 with the assassination of the group’s chief of staff in the Lebanese capital, Beirut.\nHaytham Ali Tabataba, known by his nom de guerre “Abu Ali,” was killed in a targeted strike that hit the third and fourth floors of a nine-story building in the Haret Hreik area in the southern suburbs of Beirut, a stronghold of Hezbollah commonly known as Dahiya.\nLebanon’s state-run National News Agency said that three “missiles” hit the building, but photos from the scene of the strike suggest that more than five projectiles were used.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233257Z"
    },
    {
      "original": "Israel Assassinated Hezbollah’s Military Chief, What Comes Next Is War (Photos, Video)\nThe Israeli escalation against Hezbollah reached a new peak on November 23 with the assassination of the group’s chief of staff in the Lebanese capital, Beirut.\nHaytham Ali Tabataba, known by his nom de guerre “Abu Ali,” was killed in a targeted strike that hit the third and fourth floors of a nine-story building in the Haret Hreik area in the southern suburbs of Beirut, a stronghold of Hezbollah commonly known as Dahiya.\nLebanon’s state-run National News Agency said that three “missiles” hit the building, but photos from the scene of the strike suggest that more than five projectiles were used.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233267Z"
    },
    {
      "original": "Sectarian Violence Reignites In Syria With Attack On Alawites In Homs (Videos)\nSyria witnessed another episode of sectarian violence on November 24 after the killing of a Bedouin couple triggered retaliatory attacks against the Alawite community in the central governorate of Homs. \nThe man and his wife, both from the Bani Khalid Bedouin tribe, were found killed in their home in the town of Zaidal in the eastern Homs countryside early in the day, with the woman’s body partially burned and sectarian-charged graffiti found at the scene.\nQuickly after the news spread out, armed Bedouins carried out retaliatory attacks against Alawites in Homs city, storming al-Muhajirin and other neighborhoods where members of the community reside. Authorities announced an investigation into the crime in Zaidal and deployed troops in the city in an attempt to control the situation.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233288Z"
    },
    {
      "original": "Sectarian Violence Reignites In Syria With Attack On Alawites In Homs (Videos)\nSyria witnessed another episode of sectarian violence on November 24 after the killing of a Bedouin couple triggered retaliatory attacks against the Alawite community in the central governorate of Homs. \nThe man and his wife, both from the Bani Khalid Bedouin tribe, were found killed in their home in the town of Zaidal in the eastern Homs countryside early in the day, with the woman’s body partially burned and sectarian-charged graffiti found at the scene.\nQuickly after the news spread out, armed Bedouins carried out retaliatory attacks against Alawites in Homs city, storming al-Muhajirin and other neighborhoods where members of the community reside. Authorities announced an investigation into the crime in Zaidal and deployed troops in the city in an attempt to control the situation.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233298Z"
    },
    {
      "original": "Foreign Jihadists Are Pouring Into Syria, Joining New Army (Videos)\nTestimonies by two alleged Russian jihadists who were captured while taking part in the battle in the southern Syrian governorate of al-Suwayda in July revealed that more foreign jihadists are pouring into the war-torn country, and are even enlisting in the new military.\nThe battle in al-Suwayda broke out when an intervention by government forces to end a local conflict involving Bedouins quickly escalated into an sectarian-fueled attack on the Druze. Israel, which vowed to protect the community after the fall of the Assad regime, intervened, and the battle ended with a ceasefire brokered by the United States.\nThe battle claimed the lives of more than 3,000 people, around a third of them were Druze civilians executed by government troops and Bedouins. Hundreds others – reportedly up to 600 people – were abducted. Druze fighters also captured a number of government troops and Bedouin fighters.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233309Z"
    },
    {
      "original": "Foreign Jihadists Are Pouring Into Syria, Joining New Army (Videos)\nTestimonies by two alleged Russian jihadists who were captured while taking part in the battle in the southern Syrian governorate of al-Suwayda in July revealed that more foreign jihadists are pouring into the war-torn country, and are even enlisting in the new military.\nThe battle in al-Suwayda broke out when an intervention by government forces to end a local conflict involving Bedouins quickly escalated into an sectarian-fueled attack on the Druze. Israel, which vowed to protect the community after the fall of the Assad regime, intervened, and the battle ended with a ceasefire brokered by the United States.\nThe battle claimed the lives of more than 3,000 people, around a third of them were Druze civilians executed by government troops and Bedouins. Hundreds others – reportedly up to 600 people – were abducted. Druze fighters also captured a number of government troops and Bedouin fighters.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T14:40:36.233318Z"
    },
    {
      "original": "Military Situation In Syria On November 24, 2025 (Map Update)",
      "timestamp": "2025-11-24T14:40:36.233322Z"
    }
  ],
  "script_run_time": "2025-11-24T14:40:36.234257Z"
}