{
  "messages": [
    {
      "original": "🛵\n БпЛА в Павлоградському та Самарівському районах Дніпропетровської області, курс захід.",
      "timestamp": "2025-11-15T19:00:02.810744Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини на Харківщину (Богодухівський район), курс південний.",
      "timestamp": "2025-11-15T19:00:02.810760Z"
    },
    {
      "original": "🛵\n БпЛА на межі Чернігівщини та Київщини, курс західний.",
      "timestamp": "2025-11-15T19:00:02.810766Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини, курс південний.",
      "timestamp": "2025-11-15T19:00:02.810770Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nКиїв - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-15T19:00:02.810777Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-15T19:00:02.810785Z"
    },
    {
      "original": "🛵\n БпЛА  на півдні Сумщини курсом на Полтавщину.",
      "timestamp": "2025-11-15T19:00:02.810790Z"
    },
    {
      "original": "🛵\n БпЛА в Черкаському районі Черкащини, курс південно-західний.",
      "timestamp": "2025-11-15T19:00:02.810794Z"
    },
    {
      "original": "🛵\n БпЛА в Бориспільському районі Київщини, курс південно-західний.",
      "timestamp": "2025-11-15T19:00:02.810799Z"
    },
    {
      "original": "🛵\n БпЛА з Черкащани на Кіровоградщину(Голованівський район), курс південно-західний",
      "timestamp": "2025-11-15T19:00:02.810803Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на н.п. Лозова на Харківщині з півночі.",
      "timestamp": "2025-11-15T19:00:02.810807Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА в Богодухівському районі Харківщини,курс західний.",
      "timestamp": "2025-11-15T19:00:02.810812Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини на Полтавщину (Полтавський район), курс південно-західний.",
      "timestamp": "2025-11-15T19:00:02.810819Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-15T19:00:02.810823Z"
    },
    {
      "original": "🛵\n БпЛА в Новоукраїнському районі Кіровоградської області, курс південно-східний.",
      "timestamp": "2025-11-15T19:00:02.810828Z"
    },
    {
      "original": "🛵\n БпЛА в Берестинському районі Харківщини, курс південно-східний.",
      "timestamp": "2025-11-15T19:00:02.810833Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Миколаївщини, курс на захід.",
      "timestamp": "2025-11-15T19:00:02.810837Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-15T19:00:02.810844Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-15T19:00:02.810852Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-15T19:00:02.810858Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations aimed at recapturing previously lost positions in Sumy Oblast.\nIn the west, Ukrainian forces once again attempted to infiltrate the western part of Oleksiivka via the agricultural buildings. Russian forces then launched a series of counterattacks and cleared these buildings, before beginning a push down the road to Andriivka. At the same time, Ukrainian forces continued attempts at entering and entrenching in the eastern part of Oleksiivka.\nTo the east, multiple Russian assault groups used an underground pipeline to attack Ukrainian positions to the rear of Varachyne. Ukrainian formations stationed in the area were aware of this pipe and immediately fired on Russian soldiers emerging from it. Nevertheless, the numbers of Russian soldiers who emerged were too high for the Ukrainians to contain, forcing them to withdraw from the area. The surviving Russian soldiers established control over some treeline positions, and Ukrainian drones are trying to pick them off. Two attempts at reconnecting with other forces to the northwest failed with casualties. \nMeanwhile, due to the complicated situation for Ukraine and the disruption of their supply routes, Russia was able to enter the northern part of Varachyne relatively unopposed and consolidate in the houses there. Attempts are now underway to establish control over the rest of the village. Other forces advanced west of Varachyne, capturing new treeline positions on the tactical heights. \nIn the east, following earlier unsucessful attacks and consolidation attempts, Russian forces resumed assault operations in the village of Yunakivka and recaptured positions in the southern part of the village. They are now consolidating and attempting to accumulate additional infantry in order to establish control over the last parts of the village.\n+ ~3.97 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461455Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to advance towards the Verkhnya Dvurichkova River, capturing additional positions on the tactical heights.\nIn the southeast, after entering the large forest southeast of Dvorichanske, Russian forces were able to advance further north and establish full control over it, entrenching on the edge of the tactical heights. They then went on to capture further positions in the forested areas to the north, while other forces established control over the forests and treelines on the tactical heights to the east and northeast. Additionally, the Russians captured a small forest northeast of Dvorichanske, further approaching the village from this direction.\nTo the northwest, following earlier advances on the flanks, Russian forces improved their positions along a treeline west of Odradne, before securing the northern end of the adjacent gulley, largely levelling the frontline in this sector. \n+ ~12.39 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461468Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in Kupyansk, while Ukrainian forces are attempting to counterattack at several different points.\nIn the northeastern part of Kupyansk, after establishing a foothold in the first blocks of the city and accumulating additional infantry, Russian forces advanced further south towards the highway. They captured the rest of the high-rise buildings and a significant portion of the low-rise residential areas. They also entered the eastern industrial zone and captured the Kupyansk Railway Station. \nIn the southern part of Kupyansk, Russian forces continued widening their spearhead to Sadove. They pushed southwest from the Yuvileynyi high-rise micro-district and captured new parts of the southern low-rise residential area. \nMeanwhile, Ukrainian forces began attempts at counterattacking in the eastern residential area and industrial zone, slowing the Russian advance towards the southeastern neighbourhoods. They are also attacking through the grey-zone towards the market and city centre. On the western side of the city, the Ukrainians are attempting to infiltrate the residential areas in the grey zone where Russia hasn't consolidated in yet, while other forces continued their attacks from Moskovka and the forests southwest of Radkivka. No Ukrainian advances have been confirmed yet.\n+ ~5.04 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461476Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards the village of Novoplatonivka, and have captured new positions on the tactical heights. \nAfter capturing the treelines and forest plantations northwest of Borivska Andriivka, Russian forces advanced further down the tactical heights, capturing positions in two treelines to the west. Other forces advanced west down a third treeline, reaching a gulley.\n+ ~1.82 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461481Z"
    },
    {
      "original": "In the Borova direction and on the northwestern flank of Lyman, both Russian and Ukrainian forces have advanced.\nIn the northwest, Russian forces continued their assault operations towards the village of Korovii Yar and have captured additional positions some forested areas. Attacks are now underway on the main Ukrainian strongpoints outside the settlement.\nTo the south, Ukrainian forces built on their progress east of Yarova and captured additional positions in the forests along the western bank of the Nitrius River. They were able to entrench in the forests just outside Novoselivka, and infiltrate into the southern part of the village, where a large grey-zone has formed. Russian forces are now trying to push the Ukrainians back out of the settlement. \nTo the east, Ukrainian forces reversed some Russian progress in and around the town of Drobysheve. They advanced north through poorly consolidated Russian positions in the forests east of the Nitrius River, reaching the main Russian positions south and southeast of the fish farm. Other forces recaptured positions in the northern part of the town, pushing the Russians back to the outermost streets. \nMeanwhile, Russian forces continued their attempts at advancing from the agricultural complex on the northwestern outskirts of the town towards its centre. Other forces are attempting to infiltrate from the strongpoints in the Bogdasarov Forest to the eastern streets of Drobysheve, where a grey zone has formed. \nIn the east, Russian forces continued to slowly advance near Stavky, capturing the western agricultural complex on the western outskirts of the village. \n+ ~2.80 km² in favour of Ukraine.\n+ ~2.77 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461489Z"
    },
    {
      "original": "On the eastern flank of Lyman and on the northern flank of Siversk, both Russian and Ukrainian forces have advanced.\nIn the west, after bringing in new reinforcements, Ukrainian forces cleared the Kommunal'nyy district of Lyman from Russian DRGs, as well as the western part of the Masliakivka District. Russian forces have refocused their efforts on the eastern part of Masliakivka, and the forests east of the Pivdennyi District.\nTo the east, Russian forces resumed their assault operations in Yampil. They pushed southwest from the northern and northeastern parts of the village, recapturing previously lost positions in the western, central, northern, and eastern streets. Ukrainian forces have since withdrawn from most of the village and are maintaining their main presence in the southernmost streets.\nFurther east, Russian forces infiltrated from the forest east on Yampil, across the wetlands to the forests further south, capturing positions there. Other forces advanced from the forests west of Dronivka, securing their presence in this new area.\n+ ~5.57 km² in favour of Russia.\n+ ~1.26 km² in favour of Ukraine.",
      "timestamp": "2025-11-15T19:00:03.461496Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued to advance towards Siversk and have captured most of the rest of the fortifications east of the city. \nIn the north, Russian forces broke through Ukrainian positions in the treelines southwest of Verkhnokamyanske, capturing numerous new positions and strongpoints on the tactical heights. Some assault groups were able to reach the fortifications right outside the city, where fighting is now ongoing. Additionally, Russian forces infiltrated to the northeastern part of the city, where they are now fighting for the trench strongpoints there.\nIn the south, Russian forces began advancing west of the railway line towards Zvanivka. They were able to capture new positions in 7 different treelines on the tactical heights.  \n+ ~9.49 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461502Z"
    },
    {
      "original": "Explosions in Horlivka, Donetsk Oblast from Ukrainian MLRS strikes. Russian S-300 air defence is active.",
      "timestamp": "2025-11-15T19:00:03.461505Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued to advance towards the village of Minkivka and have made new progress in three different areas.\nIn the west, Russian forces continued to advance along the Siverskyi-Donets Canal and captured new trench positions and dugouts northeast of Novomarkove. \nFurther east, Russian forces advanced to the forest south of Orikhovo-Vasylivka, capturing its southern part. They then went on to advance further northeast, reaching the southern outskirts of Orikhovo-Vasylkivka.\nTo the northeast, Russian forces captured new positions along the E-40 highway and in an adjacent treeline and improved their positions in the forests to the southwest.\n+ ~1.76 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461512Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, both Russian and Ukrainian forces have advanced.\nIn the north, Russian forces expanded their control west of the Siverskyi Donets River, advancing from their trenches and dugouts there and capturing a small forest south of Markove.\nTo the southwest, Russian forces resumed their attacks towards Maiske, advancing along two parallel treelines and capturing the treeline directly south of the village. \nTo the south, the Russians resumed assault operations west of Chasiv Yar. They advanced from the northwestern part of the city, down the railway line, capturing positions in the windbreaks on either side of the tracks. Other forces advanced from the north and captured positions in three separate treelines.\nMeanwhile, the frontline was corrected in favour of Ukraine in southern Chasiv Yar. At some point in the last six weeks, Ukrainian units were able to enter the Pivdennyi District of the city. After capturing the northern, low-rise residential part of this district and accumulating additional infantry, they were able to advance further east and establish control over part of the Levanevskoho District.\n+ ~3.47 km² in favour of Russia. \n+ ~1.10 km² in favour of Ukraine.",
      "timestamp": "2025-11-15T19:00:03.461520Z"
    },
    {
      "original": "Its out! \nhttps://youtu.be/sUxs_6MFSIs",
      "timestamp": "2025-11-15T19:00:03.461524Z"
    },
    {
      "original": "Its out! https://youtu.be/sUxs_6MFSIs",
      "timestamp": "2025-11-15T19:00:03.461527Z"
    },
    {
      "original": "The audio is a bit broken, but it could be worse from my computer",
      "timestamp": "2025-11-15T19:00:03.461534Z"
    },
    {
      "original": "⚡️\n🇸🇾\n🇺🇸\n Talks to integrate Rojava’s civil and military institutions into the Syrian state are entering a decisive phase next week, an SDC representative \ntold Rudaw\n. \nAbdul Wahab Khalil said last week’s Washington meeting between interim President Ahmed al-Sharaa, President Trump, and Turkish FM Hakan Fidan created “positive” momentum, with large-scale SDF–Damascus talks expected soon.\nSyrian FM Asaad al-Shaibani said Damascus has held five meetings with the SDF in 45 days, stressing that unification will proceed through dialogue, not haste. AANES is preparing to send a delegation to Damascus.\n@wfwitness",
      "timestamp": "2025-11-15T19:00:03.461545Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, making important progress.\nIn the northeast, following the withdrawal of the remaining Ukrainian formations, Russian forces completed the capture of the large, fortified forest east of Predtechyne and captured numerous treeline positions further west. \nTo the west, Russian forces continued advancing down the railway line and entered southeastern Kostyantynivka from a new direction. Other forces continued advancing through the Stare Selyshche District, where they captured new positions in the direction of the railway station, and crossed the Naumykha River to the railway line. \nTo the south, after advancing from the northwest, Russian forces cleared most of the rest of southern Ivanopillya, and captured positions along the railway line northwest of Pleshchiivka.\nIn the southwest, after capturing a bunker system, the Russians advanced further west through the forests behind the Kleban-Bykske Reservoir, with some groups nearly reaching the northernmost part of it.\n+ ~13.66 km² in favour of Russia",
      "timestamp": "2025-11-15T19:00:03.461552Z"
    },
    {
      "original": "On the southwestern flank of Kostyantynivka and in the Dobropillya direction, both Russian and Ukrainian forces have advanced.\nRussian forces resumed their assault operations north of Rusyn Yar and captured the rest of the treeline south of a gulley. They then crossed the gulley and captured positions in the forests outside the chalk quarries.\nTo the west, sometime recently, Ukrainian forces advanced east from Shakhove to a gulley and nearby orchards, along with a forested area, recapturing positions there.\nMeanwhile, Russian forces advanced from the southern part of Volodymyrivka and recaptured most of the rest of the village. Other forces recaptured the treelines south of the Novyy Reservoir, along with the agricultural complex on the eastern outskirts of Volodymyrivka. The Ukrainians are continuing their attempts at cutting off Russian assault groups in western Shakhove. \nTo the southwest, Russian forces crossed the tributary of the Kazenyi Torets River and recaptured the main part of the village of Zatyshok. Ukrainian forces are counterattacking from Sukhetske and the western dachas of Zatyshok towards the eastern dachas.\n+ ~8.08 km² in favour of Russia.\n+ ~2.25 km² in favour of Ukraine.",
      "timestamp": "2025-11-15T19:00:03.461560Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued assault operations in the besieged city of Myrnohrad, capturing new positions in three different areas.\nIn the south, after gaining a foothold in the first few high-rise buildings of the Zapadny District, Russian forces advanced further and captured at least 11 more buildings and are fighting for the area of School No. 9. Additionally, they are attempting to advance further west through the low-rise residential areas to the south, where the grey zone is expanding.\nTo the northeast, Russian forces marginally advanced in the high-rise blocks of eastern Myrnohrad. After bombing Ukrainian positions with FABs, they were able to approach the local school and kindergarten, capturing at least four more high-rise buildings.\nTo the northwest, Russian forces continued to slowly expand their zone of control in northern Myrnohrad. They were able to capture the locomotive depot and enter the abandoned \"Novator\" mine.\n+ ~0.25 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461566Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Russian forces intensified their assault operations in the area of the Donetsk - Dnipropetrovsk regional border and have made important progress in two different areas.\nIn the west, Russian forces advanced west from the village of Molodetske, crossing the border towards Novopidhorodne. They consolidated in the windbreaks on either side of the railway tracks and entrenched in the southeastern houses of Novopidhorodne. They were also able to advance along the treeline north of Molodetske, while other forces enter the forest plantations next to the gulley to the northeast.\nIn the east, Russian forces advanced further north from western Udachne, capturing new treeline positions and entering the western part of the Pokrovsk Coal Mine. Other forces advanced north up the treeline from eastern Udachne to the southern part of the mine, and down the road to the western part of the mine. \n+ ~3.06 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461572Z"
    },
    {
      "original": "In the Novopavlivka and Prosyana directions, Russian forces intensified their assault operations and have made significant progress.\nIn the east, Russian forces advanced further northeast through southern Novopavlivka, reaching the town centre and the bridge over the Solena River. Other forces secured the treelines and agricultural buildings to the south. A mechanised assault was then carried out through the grey-zone down the highway, taking advantage of a gap in the anti-tank ditches and dragon's teeth fortifications. They were able to break into the eastern part of the town and reach the northern outskirts. Consolidation is ongoing in many areas.\nIn the west, after earlier infiltrations by DRGs, Russian forces advanced from western Ivanivka to the large forest east of Havrylivka, where they established control over most of it. Additionally, the Russians advanced south of the Vovcha River from the western outskirts of Zelenyi Hai to the other large forest in the area, establishing control over it. \n+ ~11.61 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461579Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces intensified their assault operations south of the Vovcha River and have captured two villages.\nIn the east, Russian forces advanced further east through Orestopil, capturing the rest of the village. They also advanced north and downhill up the treelines to the Vorona River, establishing control over them and the forest plantations on its southern bank. They also recaptured the village of Sosnivka, which has been partially in the grey zone for some time, and advanced west through the forested areas from Novoselivka and the area of Vorone. Other forces carried out attacks towards the rear of Oleksandrohrad in an attempt to force a Ukrainian withdrawal from the village.\nIn the west, Russian forces widened their spearhead to Orestopil by advancing to and establishing control over part of the nearby gulley. Additionally, they advanced north and downhill up two treelines, before branching off towards the village of Vovche, where they entrenched in the nearby forested area on the southern bank of the Vovcha River. \n+ ~17.39 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461585Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, Russian forces continued to rapidly advance, making substantial progress in four different areas.\nIn the north, after earlier attempts at attacking the village, Russian forces were able to establish full control over Danylivka, physically cutting the Pokrovsk'e - Hulyaipole road. At the same time, they advanced further west through the treelines on the tactical heights south of Danylivka, capturing positions in numerous different treelines, and beginning attacks to the southwest in the direction of Radisne. Other forces advanced south through the treelines west and northwest of Zlahoda, seizing new positions there too.\nTo the south, after capturing Solodke and entering Rivnopillya, Russian forces continued to build on their momentum and advanced for more than 3.3 km through the treelines on the tactical heights to the southwest of Solodke. This was done in conjunction with other forces advancing directly west from Solodke, and through the treelines northwest of Rivnopillya. Meanwhile, the Russians completed the capture of Rivnopillya and Yablukove after approximately two days of fighting, and began advancing further west beyond these two settlements, where they captured new treeline positions towards the rear of Hulyaipole. \nTo the southwest, after capturing Yablukove, Russian forces began a series of attacks along the tactical heights towards the village of Zatyshshya. They were able to advance for around 3 km, bypassing Vesele from the west and approaching the eastern outskirts of Zatyshshya. Other forces levelled the frontline between this new spearhead and the positions north of Vesele. \nIn the south, Russian forces improved their positions northeast of Vesele, reaching the northeastern outskirts of the village and capturing a treeline north of the Hulyaipole - Malynivka Road. They also levelled the frontline east of Vysoke, capturing new positions in eight different treelines. \n+ ~44.86 km² in favour of Russia.",
      "timestamp": "2025-11-15T19:00:03.461592Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 14, 2025\nOn November 14, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-15T19:00:04.196891Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 14, 2025\nOn November 14, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-15T19:00:04.196907Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196917Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196925Z"
    },
    {
      "original": "Over Hundred Russian Drones And Hypersonic Missiles Hit Ukraine Overnight (Videos)\nMultiple hypersonic missiles and over a hundred suicide drones attacked targets in Ukraine over the night of November 14 and 15.\nIn a statement, the Ukrainian Air Force said that three Kinzhal air-launched hypersonic ballistic missiles and 135 suicide drones, mostly from the Geran-type, were launched from Russia. As usual, the air force claimed that most of the projectiles were intercepted by air defenses or jammed by electronic warfare means. However, impacts were reported in at least 13 locations.\nBlasts were heard in the regions of Dnipropetrovsk, Kherson, Donetsk, Kharkiv, as well as Sumy, as in the capital, Kiev, itself.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196934Z"
    },
    {
      "original": "Over Hundred Russian Drones And Hypersonic Missiles Hit Ukraine Overnight (Videos)\nMultiple hypersonic missiles and over a hundred suicide drones attacked targets in Ukraine over the night of November 14 and 15.\nIn a statement, the Ukrainian Air Force said that three Kinzhal air-launched hypersonic ballistic missiles and 135 suicide drones, mostly from the Geran-type, were launched from Russia. As usual, the air force claimed that most of the projectiles were intercepted by air defenses or jammed by electronic warfare means. However, impacts were reported in at least 13 locations.\nBlasts were heard in the regions of Dnipropetrovsk, Kherson, Donetsk, Kharkiv, as well as Sumy, as in the capital, Kiev, itself.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196942Z"
    },
    {
      "original": "Russian Army Captures Yablokovo, Reaches Depth Of Defenses In Novopavlivka (Videos)\nOn November 15, the Russian military captured yet another settlement from Kiev forces in Zaporizhzhia, and broke through Ukrainian defenses inside a large settlement in Dnepropetrovsk.\nThe capture of Yablokovo in Zaporizhzhia by the Vostok [East] Group of Forces was announced by the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 114th Motorised Rifle Regiment of the 5th Combined Arms Army.\nIn addition to the advance in Zaporizhzhia, the Vostok Group of Forces is developing its operations in Novopavlivka in Dnepropetrovsk.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196960Z"
    },
    {
      "original": "Russian Army Captures Yablokovo, Reaches Depth Of Defenses In Novopavlivka (Videos)\nOn November 15, the Russian military captured yet another settlement from Kiev forces in Zaporizhzhia, and broke through Ukrainian defenses inside a large settlement in Dnepropetrovsk.\nThe capture of Yablokovo in Zaporizhzhia by the Vostok [East] Group of Forces was announced by the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 114th Motorised Rifle Regiment of the 5th Combined Arms Army.\nIn addition to the advance in Zaporizhzhia, the Vostok Group of Forces is developing its operations in Novopavlivka in Dnepropetrovsk.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196969Z"
    },
    {
      "original": "Military Situation In Syria On November 15, 2025 (Map Update)",
      "timestamp": "2025-11-15T19:00:04.196973Z"
    },
    {
      "original": "Russian Army Makes Gains In Myrnohrad And Shakhove Near Pokrovsk (Videos)\nOn November 15, the Russian military advanced in two settlements close to Pokrovsk and repelled more Ukrainian counterattacks nearby in Donetsk.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces reportedly made gains in the eastern and northern parts of Myrnohrad, taking over several high-rise buildings. In addition, the Russian Ministry of Defense said in its daily briefing that the group, more specifically the 51st Army, advanced in the Vostochny neighborhood, made gains in the southern part of the large settlement, and approached the Zapadny microdistrict.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196981Z"
    },
    {
      "original": "Russian Army Makes Gains In Myrnohrad And Shakhove Near Pokrovsk (Videos)\nOn November 15, the Russian military advanced in two settlements close to Pokrovsk and repelled more Ukrainian counterattacks nearby in Donetsk.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces reportedly made gains in the eastern and northern parts of Myrnohrad, taking over several high-rise buildings. In addition, the Russian Ministry of Defense said in its daily briefing that the group, more specifically the 51st Army, advanced in the Vostochny neighborhood, made gains in the southern part of the large settlement, and approached the Zapadny microdistrict.\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.196989Z"
    },
    {
      "original": "Military Situation In Ukraine On November 15, 2025 (Maps Update)",
      "timestamp": "2025-11-15T19:00:04.196993Z"
    },
    {
      "original": "Military Situation In Ukraine On November 15, 2025 (Maps Update)",
      "timestamp": "2025-11-15T19:00:04.196997Z"
    },
    {
      "original": "Iran’s Revolutionary Guards Confirms Seizure Of Oil Tanker In Strait Of Hormuz\nIran’s Islamic Revolutionary Guard Corps (IRGC) confirmed on November 15 that it had seized a tanker in the strategic Strait of Hormuz a day earlier.\nThe Talara tanker, sailing under the flag of the Marshall Islands, was travelling from the United Arab Emirates (UAE) to Singapore.\nIn a brief statement carried by the Iranian state-run television, the IRGC stated that “the tanker was in violation for carrying unauthorized cargo.”\nRead more \nHERE",
      "timestamp": "2025-11-15T19:00:04.197005Z"
    }
  ],
  "script_run_time": "2025-11-15T19:00:04.197791Z"
}