{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-27T19:32:10.706700Z"
    },
    {
      "original": "🚀\nПуски КАБів \n➡️\n на Донеччину та Сумщину.",
      "timestamp": "2025-09-27T19:32:10.706721Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Запоріжжя та Сум!",
      "timestamp": "2025-09-27T19:32:10.706728Z"
    },
    {
      "original": "🛵\n  БпЛА у Запорізькій області \n➡️\n на Кушугум.\n🛵\n БпЛА у Сумській області, на  півдні від Конотопу \n➡️\n на Дубовязівку.\n🛵\n БпЛА на сході Чернігівщини \n➡️\n на Сосницю.",
      "timestamp": "2025-09-27T19:32:10.706741Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у Сумській області, на півночі \n➡️\n курсом на захід. Та на заході, в напрямку Чернігівщини.",
      "timestamp": "2025-09-27T19:32:10.706747Z"
    },
    {
      "original": "🛵\n Ударні безпілотники у  Богодухівському районі на Харківщині, курсом на південно-західний напрямок.",
      "timestamp": "2025-09-27T19:32:10.706752Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-27T19:32:10.706758Z"
    },
    {
      "original": "🛵\n БпЛА на сході Полтавщини \n➡️\n на південь.",
      "timestamp": "2025-09-27T19:32:10.706764Z"
    },
    {
      "original": "🛵\n БпЛА з півдня Харківщини, на Дніпропетровщину, Самарівський район.",
      "timestamp": "2025-09-27T19:32:10.706768Z"
    },
    {
      "original": "🚀\nПуски КАБів \n➡️\n на Донеччину.",
      "timestamp": "2025-09-27T19:32:10.706774Z"
    },
    {
      "original": "🛵\n  БпЛА на півдні Харківщини та півночі Дніпропетровщини \n➡️\n на захід.\n🛵\n БпЛА північніше Чернігова \n➡️\n на Любеч.",
      "timestamp": "2025-09-27T19:32:10.706783Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у Донецькій області, Куп'янському та Ізюмському районах. Вектором руху на захід!",
      "timestamp": "2025-09-27T19:32:10.706790Z"
    },
    {
      "original": "🛵\n БпЛА в районі Краснопілля-Тростянець на Сумщині, курсом на південь.",
      "timestamp": "2025-09-27T19:32:10.706795Z"
    },
    {
      "original": "🛵\n Ударні безпілотники у Харківському, Берестинському, Самарівському районах. Також БпЛА в напрямку Харкова! Під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-09-27T19:32:10.706800Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя!",
      "timestamp": "2025-09-27T19:32:10.706805Z"
    },
    {
      "original": "🛵\n У Дніпровському районі Дніпропетровщини БпЛА, курсом на захід.",
      "timestamp": "2025-09-27T19:32:10.706809Z"
    },
    {
      "original": "🛵\n БпЛА  на Харківщині:\n- в центрі на південь;\n- на сході на захід.",
      "timestamp": "2025-09-27T19:32:10.706815Z"
    },
    {
      "original": "🛵\n БпЛА  на сході Дніпропетровщини, курсом південно-західним.",
      "timestamp": "2025-09-27T19:32:10.706819Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.\n⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-27T19:32:10.706828Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-09-27T19:32:10.706833Z"
    },
    {
      "original": "Russian forces have captured the village of Derylove, Lyman direction, Donetsk Oblast.\nPre-war population: ~108.\nTotal land area: ~0.63 km².",
      "timestamp": "2025-09-27T19:32:11.289748Z"
    },
    {
      "original": "\"At this rate, they will reach Kyiv in 465 years\"\n➡️\n Send submissions in the group via this \nlink",
      "timestamp": "2025-09-27T19:32:11.289765Z"
    },
    {
      "original": "In the Pokrovske and Hulyaipole directions, Russian forces continue to rapidly advance west towards the Yanchur River, making new progress in three areas.\nIn the south, Russian forces continue approach the chain of settlements along the Yanchur River, advancing further along the treelines on the tactical heights north of Olhivske, and improving their positions along the heights southwest of Novoivanivka. \nFurther north, the Russians advanced north from Novoivanivka capturing additional treelines and supporting the assault operations to Novohryhorivka. Deep advances were made along the gulley on the Dnipropetrovsk - Zaporizhzhia Regional Border, with Russian forces approaching the rear of Novohryhorivka. \nIn Dnipropetrovsk Oblast, after taking Novomykolaivka, Russian forces stormed the eastern outskirts of Kalynivske, while aviation and artillery worked on the main Ukrainian defensive nodes in the area. This collapsed the Ukrainian defense of the flanks and allowed for the Russians to quickly take the lightly defended village of Kalynivske, as well as the adjacent fortifications. The fall of Kalynivske allowed for Russian forces to push along the treelines on the tactical heights to the south, and level the front south of Kalynivske. They were also able to capture positions northwest and north of Kalynivka in the forests and treelines in the low-lying ground, approaching Stepove from the south. \nIn the north, Russian forces continued to develop their offensive in the area of Sosnivka. They were able to capture another treeline north of Berestove, and secured a series of treeline intersections northwest of Ternove, forcing a Ukrainian withdrawal from the salient south of Sosnivka. \n+ ~39.80 km² in favour of Russia.",
      "timestamp": "2025-09-27T19:32:11.289778Z"
    },
    {
      "original": "❗️\nNew Zealand will not recognize 'Palestinian state' now, 'question of when, not if'\nNew Zealand will not recognize a 'Palestinian state' for now but remains committed to pursuing a 'two-state solution,' Foreign Minister Winston Peters said.\n“With a war raging, Hamas remaining the de facto government of Gaza, and no clarity on next steps, too many questions remain about the future state of Palestine for it to be prudent for New Zealand to announce recognition at this time,” Peters stated in a speech at the UN General Assembly in New York on Friday.\n“We are also concerned that a focus on recognition, in the current circumstances, could complicate efforts to secure a ceasefire by pushing Israel and Hamas into even more intransigent positions,\" he added.\nPrime Minister Christopher Luxon said in Auckland today that \"recognition of Palestinian statehood is a question of when, not if.\"",
      "timestamp": "2025-09-27T19:32:11.289788Z"
    },
    {
      "original": "Russia is finishing its final preparations for the next large-scale combined missile attack on Ukraine. \nYesterday, 5 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast to Olenya Airbase, Murmansk Oblast. 2 of these aircraft were equipped with Kh-101 cruise missiles at Ukrainka, while the other 3 have since been equipped with missiles at Olenya. \n1 Tu-95MS and 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast. The Tu-160 was equipped with missiles at Ukrainka, while the Tu-95MS has since been equipped at Engels-2 and is currently in the air, flying to Olenya Airbase. Thus, 6 Tu-95MS bombers and 1 Tu-160 bomber are known to be equipped with cruise missiles. \nInterestingly, the Black Sea Fleet has seemingly completed loading of Kalibr cruise missiles before the completion of Tu-95MS/160 preparations, despite possible delays from Ukraine's UAV attacks on Novorossiysk Naval Base in Krasnodar Krai. \nAdditionally, Geran-2/3 and Gerbera drone accumulation has been continuing as normal, with daily Geran-2/3drone launches not exceeding 100 since the last attack. \nThe most likely time for a missile attack is the night of 28 September to the morning of the 29 September, but it could even take place as early as tonight.",
      "timestamp": "2025-09-27T19:32:11.289798Z"
    },
    {
      "original": "So far, launches of Geran-2/Gerbera drones were recorded from Millerovo Airbase, Rostov Oblast, and Khalino Airbase, Kursk Oblast. Most were Gerbera (decoy) drones, also Bakhmach in Chernihiv Oblast was attacked by Gerans earlier. \nSome drones are still being detected in southern Chernhiv Oblast, but these are likely Gerberas.",
      "timestamp": "2025-09-27T19:32:11.289803Z"
    },
    {
      "original": "So far, launches of Geran-2/Gerbera drones were recorded from Millerovo Airbase, Rostov Oblast, and Khalino Airbase, Kursk Oblast. Most were Gerbera (decoy) drones, also Bakhmach in Chernihiv Oblast was attacked by Gerans earlier.   Some drones are still being…",
      "timestamp": "2025-09-27T19:32:11.289807Z"
    },
    {
      "original": "Likely no missile attack tonight, but I will update if anything changes.",
      "timestamp": "2025-09-27T19:32:11.289811Z"
    },
    {
      "original": "The chaotic situation in the Dobropilla direction continues, with both Russian and Ukrainian forces continuing their attempts at encircling each other.\nInterestingly, despite being nearly cut off, Russian forces are continuing their assault operations in the salient and have been advancing. Russian forces have been slowly pushing towards the northern edge of Doroznje, and were geolocated at the clay mine. Unconfirmed (but plausible) reports state that Doroznje has come back under Russian control, and that Russian forces have re-secured the northern part of Nykanorivka. If true, Ukrainian forces are at great risk of being encircled here. \nMeanwhile, Ukrainian forces continued to attack. They have entered the centre of Boikivka, and carried out unsuccessful attacks on northern Zatyshok after advancing down a treeline in the grey zone. Russian forces are slowly pushing the Ukrainians back out of northern Novotoretske, and continue their attacks on western Nove Shakhove.",
      "timestamp": "2025-09-27T19:32:11.289817Z"
    },
    {
      "original": "In the Prosyana direction, Russian forces continue to advance in the village of Ivanivka, further expanding their bridgehead on the northern bank of the Vovcha River.\nAfter establishing a foothold in the easternmost houses of Ivanivka, Russian reinforcements were able to be brought in over the river, allowing for the exploitation of the initial bridgehead to take place. Russian forces pushed northwest to the main section of the eastern part of Ivanivka, capturing additional positions in the houses there and along the northern bank of the Vovcha River. \n+ ~2.76 km² in favour of Russia.",
      "timestamp": "2025-09-27T19:32:11.289823Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, at some point over the pastfew weeks, Ukrainian forces were able to completely push the Russians out of the city of Rodynske. \nEarlier, Russian forces attempted a series of assault operations in various parts of the city, attempting to break into the city centre. Ukrainian reinforcements were brought in and kill-zones with FPV drones were formed in the low-rise residential areas. As a result, despite incredibly intense FAB glide-bomb and artillery bombardment of Rodynske and the surrounding areas, Russia failed to breach Ukrainian lines here. \nUkrainian forces in turn began their own series of counterattacks. Utilising their superior forward deployment points in stronger and larger high-rise buildings, the Ukrainians cleared Russian soldiers from the eastern and northern parts of the city, as well as the area of the train station. \nMeanwhile, Russian forces continued their attacks in the area of the highway, near the pig farms south of Rodynske.\n+ ~1.64 km² in favour of Ukraine.",
      "timestamp": "2025-09-27T19:32:11.289831Z"
    },
    {
      "original": "YouTuber logic.\nLet's not apply equal standards....",
      "timestamp": "2025-09-27T19:32:11.289835Z"
    },
    {
      "original": "⚡\n🇷🇺\n🇺🇦\n One of the Ukrainian USV that participated on the attack on Tuapse was found washed ashore.\nThis drone is a FPV drone carrier, with cells to launch fiber optic drones. No POV of the drones was released from the Ukrainian side, it's unknown if another USV managed to launch its FPV, and what was the target.\n@wfwitness",
      "timestamp": "2025-09-27T19:32:11.289844Z"
    },
    {
      "original": "⚡\n🇷🇺\n🇺🇦\n One of the Ukrainian USV that participated on the attack on Tuapse was found washed ashore.\nThis drone is a FPV drone carrier, with cells to launch fiber optic drones. No POV of the drones was released from the Ukrainian side, it's unknown if another USV managed to launch its FPV, and what was the target.\n@wfwitness",
      "timestamp": "2025-09-27T19:32:11.289852Z"
    },
    {
      "original": "Likely no missile attack tonight, but I will update if anything changes.",
      "timestamp": "2025-09-27T19:32:11.289855Z"
    },
    {
      "original": "There is a very small Geran-2 drone attack on Ukraine tonight. This, plus other developments indicates that the large-scale missile attack will be tomorrow night.",
      "timestamp": "2025-09-27T19:32:11.289859Z"
    },
    {
      "original": "Possible combat-related activity has been recorded on two frequencies related to Russian strategic aviation. Possible missile attack tonight. \nMore to come.",
      "timestamp": "2025-09-27T19:32:11.289863Z"
    },
    {
      "original": "Possible combat-related activity has been recorded on two frequencies related to Russian strategic aviation. Possible missile attack tonight.   More to come.",
      "timestamp": "2025-09-27T19:32:11.289867Z"
    },
    {
      "original": "Reminder: 6 Tu-95MS and 1 Tu-160 are equipped with Kh-101 cruise missiles. \nThe Tu-95MS are at Olenya Airbase, while the Tu-160 is at Engels-2.",
      "timestamp": "2025-09-27T19:32:11.289871Z"
    },
    {
      "original": "Possible combat-related activity has been recorded on two frequencies related to Russian strategic aviation. Possible missile attack tonight.   More to come.",
      "timestamp": "2025-09-27T19:32:11.289875Z"
    },
    {
      "original": "Activity is confirmed to be combat-related. There will likely be a missile attack tonight.",
      "timestamp": "2025-09-27T19:32:11.289878Z"
    },
    {
      "original": "1 Tu-160 has entered Saratov Oblast after taking off from Ukrainka Airbase earlier. It is redeploying to Engels-2 Airbase, possibly after being equipped with missiles.",
      "timestamp": "2025-09-27T19:32:11.289882Z"
    }
  ],
  "script_run_time": "2025-09-27T19:32:11.739513Z"
}