{
  "messages": [
    {
      "original": "🛵\n Київщина: БпЛА \n➡️\n на Обухів.",
      "timestamp": "2025-12-05T20:17:03.029029Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-05T20:17:03.029045Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Харкова та Сум.",
      "timestamp": "2025-12-05T20:17:03.029052Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Харкова та Сум.",
      "timestamp": "2025-12-05T20:17:03.029057Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Терни та Боромлю у напрямку Полтавщини. \n🛵\n Чернігівщина: БпЛА \n➡️\n через Мену та Бахмач.\n🛵\n Житомирщина: БпЛА \n➡️\n повз Попільню у західному напрямку.",
      "timestamp": "2025-12-05T20:17:03.029069Z"
    },
    {
      "original": "🚀\nПуски КАБ \n➡️\n на Запорізьку область!",
      "timestamp": "2025-12-05T20:17:03.029079Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на півдні Сумщини, курс - південно-західний;\n🛵\n БпЛА на півночі та на північному сході Чернігівщини, курс - південно-західний;\n🛵\n БпЛА на сході Полтавщини, курс - південно-західний;\n🛵\n БпЛА на заході Харківщини, курс - південний;\n🛵\n БпЛА на Житомирщині в напрямку Чуднова з південного сходу.",
      "timestamp": "2025-12-05T20:17:03.029090Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку н.п.Сосниця, Сновськ, Седнів, Городня;\n🛵\n БпЛА на Сумщині в напрямку н.п.Буринь, Низи, Чупахівка;\n🛵\n БпЛА на заході Харківщини в напрямку Полтавщини та Дніпропетровщини;\n🛵\n БпЛА на сході Полтавщини в напрямку Полтави.",
      "timestamp": "2025-12-05T20:17:03.029099Z"
    },
    {
      "original": "🛵\n БпЛА на заході та північному заході від Чернігова, курс - південний/південно-західний.",
      "timestamp": "2025-12-05T20:17:03.029103Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з південного заходу.",
      "timestamp": "2025-12-05T20:17:03.029108Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА, ймовірно, розвідувальний, на півдні від м.Запоріжжя. Залучено засоби для збиття.",
      "timestamp": "2025-12-05T20:17:03.029114Z"
    },
    {
      "original": "🛵\n \n🛸\nБпЛА  на сході Київщини в напрямку н.п.Бориспіль/Бровари;\n \n🛵\n🛸\n БпЛА в напрямку Чернігова, н.п.Гончарівське;\n🛵\n🛸\n БпЛА з Харківщини на північ Дніпропетровщини;\n🛵\n БпЛА на сході Харківщини, курс - західний/південно-західний.",
      "timestamp": "2025-12-05T20:17:03.029127Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n в напрямку Дніпра/Кам'янського.",
      "timestamp": "2025-12-05T20:17:03.029132Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n в напрямку Чернігова з півночі.",
      "timestamp": "2025-12-05T20:17:03.029138Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА \n➡️\n в напрямку Харкова з півночі.",
      "timestamp": "2025-12-05T20:17:03.029147Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Чернігівщині в районі Чернігова та н.п.Славутич, Ріпки, Березна;\n🛵\n🛸\n БпЛА на Дніпропетровщині в напрямку н.п.Просяна, Шахтарське, Васильківка;\n🛵\n🛸\n БпЛА на півдні Донеччини, курс - західний/північно-західний.",
      "timestamp": "2025-12-05T20:17:03.029157Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА, ймовірно, розвідувальний, на Сумщині в напрямку н.п.Терни з північного сходу. Залучено засоби для збиття.",
      "timestamp": "2025-12-05T20:17:03.029163Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-05T20:17:03.029171Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Сумщині північніше н.п.Кролевець, курс - західний (Чернігівщина, вектор - н.п.Короп).",
      "timestamp": "2025-12-05T20:17:03.029177Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-05T20:17:03.029182Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку н.п.Миколаївка/Улянівка, Тростянець, Буринь, Кролевець, курс - західний/південно-західний.",
      "timestamp": "2025-12-05T20:17:03.029186Z"
    },
    {
      "original": "A Russian Gerbera reconnaissance drone is currently scouting out the Darnytsia Power Plant in Kyiv.",
      "timestamp": "2025-12-05T20:17:03.804118Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Nykanorivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~469.\nTotal land area: ~1.38 km².\nThe second battle for Nykanorivka lasted approximately 3 months, 20 days.",
      "timestamp": "2025-12-05T20:17:03.804133Z"
    },
    {
      "original": "The IDF claimed that its recent airstrikes on the city of Rafah, southern Gaza, killed the commander of Hamas' East Rafah Battalion Muhammad al-Bawab, along with his deputy commander, a regional company commander of the battalion, and a security guard from the battalion.\nThe East Rafah Battalion is one of four battalions which makes up Hamas' Rafah Brigade, operating in and around the Rafah Governorate in the southern Gaza Strip. \nThe Rafah Brigade has been heavily degraded over the past two years and has lost most of its combat capabilities due to Israel's Rafah offensive. The IDF's continued operations in the southern part of the Gaza Strip have forced it to largely relocate its command structures to the neighbouring Khan Younis Governorate, with some cells still operating in Rafah due to the implementation of the ceasefire agreement.",
      "timestamp": "2025-12-05T20:17:03.804139Z"
    },
    {
      "original": "Hamas' \"Radea\" security force announced that a local Palestinian clan killed Yasser Abu Shabab, the commander of the Israeli-backed \"Popular Forces\" militia, along with a number of other militants. \nThe Popular Forces is a local Gazan militia made up of anti-Hamas Palestinians, and operates in eastern Rafah. It has cooperated with the IDF, carrying out security operations, in return for safety in its small pocket of territory containing its barracks (as indicated in the pink polygon on the map.",
      "timestamp": "2025-12-05T20:17:03.804143Z"
    },
    {
      "original": "Hamas' \"Radea\" security force announced that a local Palestinian clan killed Yasser Abu Shabab, the commander of the Israeli-backed \"Popular Forces\" militia, along with a number of other militants. \nThe Popular Forces is a local Gazan militia made up of anti-Hamas Palestinians, and operates in eastern Rafah. It has cooperated with the IDF, carrying out security operations, in return for safety in its small pocket of territory containing its barracks (as indicated in the pink polygon on the map.",
      "timestamp": "2025-12-05T20:17:03.804148Z"
    },
    {
      "original": "From now on, all outspoken Zionists and Resistance supporters will receive harsher punishments when breaking rules in the chat. \nWe are NOT about to turn into a low-IQ channel of people constantly insulting each other.",
      "timestamp": "2025-12-05T20:17:03.804152Z"
    },
    {
      "original": "Last night, approximately 25 Russian Geran-2 drones attacked an unknown military-related target in the town of Turbiv, Vinnytsia Oblast. Whatever they were targeting only recently arrived in the town. A large fire is now burning at the impact site.",
      "timestamp": "2025-12-05T20:17:03.804158Z"
    },
    {
      "original": "Last night, approximately 25 Russian Geran-2 drones attacked an unknown military-related target in the town of Turbiv, Vinnytsia Oblast. Whatever they were targeting only recently arrived in the town. A large fire is now burning at the impact site.",
      "timestamp": "2025-12-05T20:17:03.804162Z"
    },
    {
      "original": "Overnight, Russia carried out another large-scale Geran-2 drone attack on Kharkiv Oblast.\nAt least 4 Gerans attacked an unknown enterprise in the Osnovianskyi District of Kharkiv City. A large fire broke out as a result.\nAt least 11 Gerans attacked the city of Chuhuiv. Some impacted the base of the 92nd Separate Assault Brigade (49.84246, 36.72763), while others targeted an industrial enterprise which is \"officially non-operational\".",
      "timestamp": "2025-12-05T20:17:03.804167Z"
    },
    {
      "original": "Overnight, Russia carried out another large-scale Geran-2 drone attack on Kharkiv Oblast.\nAt least 4 Gerans attacked an unknown enterprise in the Osnovianskyi District of Kharkiv City. A large fire broke out as a result.\nAt least 11 Gerans attacked the city of Chuhuiv. Some impacted the base of the 92nd Separate Assault Brigade (49.84246, 36.72763), while others targeted an industrial enterprise which is \"officially non-operational\".",
      "timestamp": "2025-12-05T20:17:03.804172Z"
    },
    {
      "original": "Russian forces have captured the city of Vovchansk, Vovchansk direction, Kharkiv Oblast.\nPre-war population: ~17,459.\nTotal land area: ~26.00 km²\nThe fighting for Vovchansk lasted approximately 1 year, 7 months, 1 day.",
      "timestamp": "2025-12-05T20:17:03.804177Z"
    },
    {
      "original": "Russian forces have captured the city of Vovchansk, Vovchansk direction, Kharkiv Oblast.  Pre-war population: ~17,459. Total land area: ~26.00 km²  The fighting for Vovchansk lasted approximately 1 year, 7 months, 1 day.",
      "timestamp": "2025-12-05T20:17:03.804181Z"
    },
    {
      "original": "Vovchansk direction \n➡️\n Bilyi Kolodyaz direction",
      "timestamp": "2025-12-05T20:17:03.804185Z"
    },
    {
      "original": "UKMTO reports that 15 small boats approached a vessel 15 Nautical Miles west of Yemen and engaged in an exchange of fire. \nThe boats have since left the scene, and the vessel is continuing on its journey towards its next port. No casualties are reported.",
      "timestamp": "2025-12-05T20:17:03.804189Z"
    },
    {
      "original": "The Ukrainian General Staff map still shows 100% of Pokrovsk, 100% of Myrnohrad, and 100% of Rodynske under Ukrainian control \n🤣\n🤣\n🤣",
      "timestamp": "2025-12-05T20:17:03.804197Z"
    },
    {
      "original": "Tonight there will be a large-scale, combined Russian missile and drone attack on Ukraine. \nAt least 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast. 3 landed at Diaghilev Airbase, Ryazan Oblast, and 1 landed at Engels-2 Airbase, Saratov Oblast. All are equipped with Kh-101 cruise missiles.\n1-2 Varshavyanka submarines are equipped with Kalibr cruise missiles at Novorossiysk Naval Base, Krasnodar Krai. There are likely other surface carriers which are also equipped.\nDeliveries of Iskander-M ballistic missiles have taken place to OTRK installations in Kursk, Voronezh, Bryansk, and Rostov Oblast.\nLaunches of Geran-2 drones are taking place. At least 500 Gerans have been accumulated at various launch sites and are expected to be used in Ukraine.",
      "timestamp": "2025-12-05T20:17:03.804204Z"
    },
    {
      "original": "Tonight there will be a large-scale, combined Russian missile and drone attack on Ukraine.   At least 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast. 3 landed at Diaghilev Airbase, Ryazan Oblast, and 1 landed at Engels-2 Airbase…",
      "timestamp": "2025-12-05T20:17:03.804207Z"
    },
    {
      "original": "Currently, communications on strategic frequencies between Diaghilev Airbase, Engels-2 Airbase, and Moscow have been recorded. \nThere likely won’t be any departures of Tu-95MS for at least the next 4 hours.",
      "timestamp": "2025-12-05T20:17:03.804211Z"
    },
    {
      "original": "Launches of Geran-2 drones have been recorded (not all confirmed) from:\nKhalino Airbase, Kursk Oblast (x2).\nNavlya Test site, Bryansk Oblast (x1).\nMillerovo Airbase, Rostov Oblast (x1).\nTsumbulova Test Site, Oryol Oblast (x1).\nHvardiiske Training Ground, Crimea (x1).\nKacha Airbase, Crimea (x1).\nPrimorsko-Akhtarsk Airbase, Krasnodar Krai (x1).\nCape Chauda, Crimea (x1).",
      "timestamp": "2025-12-05T20:17:03.804219Z"
    },
    {
      "original": "The airspace over the launch lines for MiG-31Ks has been closed in Lipetsk, Tambov, and Ryazan Oblasts. \nLaunches of Kinzhal hypersonic aeroballistic missiles are expected in the coming hours.",
      "timestamp": "2025-12-05T20:17:03.804223Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 4, 2025\nOn December 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-05T20:17:04.597680Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 4, 2025\nOn December 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-05T20:17:04.597696Z"
    },
    {
      "original": "Iranian Drones Tracked U.S. Warship During Live-Fire Drills (Video)\nIran’s Islamic Revolutionary Guard Corps (IRGC) Navy on December 4 kicked off a two-day naval exercise, issuing warnings to United States warships operating in waters near the Islamic Republic.\nThe exercise is named after Mohammad Nazeri, a commander of the elite commando units of the IRGC Navy who lost his life in 2016. It is taking place in the Persian Gulf, the Hormuz Strait, the Sea of Oman, and the islands of Abu Musa, Greater Tunb, Lesser Tunb, and Siri.\nIranian state TV reported the exercise showcases the “sacrifice and spirit of resistance” of the IRGC’s naval forces “to confront any threat” against Iran following the 12-day war with Israel last June.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597707Z"
    },
    {
      "original": "U.S. Hits Another Alleged Drug Boat As Trump Renews Threats Of Land Strikes On Venezuela (Video)\nThe United States military on December 4 conducted another deadly strike on an alleged drug smuggling boat in the Eastern Pacific Ocean, killing four.\nIn a statement, the U.S Southern Command (SOUTHCOM) said that the strike was carried out by the Joint Task Force Southern Spear at the direction of Secretary of Defense Pete Hegseth.\n“Intelligence confirmed that the vessel was carrying illicit narcotics and transiting along a known narco-trafficking route in the Eastern Pacific. Four male narco-terrorists aboard the vessel were killed,” the command added.\nThis was the 22nd alleged drug boat to be hit by SOUTHCOM since the U.S. military began its campaign against drug cartels in the Eastern Pacific and the Caribbean Sea last September. Including the last casualties, the campaign has so far claimed the lives of at least 83 people, all alleged drug traffickers.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597717Z"
    },
    {
      "original": "Europe’s Arms Makers: The Key Beneficiaries of War, the Blockers of Peace\nOn December 2, Russian President Vladimir Putin outlined whom he considers responsible for obstructing a peaceful resolution to the war in Ukraine. According to him, despite what he described as clear interest from both Moscow and Washington in ending the conflict, the European Union has repeatedly derailed potential agreements.\n“Even when they try to amend Trump’s proposals, it is obvious that all these changes are aimed at one thing: blocking the entire peace process,” he said.\nBrussels’ assessment of the situation has also drawn criticism. EU foreign policy chief Kaja Kallas stated that Russia must reduce its military budget and limit the size of its armed forces—effectively demanding the “demilitarization” of Moscow as the principal geopolitical rival. Given the realities on the front line, such expectations appear unrealistic. Yet these statements are not merely rhetorical. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597726Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597736Z"
    },
    {
      "original": "Russian Strikes Soften Ukrainian Defenses In Huliaipole Ahead Of Large Assault (Videos)\nThe Russian military has intensified strikes on the key city of Huliaipole and its outskirts in Zaporozhye likely in preparation of a large-scale assault, videos from December 5 and previous days show.\nIn the last few days, the Vostok [East] Group of Forces, which leads operations in this direction, captured the last two settlements to the east of Huliaipole, Zelenyi Hai and Vysoke, from Kiev forces.\nThe group also broke through Ukrainian defenses along the Haichur River to the north of the city, capturing Dobropillya and storming Varvarivka. Fierce fighting is currently taking place in the latter, with preliminary reports indicating that at least the northern part of the large settlement has been already secured.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597744Z"
    },
    {
      "original": "When Morale Breaks: Inside Ukraine’s Failing War Machine\nThe Russian army’s strategy is gradually bearing fruit. The Ukrainian army’s tactical crises are turning into operational ones. Four years of intense conflict are taking their toll on Ukrainian troops. They are becoming less and less motivated to fight.\nHigh-intensity armed conflicts cannot last for decades. The examples of World Wars I and II confirm this, as one of the warring parties suffered defeat due to the depletion of necessary resources. For countries waging wars of this type, having vital reserves is critically important. This was one of the key reasons for Germany’s defeat.\nRussia and Ukraine’s military capabilities are not comparable in scale. Even disregarding nuclear weapons, Kyiv’s conventional forces are significantly inferior to Moscow’s. However, besides troops, dozens of factors determine the success of a war. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597753Z"
    },
    {
      "original": "Russian Army Broke Through Key Ukrainian Defense Line In Siversk\nOn December 5, the Russian military’s Yug [South] Group of Forces broke through a key Ukrainian defense line within the city of the Siversk in Donetsk.\nThe line, which includes strong fortifications, lies along the eastern part of Siversk. After breaking through the line, Russian troops managed to expand their control in the eastern part of the city, even reaching the multi-story residential area on Energetikov Street which oversees all nearby areas.\nFollowing the breakthrough, some Ukrainian news sources began to sound the alarm over the catastrophic situation in Siversk.\nUkrainian troops held up in the city lost their last main supply route a few days earlier when the Yug Group of Forces stormed Sviato-Pokrovske to the south and cut the T-05-13 road. The city is not besieged yet, but bringing in supplies is getting harder by the day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597770Z"
    },
    {
      "original": "Russian Army Broke Through Key Ukrainian Defense Line In Siversk\nOn December 5, the Russian military’s Yug [South] Group of Forces broke through a key Ukrainian defense line within the city of the Siversk in Donetsk.\nThe line, which includes strong fortifications, lies along the eastern part of Siversk. After breaking through the line, Russian troops managed to expand their control in the eastern part of the city, even reaching the multi-story residential area on Energetikov Street which oversees all nearby areas.\nFollowing the breakthrough, some Ukrainian news sources began to sound the alarm over the catastrophic situation in Siversk.\nUkrainian troops held up in the city lost their last main supply route a few days earlier when the Yug Group of Forces stormed Sviato-Pokrovske to the south and cut the T-05-13 road. The city is not besieged yet, but bringing in supplies is getting harder by the day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597783Z"
    },
    {
      "original": "U.S. Strategy Shift and Russian-Ukrainian Strikes on December 4-5 (Videos) \nOn December 4-5, Russian and Ukrainian forces continued to exchange strikes. According to the Russian Defense Ministry, during the night of December 5, Russian air defense systems intercepted and destroyed 41 Ukrainian unmanned aerial vehicles over several regions. A statement from the Ukrainian Air Force reported that on the same night, Russia employed 137 attack UAVs, of which 80 were shot down or suppressed by Ukrainian air defense and electronic warfare assets.\nThese developments unfolded against the backdrop of the published update to the U.S. National Security Strategy, wherein Washington's foreign policy priorities were revised. According to the document, the U.S. administration considers achieving a swift end to the conflict in Ukraine to be a vital interest, aimed at stabilizing the European economy, preventing escalation, and restoring strategic stability in relations with Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597791Z"
    },
    {
      "original": "U.S. Strategy Shift and Russian-Ukrainian Strikes on December 4-5 (Videos) \nOn December 4-5, Russian and Ukrainian forces continued to exchange strikes. According to the Russian Defense Ministry, during the night of December 5, Russian air defense systems intercepted and destroyed 41 Ukrainian unmanned aerial vehicles over several regions. A statement from the Ukrainian Air Force reported that on the same night, Russia employed 137 attack UAVs, of which 80 were shot down or suppressed by Ukrainian air defense and electronic warfare assets.\nThese developments unfolded against the backdrop of the published update to the U.S. National Security Strategy, wherein Washington's foreign policy priorities were revised. According to the document, the U.S. administration considers achieving a swift end to the conflict in Ukraine to be a vital interest, aimed at stabilizing the European economy, preventing escalation, and restoring strategic stability in relations with Russia. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-05T20:17:04.597799Z"
    },
    {
      "original": "A WAR OF EXHAUSTION: RUSSIA PUSHES FORWARD AS UKRAINE'S RESERVES RUN THIN",
      "timestamp": "2025-12-05T20:17:04.597803Z"
    }
  ],
  "script_run_time": "2025-12-05T20:17:04.598707Z"
}