{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-11-22T17:53:22.641040Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на південний захід\\північ.",
      "timestamp": "2025-11-22T17:53:22.641060Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на південно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-22T17:53:22.641068Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщину та Запоріжжя.",
      "timestamp": "2025-11-22T17:53:22.641073Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Донеччини \n➡️\n курсом на Харківщину.\n🛵\n Група БпЛА на сході Дніпропетровщини \n➡️\n курсом на північний захід.\n🛵\n Група БпЛА на Запоріжжі \n➡️\n курсом на південний захід, південь.",
      "timestamp": "2025-11-22T17:53:22.641087Z"
    },
    {
      "original": "⚠\nУВАГА\n🛫\n Активність ворожої тактичної авіації на східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-22T17:53:22.641096Z"
    },
    {
      "original": "🛵\n Група БпЛА з Чорного моря \n➡️\n на Одещину, Миколаївщину!\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Павлоград.\n🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на Чугуїв.",
      "timestamp": "2025-11-22T17:53:22.641109Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n курсом на Чорноморськ, Одесу, Чорноморське, Південне!",
      "timestamp": "2025-11-22T17:53:22.641119Z"
    },
    {
      "original": "🛸\n В районі Запоріжжя, Кривого Рогу - розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-11-22T17:53:22.641124Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-11-22T17:53:22.641128Z"
    },
    {
      "original": "🛵\n БпЛА з Курської обл., рф \n➡️\n на північ Сумщини.",
      "timestamp": "2025-11-22T17:53:22.641137Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n курсом на Чорноморськ!",
      "timestamp": "2025-11-22T17:53:22.641143Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-11-22T17:53:22.641147Z"
    },
    {
      "original": "🛵\n БпЛА з Курської обл., рф \n➡️\n на північ Сумщини.",
      "timestamp": "2025-11-22T17:53:22.641153Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини.",
      "timestamp": "2025-11-22T17:53:22.641159Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини.",
      "timestamp": "2025-11-22T17:53:22.641165Z"
    },
    {
      "original": "🛵\n Полтавщина: групи БпЛА \n➡️\n у напрямку Миргорода.",
      "timestamp": "2025-11-22T17:53:22.641170Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n курсом на Чорноморськ!",
      "timestamp": "2025-11-22T17:53:22.641176Z"
    },
    {
      "original": "🛵\n Ще група БпЛА із акваторії Чорного моря \n➡️\n у бік Одещини/Миколаївщини.",
      "timestamp": "2025-11-22T17:53:22.641182Z"
    },
    {
      "original": "🛵\n Ще група БпЛА із акваторії Чорного моря \n➡️\n у бік Одещини/Миколаївщини.",
      "timestamp": "2025-11-22T17:53:22.641187Z"
    },
    {
      "original": "🛵\n Миколаївщина: БпЛА \n➡️\n повз Березанку на північ.",
      "timestamp": "2025-11-22T17:53:22.641192Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини.",
      "timestamp": "2025-11-22T17:53:22.641198Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА із Сумщини \n➡️\n на Полтавщину. Повз Гадяч \n➡️\n у напрямку Миргорода.",
      "timestamp": "2025-11-22T17:53:22.641207Z"
    },
    {
      "original": "🛵\n Нова група БпЛА із акваторії Чорного моря \n➡️\n у напрямку Одещини.",
      "timestamp": "2025-11-22T17:53:22.641213Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n у бік Славгорода.",
      "timestamp": "2025-11-22T17:53:22.641220Z"
    },
    {
      "original": "Regarding the situation in Siversk:\nRecently, there have been a lot of differing claims from various sources about the situation in this critical city. Some are claiming that Russia has broken through and captured large parts of the city, while others say the situation is under control for Ukraine. Based on the information I have gathered, I can come to a somewhat conclusive position on what the true situation is here.\nFirstly, one major correction was made to the map. It turns out that previous Russian attempts to seize a series of Ukrainian strongpoints southeast of Siversk in September and October failed, with Ukrainian forces retaining control over important positions on the tactical heights there. The Russians instead opted to bypass these areas, advancing along the railway line and from the area of Verkhnokamyanske. \nOver the last week, attacks intensified. Russian forces assaulted and captured Ukrainian positions on the treeline leading to the southeastern edge of Siversk, which they then used to infiltrate into the city. A number of Russian soldiers scattered in the houses there, leaving the Ukrainian strongpoints to the southeast in an operational encirclement. \nHowever, the main vector of attack on Siversk took place from the south. A number of Russians on motorcycles broke into the southern part of the city, which was already in the grey zone. The surviving infantry then advanced north towards the city centre, scattering in additional residential areas and linking up with the forces from the east. This was achieved with minimal resistance from Ukrainian soldiers on the ground due to Ukrainian manpower shortages inside the city itself, as well as new logistical problems which Ukraine is facing due to recent Russian advances on the flanks. \nDespite this small number of Ukrainian soldiers, a massive number of drones remain in the sky as usual, monitoring every movement and striking anything that moves. Russia deployed only a small number of soldiers in these attacks (likely 30-50, not including already established positions on the southern outskirts), which is not enough to consolidate larger areas and bring in additional supplies and reinforcements. Naturally, due to a lack of Ukrainian manpower, drone operators are now attempting to pick off the Russian soldiers to prevent any consolidation, ahead of small assault groups moving in. Currently, only a portion of the Russian soldiers have been killed/wounded, and work is underway to find the rest of them. Earlier strikes mainly took place in the southern parts of the city but are now moving further north to hit the Russians who penetrated deeper. \nMeanwhile to the south of Siversk, Russian forces have made new advances in Zvanivka. They captured at least 60% of the village, reached its western edge, and are now trying to push further north and consolidate on its northern edge. Advances also took place downhill from the tactical heights next to the railway line, forcing the remaining Ukrainian soldiers still in the salient northeast of Pereizne to withdraw.",
      "timestamp": "2025-11-22T17:53:23.457545Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on the Orlivka Gas Compresser Station in southern Odesa Oblast near the border with Romania. \nApproximately 38 drones took part in the attack, most/all of which impacted. \nCoordinates: 45.30433, 28.54219",
      "timestamp": "2025-11-22T17:53:23.457560Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on the Orlivka Gas Compresser Station in southern Odesa Oblast near the border with Romania. \nApproximately 38 drones took part in the attack, most/all of which impacted. \nCoordinates: 45.30433, 28.54219",
      "timestamp": "2025-11-22T17:53:23.457570Z"
    },
    {
      "original": "Russia is winning the war; therefore any peace negotiations will favour them.\nPeople are so hooked up on hopium, and are looking at this from an idealist point of view. War doesn't work like a Hollywood movie where the good guys win and the bad guys lose. The stronger side wins and the weaker side loses - at least in a war of attrition. \nThe fact that people think THIS plan is unacceptable to Ukraine is insane to me and shows how delusional many have gotten. With how things are going, in the next year and a half Ukraine likely will have been defeated. \nEven for people who see this war as a linear \"Russia took X number of kilometres in Y amount of time, therefore it will take 200 years for them to get to Kyiv\" are being proven wrong by reality now. Using that logic, at this current rate of advance, Russia will reach the Dnipro River at Zaporizhzhia City (a city of over 700k people) in less than a year. The linear claim used to be 90 years, or 1,000 years. \n\"Oh, but Russia could just leave, why should Ukraine cede territory!\" Trump could also resign today, Elon Musk could donate $50 Billion to charity. The amount of brain rotting shit that people try to portray as actual arguments is mind numbing.\nThis isn't how war works. Why would Russia leave? They are winning and know they will win if they keep pushing. People are seriously conflating reality with their perception of an ideal situation, and the fact that this opinion is so widely accepted and promoted is proof of what emotional attachments to entities (Ukraine), and propaganda can do.",
      "timestamp": "2025-11-22T17:53:23.457579Z"
    },
    {
      "original": "Explosion in Pavlohrad, Dnipropetrovsk Oblast. Iskander-M ballistic missile strike.",
      "timestamp": "2025-11-22T17:53:23.457582Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in and around Vovchansk, making new progress in two different areas.\nIn the northeast, Russian forces expanded their zone of control in the denser low-rise residential areas in the south of the city, eventually reaching its eastern edge. They also crossed the highway further north, entering the southeastern neighbourhoods and capturing the technical school along with around 9 more residential blocks.\nTo the southwest, after entering the main part of Synelnykove, Russian forces quickly pushed to its eastern outskirts, completing the capture of the village. From there, they entered the Tsehelne industrial facilities and established full control over them and the surrounding forested areas. \n+ ~2.93 km² in favour of Russia.",
      "timestamp": "2025-11-22T17:53:23.457589Z"
    },
    {
      "original": "For all those saying I'm a psyop account living in Russia \n😁",
      "timestamp": "2025-11-22T17:53:23.457594Z"
    },
    {
      "original": "For all those saying I'm a psyop account living in Russia \n😁",
      "timestamp": "2025-11-22T17:53:23.457598Z"
    },
    {
      "original": "🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🔥\n🔥\n🔥\n🔥\n🔥\n🔥\n🔥",
      "timestamp": "2025-11-22T17:53:23.457613Z"
    },
    {
      "original": "Throwback to when Prigozhin held up one of his maps with a pin which happened to be on the Chatham Islands (part of NZ), and then gaslit our media into thinking Wagner was gonna invade.",
      "timestamp": "2025-11-22T17:53:23.457617Z"
    },
    {
      "original": "Throwback to when Prigozhin held up one of his maps with a pin which happened to be on the Chatham Islands (part of NZ), and then gaslit our media into thinking Wagner was gonna invade.",
      "timestamp": "2025-11-22T17:53:23.457620Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards the village of Novoplatonivka and have reached the low-lying ground next to the Oskil River.\nAfter securing the main section of the tactical heights, Russian forces advanced downhill to the southwest along two gulleys, capturing new positions in the forest plantations there. They also captured a treeline west of a tributary of the Oskil River, and marginally advanced in Borivska Andriivka, entering the western part of the village. \n+ ~4.54 km² in favour of Russia.",
      "timestamp": "2025-11-22T17:53:23.457625Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are advancing, each attempting to retake positions in various areas.\nIn the east, the remaining Russian soldiers who attempted the earlier pipeline operation were killed/captured. Ukrainian forces subsequently moved back into the positions, resecuring logistics into the village of Varachyne which was now being stormed by Russian troops. Ukrainian forces recaptured the southern street, and Russian soldiers subsequently withdrew from the north after their initial assaults were repelled by Ukrainian FPV drones. \nSince then, the Russians have resumed their attacks, carrying out intensive operations aimed at re-entering Varachyne. These attacks have seen mixed results, but they were able to recapture positions in the treeline north of the village.\nTo the west, Russian forces began a series of attacks aimed at entering the village of Andriivka. This time they advanced from the north, bypassing the large grey zone on the western approaches to Oleksiivka. They were able to capture the rest of a treeline and entrench along the road on the northern outskirts of Andriivka. \nFurther west, at some point recently, Ukrainian forces were able to clear out the easternmost street of Kindrativka from Russian soldiers who infiltrated the village last month. \n+ ~3.05 km² in favour of Ukraine.\n+ ~1.43 km² in favour of Russia.",
      "timestamp": "2025-11-22T17:53:23.457633Z"
    },
    {
      "original": "Russian forces have captured the village of Nechaivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~126.\nTotal land area: ~0.62 km².",
      "timestamp": "2025-11-22T17:53:23.457638Z"
    },
    {
      "original": "Russian forces have captured the village of Radisne, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~164.\nTotal land area: ~1.03 km².",
      "timestamp": "2025-11-22T17:53:23.457642Z"
    },
    {
      "original": "Russian forces have captured the village of Nove Zaporizhzhya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~103.\nTotal land area: ~1.00 km².",
      "timestamp": "2025-11-22T17:53:23.457646Z"
    },
    {
      "original": "In the Lyman direction and on the northern flank of Siversk, Russian forces have made significant progress, advancing in important parts of the frontline.\nIn the southeast, after capturing Dronivka, Russian forces advanced to the southwest through the forests to Platonivka, quickly establishing control over the village. They then captured the adjacent treelines and are now trying to advance through the forests and break through the Ukrainian defence at Zakitne. Additionally, the Russians advanced west from their new positions on the northern bank of the Siverskyi Donets River, and captured additional positions in the forests further west.\nTo the northwest, Russian forces advanced further through the forests west of Yampil and reached the Lyman - Siversk Highway. They then broke into the southern houses of Yampil, allowing for the rest of the village to be cleared. Fighting is now taking place for the strongpoints south and southwest of Yampil in the area of the highway. \nFurther northwest, following earlier failed attacks, Russian assault groups once again entered the Masliakivka District of Lyman and consolidated in its eastern half. Clearing operations continue in the western part of the district, and unsuccessful attacks took place on the neighbouring Kommunal'nyy District.\n+ ~24.50 km² in favour of Russia.",
      "timestamp": "2025-11-22T17:53:23.457653Z"
    },
    {
      "original": "Russian forces have captured the village of Zelenyi Hai, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~68.\nTotal land area; ~1.03 km².",
      "timestamp": "2025-11-22T17:53:23.457657Z"
    },
    {
      "original": "Russian forces have captured the village of Vysoke, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~517.\nTotal land area: ~0.89 km².",
      "timestamp": "2025-11-22T17:53:23.457662Z"
    },
    {
      "original": "Russian forces advanced east of Rive (Rovnoye), as the Myrnograd pocket continues to collapse slowly.",
      "timestamp": "2025-11-22T17:53:23.457665Z"
    },
    {
      "original": "In case you haven't realised it yet, the Russian MOD claim that Russia captured Kupyansk is false... just like basically every other claim they make in this direction.",
      "timestamp": "2025-11-22T17:53:23.457670Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From November 21, 2025\nOn November 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252643Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From November 21, 2025\nOn November 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252662Z"
    },
    {
      "original": "Kiev Destroyed Morale Of Its Troops \nUkrainian soldiers and officers are rapidly losing their morale amid a series of defeats and mounting losses all caused by the disillusion of Kiev. On the other side, Russian troops, encouraged by their recent success, seem to be more motivated than ever.\nThe defeat in Kupyansk was especially harsh for Ukraine, and the upcoming defeat in Pokrovsk will be even harsher. That’s not to mention all the recent setbacks in Krasny Liman and Siversk, or the complete collapse taking shape all around Huliapole. In addition, hundreds of Ukrainian troops are getting killed or wounded every day in hopeless counterattacks.\nDespite all of this, Kiev has so far maintained its maximalist stance, sabotaging any attempt to push for peace, even by its top backer, the United States.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252672Z"
    },
    {
      "original": "Kiev Destroyed Morale Of Its Troops \nUkrainian soldiers and officers are rapidly losing their morale amid a series of defeats and mounting losses all caused by the disillusion of Kiev. On the other side, Russian troops, encouraged by their recent success, seem to be more motivated than ever.\nThe defeat in Kupyansk was especially harsh for Ukraine, and the upcoming defeat in Pokrovsk will be even harsher. That’s not to mention all the recent setbacks in Krasny Liman and Siversk, or the complete collapse taking shape all around Huliapole. In addition, hundreds of Ukrainian troops are getting killed or wounded every day in hopeless counterattacks.\nDespite all of this, Kiev has so far maintained its maximalist stance, sabotaging any attempt to push for peace, even by its top backer, the United States.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252680Z"
    },
    {
      "original": "Ukrainian Cache With Toxic Substances Discovered Near Pokrovsk (Videos)\nToxic substances affiliated with chemical weapons were found in a Ukrainian cache close to the key city of Pokrovsk in Donetsk, the Regional Directorate of the Russian Federal Security Service (FSB) announced on November 22.\nThe Russian military is currently engaged in a fierce battle in Pokrovsk. Kiev forces have been already expelled from most of the city. Mopping-up operations are underway.\nIn a statement, the FSB said that sealed tubes with chemical warfare agents, explosives, and gasoline containers were found in the cache near Pokrovsk.\nThe cache found near Pokrovsk was not the first. On July 1, the FSB found a similar cache with the same toxic substances near Ilyinka in Donetsk.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252689Z"
    },
    {
      "original": "Ukrainian Cache With Toxic Substances Discovered Near Pokrovsk (Videos)\nToxic substances affiliated with chemical weapons were found in a Ukrainian cache close to the key city of Pokrovsk in Donetsk, the Regional Directorate of the Russian Federal Security Service (FSB) announced on November 22.\nThe Russian military is currently engaged in a fierce battle in Pokrovsk. Kiev forces have been already expelled from most of the city. Mopping-up operations are underway.\nIn a statement, the FSB said that sealed tubes with chemical warfare agents, explosives, and gasoline containers were found in the cache near Pokrovsk.\nThe cache found near Pokrovsk was not the first. On July 1, the FSB found a similar cache with the same toxic substances near Ilyinka in Donetsk.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252699Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 22, 2025 (Map Update)",
      "timestamp": "2025-11-22T17:53:24.252702Z"
    },
    {
      "original": "Death Dealers: How War Turned Ukraine’s Burial System Into a Criminal Industry\nBehind the public façade of national tragedy lies a cold, meticulously organized commercial machine. In Odessa, Kyiv’s central morgue, and military cemeteries across the country, funerals have become part of a shadow economy worth an estimated $45 million a year.\nThe beneficiaries: 3,000 private firms, corrupt officials, medical workers, and police officers.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252710Z"
    },
    {
      "original": "Death Dealers: How War Turned Ukraine’s Burial System Into a Criminal Industry\nBehind the public façade of national tragedy lies a cold, meticulously organized commercial machine. In Odessa, Kyiv’s central morgue, and military cemeteries across the country, funerals have become part of a shadow economy worth an estimated $45 million a year.\nThe beneficiaries: 3,000 private firms, corrupt officials, medical workers, and police officers.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252718Z"
    },
    {
      "original": "Ukraine Got Chinese-Made Man-Portable Air Defense Systems From Black Market (Video)\nUkraine has managed to obtain Chinese-made FN-6 man-portable air defense systems (MANPADS), most likely from the black market in the Middle East.\nA photo showing Ukrainian troops with a FN-6 somewhere in the special military operation zone first surfaced online on November 19. One the same day, footage showing the MANPADS being used against what was said to be a Russian cruise missile appeared.\nThe FN-6 is a third-generation passive infrared homing MANPADS developed by Shanghai Academy of Spaceflight Technology of China Aerospace Science and Technology Corporation.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252727Z"
    },
    {
      "original": "Ukraine Got Chinese-Made Man-Portable Air Defense Systems From Black Market (Video)\nUkraine has managed to obtain Chinese-made FN-6 man-portable air defense systems (MANPADS), most likely from the black market in the Middle East.\nA photo showing Ukrainian troops with a FN-6 somewhere in the special military operation zone first surfaced online on November 19. One the same day, footage showing the MANPADS being used against what was said to be a Russian cruise missile appeared.\nThe FN-6 is a third-generation passive infrared homing MANPADS developed by Shanghai Academy of Spaceflight Technology of China Aerospace Science and Technology Corporation.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252735Z"
    },
    {
      "original": "Collapse Of Ukrainian Defenses Along Haichur River Has Begun (Videos)\nOn November 22, the collapse of Ukrainian defenses along the Haichur River began with a push by the Russian military from Dnepropetrovsk towards the city of Huliapole in Zaporozhye to the south.\nAdvancing along the river from Radisne in Dnepropetrovsk, the Vostok [East] Group of Forces imposed control of Nove Zaporizhzhya. The capture of the settlement was confirmed by the Russian Ministry of Defense, which said that the attack was led by the 37th Motorized Rifle Brigade of the 36th Guards Combined Arms Army.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252742Z"
    },
    {
      "original": "Collapse Of Ukrainian Defenses Along Haichur River Has Begun (Videos)\nOn November 22, the collapse of Ukrainian defenses along the Haichur River began with a push by the Russian military from Dnepropetrovsk towards the city of Huliapole in Zaporozhye to the south.\nAdvancing along the river from Radisne in Dnepropetrovsk, the Vostok [East] Group of Forces imposed control of Nove Zaporizhzhya. The capture of the settlement was confirmed by the Russian Ministry of Defense, which said that the attack was led by the 37th Motorized Rifle Brigade of the 36th Guards Combined Arms Army.\nRead more \nHERE",
      "timestamp": "2025-11-22T17:53:24.252750Z"
    }
  ],
  "script_run_time": "2025-11-22T17:53:24.253582Z"
}