{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південному напрямку.",
      "timestamp": "2025-12-03T13:59:03.348210Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжя",
      "timestamp": "2025-12-03T13:59:03.348229Z"
    },
    {
      "original": "⚠\nУВАГА!\nПовітряна тривога в Одеській області через роботу розвідувального БпЛА.",
      "timestamp": "2025-12-03T13:59:03.348235Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку н.п. Богодухів з півночі на Харківщині.",
      "timestamp": "2025-12-03T13:59:03.348241Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на півдні Харківщині в районі н.п.Лиманівка/Лозова, напрямок руху постійно змінюється.",
      "timestamp": "2025-12-03T13:59:03.348247Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на півдні Сумщини, курс південно-західний.",
      "timestamp": "2025-12-03T13:59:03.348258Z"
    },
    {
      "original": "🛸\n На Миколаївщині розвідувальний БпЛА! Можлива робота ППО. Даний безпілотник є потенційним навідником ворожих засобів ураження.",
      "timestamp": "2025-12-03T13:59:03.348264Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччині, напрямок Дружківка",
      "timestamp": "2025-12-03T13:59:03.348268Z"
    },
    {
      "original": "🛵\n БпЛА в Берестинському районі Харківщини, курс на Полтавщину.",
      "timestamp": "2025-12-03T13:59:03.348273Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини, напрямок м.Шостка",
      "timestamp": "2025-12-03T13:59:03.348278Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині, напрямок на м.Полтаву.",
      "timestamp": "2025-12-03T13:59:03.348282Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Запоріжжя, напрямок м.Запоріжжя.",
      "timestamp": "2025-12-03T13:59:03.348288Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, курс на м.Суми.",
      "timestamp": "2025-12-03T13:59:03.348292Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину!",
      "timestamp": "2025-12-03T13:59:03.348297Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку.",
      "timestamp": "2025-12-03T13:59:03.348305Z"
    },
    {
      "original": "🛵\n БпЛА в Ізюмському районі Харківської області, курс південно-західний.",
      "timestamp": "2025-12-03T13:59:03.348310Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Павлоград.",
      "timestamp": "2025-12-03T13:59:03.348314Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину.",
      "timestamp": "2025-12-03T13:59:03.348319Z"
    },
    {
      "original": "🛵\n БпЛА  над  м.Суми.",
      "timestamp": "2025-12-03T13:59:03.348323Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині,  напрямок м.Павлоград.",
      "timestamp": "2025-12-03T13:59:03.348329Z"
    },
    {
      "original": "The Map has been updated!\nThe RUAF entered the settlement\n of \nNovodanilovka\n in the \nOrekhov Direction\n. During the \nheavy fog\n across the frontline on \nNovember 21st\n, Russian Forces managed to \npenetrate a BTR 2.5km\n past the line of contact and enter the settlement of \nNovodanilovka\n, where an\n infantry component then dismounted\n. It is unsure whether all of the dismounted infantry were killed in the subsequent FPV strikes, but it seems with the frontline penetrated even \nmore Russian Assault Squads were able to gain a foothold\n on the southern area of the settlement. In \nMalaya Tokmachka\n, the settlement remains a \nmassive grey-zone\n due to the immense defenses presented by the AFU, however the \nRUAF succeeded in capturing the brick factory\n. A \nRussian Soldier was geolocated surrendering\n the western part of the settlement, \nconfirming fluid positions\n as there are Ukrainian geolocations in the eastern part of the settlement as well.\n+2.2km² RUAF\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n〰️\n⚔️\n \nTheIronDispatch Channel. Subscribe now.",
      "timestamp": "2025-12-03T13:59:03.968145Z"
    },
    {
      "original": "The Map has been updated!  The RUAF entered the settlement of Novodanilovka in the Orekhov Direction. During the heavy fog across the frontline on November 21st, Russian Forces managed to penetrate a BTR 2.5km past the line of contact and enter the settlement…",
      "timestamp": "2025-12-03T13:59:03.968159Z"
    },
    {
      "original": "Good mapper to follow for additional frontline info ^^",
      "timestamp": "2025-12-03T13:59:03.968163Z"
    },
    {
      "original": "For the record, I don't do paid ads or cross-promotions/partnerships, and never plan to.\nI only ever promote channels that I think are decent and that you guys will find interesting, and never when someone asks me to.",
      "timestamp": "2025-12-03T13:59:03.968168Z"
    },
    {
      "original": "🇷🇺\n🇹🇷\n🇺🇦\n❗️\n — The Russian tanker MIDVOLGA-2, carrying sunflower oil to Georgia, reported an attack about 80 miles off Turkey’s Black Sea coast, inside Turkey’s EEZ.  \n➡️\n No injuries were reported, and the ship continued toward Sinop.   \n➡️\n This marks the third…",
      "timestamp": "2025-12-03T13:59:03.968180Z"
    },
    {
      "original": "Fighterbomber reported that the most recent attack on a Russian tanker off the coast of Turkey was by a Ukrainian USV.",
      "timestamp": "2025-12-03T13:59:03.968184Z"
    },
    {
      "original": "Russian forces have captured the village of Dobropillya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~440.\nTotal land area: ~2.59 km².\nThe fighting for Dobropillya lasted approximately 5 days.",
      "timestamp": "2025-12-03T13:59:03.968190Z"
    },
    {
      "original": "Russian Geran-2 drone strike on a Ukrainian mobile anti-air unit on the Pavlohrad - Dnipro Highway in Dnipropetrovsk Oblast.",
      "timestamp": "2025-12-03T13:59:03.968194Z"
    },
    {
      "original": "The Ukrainian 425th Separate Assault Regiment \"Skala\" published an AI-generated video to their Twitter profile claiming to show Ukrainian soldiers raising a flag in central Pokrovsk. \nThe footage was debunked by Deepstate, who showed how the pedestrian crossing sign in the background began to \"dance\". \nSkala has since deleted the video.",
      "timestamp": "2025-12-03T13:59:03.968199Z"
    },
    {
      "original": "🇸🇾\n🇮🇱\n⚡\n- \"We want to establish a demilitarized zone in southern Syria that stretches from Damascus to Mount Hermon,\" - Benjamin Netanyahu, Prime Minister of Israel.",
      "timestamp": "2025-12-03T13:59:03.968206Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Sobolivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~88.\nTotal land area: ~0.48 km².\nWhile there were no major battles for Sobolivka, the village has remained in the grey zone for over 3 months.",
      "timestamp": "2025-12-03T13:59:03.968212Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Sobolivka, Kupyansk direction, Kharkiv Oblast.  Pre-war population: ~88. Total land area: ~0.48 km².  While there were no major battles for Sobolivka, the village has remained in the grey zone…",
      "timestamp": "2025-12-03T13:59:03.968216Z"
    },
    {
      "original": "Kupyansk was also clarified. The situation could soon reach a critical point for Russian formations in the western part of the city.\nI will publish a full update on it tomorrow.",
      "timestamp": "2025-12-03T13:59:03.968220Z"
    },
    {
      "original": "The Ukrainian command has sent reinforcements to Vovchansk, in order to save the city from falling.  The immediate goal of the recent Russian advances in Vovchansk is to help tie down Ukrainian units and distract from operations in Kupyansk.   The longer-term…",
      "timestamp": "2025-12-03T13:59:03.968224Z"
    },
    {
      "original": "These reinforcements I \nreported on\n last week were not sent to Vovchansk, but instead to the Lyman - Vilcha area, southwest of the city where Russia has been making significant progress recently.",
      "timestamp": "2025-12-03T13:59:03.968231Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Moskovka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~534.\nTotal land area: ~1.83 km².\nThe fighting for Moskovka lasted approximately 5 months.",
      "timestamp": "2025-12-03T13:59:03.968237Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance and have captured most of the city of Vovchansk.\nUkrainian forces largely withdrew from Vovchansk, leaving only a few cover units on the outer streets of the city. Russian forces subsequently captured the majority of the southeastern part of Vovchansk and the nearby forest. \nTo the southwest, Russian forces continued their storming of Vilcha, and consolidated in the northern part of the town. Fighting is now shifting to the central and northeastern streets.\n+ ~5.96 km² in favour of Russia.",
      "timestamp": "2025-12-03T13:59:03.968242Z"
    },
    {
      "original": "In the Kupyansk direction, over the last two weeks Ukrainian forces have been making incremental advances in and around Kupyansk.\nUkrainian forces cleared the village of Sobolivka from Russian DRGs and recaptured the rest of Moskovka which was previously in the grey zone. They also secured the rest of the warehouses on the northwestern edge of Kupyansk.\nFrom there, Ukrainian forces were able to consolidate along Yuvileyna Street in the northern part of the city, and captured the vocational school, beginning the fighting for the surrounding high-rise buildings and low-rise residential streets. The most recent attacks were focused on the remaining Russian supply routes into west bank Kupyansk, with attempts underway to recapture a number of enterprises along the P-79 highway. No significant progress has been achieved there yet, however, with drones acting as the main method of disrupting Russian logistics\nMeanwhile in the western part of the city, Ukrainian forces were able to consolidate in the residential streets north of Lermontova Street, while other assault groups spearheaded southeast towards the Yuvileynyi high-rise micro-district. They were able to capture most of the low-rise residential areas west of Yuvileynyi, and infiltrated its western apartment buildings. Attacks are also underway in the direction of the city centre\nFurther south, Ukrainian forces continued to advance northwards, supporting the operations in the western suburbs. They recaptured the rest of the Kolontaivka District in the southern part of the city and took up positions in the surrounding forests. Other forces pushed further north up the highway, linking up with the garrison still holding out in the bridgehead west of the Oskil River, south of the city centre. \n+ ~7.42 km² in favour of Ukraine.",
      "timestamp": "2025-12-03T13:59:03.968250Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced, capturing various positions east of the Oskil River.\nIn the south, Russian forces continued to incrementally advance towards the Borova - Novoplatonivka line over the last week. They advanced south from their initial spearhead towards the P-79 Highway, establishing control over positions on the northern bank of a tributary of the Oskil River. Additionally, the Russians captured the last houses of Borivska Andriivka, and improved their positions in the treelines southeast of the village.\nIn the north, following an earlier Russian attack, Ukrainian forces were able to clear the southeastern part of Bohuslavka from dismounted Russian infantry, re-establishing full control over the village. \n+ ~4.00 km² in favour of Russia.\n+ ~0.66 km² in favour of Ukraine.",
      "timestamp": "2025-12-03T13:59:03.968257Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Ivanivka, Prosyana direction, Dnipropetrovsk Oblast.\nPre-war population: ~1,420.\nTotal land area: ~8.15 km².\nThe fighting for Ivanivka lasted approximately 2 months, 18 days.",
      "timestamp": "2025-12-03T13:59:03.968262Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations in the direction of the Kharkiv - Donetsk regional border, capturing new positions in the low-lying ground. \nRussian forces advanced northwest up the forest plantations on the northern end of the gulley, reaching Ukrainian positions on the approaches to Korovii Yar. They also captured a forested area to the southwest and began fighting for the three main strongpoints in the area.\n+ ~1.52 km² in favour of Russia.",
      "timestamp": "2025-12-03T13:59:03.968266Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance southeast and east of Lyman, while Ukrainian forces carry out counterattacks to the north.\nIn the southeast, after several days of fighting, Russian forces captured the main trench strongpoints in the area of the highway south of Yampil. They also further improved their positions to the northwest, crossing the highway at new points. Additionally, Russian forces captured the rest of the chalk quarry and broke through Ukrainian positions in the Sviati Hory National Park, entering the village of Dibrova from the northeast.\nTo the north, Russian forces resumed their assault operations along the Zarichne - Lyman Road, capturing new positions in the strongpoints there. Heavy fighting is ongoing for additional trenches further west. \nIn the northwest, Ukrainian forces continued counterattacks in Stavky, where they consolidated in the eastern agricultural buildings and the southern houses, before infiltrating into the northern part of the village. \n+ ~7.23 km² in favour of Russia. \n+ ~1.20 km² in favour of Ukraine.",
      "timestamp": "2025-12-03T13:59:03.968273Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces intensified their assault operations, making significant progress in three different areas.\nIn the northeast, Russian forces crossed the Bakhmutovka River and entered the eastern outskirts of Sviato-Pokrovske, capturing positions in the agricultural buildings. From there, additional forces crossed the river and began assaults on the eastern residential part of Sviato-Pokrovske, which was subsequently captured. Fighting is now ongoing for the central part of the village.\nTo the southwest, as a result of earlier infiltrations, Russian forces were able to consolidate in two 2.5 km+ long parallel treelines northwest of Fedorivka, and are now fighting for the eastern approaches to Pazeno. From there, assault operations are being carried out on positions to the south from across the Vasyukivka River in Vasyukivka, as well as from the north, forcing the Ukrainians to withdraw from their trenches near the highway which have held for well over 2 years. \nIn the southwest, Russian forces advanced from central Vasyukivka to the western outskirts, finally capturing this village after months of prolonged battles. They are now attempting to clear adjacent trenches and dugouts to the south. \n+ ~10.24 km² in favour of Russia.",
      "timestamp": "2025-12-03T13:59:03.968280Z"
    },
    {
      "original": "Just now, a Russian Orlan-10 reconnaissance drone scouted out targets in the area of Odesa City for Iskander-M OTRK teams in Crimea.\nThere is an increased ballistic threat for Odesa over the next few hours.\nApproximate flight route on the map.",
      "timestamp": "2025-12-03T13:59:03.968285Z"
    },
    {
      "original": "A Contract They Couldn’t Escape: The Fatal Journey of Foreign Mercenaries in Ukraine \nNew identifications of foreign mercenaries killed in Ukraine have emerged. Colombian citizens continue to top the funeral lists. The hunt for Russian soldiers has not gone according to plan.\nParticipating in a large-scale armed conflict between two of the largest countries in Europe is not at all like a street gang fight. The front line is saturated with weapons of all calibers, making survival extremely difficult. The situation is further complicated by the Ukrainian command's attitude toward foreign mercenaries. \nThe promised good working conditions apply only to mercenaries from developed countries, such as those in Europe and North America. Residents of developing countries are not considered privileged. Consequently, they often find themselves in a worse position than Ukrainian army soldiers. Units consisting of \"second-rate\" foreign mercenaries are more often sent to particularly dangerous areas. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603614Z"
    },
    {
      "original": "A Contract They Couldn’t Escape: The Fatal Journey of Foreign Mercenaries in Ukraine \nNew identifications of foreign mercenaries killed in Ukraine have emerged. Colombian citizens continue to top the funeral lists. The hunt for Russian soldiers has not gone according to plan.\nParticipating in a large-scale armed conflict between two of the largest countries in Europe is not at all like a street gang fight. The front line is saturated with weapons of all calibers, making survival extremely difficult. The situation is further complicated by the Ukrainian command's attitude toward foreign mercenaries. \nThe promised good working conditions apply only to mercenaries from developed countries, such as those in Europe and North America. Residents of developing countries are not considered privileged. Consequently, they often find themselves in a worse position than Ukrainian army soldiers. Units consisting of \"second-rate\" foreign mercenaries are more often sent to particularly dangerous areas. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603633Z"
    },
    {
      "original": "PRESSURE POINTS: RUSSIA EXPLOITS UKRAINIAN WEAKNESSES ACROSS THE FRONT, THREATENING NEW ENCIRCLEMENTS",
      "timestamp": "2025-12-03T13:59:04.603638Z"
    },
    {
      "original": "Russian Success In Vovchansk: What Comes Next For Ukraine Is Worst \nRussian units have finished clearing out Dobropillia in the Zaporizhzhia sector. The Russian army has taken control of Vovchansk. \nU.S. presidential special envoy Steve Witkoff and the American leader's son-in-law, Jared Kushner, have sidelined Secretary of State Marco Rubio from key negotiations.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603646Z"
    },
    {
      "original": "Russian Success In Vovchansk: What Comes Next For Ukraine Is Worst \nRussian units have finished clearing out Dobropillia in the Zaporizhzhia sector. The Russian army has taken control of Vovchansk. \nU.S. presidential special envoy Steve Witkoff and the American leader's son-in-law, Jared Kushner, have sidelined Secretary of State Marco Rubio from key negotiations.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603654Z"
    },
    {
      "original": "Geran Attack: Summary Of Russian Combat Footage From December 2, 2025\nOn December 2, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603662Z"
    },
    {
      "original": "Geran Attack: Summary Of Russian Combat Footage From December 2, 2025\nOn December 2, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603672Z"
    },
    {
      "original": "Druze Force Arrests Dozens Over Alleged Syrian Government Plot To Take Over Suwayda \nA power struggle emerged in al-Suwayda over the past week, with the National Guard arresting dozens, including a prominent Druze Sheikh, over an alleged plot by the Islamist-led government to take over the southern Syrian governorate.\nThe National Guard was formed by Druze armed factions under the direction of the community spiritual leader in Syria, Sheikh Hikmat al-Hijri, in August, little over a month after the end of a deadly attack by government forces and allied Bedouin fighters on al-Suwayda.\nTensions remained high in al-Suwayda since the battle, and in recent weeks clashes between the National Guard and government forces became more frequent.\nIn a surprise turn of events, the escalation moved to the areas held by Druze on November 29, with the National Guard carrying out a security operation and arresting at least five people. All five were Druze. One of those detained was Sheikh Raed al-Mutni.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603681Z"
    },
    {
      "original": "Druze Force Arrests Dozens Over Alleged Syrian Government Plot To Take Over Suwayda \nA power struggle emerged in al-Suwayda over the past week, with the National Guard arresting dozens, including a prominent Druze Sheikh, over an alleged plot by the Islamist-led government to take over the southern Syrian governorate.\nThe National Guard was formed by Druze armed factions under the direction of the community spiritual leader in Syria, Sheikh Hikmat al-Hijri, in August, little over a month after the end of a deadly attack by government forces and allied Bedouin fighters on al-Suwayda.\nTensions remained high in al-Suwayda since the battle, and in recent weeks clashes between the National Guard and government forces became more frequent.\nIn a surprise turn of events, the escalation moved to the areas held by Druze on November 29, with the National Guard carrying out a security operation and arresting at least five people. All five were Druze. One of those detained was Sheikh Raed al-Mutni.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603690Z"
    },
    {
      "original": "Footage Of Israeli Strikes On Iranian Headquarters Highlights Dangers Of AI Warfare\nVideo footage purported to show Israeli strikes on headquarters of the Iranian military and revolutionary guards from the 12-day war last June have turned out to be generated by artificial intelligence (AI).\nThe footage, which spread across social networks starting from December 1, appears to have originated from an Instagram account that shared in the past AI generated video related to the Israeli-Iranian war.\nThe level of details in the latest AI video was, however, truly unprecedented. The footage, which were designed to look as if they were taken from surveillance cameras, shows what appears to be underground headquarters with people in Iranian military uniforms along with what appears to be air defense command and control equipment with real maps and realistic-looking parameters.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603699Z"
    },
    {
      "original": "Footage Of Israeli Strikes On Iranian Headquarters Highlights Dangers Of AI Warfare\nVideo footage purported to show Israeli strikes on headquarters of the Iranian military and revolutionary guards from the 12-day war last June have turned out to be generated by artificial intelligence (AI).\nThe footage, which spread across social networks starting from December 1, appears to have originated from an Instagram account that shared in the past AI generated video related to the Israeli-Iranian war.\nThe level of details in the latest AI video was, however, truly unprecedented. The footage, which were designed to look as if they were taken from surveillance cameras, shows what appears to be underground headquarters with people in Iranian military uniforms along with what appears to be air defense command and control equipment with real maps and realistic-looking parameters.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603707Z"
    },
    {
      "original": "Military Situation In Syria On December 3, 2025 (Map Update)",
      "timestamp": "2025-12-03T13:59:04.603711Z"
    },
    {
      "original": "Ukrainian Collapse Continues In Zaporizhzhia, From Huliaipole To Stepnogorsk (Videos)\nOn December 3, the Russian military captured another settlement close to the key city of Huliaipole and made additional gains near the settlement of Stepnogorsk to the west in Zaporozhye.\nThe capture of Chervonoye, also known as Vysoke, to the east of Huliaipole, was announced by the Russian Ministry of Defense, which said that the attack on the settlement was led by the the 38th Guards Motorized Rifle Brigade of the 35th Combined Arms Army, a part of the Vostok [East] Group of Forces.\nTo the west in Zaporozhye, the group is rapidly developing its operations around Stepnogorsk after breaking through Ukrainian defenses there.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603719Z"
    },
    {
      "original": "Ukrainian Collapse Continues In Zaporizhzhia, From Huliaipole To Stepnogorsk (Videos)\nOn December 3, the Russian military captured another settlement close to the key city of Huliaipole and made additional gains near the settlement of Stepnogorsk to the west in Zaporozhye.\nThe capture of Chervonoye, also known as Vysoke, to the east of Huliaipole, was announced by the Russian Ministry of Defense, which said that the attack on the settlement was led by the the 38th Guards Motorized Rifle Brigade of the 35th Combined Arms Army, a part of the Vostok [East] Group of Forces.\nTo the west in Zaporozhye, the group is rapidly developing its operations around Stepnogorsk after breaking through Ukrainian defenses there.\nRead more \nHERE",
      "timestamp": "2025-12-03T13:59:04.603727Z"
    }
  ],
  "script_run_time": "2025-12-03T13:59:04.604624Z"
}