{
  "messages": [
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 71 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 19 вересня (із 21.00 18 вересня) противник атакував 86-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Шаталово, Міллєрово, Приморсько-Ахтарськ – рф., понад 50 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 71 ворожий БпЛА типу Shahed, Гербера і дронів інших типів на півночі, сході та в центрі країни.\nЗафіксовано влучання 15 ударних БпЛА на 6 локаціях, а також падіння збитих (уламки) на двох локаціях.\nАтака триває. Нова група ворожих БпЛА з північному напрямку.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-19T10:44:16.404929Z"
    },
    {
      "original": "🛵\n Чернігівщина:  БпЛА на сході, курсом на захід та в центрі, курсом на схід.",
      "timestamp": "2025-09-19T10:44:16.404945Z"
    },
    {
      "original": "🛵\n Загроза застосування ворожих БпЛА на Сумщині!",
      "timestamp": "2025-09-19T10:44:16.404950Z"
    },
    {
      "original": "🛵\n  БпЛА в напрямку Чернігова. Перебувайте в укриттях!",
      "timestamp": "2025-09-19T10:44:16.404954Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-19T10:44:16.404962Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-09-19T10:44:16.404966Z"
    },
    {
      "original": "🚀\n КАБ в напрямку громади Хотінь.",
      "timestamp": "2025-09-19T10:44:16.404971Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-19T10:44:16.404990Z"
    },
    {
      "original": "🚀\nПуски КАБ на Луганщині, курсом на Борову  на Харківщині",
      "timestamp": "2025-09-19T10:44:16.404994Z"
    },
    {
      "original": "🚀\n КАБ в напрямку громади Куп'янськ.",
      "timestamp": "2025-09-19T10:44:16.404999Z"
    },
    {
      "original": "🚀\n КАБ в напрямку Новомиколаївки на Харківщині.",
      "timestamp": "2025-09-19T10:44:16.405003Z"
    },
    {
      "original": "🛵\n Оновлення інформації по БпЛА :\n- в центрі Чернігівщини, курсом на північ;\n- в центрі Сумщини, курсом на південь.",
      "timestamp": "2025-09-19T10:44:16.405009Z"
    },
    {
      "original": "🛵\n В напрямку Чернігова ударні БпЛА!",
      "timestamp": "2025-09-19T10:44:16.405013Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА поблизу Запоріжжя та на північно-східному напрямку області! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-09-19T10:44:16.405017Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-09-19T10:44:16.405022Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-19T10:44:16.405027Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий  БпЛА на Суми! Залучено засоби для його збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-09-19T10:44:16.405032Z"
    },
    {
      "original": "🛵\n Ворожий  БпЛА в Полтавському районі на Полтавщині.",
      "timestamp": "2025-09-19T10:44:16.405039Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-19T10:44:16.405047Z"
    },
    {
      "original": "🛵\n На півночі Сумщини ударні  БпЛА, в напрямку Сум!",
      "timestamp": "2025-09-19T10:44:16.405051Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on concentration of Ukrainian manpower from the 95th Separate Air Assault Brigade in a treeline near the city of Druzhkivka, Donetsk Oblast. The missile was equipped with a cluster warhead. \nCoordinates: 48.643307, 37.595839 (only 12 km from the frontline).",
      "timestamp": "2025-09-19T10:44:17.038660Z"
    },
    {
      "original": "Another exchange of dead has occurred.\n24 Russian bodies for 1000 Ukrainian.",
      "timestamp": "2025-09-19T10:44:17.038671Z"
    },
    {
      "original": "Google Earth has updated its satellite imagery of Avdiivka and the surrounding areas. The new images, taken on July 7, 2024, show what the city looks like while under Russian control. For context, Russia captured the city on February 17, 2024. \nThe images below show the partially destroyed high-rise districts, damaged low-rise residential areas, and the destroyed industrial zone on the former 2014 frontline.",
      "timestamp": "2025-09-19T10:44:17.038676Z"
    },
    {
      "original": "Google Earth has updated its satellite imagery of Avdiivka and the surrounding areas. The new images, taken on July 7, 2024, show what the city looks like while under Russian control. For context, Russia captured the city on February 17, 2024. \nThe images below show the partially destroyed high-rise districts, damaged low-rise residential areas, and the destroyed industrial zone on the former 2014 frontline.",
      "timestamp": "2025-09-19T10:44:17.038680Z"
    },
    {
      "original": "⚡️\n🇷🇺\n A 7.8 magnitude earthquake struck Russia’s Kamchatka peninsula and a tsunami warning was issued.\nTsunami warnings in Hawaii and Alaska were also issued. \n@wfwitness",
      "timestamp": "2025-09-19T10:44:17.038687Z"
    },
    {
      "original": "⚡️\n🇷🇺\n A 7.8 magnitude earthquake struck Russia’s Kamchatka peninsula and a tsunami warning was issued.  Tsunami warnings in Hawaii and Alaska were also issued.   @wfwitness",
      "timestamp": "2025-09-19T10:44:17.038693Z"
    },
    {
      "original": "Not again...",
      "timestamp": "2025-09-19T10:44:17.038696Z"
    },
    {
      "original": "Yesterday, 1-2 Ukrainian UAVs struck the Gazprom Neftekhim Salavat petrochemical complex in the city of Salavat, Republic of Bashkortostan, around 1,300km from the nearest Ukrainian-controlled territory. \nAs a result, a large fire is now burning at the ELOU-AVT-4 electro-desalting unit, despite it being covered in netting to prevent damage. This unit is used to prepare oil for further distillation.\nCoordinates: 53.41310, 55.88494\nGeolocation credit: \nt.me/exilenova_plus/12408",
      "timestamp": "2025-09-19T10:44:17.038702Z"
    },
    {
      "original": "Yesterday, 1-2 Ukrainian UAVs struck the Gazprom Neftekhim Salavat petrochemical complex in the city of Salavat, Republic of Bashkortostan, around 1,300km from the nearest Ukrainian-controlled territory. \nAs a result, a large fire is now burning at the ELOU-AVT-4 electro-desalting unit, despite it being covered in netting to prevent damage. This unit is used to prepare oil for further distillation.\nCoordinates: 53.41310, 55.88494\nGeolocation credit: \nt.me/exilenova_plus/12408",
      "timestamp": "2025-09-19T10:44:17.038708Z"
    },
    {
      "original": "Recent signs point towards a possible Russian offensive towards the city of Druzhkivka from the south. \nOver the past 2 weeks, intensified FAB and artillery bombardment has been recorded in the area marked on the map, while large-scale troop deployments have taken place.\nAccording to reports, the 177th Caspian Marine Regiment, the 336th Marine Brigade, 40th Marine Brigade, and the 61st Marine Brigade have been deployed to the area south of this zone with intensified bombing. \nAdditionally, the elevation favours Russia in this area. If they were to advance north towards Druzhkivka, they would largely be advancing downhill. It would also threaten the supply routes for Kostyantynivka, and Shakhove, as seen in yellow on either side of the high ground. \nThe possibility of an upcoming Russian offensive here is merely speculation, of course, but it is entirely plausible that something will happen in the coming weeks.",
      "timestamp": "2025-09-19T10:44:17.038715Z"
    },
    {
      "original": "Last night, around 15 Geran-2 drones attacked the city of Pavlohrad in Dnipropetrovsk Oblast. Most impacted the Pavlohrad Chemical Plant and an ammunition depot.",
      "timestamp": "2025-09-19T10:44:17.038718Z"
    },
    {
      "original": "Last night, around 15 Geran-2 drones attacked the city of Pavlohrad in Dnipropetrovsk Oblast. Most impacted the Pavlohrad Chemical Plant and an ammunition depot.",
      "timestamp": "2025-09-19T10:44:17.038721Z"
    },
    {
      "original": "Some reactions to the announcement that Ukraine will not hold elections in 2026, on the largest Ukrainian telegram channel. Note the reactions under the post and replies.",
      "timestamp": "2025-09-19T10:44:17.038725Z"
    },
    {
      "original": "Some reactions to the announcement that Ukraine will not hold elections in 2026, on the largest Ukrainian telegram channel. Note the reactions under the post and replies.",
      "timestamp": "2025-09-19T10:44:17.038728Z"
    },
    {
      "original": "Hey boys, no video today.\nAlso, be aware Israel is reaching out & paying for or facilitating a whole heap of creators to do trips/interviews recently.\nI know multiple Aussies who've been hit up, so just keep an eye out for that. (They asked my thoughts on if they should accept)\nPersonally I got hit up to interview Eylon Levy. I haven't heard back after questioning how it works.\nThis is an interesting shift as both times Israel denied my media accreditations, or facilitate any interviews etc ....\nAlthough people accuse me of all sorts of funding, I've never taken a cent for my work or travel outside of YouTube AdSense or PayPal/Patreon/buymeacoffee\n(These are the best ways to support me) ;)",
      "timestamp": "2025-09-19T10:44:17.038735Z"
    },
    {
      "original": "Hey boys, no video today.  Also, be aware Israel is reaching out & paying for or facilitating a whole heap of creators to do trips/interviews recently.  I know multiple Aussies who've been hit up, so just keep an eye out for that. (They asked my thoughts on…",
      "timestamp": "2025-09-19T10:44:17.038738Z"
    },
    {
      "original": "(This isn't my post, I'm forwarding from WillyOAM because of the Israel thing)",
      "timestamp": "2025-09-19T10:44:17.038741Z"
    },
    {
      "original": "Russian forces have captured the village of Novoivanivka, Pokrovske direction, Zaporizhzhia Oblast.\nPre-war population: ~150.\nTotal land area: ~0.95 km².",
      "timestamp": "2025-09-19T10:44:17.038746Z"
    },
    {
      "original": "You gotta love selective reporting with Ukraine.\nPro-Ukrainians will ignore the frontline situation for months on end, but the second Ukraine retakes a couple treelines in Sumy or allegedly encircles Russian soldiers near Pokrovsk, we get 10 thousand tweets about how Ukraine is winning and that the tide is turning in their favour. \nAlso, by \"allegedly\" I mean it didn't happen. There was a brief period of operational encirclement south of Kucheriv Yar last month, but that's all. \nP.S. don't check Dnipropetrovsk/Zaporizhzhia Oblast, or Lyman direction - it won't fit the cherry-picked narrative.",
      "timestamp": "2025-09-19T10:44:17.038751Z"
    },
    {
      "original": "You gotta love selective reporting with Ukraine.  Pro-Ukrainians will ignore the frontline situation for months on end, but the second Ukraine retakes a couple treelines in Sumy or allegedly encircles Russian soldiers near Pokrovsk, we get 10 thousand tweets…",
      "timestamp": "2025-09-19T10:44:17.038754Z"
    },
    {
      "original": "Also, the sourcing for some of this is so funny. People unironically use Deepstate (under heavy Ukrainian government influence) or Azov's official page to update their maps. \nThose same people will then go on to criticise people like me for showing Russian advances based on satellite imagery, Ukrainian sources, and Russian sources!\nThe disconnect from reality in the Pro-Ukraine community is beyond insane due to the desperate need for a victory - no matter how small/insignificant. You will go to extreme lengths to \"disprove\" any Russian successes, but then as soon as there are a couple of dubious claims about Ukraine slightly advancing, it's taken at face value - no questions asked (the same goes for Pro-Russians too btw).\nThis is one of those things I could rant on and on about because I am Pro-Ukraine, so naturally I see so much of this in my feed.",
      "timestamp": "2025-09-19T10:44:17.038760Z"
    },
    {
      "original": "Russian Strikes on Gas Storage Will Force Ukraine to Spend $1 Billion to Avoid Winter Crisis\nThe balance of attacking unmanned aerial vehicles (UAVs) on the night of September 17-18 showed the Russian side’s advantage. According to Russian sources, air defense systems shot down \n43 \nUkrainian UAVs (with 12 more during daytime). Ukrainian sources reported \n75\n Russian “Geran”/”Gerbera” UAVs launched, with 48 claimed shot down or suppressed. \nFormer advisor to the head of the Association of Ukrainian Banks \nAlexei Kushch \nsaid Russia is deliberately targeting four key elements of Ukraine’s gas system, paralyzing gas import and storage. The most significant are strikes on underground storage facilities:\n“The next strikes target underground gas storage. The explosions are so powerful that rumors say minor earthquakes in Poltava region could be linked to the destruction of underground gas storage.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623189Z"
    },
    {
      "original": "Russian Strikes on Gas Storage Will Force Ukraine to Spend $1 Billion to Avoid Winter Crisis\nThe balance of attacking unmanned aerial vehicles (UAVs) on the night of September 17-18 showed the Russian side’s advantage. According to Russian sources, air defense systems shot down \n43 \nUkrainian UAVs (with 12 more during daytime). Ukrainian sources reported \n75\n Russian “Geran”/”Gerbera” UAVs launched, with 48 claimed shot down or suppressed. \nFormer advisor to the head of the Association of Ukrainian Banks \nAlexei Kushch \nsaid Russia is deliberately targeting four key elements of Ukraine’s gas system, paralyzing gas import and storage. The most significant are strikes on underground storage facilities:\n“The next strikes target underground gas storage. The explosions are so powerful that rumors say minor earthquakes in Poltava region could be linked to the destruction of underground gas storage.”\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623207Z"
    },
    {
      "original": "Military Situation In Ukraine On September 18, 2025 (Maps Update)",
      "timestamp": "2025-09-19T10:44:17.623212Z"
    },
    {
      "original": "Military Situation In Ukraine On September 18, 2025 (Maps Update)",
      "timestamp": "2025-09-19T10:44:17.623216Z"
    },
    {
      "original": "Ukraine Emerges As Testbed For U.S. AI Killer Drones\nAuterion, a Swiss-American uncrewed vehicle software company, introduced on September 17 the “Nemyx,” a specialized platform for the simultaneous and coordinated control of multiple drones. The platform was, according to the company, developed based on experience gained from real-world use in Ukraine, which highlights the country’s growing role as a testbed for Western weapons, especially more controversial artificial intelligence (AI) systems.\nThe Nemyx represents a “major step forward” in the field of military and surveillance drone technology, according to Auterion.\nThe company said that the platform enables operators to centrally manage entire fleets of drones that can be from different manufacturers, as long as they are equipped with the AuterionOS operating system.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623225Z"
    },
    {
      "original": "Bloody Day For Israel With Six Soldiers Killed In Gaza And West Bank (Videos, Photos)\nSix Israeli soldiers were killed on September 18 in two separate attacks that took place in the occupied West Bank and the Gaza Strip, where the Israeli Defense Forces (IDF) is conducting a major offensive.\nIn the afternoon, two soldiers, a reservist in the Civil Administration and a liaison officer with foreign forces in the IDF’s Tevel international cooperation unit, were killed in a shooting and stabbing attack near Allenby Crossing between the West Bank and Jordan. The attacker was identified as a Jordanian citizen who had been driving a humanitarian aid truck headed for Gaza.\nThe IDF said after the attack that security forces had “neutralized the terrorist” at the scene of the attack, adding that troops were carrying out scans in the area for additional suspects and briefly encircled the nearby town of Jericho.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623234Z"
    },
    {
      "original": "Bloody Day For Israel With Six Soldiers Killed In Gaza And West Bank (Videos, Photos)\nSix Israeli soldiers were killed on September 18 in two separate attacks that took place in the occupied West Bank and the Gaza Strip, where the Israeli Defense Forces (IDF) is conducting a major offensive.\nIn the afternoon, two soldiers, a reservist in the Civil Administration and a liaison officer with foreign forces in the IDF’s Tevel international cooperation unit, were killed in a shooting and stabbing attack near Allenby Crossing between the West Bank and Jordan. The attacker was identified as a Jordanian citizen who had been driving a humanitarian aid truck headed for Gaza.\nThe IDF said after the attack that security forces had “neutralized the terrorist” at the scene of the attack, adding that troops were carrying out scans in the area for additional suspects and briefly encircled the nearby town of Jericho.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623243Z"
    },
    {
      "original": "Israel Is Closer Than Ever To Renew War On Lebanon (Videos)\nThe Israeli Defense Forces (IDF) on September 18 carried out one of its largest waves of strikes against Lebanon since a ceasefire brokered by the United States entered into effect last November.\nThe strikes were carried out in two main waves, following evacuation warnings issued by the IDF’s Arabic-language spokesman, Col. Avichay Adraee to residents of five towns in southern Lebanon that are known to be strongholds of Hezbollah: Mays al-Jabal, Kfar Tebnit, Dibbin, Chehabiyeh and Burj Qalaouiyah.\nIn a statement released later, the IDF said that the strikes targeted several weapon depots belonging to the group’s elite Radwan Force.\nRead more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623251Z"
    },
    {
      "original": "Israel Is Closer Than Ever To Renew War On Lebanon (Videos)\nThe Israeli Defense Forces (IDF) on September 18 carried out one of its largest waves of strikes against Lebanon since a ceasefire brokered by the United States entered into effect last November.\nThe strikes were carried out in two main waves, following evacuation warnings issued by the IDF’s Arabic-language spokesman, Col. Avichay Adraee to residents of five towns in southern Lebanon that are known to be strongholds of Hezbollah: Mays al-Jabal, Kfar Tebnit, Dibbin, Chehabiyeh and Burj Qalaouiyah.\nIn a statement released later, the IDF said that the strikes targeted several weapon depots belonging to the group’s elite Radwan Force.\nRead more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623263Z"
    },
    {
      "original": "GERASIMOV BREAKS COVER: RUSSIA PUSHES ON ALL FRONTS AMID WESTERN TURMOIL",
      "timestamp": "2025-09-19T10:44:17.623270Z"
    },
    {
      "original": "Large-Scale Ukrainian Losses and Unequal Body Exchanges with Russia: Latest Exchange and Trends Since 2022\nOn September 18, 2025, the thirteenth exchange of bodies of military personnel between Russia and Ukraine occurred. Ukraine received bodies of \n1,000\n servicemen, while Russia received bodies of \n24\n soldiers. This operation, like previous exchanges, was conducted under third-party-mediated humanitarian agreements and remains one of few forms of interaction between the conflicting parties.\nAccording to cumulative data from all such exchanges since 2022, Russia has transferred approximately\n 18,362 \nbodies of Ukrainian servicemen to Ukraine, while Ukraine has transferred about \n3,208\n bodies of Russian servicemen to Russia.\nDynamics of Body Exchanges by Year:\n▪️\nIn 2022 and 2023, the number of bodies exchanged was roughly equal.\n▪️\n2024 saw a disparity of about 5.5 to 1.\n▪️\nIn 2025, the gap sharply increased to 38 to 1, with Ukraine receiving about 13,300 bodies and Russia receiving about 350.\n👉\n Read more \nHERE",
      "timestamp": "2025-09-19T10:44:17.623286Z"
    }
  ],
  "script_run_time": "2025-09-19T10:44:17.623885Z"
}