{
  "messages": [
    {
      "original": "🛵\n Декілька груп БпЛА через Херсонщину \n➡️\n у напрямку Миколаївщини.",
      "timestamp": "2026-01-05T17:50:12.694000Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Миколаїв.",
      "timestamp": "2026-01-05T17:50:12.694017Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Дніпро зі сходу.",
      "timestamp": "2026-01-05T17:50:12.694024Z"
    },
    {
      "original": "🛵\n Чернігівське: декілька груп БпЛА \n➡️\n в районі Гончарівського.\n🛵\n Дніпропетровщина: групи БпЛА \n➡️\n у напрямку Павлограда.",
      "timestamp": "2026-01-05T17:50:12.694034Z"
    },
    {
      "original": "🛵\n Харківський р-н, м.Харків \n➡️\n бойова робота по ворожих БпЛА.",
      "timestamp": "2026-01-05T17:50:12.694040Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Чернігів з півночі",
      "timestamp": "2026-01-05T17:50:12.694046Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-05T17:50:12.694051Z"
    },
    {
      "original": "🚀\nШвидкісна ціль в напрямку Харкова",
      "timestamp": "2026-01-05T17:50:12.694067Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА навколо Харкова, до закінчення повітряної тривоги перебувайте в укриттях.",
      "timestamp": "2026-01-05T17:50:12.694073Z"
    },
    {
      "original": "🛸\n Поблизу Херсона та на півночі Сумщини розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2026-01-05T17:50:12.694078Z"
    },
    {
      "original": "🛵\n БпЛА  на заході Чернігівщини, курс на південь.",
      "timestamp": "2026-01-05T17:50:12.694083Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-05T17:50:12.694087Z"
    },
    {
      "original": "🛵\n БпЛА  в напрямку Сум та Чернігова.",
      "timestamp": "2026-01-05T17:50:12.694092Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-05T17:50:12.694096Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з заходу.",
      "timestamp": "2026-01-05T17:50:12.694100Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Запоріжжя, на Харків та на Суми.",
      "timestamp": "2026-01-05T17:50:12.694108Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА \n➡️\n курсом на Дніпро.",
      "timestamp": "2026-01-05T17:50:12.694115Z"
    },
    {
      "original": "🚀\n Пуски КАБів на Харківщину та Сумщину",
      "timestamp": "2026-01-05T17:50:12.694120Z"
    },
    {
      "original": "🛩\nНа шляху до F-16: ексклюзивна історія від українського пілота\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nЕксклюзивна розповідь пілота F-16 про те, як Україна пройшла шлях від виснажливих дипломатичних перемовин – до першого переможного “Target destroyed.” \nЯк попри опір і скепсис буквально виборювала право на сучасну бойову авіацію.\nЧому F-16 стали не просто новим типом техніки, а стратегічним інструментом у захисті наших міст та об’єктів критичної інфраструктури.\nЦе історія про українців,  які довели усьому світу, що можуть і вміють перемагати на межі можливостей!\nДивіться за \nпосиланням",
      "timestamp": "2026-01-05T17:50:12.694138Z"
    },
    {
      "original": "🛵\n Харківщина: групи БпЛА \n➡️\n в районі Куп'янська.",
      "timestamp": "2026-01-05T17:50:12.694143Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n в напрямку Городні. \n🛵\n БпЛА \n➡️\n курсом на Харків.",
      "timestamp": "2026-01-05T17:50:12.694154Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their assault operations northeast of Stepnohirsk and have made additional progress near Lukyanivske.\nRussian forces continued advancing east from the solar plant, capturing new positions in the treelines there and reaching Lukyanivske from the south. Infiltrations into the village continued from the west. \nAdditionally, the Russians continued infiltrating further east through the treelines and began attacking along the gulley in the direction of Novoyakovlivka.\n+ ~0.96 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482266Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued their assault operations, making new progress in two different areas.\nIn the northeast, Russian forces continued to advance south of Hulyaipole, where they captured new positions in the treelines and forest northwest of Dorozhnyanka.\nIn the southwest, after entering Bilohirya from the south and east, the Russians established control over most of the village, and began attacks to the north in the direction of the Ukrainian positions on the tactical heights. \n+ ~3.78 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482281Z"
    },
    {
      "original": "In the Pokrovs'ke direction, Ukrainian forces have consolidated numerous treelines east of the Haichur River following failed Russian operations.\nOver the last month, Ukrainian forces have been incrementally regaining solid control over positions east of the Haichur River. These operations have been conducted in areas where Russian forces did not properly entrench in and only moved through to their forward positions west of the river. \nDue to this lack of Russian consolidation, the Ukrainians were able to regain control over the village of Radisne which had previously been in a sort of zone of Russian influence with no permanent presence, and managed to link up with isolated pockets of soldiers in the treelines further east. As a result, a large grey-zone has formed stretching up to 4.5 km wide in some areas, where both sides have overlapping positions in an extremely fluid and dynamic situation. \nThe establishment of solid positions east of the river by Ukraine has allowed them to increase their overall presence in this grey-zone of mixed positions in recent weeks, significantly complicating Russian logistics to their own bridgeheads west of the Haichur river. Nevertheless, Russian forces continued their operations west of the river, with DRGs still infiltrating the village of Kosivtseve, and for the first time, entering the town of Ternuvate.\n+ ~13.70 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482290Z"
    },
    {
      "original": "In the Novopavlivka direction, both Russian and Ukrainian forces have advanced, each capturing positions in the village of Novopidhorodne.\nAt some point recently, Ukrainian forces launched counterattacks in northeastern Novopidhorodne, recapturing positions along two residential streets, shrinking the Russian incursion zone. \nSince then, the Russians have resumed their attacks through the southern part of the village, capturing new positions along Shevchenka Street. Additionally, under heavy artillery cover, assault operations are being carried out on the central part of the village, as well as along the railway line to the south. DRGs have also penetrated the western streets. \n+ ~0.66 km² in favour of Ukraine. \n+ ~0.09 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482298Z"
    },
    {
      "original": "Explosion in Kharkiv City. Likely a Tornado-S rocket.",
      "timestamp": "2026-01-05T17:50:13.482301Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T17:50:13.482305Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations north of Pokrovsk and recaptured previously lost positions there.\nRussian forces advanced northwest from the forested areas northwest of Myrnohrad, recapturing the highway intersection. Other forces attacked up the treelines on a wide front north of Pokrovsk, re-establishing control over a large section of the road to Hryshyne and one of the pig farms. \n+ ~6.04 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482311Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T17:50:13.482318Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T17:50:13.482322Z"
    },
    {
      "original": "To all the geniuses who accuse me of reporting Tornado-S strikes to S-300 ground-to-ground strikes, notice how there is no ballistic threat this time?\nWhen there is a ballistic threat, a non-Iskander target is detected flying and an explosion is heard, that is almost always an S-300 ground-to-ground. Don't ask me why Russia does this, but it happens.",
      "timestamp": "2026-01-05T17:50:13.482326Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T17:50:13.482330Z"
    },
    {
      "original": "Repeated explosions in Kharkiv City",
      "timestamp": "2026-01-05T17:50:13.482333Z"
    },
    {
      "original": "Tornado-S strikes are also being carried out on Slovyansk, Donetsk Oblast simultaneously.",
      "timestamp": "2026-01-05T17:50:13.482336Z"
    },
    {
      "original": "Tornado-S strikes are now carried out on the area of Rohan, to the southeast of Kharkiv City.",
      "timestamp": "2026-01-05T17:50:13.482339Z"
    },
    {
      "original": "Repeated strikes on Kharkiv City.\nA Russian recon drone is operating just north of the city centre, adjusting the strikes.",
      "timestamp": "2026-01-05T17:50:13.482343Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-05T17:50:13.482346Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-05T17:50:13.482350Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-05T17:50:13.482353Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-05T17:50:13.482357Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the southeast, Russian forces resumed their assault operations towards eastern Yarova, recapturing positions in the forests there and reaching the edge of the town.\nTo the west, the Russians advanced south to the western part of Yarova, recapturing positions in the forests south of the railway line. They also began attacks to the southwest and west, improving their positions in the forests and reaching the outskirts of Sosnove.\nTo the north, Russian forces resumed their assault operations in the direction of Oleksandrivka, where they advanced northwest and captured new positions in the forests there.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482365Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress northeast of Lyman.\nIn the northeast, Russian forces resumed their assault operations northwest of Zarichne and captured new treeline positions north of the gulley. From there, they began attacking the Ukrainian positions east of Stavky. Other assault groups are attempting to attack these same positions via the treelines from the eastern part of Stavky. assault operations are also underway on the agricultural buildings on the western outskirts of Stavky.\nIn the southwest, Russian forces continued incrementally consolidating in the fields west of the Pynkov Yar Gulley, where they were able to capture new treeline positions in the direction of the first cluster of agricultural buildings. DRGs continue to infiltrate further west to the northern outskirts of Lyman.\n+ ~1.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482374Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T17:50:13.482383Z"
    },
    {
      "original": "See Kupiansk and Die: Foreign Mercenaries as Expendable Assets in the Battle for the City\nThe conflict in Ukraine continues to claim the lives of foreign mercenaries. Over the past month, Kupiansk has become the primary meat grinder for the Ukrainian Armed Forces' \"Foreign Legion.\" Against the backdrop of catastrophic losses among Ukrainian troops, the command has placed its bet not on its own soldiers, but on Latin American mercenaries—primarily Brazilians and Colombians—used as expendable material in numerous counterattacks.\nAs for the European and American mercenaries, even their privileged status does not save them. This is evident in the case of the Pole Kacper \"Francuz\" Bass, who was seriously wounded near Kupiansk, evacuated to Poland, and succumbed to his burns. The deaths of 33 mercenaries have been confirmed over the past week, with actual losses likely being significantly higher.\nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327429Z"
    },
    {
      "original": "See Kupiansk and Die: Foreign Mercenaries as Expendable Assets in the Battle for the City\nThe conflict in Ukraine continues to claim the lives of foreign mercenaries. Over the past month, Kupiansk has become the primary meat grinder for the Ukrainian Armed Forces' \"Foreign Legion.\" Against the backdrop of catastrophic losses among Ukrainian troops, the command has placed its bet not on its own soldiers, but on Latin American mercenaries—primarily Brazilians and Colombians—used as expendable material in numerous counterattacks.\nAs for the European and American mercenaries, even their privileged status does not save them. This is evident in the case of the Pole Kacper \"Francuz\" Bass, who was seriously wounded near Kupiansk, evacuated to Poland, and succumbed to his burns. The deaths of 33 mercenaries have been confirmed over the past week, with actual losses likely being significantly higher.\nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327446Z"
    },
    {
      "original": "No Rotation, No Rest: The Ukrainian Army's Problems in the Zaporizhzhia Sector and Fighting on Other Fronts\n▪️\nIn the Zaporizhzhia sector, the situation for Ukrainian forces continues to worsen due to critical personnel issues, primarily the prolonged deployment of units without rotation or rest, leading to severe exhaustion. \n▪️\nMeanwhile, on other fronts, the dynamics vary: in the Kupiansk sector, after stabilizing the Radkovka-Holubovka line, the focus has shifted to sabotage and reconnaissance group activities and clearing operations in the forested areas near the city. \n▪️\nIn the Kharkiv sector, Russian units of the \"North\" grouping have consolidated their gains by advancing on several fronts, including the Staritsa area and the forest near Liman, where they captured three strongpoints.\n▪️\n In the Slaviansk sector, intense fighting continues over the dominant heights in the Zakotne area and north of Reznikovka, which are of key tactical importance. \nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327459Z"
    },
    {
      "original": "No Rotation, No Rest: The Ukrainian Army's Problems in the Zaporizhzhia Sector and Fighting on Other Fronts\n▪️\nIn the Zaporizhzhia sector, the situation for Ukrainian forces continues to worsen due to critical personnel issues, primarily the prolonged deployment of units without rotation or rest, leading to severe exhaustion. \n▪️\nMeanwhile, on other fronts, the dynamics vary: in the Kupiansk sector, after stabilizing the Radkovka-Holubovka line, the focus has shifted to sabotage and reconnaissance group activities and clearing operations in the forested areas near the city. \n▪️\nIn the Kharkiv sector, Russian units of the \"North\" grouping have consolidated their gains by advancing on several fronts, including the Staritsa area and the forest near Liman, where they captured three strongpoints.\n▪️\n In the Slaviansk sector, intense fighting continues over the dominant heights in the Zakotne area and north of Reznikovka, which are of key tactical importance. \nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327470Z"
    },
    {
      "original": "Over 30 Cubans Were Among At Least 80 Killed In Raid On Venezuela, But What U.S. Gained?\nAt least 80 people, including more than 30 Cubans, were killed in the January 3 United States raid in Venezuela which ended with the capture of Nicolás Maduro and his wife Cilia Flores.\nThe daring raid came following months of escalation by the administration of President Donald Trump against the government in Venezuela.\nThe escalation began in October with the administration doubling the reward for the arrest of Maduro on drug charges to $50 million. In September, the U.S. began amassing a fairly large force close to Venezuela, and launching strikes against alleged drug trafficking boats in both the Caribbean Sea and the Eastern Pacific Ocean.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327480Z"
    },
    {
      "original": "Over 30 Cubans Were Among At Least 80 Killed In Raid On Venezuela, But What U.S. Gained?\nAt least 80 people, including more than 30 Cubans, were killed in the January 3 United States raid in Venezuela which ended with the capture of Nicolás Maduro and his wife Cilia Flores.\nThe daring raid came following months of escalation by the administration of President Donald Trump against the government in Venezuela.\nThe escalation began in October with the administration doubling the reward for the arrest of Maduro on drug charges to $50 million. In September, the U.S. began amassing a fairly large force close to Venezuela, and launching strikes against alleged drug trafficking boats in both the Caribbean Sea and the Eastern Pacific Ocean.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327489Z"
    },
    {
      "original": "U.S. May Be About To Go All-In Against Iran \nPresident Donald Trump issued another warning to Iran on January 5, saying that the Islamic Republic would get “hit very hard” by the United States if more protesters die during demonstrations that have entered a second week.\n“We’re watching it very closely. If they start killing people like they have in the past, I think they’re going to get hit very hard by the United States,” Trump told reporters aboard Air Force One.\nAt least 20 people, including a member of law enforcement-security forces, have been killed in the protests, which broke out as a result of worsening economic conditions, according to human rights groups.\nTrump’s latest warning came just a day after Prime Minister Benjamin Netanyahu said that Israelis “identify with the struggle of the Iranian people.”\nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327499Z"
    },
    {
      "original": "U.S. May Be About To Go All-In Against Iran \nPresident Donald Trump issued another warning to Iran on January 5, saying that the Islamic Republic would get “hit very hard” by the United States if more protesters die during demonstrations that have entered a second week.\n“We’re watching it very closely. If they start killing people like they have in the past, I think they’re going to get hit very hard by the United States,” Trump told reporters aboard Air Force One.\nAt least 20 people, including a member of law enforcement-security forces, have been killed in the protests, which broke out as a result of worsening economic conditions, according to human rights groups.\nTrump’s latest warning came just a day after Prime Minister Benjamin Netanyahu said that Israelis “identify with the struggle of the Iranian people.”\nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327508Z"
    },
    {
      "original": "Military Situation In Gaza Strip On January 5, 2026 (Map Update)",
      "timestamp": "2026-01-05T17:50:14.327512Z"
    },
    {
      "original": "Turkey Enhances ‘Steel Dome’ With S-400 Replacement (Video)\nTurkey enhanced its multi-layered air and missile defense network, dubbed the \"Steel Dome,\" with the integration of an additional locally-made SİPER long-range air defense system, the Presidency of Defense Industries (SSB) announced on January 4.\nIn a statement, SSB President Haluk Görgün said that the SİPER Block 1 system entered active service following a live-fire test.\nThe system was originally planned as Hisar-U. However, after it was concluded that Hisar-U could not meet Turkey’s long-range air defense missile needs with its current structure, it was decided to transform Hisar-U into a new missile family. This missile family was named SİPER and the name of Hisar-U was changed to SİPER Block 1.\nRead more \nHERE",
      "timestamp": "2026-01-05T17:50:14.327521Z"
    },
    {
      "original": "Military Situation In Ukraine On January 5, 2026 (Maps Update)",
      "timestamp": "2026-01-05T17:50:14.327525Z"
    },
    {
      "original": "Military Situation In Ukraine On January 5, 2026 (Maps Update)",
      "timestamp": "2026-01-05T17:50:14.327529Z"
    }
  ],
  "script_run_time": "2026-01-05T17:50:14.328291Z"
}