{
  "messages": [
    {
      "original": "Russia’s Ka-52M Attack Helicopter Appears In ‘Drone-Buster’ Configuration\nA photo showing a Russian Ka-52M attack helicopter in what appears to be its drone interceptor configuration appeared online on July 27.\nThese helicopter began to play a key role in intercepting Ukrainian fixed-wing suicide drones over the special military operation zone and behind it in recent months.\nHelicopters can fly at low altitudes and speeds which make them very suitable for intercepting slow and small aerial targets like drones.\nThe Ka-52M in particular is very suitable for this role as it is equipped with Arbalet-52 dual-band coherent pulse radar and the GOES-451M electro-optical targeting system which are reportedly capable of detecting aerial targets from a range up to 15 kilometers.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-28T12:43:03.644788Z"
    },
    {
      "original": "Clashes Continue On Thai-Cambodian Border Despite Trump’s Call For Ceasefire \nThailand and Cambodia exchanged fire across their disputed border for a fourth day on July 27, hours after United States President Donald Trump announced the leaders of the two countries had agreed to ceasefire talks.\nThailand hit several locations in Cambodia with drones, tank fire, cluster and aerial bombs early on July 27 morning local time, a spokesperson for Cambodia’s defense ministry told reporters.\nMeanwhile, the state-run National Broadcasting Services of Thailand reported that Cambodian forces had fired artillery into Surin, damaging residential homes. Thai forces were responding, it added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-28T12:43:03.644809Z"
    },
    {
      "original": "Clashes Continue On Thai-Cambodian Border Despite Trump’s Call For Ceasefire \nThailand and Cambodia exchanged fire across their disputed border for a fourth day on July 27, hours after United States President Donald Trump announced the leaders of the two countries had agreed to ceasefire talks.\nThailand hit several locations in Cambodia with drones, tank fire, cluster and aerial bombs early on July 27 morning local time, a spokesperson for Cambodia’s defense ministry told reporters.\nMeanwhile, the state-run National Broadcasting Services of Thailand reported that Cambodian forces had fired artillery into Surin, damaging residential homes. Thai forces were responding, it added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-28T12:43:03.644820Z"
    },
    {
      "original": "Military Situation In Ukraine On July 27, 2025 (Maps Update)",
      "timestamp": "2025-07-28T12:43:03.644825Z"
    },
    {
      "original": "Military Situation In Ukraine On July 27, 2025 (Maps Update)",
      "timestamp": "2025-07-28T12:43:03.644829Z"
    },
    {
      "original": "Israeli Defense Minister Threatens To Target Iran’s Khamenei\nDefense Minister Israel Katz on July 27 threatened Iranian Supreme Leader Ayatollah Ali Khamenei, hinting that Israel could attack Iran again.\nIsrael attacked Iran on June 13, stating that its goal was to cripple Iran’s nuclear program. Later, it expanded its targets to include the Islamic Republic’s missile program. A ceasefire was suddenly announced on June 24, just two days after the United States joined the war by attacking three key nuclear sites.\n“I want to convey a clear message to Khamenei the dictator,” said Katz during a visit to the Ramon Airbase in southern Israel, according to his office. “If you continue to threaten Israel, our long arm will again reach Tehran and with even greater force — and this time to you personally. Do not threaten, lest you be harmed.”\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-28T12:43:03.644839Z"
    },
    {
      "original": "Military Situation In Gaza Strip On July 27, 2025 (Map Update)",
      "timestamp": "2025-07-28T12:43:03.644843Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 27, 2025\nOn July 27, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-28T12:43:03.644849Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 27, 2025\nOn July 27, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-28T12:43:03.644860Z"
    },
    {
      "original": "Russian Army Is Testing Kalashnikov-Armed FPV Drones \nThe Russian military is testing first-person-view (FPV) multirotor drones armed with Kalashnikov-type rifles, according to video footage released by TASS on July 24.\nThe footage shows one such drone engaging a vehicle from a close range, most likely during a test. The Russian news agency noted, however, that the Kalashnikov-armed drone was being developed to intercept and shoot down Ukrainian grenade-dropping multirotor drones, commonly known as “Baba Yaga”.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-28T12:43:03.644869Z"
    },
    {
      "original": "Houthis Vow To Attack All Ships Linked To Israel\nThe Houthis (Ansar Allah) in Yemen announced on July 27 that they will target any ships belonging to companies that do business with Israeli ports, regardless of their nationalities, as part of what it called the fourth phase of its military operations against Israel in support of the Gaza Strip.\nIn a televised statement, Houthi military spokesman Brig. Gen. Yahya Saree warned that ships would be attacked if companies ignored their warnings, regardless of their destination...\nRead more: \nHERE",
      "timestamp": "2025-07-28T12:43:03.644876Z"
    },
    {
      "original": "Suspected Iranian Drones Crash In Iraq’s Kurdistan (Videos)\nAn unidentified drone crashed on July 28 near Erbil, the capital of Iraq’s northern semi-autonomous region of Kurdistan , resulting in no casualties, Kurdish counterterrorism forces reported.\n“On Monday morning at 05:50, an explosive-laden drone crashed in the Rizgari subdistrict of Khabat district in Erbil province,” said the Directorate General of Counter Terrorism...\nRead more: \nHERE",
      "timestamp": "2025-07-28T12:43:03.644883Z"
    },
    {
      "original": "Suspected Iranian Drones Crash In Iraq’s Kurdistan (Videos)\nAn unidentified drone crashed on July 28 near Erbil, the capital of Iraq’s northern semi-autonomous region of Kurdistan , resulting in no casualties, Kurdish counterterrorism forces reported.\n“On Monday morning at 05:50, an explosive-laden drone crashed in the Rizgari subdistrict of Khabat district in Erbil province,” said the Directorate General of Counter Terrorism...\nRead more: \nHERE",
      "timestamp": "2025-07-28T12:43:03.644890Z"
    }
  ],
  "script_run_time": "2025-07-28T12:43:03.645619Z"
}