{
  "messages": [
    {
      "original": "🛵\n БпЛА на Миколаївщині, повз Очаків курс північно-західний.",
      "timestamp": "2026-01-06T14:45:35.745103Z"
    },
    {
      "original": "🛵\n🛸\nЧернігівщина:\n- БпЛА на північному сході від н.п.Любеч, курс - західний/південно-західний;\n- БпЛА в напрямку н.п.Городня з північного сходу.",
      "timestamp": "2026-01-06T14:45:35.745128Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на південному сході від м.Запоріжжя, курс - північно-східний.",
      "timestamp": "2026-01-06T14:45:35.745137Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Чернігівщині в напрямку н.п.Городня з північного заходу.",
      "timestamp": "2026-01-06T14:45:35.745146Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2026-01-06T14:45:35.745151Z"
    },
    {
      "original": "🛸\n В Запорізькому районі  розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2026-01-06T14:45:35.745158Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня.",
      "timestamp": "2026-01-06T14:45:35.745163Z"
    },
    {
      "original": "🚀\nШвидкісна ціль в напрямку Кіровоградщини.",
      "timestamp": "2026-01-06T14:45:35.745170Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс на схід.\n🛵\n БпЛА на півдні Запоріжжя, курс на південь.",
      "timestamp": "2026-01-06T14:45:35.745178Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2026-01-06T14:45:35.745184Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-06T14:45:35.745191Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Запорізьку область.",
      "timestamp": "2026-01-06T14:45:35.745200Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2026-01-06T14:45:35.745217Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-06T14:45:35.745223Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Дніпра із західного напрямку.",
      "timestamp": "2026-01-06T14:45:35.745229Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини, курс на н.п. Магдалинівка.",
      "timestamp": "2026-01-06T14:45:35.745234Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-06T14:45:35.745241Z"
    },
    {
      "original": "🛵\n БпЛА на заході Дніпропетровщини, курс на Кіровоградщину.",
      "timestamp": "2026-01-06T14:45:35.745246Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Дніпропетровщини, курс на н.п.Зачепилівка на Харківщині.",
      "timestamp": "2026-01-06T14:45:35.745251Z"
    },
    {
      "original": "🛵\n БпЛА на н.п. Карлівка на Полтавщині з півдня.",
      "timestamp": "2026-01-06T14:45:35.745257Z"
    },
    {
      "original": "To all the geniuses who accuse me of reporting Tornado-S strikes to S-300 ground-to-ground strikes, notice how there is no ballistic threat this time?\nWhen there is a ballistic threat, a non-Iskander target is detected flying and an explosion is heard, that is almost always an S-300 ground-to-ground. Don't ask me why Russia does this, but it happens.",
      "timestamp": "2026-01-06T14:45:36.343218Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-06T14:45:36.343231Z"
    },
    {
      "original": "Repeated explosions in Kharkiv City",
      "timestamp": "2026-01-06T14:45:36.343235Z"
    },
    {
      "original": "Tornado-S strikes are also being carried out on Slovyansk, Donetsk Oblast simultaneously.",
      "timestamp": "2026-01-06T14:45:36.343240Z"
    },
    {
      "original": "Tornado-S strikes are now carried out on the area of Rohan, to the southeast of Kharkiv City.",
      "timestamp": "2026-01-06T14:45:36.343244Z"
    },
    {
      "original": "Repeated strikes on Kharkiv City.\nA Russian recon drone is operating just north of the city centre, adjusting the strikes.",
      "timestamp": "2026-01-06T14:45:36.343249Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-06T14:45:36.343274Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-06T14:45:36.343279Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-06T14:45:36.343283Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-06T14:45:36.343287Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the southeast, Russian forces resumed their assault operations towards eastern Yarova, recapturing positions in the forests there and reaching the edge of the town.\nTo the west, the Russians advanced south to the western part of Yarova, recapturing positions in the forests south of the railway line. They also began attacks to the southwest and west, improving their positions in the forests and reaching the outskirts of Sosnove.\nTo the north, Russian forces resumed their assault operations in the direction of Oleksandrivka, where they advanced northwest and captured new positions in the forests there.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T14:45:36.343299Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress northeast of Lyman.\nIn the northeast, Russian forces resumed their assault operations northwest of Zarichne and captured new treeline positions north of the gulley. From there, they began attacking the Ukrainian positions east of Stavky. Other assault groups are attempting to attack these same positions via the treelines from the eastern part of Stavky. assault operations are also underway on the agricultural buildings on the western outskirts of Stavky.\nIn the southwest, Russian forces continued incrementally consolidating in the fields west of the Pynkov Yar Gulley, where they were able to capture new treeline positions in the direction of the first cluster of agricultural buildings. DRGs continue to infiltrate further west to the northern outskirts of Lyman.\n+ ~1.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T14:45:36.343308Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T14:45:36.343320Z"
    },
    {
      "original": "I keep seeing a lot of so-called \"American patriots\" criticising liberals for being against the U.S. invasion of Venezuela and their attempt at overthrowing the Venezuelan government, by arguing that Venezuelans did not like Maduro and that they are now celebrating his downfall. Ironically, these \"patriots\" are the same people who called for no more foreign wars prior to this, but that's a whole other story. \nAnd yes, while Maduro may not have been popular among Venezuelans, and a large amount of people may be happy that he's gone, the U.S. attacks are bigger than just this. \nAnyone who knows a bit about the very lengthy history of the U.S. carrying out regime changes will understand how this is not a good thing, no matter how happy Venezuelans are that Maduro is gone. This is bigger than just Venezuela. The U.S. is a great power furthering its own interests, as it has done for the last century. It recognises the difficult and worsening situation it is in with the current multipolar state of the world, and this is just one action of a larger interconnected web of geostrategic moves.",
      "timestamp": "2026-01-06T14:45:36.343325Z"
    },
    {
      "original": "I’d like to add that the US is, of course, looking to extend their influence over Venezuela’s large oil reserves",
      "timestamp": "2026-01-06T14:45:36.343331Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T14:45:36.343340Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T14:45:36.343347Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-06T14:45:36.343350Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-06T14:45:36.343354Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-06T14:45:36.343357Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-06T14:45:36.343360Z"
    },
    {
      "original": "Explosions in Kryvyi Rih",
      "timestamp": "2026-01-06T14:45:36.343363Z"
    },
    {
      "original": "New Russian Geran Interceptor Spotted Armed With MANPADS (Video, Photos)\nThe interceptor version of Russian Geran-2 drone has been spotted armed with a modified man-portable air defense system (MANPADS).\nUkrainian media revealed the existence of the Geran-2 interceptor last month, sharing photos showing the wreckage of one such drone which was armed with a top-mounted Soviet-era R-60M short-range air-to-air missile. Footage showing the wreckage of the new MANPADS-armed variant of the interceptor appeared online on January 4.\nJust like the R-60M missile, the MANPAD was mounted on top to keep the belly of the drone clear for the take off, which usually consists of a rocket booster.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.985954Z"
    },
    {
      "original": "New Russian Geran Interceptor Spotted Armed With MANPADS (Video, Photos)\nThe interceptor version of Russian Geran-2 drone has been spotted armed with a modified man-portable air defense system (MANPADS).\nUkrainian media revealed the existence of the Geran-2 interceptor last month, sharing photos showing the wreckage of one such drone which was armed with a top-mounted Soviet-era R-60M short-range air-to-air missile. Footage showing the wreckage of the new MANPADS-armed variant of the interceptor appeared online on January 4.\nJust like the R-60M missile, the MANPAD was mounted on top to keep the belly of the drone clear for the take off, which usually consists of a rocket booster.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.985977Z"
    },
    {
      "original": "Russia and Ukraine Trade Strikes: Kyiv, Chernihiv, and Energy Grid Targeted\nOn the night of January 5, the Ukrainian Air Force reported a massive Russian attack involving 165 strike UAVs and 9 Iskander-M ballistic missiles , along with S-300 anti-aircraft missiles. According to their data, 137 drones were shot down or suppressed, but not a single missile was intercepted.\nThe main strike hit the Chernihiv region: up to eight Iskander missiles struck targets in Chernihiv, including six direct hits and two in the area of the 169th Land Forces Training Center in Desna. As a result, a local thermal power plant caught fire.\nDrones were active over Kyiv and adjacent areas. Monitoring channels recorded attempts to encircle the capital: targets in Fastiv, Vyshhorod, and Boryspil, including the Kyiv Hydroelectric Power Plant and the TEC-6 thermal power plant in Troieshchyna. Slavutych was completely de-energized after the arrival of Gerans — local resources confirmed the blackouts.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-06T14:45:36.985992Z"
    },
    {
      "original": "Russia and Ukraine Trade Strikes: Kyiv, Chernihiv, and Energy Grid Targeted\nOn the night of January 5, the Ukrainian Air Force reported a massive Russian attack involving 165 strike UAVs and 9 Iskander-M ballistic missiles , along with S-300 anti-aircraft missiles. According to their data, 137 drones were shot down or suppressed, but not a single missile was intercepted.\nThe main strike hit the Chernihiv region: up to eight Iskander missiles struck targets in Chernihiv, including six direct hits and two in the area of the 169th Land Forces Training Center in Desna. As a result, a local thermal power plant caught fire.\nDrones were active over Kyiv and adjacent areas. Monitoring channels recorded attempts to encircle the capital: targets in Fastiv, Vyshhorod, and Boryspil, including the Kyiv Hydroelectric Power Plant and the TEC-6 thermal power plant in Troieshchyna. Slavutych was completely de-energized after the arrival of Gerans — local resources confirmed the blackouts.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986002Z"
    },
    {
      "original": "A STRATEGIC TRAP FOR UKRAINE: THE IMPEDING ENCIRCLEMENT OF OREKHOV AND THE WIDENING WAR",
      "timestamp": "2026-01-06T14:45:36.986007Z"
    },
    {
      "original": "Bridgehead In Sumy: Russian Army Advance Pressures Ukrainian Forces \nThe Russian army took control of Hrabovske in the Sumy sector after repelling a series of counterattacks. Assault groups from the Russian \"North\" military unit advanced on several fronts, including the Pervogo Maya area and the tree lines near Andriivka. They advanced up to 800 meters per day.\nIn the Zaporizhzhia sector, the main battles are concentrated in Prymorske, where the control zone is expanding. Clearing and consolidation are ongoing in the Stepnohirsk area, followed by movement northward. In the Kharkiv sector, Russian units have advanced in tree lines near Staritsa, and a forest area southwest of Liman has been successfully cleared. \nHungarian Prime Minister Viktor Orbán characterized the EU-approved military loan for Ukraine as a \"scam,\" stating that Kyiv would never repay these funds.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986018Z"
    },
    {
      "original": "Bridgehead In Sumy: Russian Army Advance Pressures Ukrainian Forces \nThe Russian army took control of Hrabovske in the Sumy sector after repelling a series of counterattacks. Assault groups from the Russian \"North\" military unit advanced on several fronts, including the Pervogo Maya area and the tree lines near Andriivka. They advanced up to 800 meters per day.\nIn the Zaporizhzhia sector, the main battles are concentrated in Prymorske, where the control zone is expanding. Clearing and consolidation are ongoing in the Stepnohirsk area, followed by movement northward. In the Kharkiv sector, Russian units have advanced in tree lines near Staritsa, and a forest area southwest of Liman has been successfully cleared. \nHungarian Prime Minister Viktor Orbán characterized the EU-approved military loan for Ukraine as a \"scam,\" stating that Kyiv would never repay these funds.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986027Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From January 5, 2026\nOn January 5, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986035Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From January 5, 2026\nOn January 5, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986042Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – January 6, 2026",
      "timestamp": "2026-01-06T14:45:36.986049Z"
    },
    {
      "original": "Maduro Pleads ‘Not Guilty’ in U.S., Venezuela Orders Arrest Of Anyone Involved In His Abduction\nVenezuelan leader Nicolás Maduro and his wife pleaded not guilty to drugs, weapons and narco-terrorism charges at a court in New York on January 5, two days after their abduction by United States special forces.\n“I am president of the republic of Venezuela, and I am here, kidnapped, since January 3, Saturday,” Maduro told the U.S. District Judge Alvin Hellerstein at Manhattan federal court. “I was captured at my home in Caracas, Venezuela.”\nMaduro, who entered the courtroom with his feet in shackles, was widely described by U.S. media as being defiant. Meanwhile, his wife, Cilia Flores, appeared to have injuries, which her lawyer, Mark Donnelly, said were sustained when the U.S. abducted the pair.\nOn the same day in Caracas, Delcy Rodríguez was formally sworn in as Venezuela’s acting president. The oath of office was administered by her brother, National Assembly President Jorge Rodríguez.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986058Z"
    },
    {
      "original": "Maduro Pleads ‘Not Guilty’ in U.S., Venezuela Orders Arrest Of Anyone Involved In His Abduction\nVenezuelan leader Nicolás Maduro and his wife pleaded not guilty to drugs, weapons and narco-terrorism charges at a court in New York on January 5, two days after their abduction by United States special forces.\n“I am president of the republic of Venezuela, and I am here, kidnapped, since January 3, Saturday,” Maduro told the U.S. District Judge Alvin Hellerstein at Manhattan federal court. “I was captured at my home in Caracas, Venezuela.”\nMaduro, who entered the courtroom with his feet in shackles, was widely described by U.S. media as being defiant. Meanwhile, his wife, Cilia Flores, appeared to have injuries, which her lawyer, Mark Donnelly, said were sustained when the U.S. abducted the pair.\nOn the same day in Caracas, Delcy Rodríguez was formally sworn in as Venezuela’s acting president. The oath of office was administered by her brother, National Assembly President Jorge Rodríguez.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986068Z"
    },
    {
      "original": "Trump Is Dead Serious About Taking Over Greenland\nUnited States President Donald Trump has doubled down on the idea of taking over Greenland, even after Denmark's leader urged him to \"stop the threats\" over the island.\nEven before assuming office, Trump has repeatedly raised the prospect of the semi-autonomous Danish territory becoming a part of the U.S., citing its strategic location for defense purposes and mineral wealth.\nSpeaking to NBC News on January 5, Trump said that the U.S. \"need Greenland for national security, and that includes Europe.\"\nTrump also said he had \"no timeline\" for taking action, but maintained he is \"very serious\" in his intent to take over Greenland.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986077Z"
    },
    {
      "original": "Trump Is Dead Serious About Taking Over Greenland\nUnited States President Donald Trump has doubled down on the idea of taking over Greenland, even after Denmark's leader urged him to \"stop the threats\" over the island.\nEven before assuming office, Trump has repeatedly raised the prospect of the semi-autonomous Danish territory becoming a part of the U.S., citing its strategic location for defense purposes and mineral wealth.\nSpeaking to NBC News on January 5, Trump said that the U.S. \"need Greenland for national security, and that includes Europe.\"\nTrump also said he had \"no timeline\" for taking action, but maintained he is \"very serious\" in his intent to take over Greenland.\nRead more \nHERE",
      "timestamp": "2026-01-06T14:45:36.986086Z"
    }
  ],
  "script_run_time": "2026-01-06T14:45:36.986988Z"
}