{
  "messages": [
    {
      "original": "🛵\n БпЛА у напрямку Дніпра зі східного напрямку.",
      "timestamp": "2026-01-19T07:59:50.732720Z"
    },
    {
      "original": "🛵\n БпЛА із Сумщини на північний схід Чернігівщини, курс  західний.",
      "timestamp": "2026-01-19T07:59:50.732737Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у Ніжинському р-ні., вектор руху у напрямку Києва.",
      "timestamp": "2026-01-19T07:59:50.732742Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА в р-ні. м. Запоріжжя зі сходу, курсом на захід.",
      "timestamp": "2026-01-19T07:59:50.732747Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА  на Чернігівщині в р-ні. Крюківки, Мени, Борозни та Ніжина вектором руху у напрямку Київщини.",
      "timestamp": "2026-01-19T07:59:50.732752Z"
    },
    {
      "original": "🛵\n БпЛА в р-ні. міста Запоріжжя, наближається із півночі.",
      "timestamp": "2026-01-19T07:59:50.732756Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Чернігівщини, південно-західний.",
      "timestamp": "2026-01-19T07:59:50.732761Z"
    },
    {
      "original": "🛵\n БпЛА на сході Сумщини, курс західний.",
      "timestamp": "2026-01-19T07:59:50.732765Z"
    },
    {
      "original": "🛵\n Схід Сумщини ворожі БпЛА, рухаються у західному напрямку.",
      "timestamp": "2026-01-19T07:59:50.732770Z"
    },
    {
      "original": "🛵\n🛸\nХарківщина, Донеччина та Дніпропетровщина, ворожі БпЛА вздовж лінії розмежування, ймовірно, розвідувальні.",
      "timestamp": "2026-01-19T07:59:50.732776Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-19T07:59:50.732780Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 126 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 19 січня (з 18:00 18 січня) противник атакував 145 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллєрово, Приморсько-Ахтарськ – рф., Чауда – ТОТ АР Крим, Донецьк - ТОТ України, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 126 ворожих БпЛА типу Shahed, Гербера і дронів інших типів.\nЗафіксовано влучання 13 ударних БпЛА на 12 локаціях, а також падіння збитих (уламки) БпЛА на п'яти локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-19T07:59:50.732800Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Харківщину.",
      "timestamp": "2026-01-19T07:59:50.732805Z"
    },
    {
      "original": "🛵\n🛸\n Південь Миколаївщини ворожі БпЛА, ймовірно розвідувальні.",
      "timestamp": "2026-01-19T07:59:50.732814Z"
    },
    {
      "original": "🛵\n БпЛА в р-ні. міста Запоріжжя, із східного напрямку.",
      "timestamp": "2026-01-19T07:59:50.732819Z"
    },
    {
      "original": "🛵\n🛸\n Дніпропетровщина - БпЛА на Павлоград, Тернівку, Межову.",
      "timestamp": "2026-01-19T07:59:50.732824Z"
    },
    {
      "original": "🛵\n Запоріжжя - БпЛА в напрямку міста.",
      "timestamp": "2026-01-19T07:59:50.732830Z"
    },
    {
      "original": "🛸\n Одещина - розвіддрон на Березівку/Раухівку з Миколаївщини.",
      "timestamp": "2026-01-19T07:59:50.732835Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2026-01-19T07:59:50.732842Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2026-01-19T07:59:50.732846Z"
    },
    {
      "original": "New high-resolution satellite imagery of Donetsk International Airport shows continued expansion of Russia's Geran-2 drone launch point there.\n3 new static launch pads have been installed in the last month, bringing the total number of launchers there to 7. \nThe number of open garages for storing drones remains unchanged at 93, 81 of which have a capacity of 2 drones and 12 of which have a capacity of 1 drone. This means that the total number of drones that can be stored, not including larger storage facilities, is 174.\nAdditionally, one of the newly installed launch pads is capable of launching Geran-4 and Geran-5 jet drones, which have already been used to attack targets near Kryvyi Rih, Dnipropetrovsk Oblast. \nImage credit: \n@StrategicaviationT\n.",
      "timestamp": "2026-01-19T07:59:51.529903Z"
    },
    {
      "original": "New high-resolution satellite imagery of Donetsk International Airport shows continued expansion of Russia's Geran-2 drone launch point there.\n3 new static launch pads have been installed in the last month, bringing the total number of launchers there to 7. \nThe number of open garages for storing drones remains unchanged at 93, 81 of which have a capacity of 2 drones and 12 of which have a capacity of 1 drone. This means that the total number of drones that can be stored, not including larger storage facilities, is 174.\nAdditionally, one of the newly installed launch pads is capable of launching Geran-4 and Geran-5 jet drones, which have already been used to attack targets near Kryvyi Rih, Dnipropetrovsk Oblast. \nImage credit: \n@StrategicaviationT\n.",
      "timestamp": "2026-01-19T07:59:51.529920Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. I also have Signal if you prefer that.",
      "timestamp": "2026-01-19T07:59:51.529928Z"
    },
    {
      "original": "⚡️\n🇸🇾\n🇸🇾\n🏴\n🇸🇾\n🌟\n A mixture of ISIS and tribal forces attempted to infiltrate the town of Doma in Eastern Swaida Governorate.\nSwaida's National Guard successfully repelled the attack thanks to surveillance equipment which detected the fighters approaching.\n@wfwitness",
      "timestamp": "2026-01-19T07:59:51.529940Z"
    },
    {
      "original": "🇸🇾\n📞\n🇮🇱\n \n— General Commander of the YPG Sipan Hamo: \nIsrael is a powerful state in the region, and we hope that the stance it has taken to protect the Druze will also be extended to include the Kurds.",
      "timestamp": "2026-01-19T07:59:51.529948Z"
    },
    {
      "original": "🇸🇾\n📞\n🇮🇱\n — General Commander of the YPG Sipan Hamo:  Israel is a powerful state in the region, and we hope that the stance it has taken to protect the Druze will also be extended to include the Kurds.",
      "timestamp": "2026-01-19T07:59:51.529954Z"
    },
    {
      "original": "Who could've seen that coming \n😁",
      "timestamp": "2026-01-19T07:59:51.529959Z"
    },
    {
      "original": "The U.S. is getting a lot of wins in the Middle East right now...\n- They abandoned the SDF in favour of a stronger, more stable STG, who can now control and administer oil and gas fields, and further counter Iranian influence in the region.\n- Because of this agreement with the SDF, the STG will likely go after Druze factions in Suweida next, namely the SMC, which will prevent the STG from normalising ties with Israel, providing Israel with \"justification\" to keep expanding their \"buffer zone\", further strengthening their influence and weakening STG potential.\n- The more \"extreme\" Kurdish groups opposed to the agreement with the STG may also turn to Israel, seeking SMC-like relations and support, providing Israel with additional \"justification\" to stay at odds with the STG, thereby preventing them from getting too strong and keeping them loyal to the US.\n- And all the while, the U.S. can continue their efforts at dismantling the Iranian regime, which could end through additional military operations. \nEssentially, a more complex and proxy-based version of \"divide and rule\". The next few months will be very interesting.",
      "timestamp": "2026-01-19T07:59:51.529966Z"
    },
    {
      "original": "Vuhledar in 2026. \nPopulation: 25\nThe city is now around 50 km behind the frontline.",
      "timestamp": "2026-01-19T07:59:51.529971Z"
    },
    {
      "original": "Large numbers of Russian Geran-2 and Gerbera drones are arriving at various airbases in preparation for large attacks on Ukraine.\n- Several IL-76MD cargo planes landed at Baltimore Airbase, Voronezh Oblast, with drones being delivered to launch sites (presumably including Tsumublova Testing Ground, Oryol Oblast) via rail.\n- An IL-76MD landed at Shatalovo Airbase, Smolensk Obalst, delivering drones to the launch site there.\n- An IL-76MD landed at Hvardiiske Airbase, Crimea, delivering drones to the launch site there.",
      "timestamp": "2026-01-19T07:59:51.529978Z"
    },
    {
      "original": "An IL-76MD cargo plane landed at Akhtubinsk Airbase, Astrakhan Oblast during the day.\nThe cargo presumably consists of Kh-59/69 cruise missiles for the Su-57 fighters stationed there.",
      "timestamp": "2026-01-19T07:59:51.529982Z"
    },
    {
      "original": "Explosions in Dnipro. Cause unknown, possibly a missile. There was also an explosion in Zaporizhzhia.\nClarifying.",
      "timestamp": "2026-01-19T07:59:51.529986Z"
    },
    {
      "original": "Explosions in Dnipro. Cause unknown, possibly a missile. There was also an explosion in Zaporizhzhia.  Clarifying.",
      "timestamp": "2026-01-19T07:59:51.529989Z"
    },
    {
      "original": "Zaporizhzhia City is being targeted by Tornado-S rockets equipped with cluster warheads, which were launched from the Tokmak area of Zaporizhzhia Oblast. At least three impacts have been recorded, 2 of which struck the southern part of the city while the third hit the southern outskirts/nearby settlements. A Russian reconnaissance drone is operating in the area, adjusting the strikes.\nThe explosion heard in Dnipro is from a Geran-2 drone strike on the Stara Ihren District in the southeastern part of the city. Several more drones are now flying in.",
      "timestamp": "2026-01-19T07:59:51.529993Z"
    },
    {
      "original": "A bunch of Ukrainian accounts are fabricating a Ukrainian HIMARS attack on a substation in Donetsk City.\nThis has not happened, and the photos being spread are old and unrelated. As of now, only UAVs have attacked the city.",
      "timestamp": "2026-01-19T07:59:51.530002Z"
    },
    {
      "original": "Russia's Rubicon unit has published new footage showing a series of drone strikes on rear Ukrainian targets.\nTargets hit include:\n- A 19Zh6 radar + a trailer in Mykolaiv Oblast (47.07939, 32.09680), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.40642, 35.73496), ~63 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.42119, 35.82679), ~62 km from the frontline.\n- A 36D6 radar in Dnipropetrovsk Oblast (48.80733, 35.38527), ~114 km from the frontline.\n- A P-18 radar in Dnipropetrovsk Oblast (48.81586, 35.75437), ~101 km from the frontline.\n- A P-18MU radar + a truck in Mykolaiv Oblast (46.97961, 31.70417), ~47 km from the frontline.\n- Command and control vehicle for a P-18MA radar in Mykolaiv Oblast (47.22859, 32.542), ~63 km from the frontline.\n- Command and control vehicle for a 36D6 radar in Odesa Oblast (46.60873, 30.91776), ~45 km from the frontline.\n- A 36D6 radar in Kharkiv Oblast (49.40271, 36.61234), ~75 km from the frontline.\n- A Buk Surface-to-air missile system in Dnipropetrovsk Oblast (48.3567, 36.24613), ~38 km from the frontline.\n- 4 strikes on the \"Hirnyk\" 35 kV electrical substation in Donetsk Oblast (48.58938, 37.48830), ~8 km from the frontline.",
      "timestamp": "2026-01-19T07:59:51.530015Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-19T07:59:51.530018Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast from Kursk",
      "timestamp": "2026-01-19T07:59:51.530021Z"
    },
    {
      "original": "Disappeared near Zolochiv, Kharkiv Oblast.",
      "timestamp": "2026-01-19T07:59:51.530026Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-19T07:59:51.530041Z"
    },
    {
      "original": "An explosion was heard in the town of Zolochiv.",
      "timestamp": "2026-01-19T07:59:51.530045Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-19T07:59:51.530048Z"
    },
    {
      "original": "The impact occurred outside Zolochiv. Another missile is flying in that direction.",
      "timestamp": "2026-01-19T07:59:51.530051Z"
    },
    {
      "original": "Another explosion in Zolochiv, impacting the same target.",
      "timestamp": "2026-01-19T07:59:51.530054Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-19T07:59:52.387146Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-19T07:59:52.387160Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387170Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387179Z"
    },
    {
      "original": "NATO's Greenland Theatrics And Arctic Expansionism\nA perceived \"fight\" between NATO allies would shift attention and allow further militarization without officially focusing on Russia and China. Thus, there's certainly a possibility that the entire Greenland \"fight\" between the US and EU/NATO is nothing more than an elaborate (albeit crawling) scheme to improve the political West's strategic position in the ongoing race for the Arctic.\nThe Trump administration's threat to \"take Greenland\" (in effect, to invade Denmark, a fellow NATO member state) came as a total shock, especially to those who refuse to acknowledge that the strength of the political West is slowly degenerating into a mere shadow of its former self. Speaking of which, several EU/NATO armies proved that point, as well as the fact that they simply cannot survive without US assistance. And yet, on January 15, several European NATO member states sent their troops to Greenland, all in \"support of Denmark\". Numerous media outlets reported that a Danish US-made C-130 military transport aircraft landed overnight in Nuuk, Greenland's capital, carrying Danish and French soldiers.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387188Z"
    },
    {
      "original": "Family Over Flag: Ukrainian Soldier on Motives for Surrender\nPrivate Alexander Sotnikov of the 25th Airborne Brigade\n of the Ukrainian Armed Forces was captured after his group—relying on faulty intelligence—entered a house near Dimitrov (Mirnograd) occupied by Russian troops. In an interview following his capture, he described his forcible mobilization despite a documented deferment, and the grueling six-day march to the front. His remarks underscore challenges in forced conscription: a lack of personal motivation and a sense that the state has failed its citizens. For him, family comes first—not flags or ideologies.\n\"The problem is we don't want to be mobilized. If I were a contract soldier or some great patriot, that would be different. I'm a patriot of my family, not of anyone else. Yes, I'm a citizen of Ukraine, but it gave me nothing. What flag... I slaved away 12 hours a day at the furnace.\"",
      "timestamp": "2026-01-19T07:59:52.387195Z"
    },
    {
      "original": "Kurdish Forces Lost Raqqa, Accepted Syrian Government’s Integration Plan (Videos)\nSyrian President Ahmad al-Sharaa on January 18 signed off on an agreement including a ceasefire with the Syrian Democratic Forces (SDF) and steps to completely integrate the Kurdish-led group into the institutions of the Syrian Transitional Government (STG).\nThe agreement came after the SDF lost the strategic city of Tabqa in the governorate of Raqqa to STG forces and all of the territories it was holding in the governorate of Deir Ezzor to an uprising by Arab tribes overnight.\nEven as the agreement was being announced, the group lost control over the city of Raqqa to tribal fighters. STG forces moved in.\nUnder the agreement, the STG will assume full administrative and military control over Raqqa and Deir Ezzor, including all civil institutions and public facilities. Existing employees will be retained, and Damascus pledged not to pursue SDF fighters or civil administration personnel.\nRead more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387204Z"
    },
    {
      "original": "Kurdish Forces Lost Raqqa, Accepted Syrian Government’s Integration Plan (Videos)\nSyrian President Ahmad al-Sharaa on January 18 signed off on an agreement including a ceasefire with the Syrian Democratic Forces (SDF) and steps to completely integrate the Kurdish-led group into the institutions of the Syrian Transitional Government (STG).\nThe agreement came after the SDF lost the strategic city of Tabqa in the governorate of Raqqa to STG forces and all of the territories it was holding in the governorate of Deir Ezzor to an uprising by Arab tribes overnight.\nEven as the agreement was being announced, the group lost control over the city of Raqqa to tribal fighters. STG forces moved in.\nUnder the agreement, the STG will assume full administrative and military control over Raqqa and Deir Ezzor, including all civil institutions and public facilities. Existing employees will be retained, and Damascus pledged not to pursue SDF fighters or civil administration personnel.\nRead more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387213Z"
    },
    {
      "original": "Women Fill the Gap: Surge in Female Personnel in Ukraine's Armed Forces Amid Manpower Shortages\nIn recent years, the Armed Forces of Ukraine (AFU) have seen a notable increase in the number of women serving in their ranks. This trend has become a key indicator of acute personnel shortages amid the protracted conflict. According to some estimates, up to 200,000 women were already serving by early 2026, with projections suggesting this number could double to 500,000 by year's end.\n\"Previously, women in the AFU were a rare exception: isolated examples of well-trained medics, paramedics, communications personnel, and, more rarely, snipers,\" noted Russian expert Vladimir Popov. \"Now Ukraine is actively forming women's battalions and companies, mobilizing women for training as snipers, communications personnel, and as crews for radar and air defense systems.\" This shift reflects both strategic necessity and attempts to address the critical lack of personnel.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387222Z"
    },
    {
      "original": "Women Fill the Gap: Surge in Female Personnel in Ukraine's Armed Forces Amid Manpower Shortages\nIn recent years, the Armed Forces of Ukraine (AFU) have seen a notable increase in the number of women serving in their ranks. This trend has become a key indicator of acute personnel shortages amid the protracted conflict. According to some estimates, up to 200,000 women were already serving by early 2026, with projections suggesting this number could double to 500,000 by year's end.\n\"Previously, women in the AFU were a rare exception: isolated examples of well-trained medics, paramedics, communications personnel, and, more rarely, snipers,\" noted Russian expert Vladimir Popov. \"Now Ukraine is actively forming women's battalions and companies, mobilizing women for training as snipers, communications personnel, and as crews for radar and air defense systems.\" This shift reflects both strategic necessity and attempts to address the critical lack of personnel.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387230Z"
    },
    {
      "original": "\"Volunteer Corps\" on the Path to Kramatorsk in Ukraine: Russian Army Establishes Control Over Minkivka and Pryvillia\n▪️\nIn the Kramatorsk sector, Russian units, including the \"Volunteer Corps,\" gained control of Minkivka and Pryvillia during engagements. \n▪️\nIn the Slaviansk sector, units operating north of Krasnyi Liman forced Ukrainian forces out of Aleksandrovka. Fighting continues for control of the western part of the village in the Zakotne area. In the southern section, clashes for control of Nykyforivka persist, and Russian forces advanced in Minkovo. \n▪️\nIn the Kostiantynivka sector, Russian assault groups expanded their control over the approaches to the city. They advanced toward strongpoints in the area of the former anti-aircraft missile battalion. They also established control over a section from Predtechyne. This expanded the gray zone to the outskirts of Kostiantynivka. \n▪️\nIn the Pokrovsk sector, the most intense fighting is near Hryshyne, where Russian units have consolidated their position within an agro-industrial complex. In the Czech Republic, the president and the government are in a public dispute over the potential transfer of domestically produced subsonic combat aircraft to Ukraine.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387243Z"
    },
    {
      "original": "\"Volunteer Corps\" on the Path to Kramatorsk in Ukraine: Russian Army Establishes Control Over Minkivka and Pryvillia\n▪️\nIn the Kramatorsk sector, Russian units, including the \"Volunteer Corps,\" gained control of Minkivka and Pryvillia during engagements. \n▪️\nIn the Slaviansk sector, units operating north of Krasnyi Liman forced Ukrainian forces out of Aleksandrovka. Fighting continues for control of the western part of the village in the Zakotne area. In the southern section, clashes for control of Nykyforivka persist, and Russian forces advanced in Minkovo. \n▪️\nIn the Kostiantynivka sector, Russian assault groups expanded their control over the approaches to the city. They advanced toward strongpoints in the area of the former anti-aircraft missile battalion. They also established control over a section from Predtechyne. This expanded the gray zone to the outskirts of Kostiantynivka. \n▪️\nIn the Pokrovsk sector, the most intense fighting is near Hryshyne, where Russian units have consolidated their position within an agro-industrial complex. In the Czech Republic, the president and the government are in a public dispute over the potential transfer of domestically produced subsonic combat aircraft to Ukraine.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-19T07:59:52.387255Z"
    }
  ],
  "script_run_time": "2026-01-19T07:59:52.387990Z"
}