{
  "messages": [
    {
      "original": "🛵\n БпЛА на Миколаївщині в напрямку Снігурівки з південного сходу.",
      "timestamp": "2026-01-14T04:03:52.410418Z"
    },
    {
      "original": "🛵\nБпЛА на Нікопольський р-н Дніпропетровщини з півдня.",
      "timestamp": "2026-01-14T04:03:52.410435Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА в напрямку Зеленодольська та Кривого Рогу зі сходу.",
      "timestamp": "2026-01-14T04:03:52.410440Z"
    },
    {
      "original": "🛵\n Групи БпЛА в акваторії Чорного моря, курс - північний.",
      "timestamp": "2026-01-14T04:03:52.410445Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі.",
      "timestamp": "2026-01-14T04:03:52.410450Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння з півночі.",
      "timestamp": "2026-01-14T04:03:52.410455Z"
    },
    {
      "original": "🛵\n Групи БпЛА в акваторії Чорного моря, курс - північний.",
      "timestamp": "2026-01-14T04:03:52.410459Z"
    },
    {
      "original": "🛵\n Група БпЛА курсом на Миколаївщину з акваторії Чорного моря (вектор - Очаків).",
      "timestamp": "2026-01-14T04:03:52.410465Z"
    },
    {
      "original": "🛵\n Житомирщина: БпЛА в напрямку н.п.Народичі з південного сходу.",
      "timestamp": "2026-01-14T04:03:52.410470Z"
    },
    {
      "original": "🛵\nЧернігівщина: БпЛА в напрямку Седніва з північного сходу.",
      "timestamp": "2026-01-14T04:03:52.410474Z"
    },
    {
      "original": "🛵\nЧернігівщина: БпЛА в напрямку Седніва з північного сходу.",
      "timestamp": "2026-01-14T04:03:52.410479Z"
    },
    {
      "original": "🛵\nЗмінив курс на Ріпки.",
      "timestamp": "2026-01-14T04:03:52.410483Z"
    },
    {
      "original": "🛵\n БпЛА курсом на/повз Миколаїв з південного заходу.",
      "timestamp": "2026-01-14T04:03:52.410489Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА в напрямку н.п. Березна, Ніжин, Борзна.",
      "timestamp": "2026-01-14T04:03:52.410494Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного сходу.",
      "timestamp": "2026-01-14T04:03:52.410498Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА в напрямку Синельникового/Славгорода зі сходу.",
      "timestamp": "2026-01-14T04:03:52.410503Z"
    },
    {
      "original": "🛵\n Житомирщина: БпЛА в напрямку н.п.Народичі з південного сходу.",
      "timestamp": "2026-01-14T04:03:52.410507Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного сходу.",
      "timestamp": "2026-01-14T04:03:52.410512Z"
    },
    {
      "original": "📢\nВідбій загрози застосування балістичного озброєння.",
      "timestamp": "2026-01-14T04:03:52.410516Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на заході Запорізької області, курс - південний.",
      "timestamp": "2026-01-14T04:03:52.410522Z"
    },
    {
      "original": "🛵\n Житомирщина: БпЛА курсом на Коростень зі сходу.",
      "timestamp": "2026-01-14T04:03:52.410526Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА з півночі курсом на Харків.",
      "timestamp": "2026-01-14T04:03:52.410532Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччині курсом на Харківщину (Лозівський район).",
      "timestamp": "2026-01-14T04:03:52.410536Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-14T04:03:52.410540Z"
    },
    {
      "original": "Flying to Bila Tserkva, ~30 km away",
      "timestamp": "2026-01-14T04:03:53.100395Z"
    },
    {
      "original": "After maneuvering for a while, its now flying east to Trypillya TPP",
      "timestamp": "2026-01-14T04:03:53.100406Z"
    },
    {
      "original": "There was only one missile here, and it was intercepted. \nUkrainian airspace is now clear of missiles.",
      "timestamp": "2026-01-14T04:03:53.100411Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.  Missiles launched:  ~10 Kh-101 cruise missiles launched from 5 Tu-95MS strategic bombers at their launch lines in Kalachyovksy District…",
      "timestamp": "2026-01-14T04:03:53.100415Z"
    },
    {
      "original": "(Updated report)\nLast night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~8 Iskander-M ballistic missiles launched from OTRK installations northeast of Simferopol, Crimea.\n~6 Iskander-M ballistic missiles launched from OTRK installations near Yeysk, Krasnodar Krai.\n~4 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~3 Iskander-M ballistic missiles launched from OTRK installations in the vicinity of Belgorod City, Belgorod Oblast.\n~2 Iskander-M ballistic missiles launched from OTRK installations at Millerovo Airbase, Rostov Oblast.\n~4 Iskander-K cruise missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~2 Iskander-K cruise missiles launched from an OTRK installation near Khalino Airbase, Kursk Oblast.\n~2 Iskander-K cruise missiles launched from an OTRK installation northwest of Klintsy, Bryansk Oblast.\n-----------------------\nTotal missiles launched:\n~23 Iskander-M ballistic missiles.\n~8 Iskander-K cruise missiles.\n~31 missiles in total.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 2 Iskander-Ms and 4 Iskander-Ks.\n-----------------------\nThe main targets for this strike was Ukrainian energy infrastructure. The following was targeted:\nTrypillya Thermal Power Plant, Kyiv Oblast (50.13416, 30.74705) by ~1 Iskander-M.\nKryvyi Rih Thermal Power Plant, Dnipropetrovsk Oblast (47.5436, 33.66164) by ~8 Iskander-Ms.\n\"Zaporizka\" 750 kV electrical substation, Zaporizhzhia Oblast (47.99956, 35.50957) by ~6 Iskander-Ms.\nKharkiv TEC-5 Combined Heat and Power Plant, Kharkiv Oblast (49.9707, 36.11154) by ~3 Iskander-Ms.\n\"Kyiv\" 750 kV electrical substation, Kyiv Oblast (50.49441, 29.69235) by ~4 Iskander-Ks.\nUnknown target in Petropavlivka, Dnipropetrovsk Oblast by ~2 Iskander-Ms. \nUnknown target in southern Kyiv City by ~1 Iskander-M.\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2026-01-14T04:03:53.100440Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast. \nExplosions were heard and a large fire broke out at the production buildings. \nAtlant Aero specialises in the production of of aircraft and spacecraft. It also produces drones, including Molniya FPV drones, as well as components for Orion drones, other drone related equipment, and electronic warfare systems.",
      "timestamp": "2026-01-14T04:03:53.100445Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast. \nExplosions were heard and a large fire broke out at the production buildings. \nAtlant Aero specialises in the production of of aircraft and spacecraft. It also produces drones, including Molniya FPV drones, as well as components for Orion drones, other drone related equipment, and electronic warfare systems.",
      "timestamp": "2026-01-14T04:03:53.100450Z"
    },
    {
      "original": "Footage showing a Russian Geran-2 drone strike on a facility in the village of Krupets, Sumy Oblast, reportedly used by Ukraine as a drone assembly point. \nWhile this footage only shows one strike, multiple other drones impacted the complex too. \nCoordinates: 51.91402, 33.56219",
      "timestamp": "2026-01-14T04:03:53.100455Z"
    },
    {
      "original": "Russian forces have captured the village of Lukyanivske,  Komyshuvakha direction, Zaporizhzhia Oblast.\nPre-war population: ~143.\nTotal land area: ~0.73 km².\nThe fighting for Lukyanivske lasted approximately 25 days.",
      "timestamp": "2026-01-14T04:03:53.100461Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their offensive operations and have made significant progress in the direction of the Konka River.\nIn the west, Russian forces completed the clearing of central and northern Stepnohirsk, bringing the town under their full control. This allowed for them to fully shift their focus to areas further north, with assault groups taking up new positions in the treelines and forest plantations there. \nOther forces continued infiltrating west from Primorske, and finally consolidated in the area of the pumping station and orchards. Infiltrations are now being carried out further north up the highway and then to the northeast through the fields in the direction of Mahdalynivka. Russian MLRS shelling is constantly targeting these areas, supporting the offensive effort. \nAdditionally, Russian forces advanced from the central part of Prymorske to the northern streets of the village, consolidating in the last part of the main residential area. Fighting is now ongoing for the dachas on the northern outskirts, and infiltrations are taking place further northeast, where they managed to reach the bridge over the Konka River and cut the E-105 Highway. The Ukrainians responded by blowing up the bridge to prevent further Russian advancement. Russian forces also continued infiltrating east from northern Prymorske and captured part of the forests there.\nIn the east, Russian forces managed to consolidate in the western part of Lukyanivske, including in the agricultural buildings, and captured treeline positions to the south and southeast. As a result of these advances, they were able to bring the rest of the village under their control, and seize the treeline to the north, from which infiltrations are now being carried out even further north in the direction of Mahdalynivka. Due to these sudden advances, Russian DRGs managed to ambush Ukrainian drone operators in the village, probably resulting in casualties for the Ukrainians. \n+ ~17.52 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100470Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their offensive operations and have made significant progress in the direction of the Konka River.  In the west, Russian forces completed the clearing of central and northern Stepnohirsk, bringing the…",
      "timestamp": "2026-01-14T04:03:53.100473Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that due to the rapidly deteriorating situation western Zaporizhzhia Oblast, Ukrainian forces blew up the highway bridge over the Konka River in the village of Hryhorivka.\nRussian forces recently achieved a localised breakthrough in this direction, quickly reaching the bridge. These Russian actions are aimed at capturing everything south of the Konka River, and creating a large right flank for the stronghold city of Orikhiv, which will eventually be used to encircle and capture the city. The Ukrainians are attempting to contain this advance against the Konka River.",
      "timestamp": "2026-01-14T04:03:53.100477Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces continued their assault operations in Mala Tokmachka and have made new progress.\nAfter regaining the initiative and expanding their foothold in the eastern part of Mala Tokmachka again, Russian forces continued advancing west and have captured new positions along the highway north of the ruins of the prison. They also improved their positions in the streets to the north, approaching the centre of the village.\n+ ~0.44 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100486Z"
    },
    {
      "original": "In the Omelnyk direction, both Russian and Ukrainian forces have advanced, with Russian forces continuing their intensified assault operations aimed at establishing a large bridgehead west of the Haichur River.\nIn the north, the Russians began clearing the grey-zone that formed east of the Haichur River in November/December. They were able to recapture positions in numerous treelines, primarily north of the gulley that stretches southeast from southern Dobropillya. From there, they managed to infiltrate west through a gap in Ukrainian defences and entered the village of Pryluky and the trench fortifications to the west. Ukrainian forces are counterattacking, with heavy fighting ongoing for the trenches there. \nTo the south, following earlier infiltrations by DRGs, Russian forces advanced from northwestern Hulyaipole and managed to enter and capture the village of Zelene. From there, they continued infiltrating the village of Sviatopetrivka from the northeast, which remains in the grey-zone for now. They also captured new treeline positions southwest of Zelene. Additionally, the Russians continued their infiltrations across the Haichur River from Varvarivka, into the southern part of Olenokostiantynivka.\nIn the south, Russian forces continued incrementally advancing southwest of Hulyaipole, and managed to captured new treeline positions in the treelines west of the highway. Meanwhile, Ukrainian forces managed to complete the clearing operations in eastern Zaliznychne, bringing the town back under their control.\n+ ~13.17 km² in favour of Russia.\n+ ~0.62 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100495Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces resumed their counterattacks in the direction of Udachne, making new progress.\nFollowing their earlier failed attempts at entering the town from the northwest, Ukrainian forces launched a new series of attacks from the west. They first advanced south down the Donetsk-Dnipropetrovsk Regional Border to the poorly consolidated Russian positions in northern Molodetske, which subsequently shifted into the grey-zone. \nThen, without consolidating, the Ukrainians infiltrated further east along the railway line and are trying to accumulate just west of Udachne. Russian FPV drone operators are attempting to cover the infiltration routes in order to limit the number of soldiers reaching the western approaches to the town. \nIn the east, Ukrainian forces counterattacked in the direction of the railway line between Kotlyne and Udachne, recapturing positions along three parallel treelines. \nMeanwhile, Russian forces continued their attacks both east and west of the Pokrovsk Coal Mine's waste dumps, while DRGs began infiltrating further northwest through the forest plantations in the direction of Serhiivka. \n+ ~1.44 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100503Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.\nLaunched from a Su-57",
      "timestamp": "2026-01-14T04:03:53.100507Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued their assault operations on a wide front, making new progress in four different areas.\nIn the south, following several attempts, Russian infantry managed to gain a foothold in the railway windbreaks north of Rodynske and began accumulating infantry for additional attacks through the windbreaks further west. Other forces in central Rodynske managed to infiltrate the former \"Zaporozhskaya\" Mine west of the city. Fighting also continues for central Zatyshok, where the Russians are trying to dislodge the remaining Ukrainian soldiers.\nTo the north, Russian forces managed to consolidate in two more clay mines, along with additional forested areas and treelines. Attacks are now being carried out further north, where assault groups have reached the southern outskirts of Kucheriv Yar once again. Renewed fighting is also ongoing for Ivanivka, and Russian soldiers are continuing their attacks in western Nove Shakhove.\nTo the northeast, Russian forces continued advancing north from Shakhove and captured new positions southwest of Toretske. Fighting is ongoing for a large trench fortification there. Additionally, Russian forces managed to further improve their positions in the treelines northeast of Sofiivka. \n+ ~7.55 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100515Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.  Launched from a Su-57",
      "timestamp": "2026-01-14T04:03:53.100518Z"
    },
    {
      "original": "The Kh-59/69 cruise missile was shot down as it approached the Sumy-Poltava border. \nAn explosion was heard in Sumy, likely from the launch of a patriot missile which intercepted the Russian missile. \nA Russian Su-57 continues to fly in Kursk Oblast, covered by a Su-35.",
      "timestamp": "2026-01-14T04:03:53.100523Z"
    },
    {
      "original": "In addition to the strikes on the Kryvyi Rih TPP, eastern Dnipropetrovsk Oblast also came under attack.  - 2 Iskander-M ballistic missiles launched from Millerovo Airbase, Rostov Oblast, impacted an unknown target in the town of Petropavlivka [Media 2].  …",
      "timestamp": "2026-01-14T04:03:53.100526Z"
    },
    {
      "original": "Footage has been released showing last night's Russian Iskander-M ballistic missile strike on eastern Dnipropetrovsk Oblast.\n1 missile (not 2) targeted a concentration of Ukrainian manpower and vehicles near the village of Troitske, just east of Petropavlivka.",
      "timestamp": "2026-01-14T04:03:53.100530Z"
    },
    {
      "original": "For some reason, after months of constant updates, all of the so-called Pro-Ukrainian sources aren't reporting on the Dobropillya direction anymore... \n🤔\nAs I've said before, your silence and selective reporting is a betrayal to Ukraine - the country you claim to support so much.",
      "timestamp": "2026-01-14T04:03:53.100535Z"
    },
    {
      "original": "New footage shows FP-2 drones of the Ukrainian \"Kairos\" battalion of the 414th Special Operations Brigade striking rear Russian targets in Donetsk Oblast. \nThe following was hit:\n- \"Myrna\" 330 kV electrical substation in the city of Mariupol (47.185541, 37.561191) by 2 drones. 2 of the substation's transformers were damaged.\n- \"Azovska\" 220 kV electrical substation in the city of Mariupol (47.164252,37.513224) by 1 drone. 1 of the substations transformers was damaged.\n- Warehouses containing rockets and artillery shells of the Russian 51st Guards Combined Arms Army in Donetsk City (48.065319,37.851658) by 2 drones. A fire broke out, followed by secondary detonations. \nAdditionally, it is claimed that drones also struck an oil depot in the city of Makiivka.",
      "timestamp": "2026-01-14T04:03:53.100543Z"
    },
    {
      "original": "In the Kostyanytnivka direction, both sides have advanced, with Russian forces continuing to collapse Ukrainian defences southwest of Kostyantynivka.\nIn the west, Russian forces continued their attacks in the direction of Stepanivka and managed to capture the remaining positions in the forest plantations west of the village, before entering its first houses (without consolidating yet). Russian attacks also continued from the treelines to the south. \nTo the southeast, Russian forces continued advancing east along the highway, capturing new positions in the treelines there and operationally encircling Ukrainian formations in their strongpoints to the south. Other assault groups are now clearing out the pocket, capturing strongpoints in the forests.\nMeanwhile, Russian forces continued infiltrating in small groups through the forests and into the village of Illinivka. Ukrainian drone operators continue attempts at fully eliminating the Russian groupings there, however the total number of Russian soldiers recorded in the village is growing. \nTo the east, Russian forces consolidated in additional positions in the forests on the northern bank of the Kleban-Byksky reservoir, and managed to enter the agricultural buildings on the southern outskirts of Beretok. On the other hand, the Ukrainians are continuing their incremental withdrawal from their last positions in the forests north of the reservoir due to the risk of encirclement.\nTo the northeast, Russian forces continued to advance in Kostyantynivka, and began bypassing the railway station from the north, capturing positions in the residential streets across the highway. However, more recently, they have begun struggling with supplies due to increased Ukrainian FPV drone strikes on the area between the city and Oleksandro-Shultyne. \nMeanwhile, at some point recently, Ukrainian forces managed to clear the Hora District of northeastern Kostyantynivka from Russian DRGs, as well as the adjacent forests, where they are now trying to accumulate. Additionally, the Ukrainians infiltrated across the fields south of the highway and recaptured the western and central parts of Predtechyne again. They also improved their positions in the forests just north of the highway.\nRussian forces are now trying to counterattack in Predtechyne, and continue their attempts at consolidating in the eastern part of the forests north of the highway. DRGs are also infiltrating further west through the treelines, where they were able to reach the village of Novodmytrivka. This has resulted in some of the Ukrainian formations in the salient west of Chasiv Yar withdrawing further west. \n+ ~5.24 km² in favour of Russia.\n+ ~3.97 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T04:03:53.100554Z"
    },
    {
      "original": "Russian forces have captured the village of Bondarne, Rai-Oleksandrivka direction, Donetsk Oblast.\nPre-war population: ~43.\nTotal land area: ~0.89 km².\nThe fighting for Bondarne lasted approximately 20 days.",
      "timestamp": "2026-01-14T04:03:53.100559Z"
    },
    {
      "original": "Steady Russian Advance Puts Ukrainian Forces In Kostiantynivka In Difficult Position (Videos)\nOn January 13, the Russian military expanded its control in the outskirts of Kostiantynivka and in nearby areas, increasing pressure on Kiev forces which are trying to hold onto the key industrial city in Donetsk.\nThe Yug [South] Group of Forces made gains in the southeastern outskirts of Kostiantynivka, to the west of Stepanovka, and between Berezka and the Kleban-Bykske Reservoir.\nKostiantynivka is a large industrial city with many high-rise buildings, factories and other structures that gives an advantage to Ukrainian troops holding up inside. Yet, the Yug Group of Forces has been steadily advancing to the south of the city, and continues to operate inside of it, mainly in the southern and southeastern part.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819889Z"
    },
    {
      "original": "Steady Russian Advance Puts Ukrainian Forces In Kostiantynivka In Difficult Position (Videos)\nOn January 13, the Russian military expanded its control in the outskirts of Kostiantynivka and in nearby areas, increasing pressure on Kiev forces which are trying to hold onto the key industrial city in Donetsk.\nThe Yug [South] Group of Forces made gains in the southeastern outskirts of Kostiantynivka, to the west of Stepanovka, and between Berezka and the Kleban-Bykske Reservoir.\nKostiantynivka is a large industrial city with many high-rise buildings, factories and other structures that gives an advantage to Ukrainian troops holding up inside. Yet, the Yug Group of Forces has been steadily advancing to the south of the city, and continues to operate inside of it, mainly in the southern and southeastern part.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819906Z"
    },
    {
      "original": "Military Situation In Ukraine On January 13, 2026 (Maps Update)",
      "timestamp": "2026-01-14T04:03:53.819911Z"
    },
    {
      "original": "Military Situation In Ukraine On January 13, 2026 (Maps Update)",
      "timestamp": "2026-01-14T04:03:53.819915Z"
    },
    {
      "original": "Trump Inflames Violence In Iran With Call For Protestors To ‘Take Over’ Government Institutions \nUnited States President Donald Trump on January 13 told protesters in Iran that “help is on its way” and urged them to keep protesting, as violence in the Islamic Republic reaches a new peak with reports of thousands of casualties.\n“Iranian Patriots, KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!! Save the names of the killers and abusers. They will pay a big price,” Trump wrote on his Truth Social platform, in what amounts to a call on the protesters to oust the government.\nIn its latest report, the U.S. -based Human Rights Activists News Agency said that at least 1,850 people have been killed and at least 16,784 have been arrested so far. However, an Iranian official told Reuters earlier in the day that around 2,000 people were killed.\nAn even higher estimate was attributed to the Israeli Mossad agency, which reportedly informed the U.S. that 5,000 people have been killed.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819925Z"
    },
    {
      "original": "Trump Inflames Violence In Iran With Call For Protestors To ‘Take Over’ Government Institutions \nUnited States President Donald Trump on January 13 told protesters in Iran that “help is on its way” and urged them to keep protesting, as violence in the Islamic Republic reaches a new peak with reports of thousands of casualties.\n“Iranian Patriots, KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!! Save the names of the killers and abusers. They will pay a big price,” Trump wrote on his Truth Social platform, in what amounts to a call on the protesters to oust the government.\nIn its latest report, the U.S. -based Human Rights Activists News Agency said that at least 1,850 people have been killed and at least 16,784 have been arrested so far. However, an Iranian official told Reuters earlier in the day that around 2,000 people were killed.\nAn even higher estimate was attributed to the Israeli Mossad agency, which reportedly informed the U.S. that 5,000 people have been killed.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819935Z"
    },
    {
      "original": "PARALYZING THE GRID: RUSSIA'S SUSTAINED ASSAULT ON UKRAINE'S ENERGY SYSTEM",
      "timestamp": "2026-01-14T04:03:53.819942Z"
    },
    {
      "original": "Sumy Front: Russian Army Advances Towards Khoten As Ukraine Fortifies Nearby Areas \nIn the Sumy sector, units are advancing tactically on the Kondrativka–Yunkivka section. They are consolidating their positions in tree lines and creating conditions for potential movement towards Khoten and Pisarivka. In the Kharkiv sector, near Staritsa, there has been an expansion of control in forested areas and an advance towards the Hrafskyi and Symonivka settlements.\nMeanwhile, fierce clashes continue in the Volchanskie Khutora area. In the Zaporizhzhia sector, the offensive is advancing on the Orikhiv and Huliaipole fronts. Bilohiria and part of Mala Tokmachka are now under control, and fighting continues on the approaches to Prymorske and Veselianka.\nIn the Druzhkivka sector, assault groups are advancing towards Novopavlivka and Raiske. Simultaneously, battles are occurring for the southern part of Toretske and the surrounding hills.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819951Z"
    },
    {
      "original": "Sumy Front: Russian Army Advances Towards Khoten As Ukraine Fortifies Nearby Areas \nIn the Sumy sector, units are advancing tactically on the Kondrativka–Yunkivka section. They are consolidating their positions in tree lines and creating conditions for potential movement towards Khoten and Pisarivka. In the Kharkiv sector, near Staritsa, there has been an expansion of control in forested areas and an advance towards the Hrafskyi and Symonivka settlements.\nMeanwhile, fierce clashes continue in the Volchanskie Khutora area. In the Zaporizhzhia sector, the offensive is advancing on the Orikhiv and Huliaipole fronts. Bilohiria and part of Mala Tokmachka are now under control, and fighting continues on the approaches to Prymorske and Veselianka.\nIn the Druzhkivka sector, assault groups are advancing towards Novopavlivka and Raiske. Simultaneously, battles are occurring for the southern part of Toretske and the surrounding hills.\nRead more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819961Z"
    },
    {
      "original": "Night of Escalation: Massive Russian Strike on Ukraine's Power Grid and Attacks on Tankers in the Black Sea\nOn the night of January 13, 2026, the Russian armed forces launched a large-scale, integrated strike against Ukraine's energy, logistics, and transportation infrastructure. This attack, the first of its kind in 17 days, marked a return to intense strikes after a pause comparable to the lull in August 2025. According to data from the Ukrainian Air Force, the attack employed 293 attack unmanned aerial vehicles, 18 ballistic missiles, and 7 cruise missiles from Iskander operational-tactical systems.\nThe strikes targeted power generation, ultra-high voltage main substations, railway infrastructure, and dual-use logistics hubs, affecting key regions and undermining the stability of rear-area systems and supply chains for the Armed Forces of Ukraine (AFU).\nIn the Kyiv region, the Trypilska Thermal Power Plant—a crucial energy source for the capital and central region...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819971Z"
    },
    {
      "original": "Night of Escalation: Massive Russian Strike on Ukraine's Power Grid and Attacks on Tankers in the Black Sea\nOn the night of January 13, 2026, the Russian armed forces launched a large-scale, integrated strike against Ukraine's energy, logistics, and transportation infrastructure. This attack, the first of its kind in 17 days, marked a return to intense strikes after a pause comparable to the lull in August 2025. According to data from the Ukrainian Air Force, the attack employed 293 attack unmanned aerial vehicles, 18 ballistic missiles, and 7 cruise missiles from Iskander operational-tactical systems.\nThe strikes targeted power generation, ultra-high voltage main substations, railway infrastructure, and dual-use logistics hubs, affecting key regions and undermining the stability of rear-area systems and supply chains for the Armed Forces of Ukraine (AFU).\nIn the Kyiv region, the Trypilska Thermal Power Plant—a crucial energy source for the capital and central region...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T04:03:53.819980Z"
    }
  ],
  "script_run_time": "2026-01-14T04:03:53.820754Z"
}