{
  "messages": [
    {
      "original": "🛵\n БпЛА з Сумщини на Чернігівщину (Новгород-Сіверський район).",
      "timestamp": "2025-10-28T11:54:09.724987Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА у напрямку міста!",
      "timestamp": "2025-10-28T11:54:09.725004Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини курсом на Холми.",
      "timestamp": "2025-10-28T11:54:09.725009Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 26 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 28 жовтня (з 20:00 27 жовтня) противник атакував 38 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, близько 25 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 26 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі та сході країни.\nЗафіксовано влучання 12 ударних БпЛА на 4 локаціях, а також падіння збитих (уламки) на 1 локації.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-28T11:54:09.725029Z"
    },
    {
      "original": "🛵\n БпЛА на заході Донеччини, курсом на Харківщину.",
      "timestamp": "2025-10-28T11:54:09.725036Z"
    },
    {
      "original": "🛸\n Повітряна тривога на Херсонщині по роботі розвідувального БпЛА.",
      "timestamp": "2025-10-28T11:54:09.725042Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі від Сумщини та Харківщини! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-28T11:54:09.725047Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область, в напрямку півдня Дніпропетровщини.",
      "timestamp": "2025-10-28T11:54:09.725051Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-28T11:54:09.725055Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Сумщини:\n- на заході від н.п. Ямпіль, курсом на північ;\n- на схід від н.п. Білопілля, курсом на північ;\n🛵\n  БпЛА на півночі Харківщини:\n- на заході, сході та півночі від н.п. Богодухів, курсом на південь.",
      "timestamp": "2025-10-28T11:54:09.725063Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-28T11:54:09.725067Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-28T11:54:09.725071Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжя",
      "timestamp": "2025-10-28T11:54:09.725076Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжя",
      "timestamp": "2025-10-28T11:54:09.725082Z"
    },
    {
      "original": "Продовжив рух на Дніпро.",
      "timestamp": "2025-10-28T11:54:09.725085Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Сумщини в районі н.п Ворожба та Харківщині на схід від обласного центру! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-28T11:54:09.725090Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на заході від Запоріжжя, курсом на південь.",
      "timestamp": "2025-10-28T11:54:09.725095Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-28T11:54:09.725099Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в районі н.п Слобожанське та Краснопавлівка, в південно-східному напрямку.",
      "timestamp": "2025-10-28T11:54:09.725104Z"
    },
    {
      "original": "🛵\n БпЛА у Лозівському районі, курсом на північ.",
      "timestamp": "2025-10-28T11:54:09.725108Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на на півночі від н.п. Терни, курсом на захід.\n🛸\n БпЛА на півночі від Харкова, курсом на південь.",
      "timestamp": "2025-10-28T11:54:09.725114Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Moscow Oblast for the third night in a row. Airports have once again begun to close, with strategic bombers and tactical aircraft being evacuated.",
      "timestamp": "2025-10-28T11:54:10.351085Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Moscow Oblast for the third night in a row. Airports have once again begun to close, with strategic bombers and tactical aircraft being evacuated.",
      "timestamp": "2025-10-28T11:54:10.351096Z"
    },
    {
      "original": "By the way, I think I should mention that when Russia carries out its next large-scale, combined missile attack on Ukraine this week, it is not in response to Ukraine's drone attacks on Moscow.\nRussian preparations for this attack were delayed due to their scheduled nuclear exercises. But the attack date is largely set in stone and was planned well in advance of Ukraine beginning their attacks. Russia doesn't really do \"retaliatory strikes\". \nThe individual Iskander-M strikes are usually opportunistic, targeting something which has just been discovered, while the larger, more coordinated attacks are planned beforehand, targeting static targets such as Ukraine's energy infrastructure, their military-industrial complex, and airfields.",
      "timestamp": "2025-10-28T11:54:10.351103Z"
    },
    {
      "original": "🇸🇩\n❌\n🇸🇩\n — NEW: \nThe Sudanese Armed Forces have declared a nationwide general mobilization of all men after the fall of El Fasher, announcing training and arming camps to defend the country against the Rapid Support Forces.\n@TabZLIVE",
      "timestamp": "2025-10-28T11:54:10.351113Z"
    },
    {
      "original": "🇸🇩\n❌\n🇸🇩\n — NEW: The Sudanese Armed Forces have declared a nationwide general mobilization of all men after the fall of El Fasher, announcing training and arming camps to defend the country against the Rapid Support Forces.  @TabZLIVE",
      "timestamp": "2025-10-28T11:54:10.351120Z"
    },
    {
      "original": "Take notes Ukraine",
      "timestamp": "2025-10-28T11:54:10.351123Z"
    },
    {
      "original": "Ukrainian channel on Ukraine's recent counterattacks in the Dobropillya direction.",
      "timestamp": "2025-10-28T11:54:10.351126Z"
    },
    {
      "original": "Due to the Belgorod Reservoir Dam breach, the water level downstream towards Russian positions in the Vovchansk direction has begun to rise, flooding additional areas. \nBehind the dam, the water level has receded multiple meters, with attempts underway to slow down the flow.",
      "timestamp": "2025-10-28T11:54:10.351131Z"
    },
    {
      "original": "Due to the Belgorod Reservoir Dam breach, the water level downstream towards Russian positions in the Vovchansk direction has begun to rise, flooding additional areas. \nBehind the dam, the water level has receded multiple meters, with attempts underway to slow down the flow.",
      "timestamp": "2025-10-28T11:54:10.351135Z"
    },
    {
      "original": "Russian forces have captured the village of Pryvilne, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~23.\nTotal land area: ~0.65 km².",
      "timestamp": "2025-10-28T11:54:10.351139Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance west of the Yanchur River and have made further progress in the fields west of Poltavka.\nRussian forces continued pushing west down the treelines from positions west of Poltavka, establishing control over new areas at the base of the next set of tactical heights. They also secured treelines positions on the flanks from the north and south, levelling the frontline, and allowing for future development of the offensive towards the Vesele-Novouspenivske line. \n+ ~4.07 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351144Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovske directions, Russian forces continued their offensive operations, advancing in several different areas.\nIn the south, Russian forces expanded their bridgehead on the western bank of the Yanchur River. After establishing control over the northern part of Zlahoda, Russian soldiers immediately began clearing the rest of the village, establishing full control over it. Shortly afterwards, they levelled the frontline to the east, and crossed a tributary of the river, linking up with assault groups attacking from west of Novohryhorivka. \nTo the northwest, the Russians crossed the Yanchur River at a new point, infiltrating through the forested areas to the southern houses of Yehorivka, where they were able to consolidate. Other forces advanced uphill down a treeline south of Yehorivka, while DRGs penetrated multiple kilometres further west.\nTo the northeast, Russian forces continued approaching Vyshneve from the southeast. They captured the rest of the treeline leading to the village and entered the agricultural complex after heavily bombing it with FABs and artillery. They also entered the eastern houses of the village and began advancing towards the centre. Other forces crossed a tributary of the Yanchur River from eastern Vyshneve and advanced up two parallel treelines, infiltrating the southern part of Novooleksandrivka. \nFurther northeast, Russian forces advanced from central Novoselivka into the southern part, completing the capture of the village. They also established control over the rest of the treelines to the south.\n+ ~16.66 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351152Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovske directions, Russian forces continued their offensive operations, advancing in several different areas.  In the south, Russian forces expanded their bridgehead on the western bank of the Yanchur River. After establishing control…",
      "timestamp": "2025-10-28T11:54:10.351155Z"
    },
    {
      "original": "As a result of these recent Russian advances, and the breaching of the Ukrainian defences west of the Yanchur River, forward Russian units are now within 4.3 km of the critical Pokrovsk'e - Hulyaipole Highway. \nOnce cut, logistics into Hulyaipole will become very difficult as the only other road is less than 6 km from the frontline. I previously talked about Russia's goals to capture Hulyaipole at the beginning of September. Since then, they have advanced over 19 km westwards, with the Ukrainians being unable to stop the advance due to their critical manpower shortages in this sector.",
      "timestamp": "2025-10-28T11:54:10.351159Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces advanced to the Dnipropetrovsk - Donetsk Regional Border, establishing control over an important stronghold.\nRussian forces advanced from the western part of Novoserhiivka and entered a large trench stronghold and bunker system. Soldiers were able to clear it, detonating the concrete bunkers with explosives and engaging the remaining Ukrainian soldiers with small arms. Other forces captured new positions in the treelines to the north, largely aligning the front with the regional border.\n+ ~3.04 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351164Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance in and around Pokrovsk, capturing key positions within the city.\nIn the west, after bombing Ukrainian positions with FABs, Russian forces advanced from the treelines west of Pokrovsk to the railway line, establishing control over a 2.9 km stretch of the railway windbreaks. \nIn Pokrovsk City, Russian forces were able to consolidate in the northern part of the Sobachivka District, as well as the eastern part of the city centre. Clashes continue in the area of the railway station, administrative building, city council building, and other nearby districts. \nFrom there, the Russians crossed the railway line and entrenched in the private sector, establishing a wedge between the two industrial strongholds in northern Pokrovsk. They then advanced further, capturing positions on Bereznya and Demury Streets, with DRGs infiltrating even further north. Additionally, Russian forces infiltrated further into the northwestern industrial zone of Pokrovsk, expanding the grey zone further.\n+ ~1.87 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351171Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued their assault operations in Myrnohrad, and have made significant progress in the southern part of the city. \nAfter entering the city further north and securing the areas to the east, Russian forces infiltrated the southern suburbs of Myrnohrad in multiple new places, consolidating in the first streets. Reinforcements were then sent in, allowing for additional progress to be made on a wide front. \nRussian forces reached the terykon from the east, establishing control over Mine 5/6, and began bypassing the terykon from the south into the nearby residential streets. Other forces who entered further south captured the small private sector and advanced towards one of the city parks, linking up with other formations. \n+ ~1.91 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351188Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces continued to advance behind Pokrovsk and established full control over the city of Rodynske. \nAfter infiltrating the city from the south, and advancing from the east and north, the remaining Ukrainian units were forced to leave the city, allowing for the Russians to capture the rest of the city centre and western suburbs. They then went on to establish control over the railway line to the west, along with the abandoned and demolished mine. \nTo the southeast, Russian forces continued to advance north of Myrnohrad, and captured additional treeline positions north of the city as well as an abandoned mineshaft. Some soldiers were able to infiltrate the northern streets of the city; however no consolidation has occurred yet. \n+ ~3.68 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351193Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces are advancing, with Ukrainian forces making substantial progress on the western flank of the salient.\nIn the south, Ukrainian forces advanced from their positions east of the railway line and recaptured treeline positions north of Zatyshok. They then infiltrated the village from the north, and attempted to push towards its western edge, resulting in Russian and Ukrainian positions being mixed up in a grey zone. Other forces also infiltrated Sukhetske, however there is no evidence of consolidation yet. \nTo the north, the Ukrainians once again recaptured the village of Nove Shakhove, and established control over positions to the south. They also advanced from Vilne to the treelines south and southeast and recaptured the dachas to the east. \nTo the northeast, Ukrainian forces advanced from their newly established positions in Kucheriv Yar, capturing positions in the forest plantations to the south. \nMeanwhile, Russian forces continued to advance in western Shakhove amid fierce fighting, and established full control over that section of the village. Mechanised assaults were also carried out on the eastern part of the village, however there is no evidence of consolidation yet. \n+ ~13.99 km in favour of Ukraine.\n+ ~0.52 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351204Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces closed the pocket south of the reservoir and began refocusing their efforts further north.\nFollowing the earlier Ukrainian withdrawal from the cut-off area south of the Kleban-Bykske reservoir via rubber boats, Russian forces have now established control over the treelines and forests to the south. Since then, they have continued their attacks towards the rear of the reservoir and are attempting to gain a foothold in the forests east of the highway.\n+ ~12.40 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351209Z"
    },
    {
      "original": "In the Siversk direction, Russian forces resumed their assault operations towards Siversk from the southeast and have captured new positions on the tactical heights.\nRussian forces advanced from the treelines northeast of Vyimka, pushing along the tactical heights, and captured new positions to the northwest. They then advanced further north up a treeline and are attempting to establish control over additional positions closer to Siversk. \n+ ~2.52 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351213Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations and have made new progress to east of the city. \nIn the northwest, Russian forces advanced further through the forests along the railway line and reached the eastern edge of Lyman. DRGs then infiltrated the city and have since been operating in the area of the freight terminals. They also established control over new parts of the forests and infiltrated further into the Masliakivka District. \nTo the southeast, Russian forces continued to slowly advance in Yampil. They were able to advance out of the village centre and capture some new positions in the southwestern streets. Ukrainian forces are gradually being pushed back to the southwestern edge of the settlement. \n+ ~3.70 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351219Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to expand their zone of control west of Zarichne, and have eliminated the salient recently formed there.\nAfter outflanking Ukrainian strongpoints west of Zarichne from the north, Ukrainian forces began withdrawing to the west to prevent being encircled. The Russians have since captured the agricultural complex that served as one of Ukraine's main forward deployment points in this sector, and secured the rest of the surrounding forests, levelling the frontline to the west. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-10-28T11:54:10.351223Z"
    },
    {
      "original": "Al-Suwayda Druze Leader Demands ‘Independence’ From Syria, Laying Ground For Israeli Invasion\nThe spiritual leader of the Druze community in Syria, Hikmat al-Hajri, said on October 27 that self-determination for the people of al-Suwayda is “an absolute right that cannot be revoked”, stressing that his vision is based on the “complete independence” of the governorate.\nDruze armed factions backed the Islamist rebel offensive that overthrew the regime of former President Bashar al-Assad last December, but later refused to allow the forces of the country’s new Islamist-led Interim Government to enter al-Suwayda, maintaining a form of autonomy over the governorate.\nIn July a battle broke out in al-Suwayda, when an intervention by government forces to end a local conflict involving bedouins quickly escalated into an all-out, sectarian-fueled attack on the Druze. Israel, which vowed to protect the community after the fall of the Assad regime, eventually intervened...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972022Z"
    },
    {
      "original": "In Video: New Russian Automated Gun Takes Down Ukrainian Drones\nThe Russian military began fielding a deeply modernized drone hunter version of the ZU-23-2 23 mm twin-barreled autocannon, which was developed by the Soviet Union in the 1950s.\nOn October 27, video footage of one such autocannon engaging several Ukrainian long-range, fixed-wing drones surfaced online. It is unclear when or where exactly the footage was taken, but it clearly shows the autocannon taking down at least four drones.\nThe autocannon is likely based on the same system shown to Dmitry Medvedev, Deputy Chairman of the Security Council of Russia, during his recent visit to the Kapustin Yar test site.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972039Z"
    },
    {
      "original": "INTENSITY PEAKS ON KEY FRONTS AS KHARKIV CRISIS THREAT GROWS",
      "timestamp": "2025-10-28T11:54:10.972043Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine’s Energy And Transport Sectors, While The EU Faces Challenges In Supporting Kyiv\nIn recent days, Russia and Ukraine have continued exchanging strikes, targeting each other's key infrastructure. The Russian armed forces have concentrated their primary efforts on Ukraine's energy facilities, including wind farms, as well as transport infrastructure—specifically, railway trains used for transporting military equipment and weapons to the front lines. In turn, Ukraine once again targeted a dam in the Belgorod region and carried out a drone raid on Moscow.\nThe use of new types of glide bombs with record-breaking range for this class of munition by Russian aviation has sharply increased the destructive force of massive air raids on rear-area targets and placed an additional burden on Ukraine's already depleted forces. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972052Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine’s Energy And Transport Sectors, While The EU Faces Challenges In Supporting Kyiv\nIn recent days, Russia and Ukraine have continued exchanging strikes, targeting each other's key infrastructure. The Russian armed forces have concentrated their primary efforts on Ukraine's energy facilities, including wind farms, as well as transport infrastructure—specifically, railway trains used for transporting military equipment and weapons to the front lines. In turn, Ukraine once again targeted a dam in the Belgorod region and carried out a drone raid on Moscow.\nThe use of new types of glide bombs with record-breaking range for this class of munition by Russian aviation has sharply increased the destructive force of massive air raids on rear-area targets and placed an additional burden on Ukraine's already depleted forces. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972060Z"
    },
    {
      "original": "Ukraine Faces Failure In Zaporizhzhia: Clearing Operations Along Yangchur River Near Completion\nUkrainian special operations units have been urgently redeployed to Pokrovsk. They are now approximately 3 kilometers from reaching the key Pokrovsk-Huliaipole highway. Control of the Privolnoye and Novonikolayevka settlements in the Zaporizhzhia sector has been established. \nMeanwhile, Polish President Karol Nawrocki has declined an invitation to visit Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972068Z"
    },
    {
      "original": "Ukraine Faces Failure In Zaporizhzhia: Clearing Operations Along Yangchur River Near Completion\nUkrainian special operations units have been urgently redeployed to Pokrovsk. They are now approximately 3 kilometers from reaching the key Pokrovsk-Huliaipole highway. Control of the Privolnoye and Novonikolayevka settlements in the Zaporizhzhia sector has been established. \nMeanwhile, Polish President Karol Nawrocki has declined an invitation to visit Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972075Z"
    },
    {
      "original": "Iskander Attack: Summary Of Russian Combat Footage From October 27, 2025\nOn October 27, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972082Z"
    },
    {
      "original": "Iskander Attack: Summary Of Russian Combat Footage From October 27, 2025\nOn October 27, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972088Z"
    },
    {
      "original": "Trump’s Bail Out Of Argentina Backfiring: Washington’s Attempt To Buy Loyalty To Counter Brazil\nTrump’s $20 billion rescue for Argentina and increased beef imports have sparked domestic backlash among US farmers. It is about securing Argentina as a US ally, amid Milei’s NATO ambitions, as part of a strategy to “counter” BRICS, Brazil and Chinese presence in the hemisphere.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972095Z"
    },
    {
      "original": "Syrian Government Forces Attack Al-Suwayda With Drones After Calls For Independence (Videos) \nThe forces of Syria’s Islamist-led Interim Government launched late on October 27 a series of drone strikes against Druze fighters in al-Suwayda, in a violation of a ceasefire in the southern governorate brokered by the United States.\nThe latest drone strikes targeted positions in the western outskirts of al-Suwayda city. At least ten people were reportedly wounded including members of the National Guard, a unified group formed by Druze armed factions following the battle with government forces.\nOn the very next day, a bus carrying Druze civilians from al-Suwayda to Damascus came under attack in a part of the highway that is supposedly secured by government forces. Two people were killed and at least 11 others were wounded as a result of the attack.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972103Z"
    },
    {
      "original": "Syrian Government Forces Attack Al-Suwayda With Drones After Calls For Independence (Videos) \nThe forces of Syria’s Islamist-led Interim Government launched late on October 27 a series of drone strikes against Druze fighters in al-Suwayda, in a violation of a ceasefire in the southern governorate brokered by the United States.\nThe latest drone strikes targeted positions in the western outskirts of al-Suwayda city. At least ten people were reportedly wounded including members of the National Guard, a unified group formed by Druze armed factions following the battle with government forces.\nOn the very next day, a bus carrying Druze civilians from al-Suwayda to Damascus came under attack in a part of the highway that is supposedly secured by government forces. Two people were killed and at least 11 others were wounded as a result of the attack.\nRead more \nHERE",
      "timestamp": "2025-10-28T11:54:10.972112Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – October 28, 2025",
      "timestamp": "2025-10-28T11:54:10.972115Z"
    }
  ],
  "script_run_time": "2025-10-28T11:54:10.972936Z"
}