{
  "messages": [
    {
      "original": "🛵\n Татарбунарський р-н. ворожий БпЛА у напрямку Арцизу",
      "timestamp": "2025-12-23T02:54:08.691093Z"
    },
    {
      "original": "🛵\n Групи ворожих ударних БпЛА у Татарбунарському р-ні., рухаються у напрямку Арцизу;\n🛵\n Ще групи ворожих БпЛА  з Херсонщини зайшли у Чорне море, вектором руху на Татарбунари;\n🛵\n Ворожі БпЛА на півночі та заході Харківщини, курс південний;\n🛵\n Групи ворожих БпЛА зі сходу на захід Сумщини, вектором руху на Чернігівщину;\n🛵\n БпЛА на Чернігівщині курсом на Київщину;\n🛵\n БпЛА на Донеччині курсом на Дніпропетровщину.",
      "timestamp": "2025-12-23T02:54:08.691116Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в р-ні. н.п. Рені (Одещина), курс постійно змінюється.",
      "timestamp": "2025-12-23T02:54:08.691122Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА з Чорного моря у напрямку Ізмаїлу;\n🛵\n Групи БпЛА з Чорного моря у напрямку Південного;\n🛵\n Групи БпЛА вздовж західної межі Харківщини південним курсом (Павлоград);\n🛵\n Групи БпЛА на півдні Харківщини у напрямку Павлограду;\n🛵\n Групи БпЛА зі сходу на захід Сумщини, південно-західним курсом, вектором на Київщину;\n🛵\n БпЛА на півночі Чернігівщини курс південний.",
      "timestamp": "2025-12-23T02:54:08.691134Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА наближається до н.п. Лубни зі сходу.",
      "timestamp": "2025-12-23T02:54:08.691141Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Павлоград зі сходу та північного-сходу.",
      "timestamp": "2025-12-23T02:54:08.691145Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА на Миколаївщині з півдня на північ та із сходу на захід.",
      "timestamp": "2025-12-23T02:54:08.691152Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА наближаються до Миргорода з північного сходу.",
      "timestamp": "2025-12-23T02:54:08.691156Z"
    },
    {
      "original": "🛵\n БпЛА на заході Чернігівщини заходять на північ Київщини.",
      "timestamp": "2025-12-23T02:54:08.691161Z"
    },
    {
      "original": "🛵\n БпЛА з Миколаївщини у напрямку Кіровоградщини.",
      "timestamp": "2025-12-23T02:54:08.691165Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА рухаються через північ Київщини у західному напрямку;\n🛵\n Групи БпЛА на півночі Чернігівщини рухаються у західному напрямку;\n🛵\nГрупи БпЛА на Миколаївщині рухаються переважно північним курсом у напрямку Кіровоградщини;\n🛵\n Групи БпЛА на північному заході Херсонщини та соді Миколаївщини рухаються у західному напрямку;\n🛵\n Групи БпЛА по всій території Сумщини рухаються південно-західним курсом на Полтавщину;\n🛵\n Групи БпЛА на Харківщині у напрямку Полтавщини;\n🛵\n БпЛА на південному заході Полтавщини та сході Черкащини рухаються у західному напрямку.",
      "timestamp": "2025-12-23T02:54:08.691179Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Білої Церкви з північного сходу.",
      "timestamp": "2025-12-23T02:54:08.691185Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА з Чорного моря у напрямку Миколаївщини.",
      "timestamp": "2025-12-23T02:54:08.691190Z"
    },
    {
      "original": "🛵\n Групи на півночі Одещини у напрямку Вінниччини.",
      "timestamp": "2025-12-23T02:54:08.691194Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщині.",
      "timestamp": "2025-12-23T02:54:08.691199Z"
    },
    {
      "original": "🚀\nШвидкісна ціль у напрямку Запоріжжя з півдня.",
      "timestamp": "2025-12-23T02:54:08.691203Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Житомир з півночі.",
      "timestamp": "2025-12-23T02:54:08.691207Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в Чорному морі у напрямку Південного та Миколаївщини.",
      "timestamp": "2025-12-23T02:54:08.691212Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Житомирщини у напрмку Рівного.",
      "timestamp": "2025-12-23T02:54:08.691218Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА на півдні Вінниччини у напрямку Хмельниччини.",
      "timestamp": "2025-12-23T02:54:08.691222Z"
    },
    {
      "original": "Explosions near Chornomorsk.  Repeated launches were carried out.",
      "timestamp": "2025-12-23T02:54:09.101537Z"
    },
    {
      "original": "The repeated launches were carried out at a very high altitude. \nThe glide-bombs will likely fly to the Mayaky Bridge.",
      "timestamp": "2025-12-23T02:54:09.101552Z"
    },
    {
      "original": "The repeated launches were carried out at a very high altitude.   The glide-bombs will likely fly to the Mayaky Bridge.",
      "timestamp": "2025-12-23T02:54:09.101557Z"
    },
    {
      "original": "These ones seem to be flying at a similar speed to ordinary KABs. \nApproaching the coast, around 35 km from the Mayaky Bridge.",
      "timestamp": "2025-12-23T02:54:09.101561Z"
    },
    {
      "original": "These ones seem to be flying at a similar speed to ordinary KABs.   Approaching the coast, around 35 km from the Mayaky Bridge.",
      "timestamp": "2025-12-23T02:54:09.101564Z"
    },
    {
      "original": "Explosion near Karolino-Buhaz, Odesa Oblast. Somewhere near the coast. 1 more KAB is approaching.\nBoth Su-34s are flying east over Crimea back to their base airfield.",
      "timestamp": "2025-12-23T02:54:09.101568Z"
    },
    {
      "original": "Explosion near Karolino-Buhaz, Odesa Oblast. Somewhere near the coast. 1 more KAB is approaching.  Both Su-34s are flying east over Crimea back to their base airfield.",
      "timestamp": "2025-12-23T02:54:09.101571Z"
    },
    {
      "original": "Another explosion. All clear now.",
      "timestamp": "2025-12-23T02:54:09.101574Z"
    },
    {
      "original": "There will be another large-scale, combined missile and drone attack on Ukraine this morning.\nAt least 2 Tu-160 strategic bombers are airborne from Ukrainka Airbase, Amur Oblast.\nAt least 2 Tu-95MS strategic bombers are airborne from Belaya Airbase, Irkutsk Oblast.\nAll are flying towards the launch lines in western Russia. \nAdditionally, Tu-95MS departures from Engels-2 and Olenya Airbases are expected later on.",
      "timestamp": "2025-12-23T02:54:09.101581Z"
    },
    {
      "original": "Mass launches of Geran-2 drones have already begun, although only a fraction of what will be used tonight has been launched.\nSo far, around 65 Gerans are detected in Ukrainian airspace.",
      "timestamp": "2025-12-23T02:54:09.101585Z"
    },
    {
      "original": "There will be another large-scale, combined missile and drone attack on Ukraine this morning.  At least 2 Tu-160 strategic bombers are airborne from Ukrainka Airbase, Amur Oblast.  At least 2 Tu-95MS strategic bombers are airborne from Belaya Airbase, Irkutsk…",
      "timestamp": "2025-12-23T02:54:09.101589Z"
    },
    {
      "original": "The Tu-95MS and Tu-160 bombers from the far east are expected to reach their launch lines in the next 3.5 hours. \nThis means that departures of Tu-95MS from Olenya Airbase, Murmansk Oblast, would likely take place in the next 30 minutes. Departures from Engels-2 Airbase could take place any time in the next 3 hours. \nNo new activity from the Black Sea Fleet has been recorded yet, however 2 Buyan-M corvettes were equipped with Kalibrs at Kaspiysk Naval Base, Republic of Dagestan, in the Caspian Sea.",
      "timestamp": "2025-12-23T02:54:09.101594Z"
    },
    {
      "original": "Clarification: 3 Tu-95MS are airborne from Belaya Airbase.\nNo departures from Engels-2 or Olenya Airbases have been recorded yet.\nThe number of Geran-2 drones detected in Ukrainian airspace has increased to around 75.",
      "timestamp": "2025-12-23T02:54:09.101599Z"
    },
    {
      "original": "2-4 Tu-95MS strategic bombers departed from Olenya Airbase, Murmansk Oblast.",
      "timestamp": "2025-12-23T02:54:09.101602Z"
    },
    {
      "original": "The number of Geran-2 drones detected in Ukrainian airspace has rapidly increased to 135 following additional mass launches.",
      "timestamp": "2025-12-23T02:54:09.101605Z"
    },
    {
      "original": "Reports of Kalibr carriers leaving Novorossiysk Naval Base, Krasnodar Krai are false.",
      "timestamp": "2025-12-23T02:54:09.101612Z"
    },
    {
      "original": "If you currently live in Ukraine or Russia and feel comfortable with getting in contact with me, please DM me. I’m looking to increase the scope of my sourcing and reliability of the information I provide, especially on Russian and Ukrainian attacks. \nYou will remain anonymous, and in complete control of the information you choose to provide, and how you provide it. I will only publish information that you allow me to, and that doesn’t put anyone from any side at risk. This will be extremely beneficial to my reporting. \nMy telegram account: \n@AMK_Mapping1\n. I also have Signal if you prefer that.",
      "timestamp": "2025-12-23T02:54:09.101620Z"
    },
    {
      "original": "Update: A minimum of 3 Tu-95MS are confirmed to be airborne from Olenya Airbase now. \nThis is in addition to the 3 Tu-95MS from Belaya Airbase, and 2 Tu-160s from Ukrainka Airbase.\nNo departures from Engels-2 Airbase have been recorded yet.",
      "timestamp": "2025-12-23T02:54:09.101627Z"
    },
    {
      "original": "The first groups of Russian Geran-2 drones are bypassing Kyiv and flying towards the western regions of Ukraine.\nThis means that the cruise missiles will likely follow the same path later on.\nThe highest threat is Ivano-Frankivsk and Lviv Oblasts, however additional regions will likely be attacked.",
      "timestamp": "2025-12-23T02:54:09.101634Z"
    },
    {
      "original": "3 Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast.\nNow there are a total of 9 Tu-95MS and 2 Tu-160s airborne.",
      "timestamp": "2025-12-23T02:54:09.101639Z"
    },
    {
      "original": "The number of Geran-2 drones detected in Ukrainian airspace has increased to 150.",
      "timestamp": "2025-12-23T02:54:09.101658Z"
    },
    {
      "original": "Kalibr launches from at least two Kalibr carriers are expected to take place from within Novorossiysk Naval Base, Krasnodar Krai in the next hour. \nTu-95MS and Tu-160s from the far east should reach their launch lines in 30-60 minutes.\nAs I mentioned earlier, the western regions of Ukraine will be the main target (especially Ivano-Frankivsk and Lviv Oblasts). There is also an increased threat for energy infrastructure in Cherkasy Oblast.",
      "timestamp": "2025-12-23T02:54:09.101669Z"
    },
    {
      "original": "MiG-31K fighters are being prepared at Savasleika Airbase, Nizhny Novgorod Oblast at this moment. They will probably launch Kinzhal hypersonic aeroballistic missiles at energy infrastructure in western Ukraine.\nIskander-M ballistic missiles may also be used.",
      "timestamp": "2025-12-23T02:54:09.101673Z"
    },
    {
      "original": "Update on strategic bombers:\n- 4 Tu-95MS are airborne from Belaya Airbase.\n- 3 Tu-95MS are airborne from Olenya Airbase.\n- 3 Tu-95MS are airborne from Engels-2 airbase.\n- 2 Tu-160s are airborne from Ukrainka Airbase\n- 1 Tu-160 is airborne from Engels-2 Airbase.\n13 strategic bombers in total.",
      "timestamp": "2025-12-23T02:54:09.101680Z"
    },
    {
      "original": "The numbers of Geran-2 drones detected in Ukrainian airspace remains largely unchanged at ~140. They are continuing to transit to the western regions of Ukraine.",
      "timestamp": "2025-12-23T02:54:09.101683Z"
    },
    {
      "original": "Seizure Of Dozens Of Anti-Aircraft Missiles Sounds Alarm On Security Situation In Syria (Photos)\nThe Syrian Ministry of Interior announced on December 22 that its forces seized dozens of man-portable air-defense systems (MANPADs) in the eastern governorate of Deir Ezzor, highlighting the fragile security situation in the war-torn country.\n“Accurate information was received by the security directorate in al-Bukamal indicating that anti-aircraft missiles were being hidden inside a house, in preparation for smuggling them out of the country,” the ministry said in a statement.\n“Based on this information, a well-planned raid was carried out, resulting in the seizure of SAM-7 missiles,” it added.\nThe SAM-7 is a common name in the Middle East for the Soviet-made 9K32 Strela-2, also known by NATO reporting name SA-7 Grail. Photos shared by the ministry show more than 24 missiles, along with a number of gripstocks and thermal batteries.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684428Z"
    },
    {
      "original": "Seizure Of Dozens Of Anti-Aircraft Missiles Sounds Alarm On Security Situation In Syria (Photos)\nThe Syrian Ministry of Interior announced on December 22 that its forces seized dozens of man-portable air-defense systems (MANPADs) in the eastern governorate of Deir Ezzor, highlighting the fragile security situation in the war-torn country.\n“Accurate information was received by the security directorate in al-Bukamal indicating that anti-aircraft missiles were being hidden inside a house, in preparation for smuggling them out of the country,” the ministry said in a statement.\n“Based on this information, a well-planned raid was carried out, resulting in the seizure of SAM-7 missiles,” it added.\nThe SAM-7 is a common name in the Middle East for the Soviet-made 9K32 Strela-2, also known by NATO reporting name SA-7 Grail. Photos shared by the ministry show more than 24 missiles, along with a number of gripstocks and thermal batteries.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684449Z"
    },
    {
      "original": "Military Situation In Ukraine On December 22, 2025 (Maps Update)",
      "timestamp": "2025-12-23T02:54:09.684461Z"
    },
    {
      "original": "Military Situation In Ukraine On December 22, 2025 (Maps Update)",
      "timestamp": "2025-12-23T02:54:09.684466Z"
    },
    {
      "original": "The \"Elite\" Graveyard: How Ukraine's Foreign Legions Are Being Depleted\nThe number of foreign mercenaries killed in Ukraine continues to rise inexorably, long surpassing 6,000. In the past week alone, 84 new casualties have been identified—though most will remain nameless in mass graves. Despite this, the influx of \"easy money hunters\" shows no signs of abating.\nBrutal reality catches up swiftly, as it did with Argentinians Bruno Herrera and Cione Dante Augusto \"Pastor\" from the neo-Nazi \"Revanche\" unit of Ukraine's GUR: they were eliminated by Russian special forces while attempting to relieve a besieged garrison in the critical Stepnogorsk area. The Ukrainian command deliberately throws mercenaries into the fray first, preserving its own elite units for a second echelon.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684475Z"
    },
    {
      "original": "The \"Elite\" Graveyard: How Ukraine's Foreign Legions Are Being Depleted\nThe number of foreign mercenaries killed in Ukraine continues to rise inexorably, long surpassing 6,000. In the past week alone, 84 new casualties have been identified—though most will remain nameless in mass graves. Despite this, the influx of \"easy money hunters\" shows no signs of abating.\nBrutal reality catches up swiftly, as it did with Argentinians Bruno Herrera and Cione Dante Augusto \"Pastor\" from the neo-Nazi \"Revanche\" unit of Ukraine's GUR: they were eliminated by Russian special forces while attempting to relieve a besieged garrison in the critical Stepnogorsk area. The Ukrainian command deliberately throws mercenaries into the fray first, preserving its own elite units for a second echelon.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684483Z"
    },
    {
      "original": "Russian Army Defeats Kiev Forces In Vilcha, Turns Up Heat In Sumy (Videos)\nOn December 22, the Russian military dealt another defeat to Kiev forces by capturing Vilcha, located to the south of Vovchansk in Kharkiv.\nThe 69th Guards Motor Rifle Division of the 6th Army and the 128th Motorized Rifle Brigade of the 44th Army of the Sever [North] Group of Forces broke the last defense line of Ukraine’s 57th Motor Rifle Brigade and 225th Separate Shock Battalion in the southern part of Vilcha, bringing all of the settlement and its outskirt under control.\nRead more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684491Z"
    },
    {
      "original": "Russian Army Defeats Kiev Forces In Vilcha, Turns Up Heat In Sumy (Videos)\nOn December 22, the Russian military dealt another defeat to Kiev forces by capturing Vilcha, located to the south of Vovchansk in Kharkiv.\nThe 69th Guards Motor Rifle Division of the 6th Army and the 128th Motorized Rifle Brigade of the 44th Army of the Sever [North] Group of Forces broke the last defense line of Ukraine’s 57th Motor Rifle Brigade and 225th Separate Shock Battalion in the southern part of Vilcha, bringing all of the settlement and its outskirt under control.\nRead more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684499Z"
    },
    {
      "original": "A NEW FRONT OPENS: RUSSIAN ADVANCE IN SUMY THREATENS UKRAINIAN DEFENSE STRATEGY",
      "timestamp": "2025-12-23T02:54:09.684503Z"
    },
    {
      "original": "Key To Russian Advance: Strategic Significance Of Zakotne In Slaviansk Sector For Ukraine\nIn the Slaviansk sector, Russian units are carrying out an offensive in the Sviato-Pokrovske area, advancing from the north and south. In the vicinity of Konstantynivka, Russian assault groups are tightening their grip on the approaches to the city by advancing into the built-up area from Predtechyne. \nMeanwhile, Hungarian Prime Minister Viktor Orbán stated that Hungarian money should not go to Ukrainian oligarchs.\nRead more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684511Z"
    },
    {
      "original": "Key To Russian Advance: Strategic Significance Of Zakotne In Slaviansk Sector For Ukraine\nIn the Slaviansk sector, Russian units are carrying out an offensive in the Sviato-Pokrovske area, advancing from the north and south. In the vicinity of Konstantynivka, Russian assault groups are tightening their grip on the approaches to the city by advancing into the built-up area from Predtechyne. \nMeanwhile, Hungarian Prime Minister Viktor Orbán stated that Hungarian money should not go to Ukrainian oligarchs.\nRead more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684518Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Odesa Ports Under Fire Again, 'Flamingo' Maker Hosts Blindfolded Journalists\nAs in previous days, the hottest spot in Ukraine during this 24-hour period was once again the Odesa region, where strikes have now been carried out for the fifth consecutive day, deliberately targeting and damaging energy and port infrastructure.\nAgainst the backdrop of ongoing shelling, the Ukrainian media space continues to make active attempts to restore the reputation of Fire Point, a company known for producing the long-range FP-1 and FP-2 drones as well as the experimental \"Flamingo\" cruise missile. The company found itself at the center of a corruption scandal involving businessman Mindich. As part of a PR campaign, groups of foreign and local journalists have been taken to the enterprise—whose location is classified—blindfolded, according to the journalists themselves.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684527Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Odesa Ports Under Fire Again, 'Flamingo' Maker Hosts Blindfolded Journalists\nAs in previous days, the hottest spot in Ukraine during this 24-hour period was once again the Odesa region, where strikes have now been carried out for the fifth consecutive day, deliberately targeting and damaging energy and port infrastructure.\nAgainst the backdrop of ongoing shelling, the Ukrainian media space continues to make active attempts to restore the reputation of Fire Point, a company known for producing the long-range FP-1 and FP-2 drones as well as the experimental \"Flamingo\" cruise missile. The company found itself at the center of a corruption scandal involving businessman Mindich. As part of a PR campaign, groups of foreign and local journalists have been taken to the enterprise—whose location is classified—blindfolded, according to the journalists themselves.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-23T02:54:09.684535Z"
    }
  ],
  "script_run_time": "2025-12-23T02:54:09.685352Z"
}