{
  "messages": [
    {
      "original": "🚀\n Пуски КАБ на Донеччину.\n🛵\n БпЛА на сході Дніпропетровщини, курс на Харківщину та Донеччину.",
      "timestamp": "2025-12-16T18:27:15.117667Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-16T18:27:15.117682Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-16T18:27:15.117687Z"
    },
    {
      "original": "🛸\n Повітряна тривога через ворожий БпЛА на Одещині! Залучено засоби для його збиття.",
      "timestamp": "2025-12-16T18:27:15.117692Z"
    },
    {
      "original": "🛵\n БпЛА із акваторії Чорного моря \n➡️\n на Одещину н.п. Затока, Вилкове",
      "timestamp": "2025-12-16T18:27:15.117698Z"
    },
    {
      "original": "🛵\n БпЛА із акваторії Чорного моря \n➡️\n на Одещину н.п. Затока, Вилкове",
      "timestamp": "2025-12-16T18:27:15.117704Z"
    },
    {
      "original": "🛵\n Одещина - група БпЛА на Чорноморськ.",
      "timestamp": "2025-12-16T18:27:15.117708Z"
    },
    {
      "original": "🛵\n БпЛА в р-ні. Татарбунарів, вектор руху Арциз.",
      "timestamp": "2025-12-16T18:27:15.117713Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Чернігівщини.",
      "timestamp": "2025-12-16T18:27:15.117717Z"
    },
    {
      "original": "🛵\n Декілька  ворожих ударних БпЛА на сході Херсонщини у напрямку Миколаївщини західним курсом",
      "timestamp": "2025-12-16T18:27:15.117744Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-12-16T18:27:15.117754Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-12-16T18:27:15.117759Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині та Запоріжжі.",
      "timestamp": "2025-12-16T18:27:15.117763Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщині.",
      "timestamp": "2025-12-16T18:27:15.117768Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА з Херсонщини заходять в акваторію Чорного моря, вектор руху Одеса/Чорноморськ",
      "timestamp": "2025-12-16T18:27:15.117772Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА наближаються до Затоки з Чорного моря.",
      "timestamp": "2025-12-16T18:27:15.117781Z"
    },
    {
      "original": "🛵\n БпЛА на Білгород-Дністровський",
      "timestamp": "2025-12-16T18:27:15.117785Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Затоки",
      "timestamp": "2025-12-16T18:27:15.117789Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщині.",
      "timestamp": "2025-12-16T18:27:15.117793Z"
    },
    {
      "original": "🛵\n БпЛА в р-ні. Татарбунарів у напрямку Арцизу.",
      "timestamp": "2025-12-16T18:27:15.117800Z"
    },
    {
      "original": "🛵\n БпЛА  на Сумщині \n➡️\n курсом на Кириківку.",
      "timestamp": "2025-12-16T18:27:15.117806Z"
    },
    {
      "original": "Deepstate has officially joined the linear warfare bros. \nPressure from the SBU must be high.",
      "timestamp": "2025-12-16T18:27:15.887867Z"
    },
    {
      "original": "6 Grom-E1 rocket-powered glide-bombs and at least 18 Geran-2 drones targeted the Zatoka Bridge in Odesa Oblast. All of the glide-bombs and most of the drones impacted.  Coordinates: 46.07611, 30.46972",
      "timestamp": "2025-12-16T18:27:15.887878Z"
    },
    {
      "original": "Footage showing yesterday's combined glide-bomb and Geran-2 drone attack on the Zatoka railway and road bridge in Odesa Oblast.\nThis bridge is the only connector in Ukraine between southern Odesa Oblast and the rest of the country.",
      "timestamp": "2025-12-16T18:27:15.887882Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance in several different areas, exploiting the fall of Siversk to make additional progress. \nIn the southeast, following the fall of Siversk and the withdrawal of Ukrainian formations from positions northwest of the city, Russian forces began a two-axis push further west along the tactical heights. They were able to quickly capture the remaining positions north of the Siversk - Lyman highway and began advancing south down the treelines to the rear of the chalk quarry. \nOther forces advanced directly west from Siversk, capturing the trenches just outside the city and quickly entering the chalk quarry from the east. Ukrainian units continued to withdraw further west, while covering Siversk itself with FPV drones in an attempt to disrupt Russian logistics and slow their advance. Since then, the Russians have continued to push west along the tactical heights and occupied new positions in the forest plantations and treelines further west, almost levelling the frontline between Platonivka and Sviato-Pokrovske. Additionally, they were able to complete the capture of Sviato-Pokrovske - establishing control over its western outskirts - and are now engaged in battles for the eastern outskirts of Riznykivka.\nTo the northwest, Russian forces advanced from the strongpoints along the highway and entered the first houses of Ozerne, capturing its northern street. Further west, other forces broke through to the northern bank of the Siverskyi Donets River and entrenched in the northwestern-most houses of Ozerne. \nIn the northwest, Russian forces continued to expand their zone of control in Dibrova and managed to fully capture the eastern half of the village. Other forces continued slowly advancing through the forests to the north, capturing additional positions southwest and west of the lakes.\n+ ~15.43 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887890Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction and on the northeastern flank of Kostyantynivka, Russian forces continued their intensified assault operations and have made significant progress over the past week.\nIn the southwest, following their earlier infiltrations, Russian forces managed to consolidate in the treelines north of Virolyubivka and in the forest on the eastern bank of the reservoir east of Klynove. They then entered Virolyubivka and established control over the northern part of the village. Additionally, under heavy artillery and MLRS cover, Russian forces began a new push north from Maiske in the direction of Markove - Fedorivka, and managed to consolidate in new treeline positions north of Maiske and the forest to the northwest. Some soldiers have infiltrated further, entering the western houses of Markove and reaching the forest plantations to the west.\nIn the northeast, Russian forces began advancing southwest from Vasyukivka. They captured new positions in five different treelines and some adjacent forested areas and are threatening to cut off some of the last remaining 2023 fortifications in this sector.  Additionally, the Russians managed to eliminate part of the salient north of Vasyukivka, consolidating in the trenches there, and began a new push further north. There, theyy were able to capture the village of Pazeno and advanced up two treelines, reaching and establishing control over a large part of the forest to the north.\n+ ~20.81 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887896Z"
    },
    {
      "original": "A Ukrainian sea drone likely struck a Russian Varshavyanka-class submarine stationed at Novorossiysk Naval Base, Krasnodar Krai.\nThe submarine, which can launch up to 6 Kalibr cruise missiles, reportedly received critical damage. Based on previous satellite imagery, the drone exploded next to the submarine’s stern.\nAdditionally, according to unconfirmed information, other ships were hit at the port, however there is no visual evidence to support this yet. \nThe head of the Black Sea Fleet Press Service responded to the claims by stating that none of the ships stationed at Novorossiysk were undamaged and are carrying out their duties as usual.",
      "timestamp": "2025-12-16T18:27:15.887903Z"
    },
    {
      "original": "Russia is currently completing its preparations for the next large-scale, combined missile and drone attack on Ukraine.   - At least 3 Tu-95MS strategic bombers are redeploying from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast after being…",
      "timestamp": "2025-12-16T18:27:15.887907Z"
    },
    {
      "original": "The next large-scale, combined Russian missile and drone attack will probably take place tomorrow morning, between 00:00 and 08:00 Kyiv time. \nIt won't be anything special - just another normal-sized attack involving strategic bombers, ballistic missiles and Geran-2 drones.\n3 Tu-160M strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Belaya Airbase, Irkutsk Oblast after being equipped with Kh-101 cruise missiles. They will then fly from Belaya Airbase to their launch lines in western Russia in order to carry out their combat sorties. \nThe 2 (not 3) Tu-95MS strategic bombers which redeployed from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast, yesterday have subsequently flown to Olenya Airbase where they will take off from during the next attack. 1 other Tu-95MS already stationed at Olenya was also equipped with missiles (delivered by an IL-76MD cargo plane) today. \n1 Tu-95MS stationed at Engels-2 Airbase is also equipped with missiles. \nThus, there are at least 4 Tu-95MS and 3 Tu-160M strategic bombers equipped and ready for usage. If Russia were to use this number of bombers, the number of Kh-101 cruise missiles launched would likely be somewhere around 30-40, although this is a very rough estimate.\nThere are no changes to the MiG-31K fighters stationed at Savasleika Airbase, Nizhny Novgorod Oblast. 4-6 Kinzhal hypersonic aeroballistic missiles are expected to be used.\nIskander-M ballistic missiles and possibly Iskander-K cruise missiles will be used as well. Additional deliveries of Iskander-Ms to OTRK installations near Taganrog, Rostov Oblast has been recorded. \nAt least 500 Geran-2 drones are expected to be used too, which have been accumulated at all major launch sites surrounding Ukraine. \nThe main targets for the strike will likely be energy infrastructure in the western regions of Ukraine (highest threat to Lviv and Ivano-Frankivsk Oblasts) and in Kyiv Oblast.",
      "timestamp": "2025-12-16T18:27:15.887918Z"
    },
    {
      "original": "Consequences of a Russian KAB glide-bomb strike on the city of Druzhkivka, Donetsk Oblast. \nI find it crazy that civilian truck drivers are still doing their jobs less than 10 km from the frontline. The whole of Ukrainian-controlled Donetsk Oblast should've been evacuated months ago.",
      "timestamp": "2025-12-16T18:27:15.887922Z"
    },
    {
      "original": "Odesa Oblast came under attack for the fifth night in a row. \nAt least 15 Geran-2 drones attacked targets in the southern suburbs of Odesa City, in the area of Sarata, and in Zatoka. A significant portion of the drones were shot down, especially over Odesa City, due to the format they were flying in (one after another). \nA large fire was seen burning at an impact site in Zatoka, as seen in the attached video.",
      "timestamp": "2025-12-16T18:27:15.887927Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continue to advance and have made additional progress on the tactical heights.\nIn the east, Russian forces resumed their assault operations east of Oleksiivka, advancing down two treelines along the tactical heights, strengthening their western flank against the stronger Ukrainian defences near Varachyne. Ukrainian forces are trying to counterattack, and have also attempted to enter Oleksiivka, but so far have achieved no successes.\nIn the west, Russian forces continued to slowly advance around Andriivka. As a part of their intensified assault operations, they were able to approach the village from the northwest, capturing the rest of the gulley east of Kindrativka. Other forces then secured the northern outskirts of Andriivka and entered the northern houses of the village but were unable to consolidate and quickly withdrew due to Ukrainian drone and artillery strikes. Ukrainian forces also carried out additional unsuccessful counterattacks in Andriivka. Meanwhile, Russian artillery fire has intensified on both frontline and rear positions, significantly complicating Ukrainian logistics and their efforts at counterattacking. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887932Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their assault operations and have made additional progress over the last week.\nIn the southwest, Russian forces continued pushing south through Lyman and reached the southern outskirts of the village. Other forces captured its eastern street, therefore completing the capture of the village. They also made additional progress in the forest to the west and captured new positions in the treelines to the east.\nTo the east, Russian forces continued to push through Vilcha, amid very heavy fighting. They were able to consolidate in the northeastern part of the town following earlier attacks and began a southward push through its eastern streets. As a result, they were able to outflank the town centre, allowing for the stronger Ukrainian positions there to be captured from three directions. From there, the Russians continued pushing towards the southern outskirts, capturing additional positions in the southern and eastern streets. Additionally, Russian forces advanced to the northeast of Vilcha, improving their positions along the highway to Vovchansk and capturing new positions in two different treelines east of the railway line.\nIn the northeast, following earlier attacks, Russian forces managed to cross a tributary of the Vovcha River from the southeastern edge of Vovchansk and entered the neighbouring village of Vovchanski-Khutory. They consolidated in the western houses in the area of Mryu Street and are now engaged in fierce battles for the western approaches to the industrial zone. \n+ ~8.03 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887939Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to incrementally advance over the last week and have made additional progress in the direction of Khanje and Ambarne.\nRussian forces advanced from their positions in the forest plantations on the western side of the gulley and captured new positions in the treelines and forest plantations further west, pushing the Ukrainians back to the eastern approaches to Khatnje. They were also able to improve their positions northwest of Ambarne, capturing the rest of the forest plantations on the northern edge of the gulley outside the village.\n+ ~2.44 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887948Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces continue to advance on different sides of the Oskil River, making important progress in various areas.\nIn the east, Russian forces consolidated in the northwestern-most houses of Petropavlivka following the Ukrainian withdrawal from the Synkivka area. From there, they began pushing southeast along the southern bank of the Hnylytsya River, capturing additional positions in the forests and reaching the northern outskirts of Kucherivka. Other forces captured the fish farm to the west, securing most of the remaining positions in the forests outside Kupyansk. \nIn the southwest, Ukrainian forces continued advancing in southwestern Kupyansk. They consolidated in additional positions in the low-rise residential area southeast of the Yuvileynyi high-rise micro-district. They also captured the rest of the houses north of Yuvileynyi. Additionally, the Ukrainians began a new push north up the western bank of the Oskil River, reaching the central market from the south. \nTo the north, Ukrainian forces entered the territory of the City Central Hospital, capturing part of it along with the adjacent residential streets. Fierce fighting is ongoing for the main hospital building and the surrounding areas. They also managed to capture the Russian strongpoint at the bread factory and the substation in northwestern Kupyansk, as well as additional residential areas to the southeast. Additionally, the Ukrainians began advancing south down the eastern bank of the Oskil River in northern Kupyansk, capturing new positions in the low-rise residential streets there, while other assault groups pushed further south through the city centre in the direction of School No. 4. \nFurther north, Ukrainian forces managed to clear Russian positions in most of the forests southeast and northeast of Radkivka, including the pipeline exit point that the Russians previously used to infiltrate the city and bring in supplies. They also advanced west from Kindrashivka, recapturing positions in the treelines and forested areas there.\n+ ~6.26 km² in favour of Russia. \n+ ~3.01 km² in favour of Ukraine.",
      "timestamp": "2025-12-16T18:27:15.887956Z"
    },
    {
      "original": "A Tu-22m3 strategic bomber is airborne from Diaghilev Airbase, Ryazan Oblast, flying towards its launch lines in the Black Sea.",
      "timestamp": "2025-12-16T18:27:15.887959Z"
    },
    {
      "original": "A Tu-22m3 strategic bomber is airborne from Diaghilev Airbase, Ryazan Oblast, flying towards its launch lines in the Black Sea.",
      "timestamp": "2025-12-16T18:27:15.887962Z"
    },
    {
      "original": "A second Tu-22m3 is airborne. Both are flying towards the Sea of Azov.",
      "timestamp": "2025-12-16T18:27:15.887965Z"
    },
    {
      "original": "A second Tu-22m3 is airborne. Both are flying towards the Sea of Azov.",
      "timestamp": "2025-12-16T18:27:15.887968Z"
    },
    {
      "original": "Its possible that they are flying to Mozdok Airbase, North Ossetia to be equipped with Kh-22/32 cruise missiles.",
      "timestamp": "2025-12-16T18:27:15.887971Z"
    },
    {
      "original": "Correction: 4 Tu-22m3s are now airborne.",
      "timestamp": "2025-12-16T18:27:15.887974Z"
    },
    {
      "original": "A MiG-31K is airborne over the eastern Black Sea. \nIt is likely carrying out a training mission with the 4 Tu-22m3 bombers. \nNo threat to Ukraine.",
      "timestamp": "2025-12-16T18:27:15.887979Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their assault operations and are advancing at an accelerated pace.\nIn the south, Russian forces have been carrying out a series of assault operations over the past week aimed at eliminating the Ukrainian salient south of Hulyaipole. They were able to advance north from the area of Dorozhnyanka, capturing positions in 7 different treelines on the tactical heights that have held for more than 3.5 years.\nTo the north, Russian forces continued advancing in eastern Hulyaipole and captured the local university and additional positions in the low-rise residential streets. They also improved their positions to the southeast, capturing additional treeline positions. From there, the Russians broke through Ukrainian positions in the southernmost part of the city, capturing an agricultural complex and nearby streets, and reaching Hoholya Street, where they established control over multiple low-rise residential blocks. \nTo the northwest, following earlier infiltrations, Russian soldiers managed to consolidate their bridgehead over the Haichur River on Travnya Street in northwestern Hulyaipole. They also captured additional positions in the treelines and orchards to the north, reaching the southern outskirts of Varvarivka.\n+ ~15.35 km² in favour of Russia.",
      "timestamp": "2025-12-16T18:27:15.887985Z"
    },
    {
      "original": "Google search trends for Kupyansk, Hulyaipole, and Myrnohrad over the last 90 days.\nThis speaks numbers...\nEdit: apparently I misclicked and didn’t select Myrnohrad as a search term, which skewed the results.",
      "timestamp": "2025-12-16T18:27:15.887990Z"
    },
    {
      "original": "Google search trends for Kupyansk, Hulyaipole, and Myrnohrad over the last 90 days.  This speaks numbers...  Edit: apparently I misclicked and didn’t select Myrnohrad as a search term, which skewed the results.",
      "timestamp": "2025-12-16T18:27:15.887993Z"
    },
    {
      "original": "The fact that no one cares about the hundreds of Ukrainian soldiers abandoned by the Ukrainian command in Myrnohrad is just depressing, and goes to show how effective Ukraine's information effort has been.",
      "timestamp": "2025-12-16T18:27:15.887998Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From December 15, 2025\nOn December 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-16T18:27:16.680680Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From December 15, 2025\nOn December 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-16T18:27:16.680695Z"
    },
    {
      "original": "U.S. Struck Three Alleged Drug Boats, Secured Access To Important Airports Near Venezuela (Video)\nThe United States military announced on December 16 that it killed eight people in new strikes on alleged drug trafficking boats in the eastern Pacific Ocean, amid rising tensions with Venezuela.\nIn a statement, the U.S. Military Southern Command (SOUTHCOM) said that “lethal kinetic strikes” targeted three boats in international waters a day earlier, at the direction of Secretary of Defense Pete Hegseth.\nThe latest strikes came as the U.S. continued to build up its military presence around Venezuela. On December 15, Trinidad and Tobago announced that it had authorized the U.S. military to use its airports.\nRead more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680705Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – December 16, 2025",
      "timestamp": "2025-12-16T18:27:16.680709Z"
    },
    {
      "original": "Iran Appointed New Air Defense Chief. Will He Manage To Deter Israel?  \nIran on December 15 appointed a new commander for its air defense forces as a part of wider efforts to rebuild the military capabilities badly hit during the 12-day June war with Israel.\nState media identified the new commander of the Islamic Republic of Iran Air Defense Force as Brig. Gen. Alireza Elhami. He replaced Brig. Gen. Alireza Sabahi-Fard, who had been in charge of the force. The state media did not provide any reason as to why the change was made.\nIran’s air defense network was badly hit during the war. Most of the damage was not done by the Israeli Air Force, but by commandos of the Mossad spy agency, who attacked air defense systems and radars from within Iranian territories with loitering munitions and guided missiles.\nRead more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680720Z"
    },
    {
      "original": "Mobilization In Ukraine: Growing Resistance And The Chasm Between Rhetoric And Reality\nDespite repeated official denials dismissing viral videos of forced mobilization as fakes, evidence of popular resistance in Ukraine is becoming increasingly widespread and radical. This is manifested in a growing number of incidents where desperate individuals resort to physically attacking TRC employees. For example, in the Lviv region, a man assaulted a recruitment officer with a hatchet, leaving the victim hospitalized.\nA recent high-profile event was the killing of a TRC employee in Mykolaiv. Reportedly, residents lured him out of his home and shot him. Such acts of revenge have begun to occur on a larger scale, though typically covertly, without witnesses, and authorities try not to publicize them.\nIn Poltava, after TRC officers pursued a man into a side street, they walked into a pre-arranged ambush. The attack reportedly resulted in three recruiters killed...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680741Z"
    },
    {
      "original": "Mobilization In Ukraine: Growing Resistance And The Chasm Between Rhetoric And Reality\nDespite repeated official denials dismissing viral videos of forced mobilization as fakes, evidence of popular resistance in Ukraine is becoming increasingly widespread and radical. This is manifested in a growing number of incidents where desperate individuals resort to physically attacking TRC employees. For example, in the Lviv region, a man assaulted a recruitment officer with a hatchet, leaving the victim hospitalized.\nA recent high-profile event was the killing of a TRC employee in Mykolaiv. Reportedly, residents lured him out of his home and shot him. Such acts of revenge have begun to occur on a larger scale, though typically covertly, without witnesses, and authorities try not to publicize them.\nIn Poltava, after TRC officers pursued a man into a side street, they walked into a pre-arranged ambush. The attack reportedly resulted in three recruiters killed...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680750Z"
    },
    {
      "original": "U.S. Accepted Israeli Red Lines On Syria\nUnited States envoy to Syria Tom Barrack and Israeli Prime Minister Benjamin Netanyahu reached several understandings with regard to Syria during a meeting on December 15, the Jerusalem Post reported.\nNetanyahu met Barrack in his Jerusalem office alongside Foreign Minister Gideon Sa’ar, acting National Security Adviser Gil Reich, Military Secretary Maj. Gen. Roman Gofman, and Ambassador to Washington Yechiel Leiter.\nThe talks were not limited to Syria. The situation in Lebanon, Turkey’s influence in the region and normalization with Saudi Arabia were also discussed.\nAccording to the Jerusalem Post, Barrack and Netanyahu agreed during the meeting on Israel’s \"freedom of operation\" in Syria, while also continuing efforts to reach a \"security deal\" with the country’s Islamist-led Interim Government.\nRead more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680759Z"
    },
    {
      "original": "Military Situation In Ukraine On December 16, 2025 (Maps Update)",
      "timestamp": "2025-12-16T18:27:16.680763Z"
    },
    {
      "original": "Military Situation In Ukraine On December 16, 2025 (Maps Update)",
      "timestamp": "2025-12-16T18:27:16.680767Z"
    },
    {
      "original": "Russian Army Approaches Borova, Makes Gains Around Vovchansk (Videos)\nOn December 16, the Russian military moved closer to Borova by capturing an important settlement nearby, all while expanding its control around Vovchansk to the north in Kharkiv.\nThe capture of Novoplatonovka, located right to the north of Borova, by the Zapad [West] Group of Forces was announced by the Russian Ministry of Defense.\nTo the north in Kharkiv, the Sever [North] Group of Forces expanded its control around Vovchansk in three different directions.\nRead more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680775Z"
    },
    {
      "original": "Russian Army Approaches Borova, Makes Gains Around Vovchansk (Videos)\nOn December 16, the Russian military moved closer to Borova by capturing an important settlement nearby, all while expanding its control around Vovchansk to the north in Kharkiv.\nThe capture of Novoplatonovka, located right to the north of Borova, by the Zapad [West] Group of Forces was announced by the Russian Ministry of Defense.\nTo the north in Kharkiv, the Sever [North] Group of Forces expanded its control around Vovchansk in three different directions.\nRead more \nHERE",
      "timestamp": "2025-12-16T18:27:16.680783Z"
    }
  ],
  "script_run_time": "2025-12-16T18:27:16.681600Z"
}