{
  "messages": [
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-18T13:13:05.733606Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-18T13:13:05.733625Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-18T13:13:05.733630Z"
    },
    {
      "original": "🛵\n Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-18T13:13:05.733636Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини! Залучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-18T13:13:05.733642Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-10-18T13:13:05.733647Z"
    },
    {
      "original": "Швидкісна ціль на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-10-18T13:13:05.733651Z"
    },
    {
      "original": "Швидкісна ціль на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-10-18T13:13:05.733654Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-10-18T13:13:05.733660Z"
    },
    {
      "original": "🚀\nЧернігівська область - ракетна небезпека!",
      "timestamp": "2025-10-18T13:13:05.733667Z"
    },
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Херсонської області",
      "timestamp": "2025-10-18T13:13:05.733673Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-10-18T13:13:05.733679Z"
    },
    {
      "original": "🛵\n Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-18T13:13:05.733686Z"
    },
    {
      "original": "Швидкісна ціль на Донеччину.",
      "timestamp": "2025-10-18T13:13:05.733689Z"
    },
    {
      "original": "🛵\n Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-18T13:13:05.733694Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-18T13:13:05.733700Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини! Залучено засоби для його збиття.",
      "timestamp": "2025-10-18T13:13:05.733705Z"
    },
    {
      "original": "🛵\n Суми - перебувайте в укриттях!",
      "timestamp": "2025-10-18T13:13:05.733709Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-18T13:13:05.733714Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-18T13:13:05.733718Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Бахмач.",
      "timestamp": "2025-10-18T13:13:05.733722Z"
    },
    {
      "original": "Kryvyi Rih, Dnipropetrovsk Oblast, is being attacked by Russian Geran-2 drones. ~19 drones are involved, and several impacts have been recorded.",
      "timestamp": "2025-10-18T13:13:06.281666Z"
    },
    {
      "original": "Can you see this message?\nedit: Some of my posts aren't going through, not sure why.",
      "timestamp": "2025-10-18T13:13:06.281680Z"
    },
    {
      "original": "POV: Western MSM every single time Kryvyi Rih gets attacked.",
      "timestamp": "2025-10-18T13:13:06.281685Z"
    },
    {
      "original": "Both Iskanders seem to have impacted in/near the village of Martove, Kharkiv Oblast.",
      "timestamp": "2025-10-18T13:13:06.281689Z"
    },
    {
      "original": "Footage showing the two Russian Iskander-M ballistic missile strikes that targeted the village of Martove, Kharkiv Oblast, last night. They reportedly targeted a Ukrainian preparation site for launching long-range UAVs. \nCoordinates: 49.95638, 36.96833",
      "timestamp": "2025-10-18T13:13:06.281694Z"
    },
    {
      "original": "Russian forces have captured the village of Poltavka, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~1,110.\nTotal land area: ~6.49 km².",
      "timestamp": "2025-10-18T13:13:06.281700Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Crimea for a large attack. Groups are flying towards Yevpatoriya on the western coast of Crimea, and Saki on the southern coast. More are flying in from off the coast of southern Kherson Oblast.",
      "timestamp": "2025-10-18T13:13:06.281704Z"
    },
    {
      "original": "During the Ukrainian UAV attack on Crimea today, a Russian Su-30SM fighter involved in air defence operations crashed after it was hit by friendly fire. Russian VKS-affiliated channel Fighterbomber confirmed the reports, stating that the crew survived and is safe.",
      "timestamp": "2025-10-18T13:13:06.281707Z"
    },
    {
      "original": "A short time ago, Russian long-range Smerch MLRS targeted the Peresadivka area of Mykolaiv Oblast, around 64 km from the nearest Russian-controlled territory. Explosions were heard in the area. A Russian reconnaissance drone was operating there at the time.",
      "timestamp": "2025-10-18T13:13:06.281711Z"
    },
    {
      "original": "Ukrainian drones from the \"Lasar\" drone group of the National Guard hit and destroyed the Russian BM-30 Smerch launcher that targeted Peresadivka, Mykolaiv Oblast last night. \nA reconnaissance drone monitored the launches of Smerch rockets, before relaying the coordinates of its relocated position to drone crews who subsequently struck it. \nCoordinates: 46.325527, 32.735003 (~30 km from the frontline).",
      "timestamp": "2025-10-18T13:13:06.281716Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City.",
      "timestamp": "2025-10-18T13:13:06.281719Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City.",
      "timestamp": "2025-10-18T13:13:06.281723Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-10-18T13:13:06.281726Z"
    },
    {
      "original": "Recently, the situation east of Kostyantynivka has become very mixed and complicated as Russian forces attempt to consolidate outside the city and begin entering the more built-up area.\nAs a result, I have decided to add a very large grey zone, where Russian and Ukrainian positions are mixed and layered, often operationally encircling each other. This map below shows areas where Russian and Ukrainian soldiers have been recorded, although this doesn't necessarily show consolidation. In the future, once the situation clears up and one side clearly regains the initiative, the map will be updated to show additional control zones. But for now, it will look something like this.\nThis has happened due to the large open areas here, with limited cover from treelines and individual, isolated buildings. Additionally, Ukraine's manpower shortages have forced them to resort to increased drone usage. Kostyantynivka provides practically endless hiding spots for drone operators, while Russia has Chasiv Yar and the surrounding forests and villages to use for this. Both Russian and Ukrainian soldiers are operating in small assault groups of usually 2-4 people, clearing each other out of their positions. A similar situation was observed (and still is to some extent) in the Dobropillya direction.\nMeanwhile, extensive preparatory bombing and shelling continues on Kostyantynivka, primarily targeting its eastern districts, ahead of the Russian storming operation on the city.",
      "timestamp": "2025-10-18T13:13:06.281733Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance over the last week, and have captured the rest of Poltavka.\nAfter crossing the Yanchur River and securing a bridgehead on its western bank, Russian forces pushed further under heavy drone and artillery cover, expanding their zone of control to the northern outskirts of Poltavka. Other forces advanced south, linking up with the formations north of Malynivka. \nAdditionally, the Russians improved their positions north of Malynivka, capturing the rest of the forests there and beginning a push west of Poltavka. However, the arrival of Ukrainian reinforcements has slowed their advance, and counterattacks will likely begin in the near future. \n+ ~4.55 km² in favour of Russia.",
      "timestamp": "2025-10-18T13:13:06.281739Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued their offensive operations, and have made significant progress in three areas.\nIn the southwest, Russian forces broke through from Verbove to the village of Pryvillya. They moved downhill and southwest from the treelines on the tactical heights, establishing control over positions east of Pryvillya, before entering and capturing the village itself. Further east, they captured most of the rest of the tactical heights and began clearing more areas in the low-lying ground northwest of Novohryhorivka. \nTo the northwest, after capturing Oleksiivka, Russian forces continued pushing through the treelines southeast of the village, and levelled the frontline towards the southern bank of the Vovcha River. They also began advancing up the treelines west of Sosnivka, attempting to reach the intersection of the Vovcha and Vorona Rivers. \nFurther east, Russian forces were able to re-enter the village of Novoselivka. They established control over the northern part and are now engaged in fierce fighting for the southern streets. \n+ ~39.69 km² in favour of Russia.",
      "timestamp": "2025-10-18T13:13:06.281746Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-18T13:13:06.281749Z"
    },
    {
      "original": "High-resolution satellite imagery published by Ukrainian outlet Radio Svoboda of the Feodosia Oil Depot in Crimea shows the extent of the damage from repeated Ukrainian UAV attacks. \nAs a result of the recent attacks on October 7 and October 13, 11 oil tanks were destroyed and 4 others sustained varying levels of damage.",
      "timestamp": "2025-10-18T13:13:06.281754Z"
    },
    {
      "original": "2 Tu-95MS Russian strategic bombers have redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast, after being equipped with Kh-101 cruise missiles. \nAt least 1 Tu-95MS strategic bomber is redeploying from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast. \nThe movements, plus additional information, suggest that there increased possibility for a large-scale, combined missile and drone attack tonight, however nothing is certain at this moment. \nI will continue to provide updates today and inform if anything changes.",
      "timestamp": "2025-10-18T13:13:06.281763Z"
    },
    {
      "original": "UKTMO reports that a ship operating 116 Nautical Miles east of Aden, Yemen, has been hit by an unknown projectile, resulting in a fire. \nEarlier, there were reports that a Cameroon-flagged tanker experienced an explosion, with the crew requesting to abandon the ship. Rescue operations are currently ongoing, and an investigation is underway.",
      "timestamp": "2025-10-18T13:13:06.281767Z"
    },
    {
      "original": "A reconnaissance drone is operating off the coast of Odesa City. It has been in that general area for the past 2 hours.",
      "timestamp": "2025-10-18T13:13:06.281771Z"
    },
    {
      "original": "A short time ago, one Russian Iskander-M ballistic missile launched from near Bryansk City impacted the vicinity of Koryukivka, Chernihiv Oblast.",
      "timestamp": "2025-10-18T13:13:06.281776Z"
    },
    {
      "original": "The target of the Iskander missile earlier was also attacked by several MLRS rockets and Geran-2 drones. A reconnaissance drone was operating there, filming the strikes, so we will probably get a video of the strikes soon.",
      "timestamp": "2025-10-18T13:13:06.281779Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations south of Novopavlivka and have expanded their bridgehead on the northern bank of the Vovcha River.\nAfter establishing control over Filiya and beginning attacks east of the settlement, Russian forces began making quicker progress towards encircling the remaining Ukrainian formations stationed to the south near Dachne. They advanced uphill from the eastern approaches to Filiya, moving along two treelines to the trench strongpoints west of the highway. These strongpoints were then captured, threatening the encirclement of the Ukrainian forces to the south. \n+ ~3.08 km² in favour of Russia.",
      "timestamp": "2025-10-18T13:13:06.281783Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Ukrainian forces counterattacked, re-establishing control over the Pokrovsk Coal Mine.\nFollowing the Russian assault groups entering and establishing themselves in the eastern buildings of the mine complex, Ukrainian forces began counterattacking. They first covered the Russian positions with FPV drones, preventing accumulation of infantry, and struck any reinforcements arriving from the south. Assault groups then moved in from the western part of the mine and cleared the positions from the surviving Russian soldiers. A grey zone has now formed up to the anti-tank ditch north of Udachne. \n+ ~0.83 km² in favour of Ukraine.",
      "timestamp": "2025-10-18T13:13:06.281788Z"
    },
    {
      "original": "Russian Army Advances Deeper In Kupyansk, Captures Two More Settlements In Kharkiv (Videos) \nOn October 17, the Russian military advanced deeper into the city of Kupyansk and imposed control over two other settlements elsewhere in the Kharkiv direction.\nThe Zapad [West] Group of Forces has reportedly imposed control of all the areas to the north of Kuznechnaya street in the center of Kupyansk following fierce clashes with Kiev forces.\nIn addition to ongoing operations in Kupyansk, the Zapad Group of Forces continues to advance in the pocket to the east of the Oskil River, between the city and Kolisnykivka.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845269Z"
    },
    {
      "original": "Russian Army Advances Deeper In Kupyansk, Captures Two More Settlements In Kharkiv (Videos) \nOn October 17, the Russian military advanced deeper into the city of Kupyansk and imposed control over two other settlements elsewhere in the Kharkiv direction.\nThe Zapad [West] Group of Forces has reportedly imposed control of all the areas to the north of Kuznechnaya street in the center of Kupyansk following fierce clashes with Kiev forces.\nIn addition to ongoing operations in Kupyansk, the Zapad Group of Forces continues to advance in the pocket to the east of the Oskil River, between the city and Kolisnykivka.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845286Z"
    },
    {
      "original": "Russian Troops Capture Pryvillya After Successful Breakthrough In Dnepropetrovsk\nOn October 17, Russian military’s Vostok [East] Group of Forces captured Pryvillya after successfully breaking through Ukrainian defenses in the Dnepropetrovsk once again.\nThe capture of Pryvillya, which is located along the Yanchur River, was confirmed by the Russian Ministry of Defense. Russian troops advanced more than five kilometers from Verbove to reach the settlement, capturing a large area on the way.\nThe next step by the Vostok Group of Forces will likely be an attack on Vyshneve to the north. Russian troops have been advancing towards the eastern outskirts of the settlement from Verbove.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845297Z"
    },
    {
      "original": "Russian Troops Capture Pryvillya After Successful Breakthrough In Dnepropetrovsk\nOn October 17, Russian military’s Vostok [East] Group of Forces captured Pryvillya after successfully breaking through Ukrainian defenses in the Dnepropetrovsk once again.\nThe capture of Pryvillya, which is located along the Yanchur River, was confirmed by the Russian Ministry of Defense. Russian troops advanced more than five kilometers from Verbove to reach the settlement, capturing a large area on the way.\nThe next step by the Vostok Group of Forces will likely be an attack on Vyshneve to the north. Russian troops have been advancing towards the eastern outskirts of the settlement from Verbove.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845305Z"
    },
    {
      "original": "Air Defenses And Drones: New Report Reveals Turkish Plan To Arm Syria\nTurkey is planning to arm Syria’s new military with advanced weapons, including armored vehicles, drones, artillery, missiles, and air defense systems, in the coming weeks, Bloomberg, reported on October 17, citing Turkish officials.\nThe officials told the news outlet that the weapons will be deployed in northern Syria to avoid any tensions with Israel in the south. They noted that this plan is part of broader understandings with Syria’s Islamist-led Interim Government to support efforts to rebuild the Syrian military.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845314Z"
    },
    {
      "original": "Iran Is Digging Up One Of Its Nuclear Sites, Israel Could Use This As Pretext To Attack \nThe Institute for Science and International Security (ISIS) reported activities at one of Iran’s most secretive nuclear sites, citing satellite images from Maxar, Vantor, and Airbus which were taken between the end of September and early October.\nIn a report published on October 16, the Washington-based institute said that the middle of three entrances at Isfahan Nuclear Technology Research Center, which were previously blocked by earth and rubble, had been cleared leaving the tunnel portal’s door visible as of September 26.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845322Z"
    },
    {
      "original": "Iran Is Digging Up One Of Its Nuclear Sites, Israel Could Use This As Pretext To Attack \nThe Institute for Science and International Security (ISIS) reported activities at one of Iran’s most secretive nuclear sites, citing satellite images from Maxar, Vantor, and Airbus which were taken between the end of September and early October.\nIn a report published on October 16, the Washington-based institute said that the middle of three entrances at Isfahan Nuclear Technology Research Center, which were previously blocked by earth and rubble, had been cleared leaving the tunnel portal’s door visible as of September 26.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845329Z"
    },
    {
      "original": "POWER AND PRESSURE: FRONTLINES IGNITE AS LEADERS TALK PEACE",
      "timestamp": "2025-10-18T13:13:06.845333Z"
    },
    {
      "original": "Heavy Urban Fighting: Russian Troops Are Advancing In Pokrovsk\nOver 60% of the territory in the industrial zone of Pokrovsk is under the control of Russian forces. Russia's 47th Tank Division has taken control of the village of Peschanoye. \nPresident Donald Trump stated that delivering Tomahawk missiles could lead to an 'escalation', and that the US is not prepared to reduce its stockpile of these missiles.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845340Z"
    },
    {
      "original": "Heavy Urban Fighting: Russian Troops Are Advancing In Pokrovsk\nOver 60% of the territory in the industrial zone of Pokrovsk is under the control of Russian forces. Russia's 47th Tank Division has taken control of the village of Peschanoye. \nPresident Donald Trump stated that delivering Tomahawk missiles could lead to an 'escalation', and that the US is not prepared to reduce its stockpile of these missiles.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845348Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845355Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845361Z"
    },
    {
      "original": "Is Quad Group Dying Or Just Being Outsourced To Fight China?\nThe Quadrilateral Security Dialogue — or “Quad” — has long been hyped as the seeds of an “Asian NATO.” Made up of the US, Japan, India, and Australia, the Quad has been Washington’s big play for the Indo-Pacific. But with US President Donald Trump’s “America First” approach, many are asking if the group has a future.\nSqueezed by Trump’s neo-Monroeist foreign policy and his deal-making style with allies, QUAD is fading fast. Analysts such as Michael Shoebridge (Director of Strategic Analysis Australia) are calling it “the incredible shrinking Quad”: its July 2025 ministers’ statement for instance boiled down to vague talk on sea security and cyber issues, ditching the meatier promises from Biden’s time.\nDu Lan (Deputy Director at Asia-Pacific Institute) notes that Washington has “concentrated mostly on domestic reforms and ending conflicts in Ukraine and the Middle East conflict”...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-18T13:13:06.845371Z"
    }
  ],
  "script_run_time": "2025-10-18T13:13:06.846236Z"
}