{
  "messages": [
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-02T23:46:48.190299Z"
    },
    {
      "original": "🛵\n БпЛА в Корюківському районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-11-02T23:46:48.190315Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-02T23:46:48.190320Z"
    },
    {
      "original": "🚀\nКАБ у напрямку Запорізького району.",
      "timestamp": "2025-11-02T23:46:48.190325Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-02T23:46:48.190330Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-02T23:46:48.190334Z"
    },
    {
      "original": "🚀\nКАБ повз Василівку, курсом на Запорізький район.",
      "timestamp": "2025-11-02T23:46:48.190338Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півдні Миколаївщини! Залучено засоби для збиття.",
      "timestamp": "2025-11-02T23:46:48.190343Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Полтаву з півночі.",
      "timestamp": "2025-11-02T23:46:48.190347Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К",
      "timestamp": "2025-11-02T23:46:48.190355Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщині, курсом на Київщину!",
      "timestamp": "2025-11-02T23:46:48.190361Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщині, курсом на Київщину!",
      "timestamp": "2025-11-02T23:46:48.190364Z"
    },
    {
      "original": "🚀\nКурсом на Житомирщину!",
      "timestamp": "2025-11-02T23:46:48.190369Z"
    },
    {
      "original": "Житомир - в укриття!",
      "timestamp": "2025-11-02T23:46:48.190372Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на Чернігівщині, курс південно-західний!",
      "timestamp": "2025-11-02T23:46:48.190376Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на півночі Сумщини, курс південно-західний!",
      "timestamp": "2025-11-02T23:46:48.190380Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на півночі Сумщини, курс південно-західний!",
      "timestamp": "2025-11-02T23:46:48.190384Z"
    },
    {
      "original": "На півночі Київщини, курсом на Житомирщину!",
      "timestamp": "2025-11-02T23:46:48.190388Z"
    },
    {
      "original": "На півночі Київщини, курсом на Житомирщину!",
      "timestamp": "2025-11-02T23:46:48.190391Z"
    },
    {
      "original": "🚀\nКурсом на Житомир!",
      "timestamp": "2025-11-02T23:46:48.190395Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К",
      "timestamp": "2025-11-02T23:46:48.190402Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К.",
      "timestamp": "2025-11-02T23:46:48.190406Z"
    },
    {
      "original": "🛵\n Група БпЛА на Херсонщині (Бериславський район), курс північно-західний.\n🛵\n БпЛА на сході Дніпропетровщини, постійно змінюють напрямок руху.",
      "timestamp": "2025-11-02T23:46:48.190412Z"
    },
    {
      "original": "БпЛА східніше Борисполя, курс південно-західний.",
      "timestamp": "2025-11-02T23:46:48.190415Z"
    },
    {
      "original": "🛵\n БпЛА північніше Обухова, змінив курс на північно-західний.\n🛵\n БпЛА повз Баштанку на Миколаївщині, курс південно-західний.\n🛵\n БпЛА в Миколаївському районі, курс північний.\n🛵\n БпЛА з Лозівського району Харківщини, курсом на Дніпропетровщину.",
      "timestamp": "2025-11-02T23:46:48.190424Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Обухів з південно-східного напрямку.\n🛵\n БпЛА в Охтирському районі Сумщини, курс південно-західний.",
      "timestamp": "2025-11-02T23:46:48.190430Z"
    },
    {
      "original": "🇺🇸\n❌\n🏴\n \n— President Trump and Secretary of War Hegseth have both threatened action against Islamic State West Africa Province and Boko Haram on social media today, warning if the Nigerian government doesn't protect Christians against \"Islamic Terrorists\", the Department of War will step in.",
      "timestamp": "2025-11-02T23:46:48.789251Z"
    },
    {
      "original": "Roughly 18 Russian Geran-2 drones attacked Izmail, Odesa Oblast, last night. Impacts were recorded at the  110 kV electrical substation (45.35406, 28.80398), where a large fire is now burning. \nAdditionally, strikes were recorded in the village of Safyany, possibly targeting the solar farm (45.39421, 28.87373).",
      "timestamp": "2025-11-02T23:46:48.789263Z"
    },
    {
      "original": "Last night, a combined attack was carried out on a target near Synyavka, Chernihiv Oblast. Two Iskander-M ballistic missiles and at least six Geran-2 drones were used, all striking the same area.\nOne Iskander-M was launched from an OTRK installation northwest of Klintsy, Bryansk Oblast, and another was launched from an OTRK installation in the vicinity of Khalino Airbase, Kursk Oblast. \nRed arrows: Missiles\nOrange arrows: Drones\nAdditionally, the city of Novhorod-Siverskyi came under attack once again, with explosions being reported.",
      "timestamp": "2025-11-02T23:46:48.789270Z"
    },
    {
      "original": "Changes on the frontline in Ukraine for October 2025:\nYellow = Russian advances\nLight blue = Ukrainian advances\nRussian advances:\nDonetsk Oblast: ~376.38 km²\nDnipropetrovsk Oblast: ~143.92 km²\nZaporizhzhia Oblast: ~103.66 km²\nKharkiv Oblast: ~62.06 km²\nSumy Oblast: ~13.98 km²\nKherson Oblast: ~12.70 km²\nBelgorod Oblast: ~3.98 km²\nTotal: ~716.68 km² (up by 42.05%)\nTotal (excluding Kursk & Belgorod): ~712.70 km²\nUkrainian advances:\nDonetsk Oblast: ~58.46 km²\nKharkiv Oblast: ~11.00 km²\nSumy Oblast: ~2.92 km²\nZaporizhzhia Oblast: ~0.49 km²\nTotal: ~72.87 km² (up by 0.89%).\nNote: This covers net gains for each side. Ukrainian advances that took place on territory Russia occupied within this month will simply be subtracted from the Russian total, and vice versa.",
      "timestamp": "2025-11-02T23:46:48.789286Z"
    },
    {
      "original": "Changes on the frontline in Ukraine for October 2025:\nYellow = Russian advances\nLight blue = Ukrainian advances\nRussian advances:\nDonetsk Oblast: ~376.38 km²\nDnipropetrovsk Oblast: ~143.92 km²\nZaporizhzhia Oblast: ~103.66 km²\nKharkiv Oblast: ~62.06 km²\nSumy Oblast: ~13.98 km²\nKherson Oblast: ~12.70 km²\nBelgorod Oblast: ~3.98 km²\nTotal: ~716.68 km² (up by 42.05%)\nTotal (excluding Kursk & Belgorod): ~712.70 km²\nUkrainian advances:\nDonetsk Oblast: ~58.46 km²\nKharkiv Oblast: ~11.00 km²\nSumy Oblast: ~2.92 km²\nZaporizhzhia Oblast: ~0.49 km²\nTotal: ~72.87 km² (up by 0.89%).\nNote: This covers net gains for each side. Ukrainian advances that took place on territory Russia occupied within this month will simply be subtracted from the Russian total, and vice versa.",
      "timestamp": "2025-11-02T23:46:48.789301Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continue to advance and have made new progress in two different areas.\nIn the south, Russian forces advanced downhill from the tactical heights and established control over the positions east of the gulley and south of the reservoir, with the Ukrainians withdrawing beyond it.\nTo the north, Russian forces advanced from northwestern Novomykolaivka, into the eastern part of Uspenivka. Other forces crossed the bridge over the Yanchur River into central Uspenivka, linking up with the assault groups to the southeast, and beginning a general push towards the western outskirts of the village.\n+ ~5.08 km² in favour of Russia.",
      "timestamp": "2025-11-02T23:46:48.789307Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to quickly advance and have made new progress on both banks of the Yanchur River.\nAfter entering and capturing most of Yehorivka, Russian forces consolidated in the western part of the village and began attacking the neighbouring village of Danylivka. They also advanced south of Yehorivka, capturing treelines on the tactical heights which previously saw significant DRG operations. Further south, they advanced to new treelines southwest of Pryvillya and expanded their zone of control west of Zlahoda.\nTo the northwest, Russian forces advanced further north of the tributary of the Yanchur River. They captured additional positions up the road in the direction of the village of Hai, and completed the capture of Novooleksandrivka after infiltrating the settlement from the south. \nTo the southeast, Russian forces advanced over the tributary and cleared the treelines north of Verbove, linking up the initial bridgehead with the rest of the frontline. \n+ ~23.11 km² in favour of Russia.",
      "timestamp": "2025-11-02T23:46:48.789313Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nRussian forces have continued to make significant advances, and as a result, most of Pokrovsk is now under Russian control.\nWest of Pokrovsk, Russian forces established full control over the railway line from Udachne, and began pushing beyond it to the treelines further north. Additionally, the Russians began advancing up the railway line to Pavlohrad, capturing a 2.2 km section of it, and reaching the small airstrip. They also entered the outskirts of Hryshyne and began fighting for the dachas there.\nIn northern Pokrovsk, Russian forces advanced to the northernmost residential areas and consolidated there. They also crossed the railway line from the city centre at a new point, establishing control over the rest of the fortified industrial zone and underground bunker system, before pushing into the remaining residential areas. \nIn northeastern Pokrovsk, Russian forces entered the high-rise district and established control over the rest of the low-rise residential streets. They also captured most of the rest of the industrial zone, breaking through to the factory on the eastern edge of the city, while other forces secured additional residential areas.\nEast of Pokrovsk, Russian forces completed the capture of the villages of Hnativka and Rih, as well as the adjacent railway line, before advancing to and capturing the treeline further east. They also seized the last part of Novopavlivka.\nSouth of Myrnohrad, Russian forces advanced from the city of Novohrodivka to Sukhyi Yar, capturing the eastern part of the village as well as the treelines to the south. \nIn northern Myrnohrad, Russian forces made additional progress in the low-rise residential areas, advancing in the direction of the city centre, and captured a few more high-rise buildings. They also captured additional areas in the industrial buildings on the northern edge of Myrnohrad.\nMeanwhile, north of Pokrovsk, over the last five days Ukrainian forces infiltrated into the northern part of Rodynske, establishing control over poorly consolidated Russian positions in and around the local school. Fighting is ongoing in this area, but the incursion zone is limited, and the Russians retain control over most of their positions in the city. \n+ ~18.14 km² in favour of Russia.\n+ ~0.73 km² in favour of Ukraine.",
      "timestamp": "2025-11-02T23:46:48.789324Z"
    },
    {
      "original": "During an overnight raid on the Askar Refugee Camp in the West Bank city of Nablus, at least two Israeli soldiers were injured after falling into an ambush from Palestinian fighters. \nPalestinian militants from the local armed group \"Nablus Battalion\" (part of the Palestinian Islamic Jihad) fired on the IDF soldiers with small-arms and detonated pre-prepared IEDs against military vehicles and infantry. The IDF did not comment on the incident, unlike usual. \nArmed groups affiliated with Hamas, the PIJ, and the Al-Aqsa Martyrs Brigades have ramped up their attacks against the IDF in the West Bank in recent weeks, coinciding with the ceasefire in the Gaza Strip. Recently, operations targeted Israeli forces in the cities of Qabatiya, Tubas, Nablus, Beit Ummar, and towns and villages surrounding Israeli-occupied Jenin, mainly involving IED detonations and small-arms attacks, as well as a reconnaissance drone interception.",
      "timestamp": "2025-11-02T23:46:48.789329Z"
    },
    {
      "original": "In Kherson, Russian FAB glide-bomb ricocheted off the ground, bounced over a street of houses, and exploded.",
      "timestamp": "2025-11-02T23:46:48.789333Z"
    },
    {
      "original": "A short time ago, 3 Kinzhal hypersonic aeroballistic missiles were launched from 3 MiG-31Ks over eastern Tambov Oblast. They all likely impacted Ozerne Airbase, Zhytomyr Oblast.",
      "timestamp": "2025-11-02T23:46:48.789336Z"
    },
    {
      "original": "A short time ago, 3 Kinzhal hypersonic aeroballistic missiles were launched from 3 MiG-31Ks over eastern Tambov Oblast. They all likely impacted Ozerne Airbase, Zhytomyr Oblast.",
      "timestamp": "2025-11-02T23:46:48.789339Z"
    },
    {
      "original": "The three Kinzhals all impacted Ozerne Airbase. Interestingly, the MiG-31Ks used new launch lines in southern Ryazan Oblast. \nThis is the second new location they have begun using, with southwestern Astrakhan Oblast also being used recently.",
      "timestamp": "2025-11-02T23:46:48.789343Z"
    },
    {
      "original": "Smoke was seen rising from Ozerne Airbase. Photo taken from Zhytomyr City.",
      "timestamp": "2025-11-02T23:46:48.789349Z"
    },
    {
      "original": "The 1st Separate Center of the Unmanned Systems Forces of Ukraine published footage showing some of their recent FP-1 drone strikes on energy infrastructure in Luhansk Oblast. \nThe video shows strikes on:\nKysneva-2 110 kV substation (48.493621, 38.793091)\nPeremoha 500 kV substation (48.159448, 39.645912)\nKomunarska 220 kV substation (48.452501, 38.851112)\nNovodonbaska 500 kV (48.500672, 38.532773)\nCherkaska 220 kV (48.565194, 38.873771)\nAll strikes, except for the Peremoha substation, impacted the electrical transformers. The drone targeting Peremoha appears to have missed slightly. \nOne of the strikes was 134 km away from the nearest Ukrainian-controlled territory. FP-1 drones were developed around a year ago and have only recently been used more commonly. They have proved very effective for strikes on rear Russian targets.",
      "timestamp": "2025-11-02T23:46:48.789358Z"
    },
    {
      "original": "Ukrainian UAVs have struck an oil depot in the city of Shakhtarsk, Donetsk Oblast. A fire is now burning at the impact site.\nCoordinates: 48.03439, 38.50705 (72 km from the frontline).",
      "timestamp": "2025-11-02T23:46:48.789362Z"
    },
    {
      "original": "Ukrainian UAVs have struck an oil depot in the city of Shakhtarsk, Donetsk Oblast. A fire is now burning at the impact site.\nCoordinates: 48.03439, 38.50705 (72 km from the frontline).",
      "timestamp": "2025-11-02T23:46:48.789366Z"
    },
    {
      "original": "The Saratov Oil Refinery is under attack from Ukrainian long-range UAVs. At least two impacts have been recorded, with several more drones flying in. Russian air defence is stationed next to the refinery, and has intercepted multiple drones so far.",
      "timestamp": "2025-11-02T23:46:48.789369Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394272Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394287Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 2, 2025 (Map Update)",
      "timestamp": "2025-11-02T23:46:49.394292Z"
    },
    {
      "original": "The Situation in Kupyansk: The Dire Plight of Ukrainian Servicemen and Prisoner Testimonies\nA complex operational situation remains tense in the Kupyansk area on the Kharkiv direction, and under these conditions, Ukrainian servicemen continue to surrender. The testimonies of captured soldiers from the 14th Separate Mechanized Brigade of the Ukrainian Armed Forces, Yuriy Shapovalenko and Alexey Vinder, paint a picture of the critical situation facing the surrounded formations.\n\"We surrendered ourselves. About four days after we were brought here, we realized we were surrounded by the Russians. Resupply was gone – no ammunition, our water ran out, very little food was left. We ate one can of stew among three men per day. The route across the Oskol River was already cut off – it's all your FPV drones there. Because of that, there was no logistics left. A lot of your soldiers entered the city. So, we decided to come out with a white rag,\" recounted prisoner of war Shapovalenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394300Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-02T23:46:49.394304Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-02T23:46:49.394309Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394317Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394325Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394334Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T23:46:49.394343Z"
    }
  ],
  "script_run_time": "2025-11-02T23:46:49.395132Z"
}