{
  "messages": [
    {
      "original": "🚀\n Крилата ракета на півдні Вінниччини, курсом на північно-західний напрямок",
      "timestamp": "2025-09-20T07:46:00.909958Z"
    },
    {
      "original": "🚀\n Крилата ракета на півдні Вінниччини, курсом на північно-західний напрямок",
      "timestamp": "2025-09-20T07:46:00.909976Z"
    },
    {
      "original": "Курсом на Вапнярку",
      "timestamp": "2025-09-20T07:46:00.909981Z"
    },
    {
      "original": "🚀\n Крилаті ракети на півдні Тернопільщини, курсом на захід.",
      "timestamp": "2025-09-20T07:46:00.909986Z"
    },
    {
      "original": "🚀\n Крилаті ракети на півдні Тернопільщини, курсом на захід.",
      "timestamp": "2025-09-20T07:46:00.909994Z"
    },
    {
      "original": "Курсом на Бережани",
      "timestamp": "2025-09-20T07:46:00.909997Z"
    },
    {
      "original": "🚀\n Крилаті ракети на півночі Івано-Франківщини, курсом на Львівщину.",
      "timestamp": "2025-09-20T07:46:00.910002Z"
    },
    {
      "original": "🚀\n Крилаті ракети на півночі Івано-Франківщини, курсом на Львівщину.",
      "timestamp": "2025-09-20T07:46:00.910006Z"
    },
    {
      "original": "Курсом на Стрий, Львівщина.",
      "timestamp": "2025-09-20T07:46:00.910010Z"
    },
    {
      "original": "🚀\n Крилата ракета на півдні Хмельниччини, курсом на захід.",
      "timestamp": "2025-09-20T07:46:00.910014Z"
    },
    {
      "original": "🛵\n Оновлення інформації по БпЛА :\n-  північ Чернігівщини, курсом на захід;\n-  північ Київщини, один курсом на північ, інший на південь.",
      "timestamp": "2025-09-20T07:46:00.910020Z"
    },
    {
      "original": "🛵\n Оновлення інформації по БпЛА :\n-  центр Чернігівщини, курсом на захід;\n-  північ Сумщини, курсом на Шостку.",
      "timestamp": "2025-09-20T07:46:00.910025Z"
    },
    {
      "original": "🛵\n БпЛА на Вишгородський район Київщини!",
      "timestamp": "2025-09-20T07:46:00.910030Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Броварського району на Київщині.",
      "timestamp": "2025-09-20T07:46:00.910036Z"
    },
    {
      "original": "🛵\n Щодо руху ворожих БпЛА:\n1. БпЛА у центральній частині Чернігівщини, курс південний;\n2. БпЛА на заході Чернігівщини, вектор руху Київ;\n3. БпЛА в центральній частині Сумщини, курс південний.\n🛫\nТакож спостерігається активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-20T07:46:00.910046Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 583 ЦІЛІ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 вересня (із 20.00 19 вересня) противник завдав комбінованого удару по території України із застосуванням ударних БпЛА, ракет повітряного та наземного базування. Загалом, під час удару, радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 619 засобів повітряного нападу:\n- 579 ударних БпЛА типу Shahed і безпілотників-імітаторів різних типів із напрямків Курськ, Брянськ, Міллєрово, Орел, Шаталово, Приморсько-Ахтарськ – рф;\n- 8 балістичних ракет Іскандер-М/KN-23 із Єйська - рф, ТОТ Криму;\n- 32 крилаті ракети Х-101 із повітряного простору Саратовської обл.- рф.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n❗️\n В ході атаки противник застосував уже традиційну тактику – одночасний удар по визначених об’єктах великою кількістю ракет і БпЛА різних типів. Під час повітряного удару, по крилатих ракетах противника ефективно відпрацювала тактична авіація, зокрема винищувачі F-16. Західна зброя вкотре доводить свою ефективність на полі бою. Дякуємо партнерам за уже надану допомогу і очікуємо на подальше посилення України в повітряному просторі, як наземними системами ППО, так і авіаційною компонентою.  \n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 583 повітряні цілі:\n- 552 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів;\n- 2 балістичні ракети Іскандер-М/KN-23;\n- 29 крилатих ракет Х-101.\nЗафіксовано влучання балістичних, крилатих ракет та 23 ударних БпЛА на 10 локаціях, падіння збитих (уламки) на 10 локаціях.\n❗️\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-20T07:46:00.910072Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА наближається до Києва з півночі.",
      "timestamp": "2025-09-20T07:46:00.910076Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-09-20T07:46:00.910081Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у напрямку Десни (Чернігівщина) зі сходу, півночі та заходу.",
      "timestamp": "2025-09-20T07:46:00.910085Z"
    },
    {
      "original": "📢\n Відбій загрози балістичного озброєння.",
      "timestamp": "2025-09-20T07:46:00.910089Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-20T07:46:00.910094Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у напрямку Києва з північного сходу;\n🛵\n БпЛА в Обухівському та Бориспільському районах Київщини, курс південно-східний;\n🛵\n Ворожий БпЛА на Полтавщині (Лубенський р-н.), курс південний.",
      "timestamp": "2025-09-20T07:46:00.910101Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації  в акваторії Азовського моря! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-20T07:46:00.910107Z"
    },
    {
      "original": "2 groups of missiles are flying west through southern Ternopil Oblast towards Ivano-Frankivsk Oblast.\n2 groups of missiles are flying northwest through southern Vinnytsia Oblast toward southern Khmelnytskyi Oblast.",
      "timestamp": "2025-09-20T07:46:01.528555Z"
    },
    {
      "original": "1 group of missiles is flying northwest towards Zolochiv, Lviv Oblast.\n1 group of missiles is flying northwest towards Burshtyn, Ivano-Frankivsk Oblast.\n2 groups of missiles continue to fly northwest through southern Vinnytsia Oblast towards southern Khmelnytskyi Oblast.",
      "timestamp": "2025-09-20T07:46:01.528569Z"
    },
    {
      "original": "1 group of missiles is approaching Mykolaiv, Lviv Oblast from the east.\n1 group of missiles flew past Burshtyn, Ivano-Frankivsk Oblast towards Mykolaiv, Lviv Oblast.\n2 groups of missiles are flying northwest towards Nova Ushytsya, Khmelnytskyi Oblast.",
      "timestamp": "2025-09-20T07:46:01.528575Z"
    },
    {
      "original": "Explosions in Mykolaiv, Lviv Oblast. Kh-101 impacts.",
      "timestamp": "2025-09-20T07:46:01.528578Z"
    },
    {
      "original": "The missiles in southern Khmelnytskyi Oblast have disappeared. They are either flying low, or impacted a target in that area.",
      "timestamp": "2025-09-20T07:46:01.528581Z"
    },
    {
      "original": "The missile attack is now over. Thank you for following my coverage. I will post more details about the numbers a little later than usual while I clarify some things.",
      "timestamp": "2025-09-20T07:46:01.528588Z"
    },
    {
      "original": "Scenes from Dnipro during the missile attack on the city. Dozens of Geran-2 drones also hit targets there earlier.",
      "timestamp": "2025-09-20T07:46:01.528592Z"
    },
    {
      "original": "Scenes from Dnipro during the missile attack on the city. Dozens of Geran-2 drones also hit targets there earlier.",
      "timestamp": "2025-09-20T07:46:01.528595Z"
    },
    {
      "original": "Last night, at least 15 Geran-2 drones attacked Mykolaiv City. The drones flew in three waves (6, followed by 7, followed by 2), and attacked multiple different unknown targets. Fires are now burning at the impact sites.",
      "timestamp": "2025-09-20T07:46:01.528599Z"
    },
    {
      "original": "Last night, at least 15 Geran-2 drones attacked Mykolaiv City. The drones flew in three waves (6, followed by 7, followed by 2), and attacked multiple different unknown targets. Fires are now burning at the impact sites.",
      "timestamp": "2025-09-20T07:46:01.528602Z"
    },
    {
      "original": "Scenes from Dnipro from during the drone attack (before the missiles arrived). Multiple large fires are still burning.",
      "timestamp": "2025-09-20T07:46:01.528607Z"
    },
    {
      "original": "Scenes from Dnipro from during the drone attack (before the missiles arrived). Multiple large fires are still burning.",
      "timestamp": "2025-09-20T07:46:01.528611Z"
    },
    {
      "original": "Ukrainian UAVs attacked the Saratov Oil Refinery in Saratov Oblast again, last night. At least 3 impacts were recorded, and fires are now burning there. \nAdditionally, flights in and out of Saratov international airport were temporarily suspended.",
      "timestamp": "2025-09-20T07:46:01.528615Z"
    },
    {
      "original": "Ukrainian UAVs attacked the Saratov Oil Refinery in Saratov Oblast again, last night. At least 3 impacts were recorded, and fires are now burning there. \nAdditionally, flights in and out of Saratov international airport were temporarily suspended.",
      "timestamp": "2025-09-20T07:46:01.528618Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Novokuibyshevsk Oil Refinery in Samara once again. At least two impacts were recorded, one of which being at the ELOU-AVT-11 oil processing unit.\nNovokuibyshevsk Refinery is approximately 900 km from the closest Ukrainian-controlled territory.",
      "timestamp": "2025-09-20T07:46:01.528623Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Novokuibyshevsk Oil Refinery in Samara once again. At least two impacts were recorded, one of which being at the ELOU-AVT-11 oil processing unit.\nNovokuibyshevsk Refinery is approximately 900 km from the closest Ukrainian-controlled territory.",
      "timestamp": "2025-09-20T07:46:01.528626Z"
    },
    {
      "original": "I have added a new layer to my Gaza map showing the estimated reach of Hamas' civil authority in the Gaza Strip. \nCurrently, I have areas of Deir Al-Balah, Nuseirat Refugee Camp, Maghazi Refugee Camp, Al-Bureij Refugee Camp, Az Zawayda, Al-Mawasi, and Khan Younis Refugee Camp in that zone. \nThis will be updated alongside Israeli advances.",
      "timestamp": "2025-09-20T07:46:01.528631Z"
    },
    {
      "original": "Interesting...",
      "timestamp": "2025-09-20T07:46:01.528634Z"
    }
  ],
  "script_run_time": "2025-09-20T07:46:01.985878Z"
}