{
  "messages": [
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА  на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T05:49:58.052010Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-06T05:49:58.052029Z"
    },
    {
      "original": "🛵\n Чернігівська область (Чернігівський район), Київська область (Вишгородський район), Сумська область (Сумський, Конотопський райони) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T05:49:58.052035Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва з північного напрямку!",
      "timestamp": "2025-09-06T05:49:58.052039Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва з північного напрямку!",
      "timestamp": "2025-09-06T05:49:58.052044Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Васильків!",
      "timestamp": "2025-09-06T05:49:58.052048Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі та Донеччині.",
      "timestamp": "2025-09-06T05:49:58.052056Z"
    },
    {
      "original": "🛵\n БпЛА на межі Донеччини та Харківщини, курс південно-західний.",
      "timestamp": "2025-09-06T05:49:58.052060Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва з східного напрямку!",
      "timestamp": "2025-09-06T05:49:58.052065Z"
    },
    {
      "original": "🛵\n БпЛА в Сумському та Охтирському районах Сумської області, курс південно-західний.\n🛵\n БпЛА в Конотопському районі Сумської області, курс західний.\n🛵\n БпЛА в Павлоградському та Синельниківському районах Дніпропетровської області, курс західний.",
      "timestamp": "2025-09-06T05:49:58.052073Z"
    },
    {
      "original": "БпЛА з акваторії Чорного моря в напрямку Білгород-Дністровського району Одещини.",
      "timestamp": "2025-09-06T05:49:58.052076Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!\n🛸\n Ворожий розвідувальний БпЛА  на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T05:49:58.052083Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку! \n🛸\n Ворожий розвідувальний БпЛА  на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T05:49:58.052088Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-06T05:49:58.052093Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на східному напрямку!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-06T05:49:58.052114Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!",
      "timestamp": "2025-09-06T05:49:58.052124Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!",
      "timestamp": "2025-09-06T05:49:58.052131Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-09-06T05:49:58.052138Z"
    },
    {
      "original": "🛵\n Чернігівська область (Чернігівський, Корюківський райони), Сумська область (Конотопський, Шосткинський райони) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T05:49:58.052145Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА  з акваторії Чорного моря в напрямку Одеси! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T05:49:58.052155Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-06T05:49:58.052163Z"
    },
    {
      "original": "🛵\n Чернігівська область (Чернігівський, Корюківський райони), Сумська область (Конотопський, Шосткинський райони) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T05:49:58.052172Z"
    },
    {
      "original": "БпЛА в західній частині Чернігівщини, курс західний.\nБпЛА в північній частині Київщини, курс західний.",
      "timestamp": "2025-09-06T05:49:58.052176Z"
    },
    {
      "original": "Чернігівська область (Чернігівський, Корюківський райони), Київська область (Вишгородський район) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T05:49:58.052180Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance and have captured new parts of Kupyansk city.\nAfter a series of Ukrainian counterattacks, Russian forces regrouped on the northern edge of the city and began pushing south again. They were able to advance through the grey zone down the highway to the city centre, reaching Spartak Stadium and establishing control over a few high-rise buildings to the north. To the east, they advanced south down Michurina Street on the western bank of the Oskil River, with the grey zone now extending towards the highway over the Oskil River.\nTo the west, Russian forces were able to maintain control over southeastern Moskovka and used this plus the adjacent industrial zone to advance deeper into northwestern Kupyansk, taking up new positions on Teroborony and Dovhailivska Streets.\nWest of Kupyansk, a large grey zone has formed in and around Moskovka and Sobolivka due to extensive FPV drone activity from both sides, and a lack of fortifications. Both Russian and Ukrainian soldiers regularly operate in this area, with neither side holding a permanent presence here.\n+ ~1.38 km² in favour of Russia.",
      "timestamp": "2025-09-06T05:49:58.706169Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their push southwards, capturing various new positions in three areas.\nIn the west, after cutting the Lyman - Shandryholove Road, Russian forces expanded their zone of control to the south, capturing new positions towards the southern outskirts of Shandryholove, as well as in the adjacent forest plantations. \nTo the east, Russian forces advanced further along the tactical heights east of Derylove. They pushed southwest down the treelines on the higher ground, while other forces cleared the forest plantations in the low-lying ground, forcing the Ukrainians to withdraw to the gulley north of Stavky. \nIn the west, after multiple failed attacks on Myrne, Russian forces began attempting to further bypass the village. They crossed the gulley southwest of Myrne, and captured the opposite treeline, while other forces spearheaded a new advance for 1.5 km south to the Zarichne - Drobysheve Road. \n+ ~9.59km² in favour of Russia.",
      "timestamp": "2025-09-06T05:49:58.706186Z"
    },
    {
      "original": "In the Siversk direction, following the stalling of Russian assault operations northeast of Siversk, Ukrainian forces carried out a series of counterattacks, aimed at alleviating pressure on the tactical heights northeast of the city. \nUkrainian forces advanced from positions north of the Plotka River, capturing a forested area and a trench fortification on the southeastern outskirts of Serebryanka. Additionally, they were able to re-enter the western houses of Serebryanka, and advanced east down the southern bank of the Siverskyi Donets River, reaching the northern part of the village.\n+ ~4.64 km² in favour of Ukraine.",
      "timestamp": "2025-09-06T05:49:58.706195Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces restarted their assault operations around 5 days ago, and have made significant advances towards Siversk from the south.\nRussian forces advanced in two areas. Most progress was made in the west, where they infiltrated from the area of Rozdolivka, through the southern part of Pereizne which was in the grey zone, to Fedorivka, where they captured the eastern part of the village. From there, Russian forces consolidated in southern Pereizne and pushed north through the village and up the parallel railway line. As of now, they have almost completely captured the settlement.\nIn the east, Russian forces advanced north along the tactical heights, capturing new positions along three parallel treelines towards Vyimka. \n+ ~5.45 km² in favour of Russia.",
      "timestamp": "2025-09-06T05:49:58.706201Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have been advancing, with both sides battling to gain the initiative.\nAfter Ukrainian forces failed to cut off the remnants of the Russian salient, Russian forces regrouped south of Kucheriv Yar and attacked west. They were able to drive a wedge between Vilne and Nove Shakhove, capturing positions along three parallel treelines on the tactical heights, threatening Ukraine's position in Nove Shakhove. \nTo the south, Ukrainian forces continued to advance in Nykanorivka, and improved their positions in the central part of the village.\nIn the east, after weeks of battles, Ukrainian forces re-established full control over Volodymyrivka, pushing the Russians out of the southern streets of the village. \n+ ~2.00 km² in favour of Russia.\n+ ~1.31 km² in favour of Ukraine.",
      "timestamp": "2025-09-06T05:49:58.706208Z"
    },
    {
      "original": "A media-silent Russian advance through Pokrovsk has been occurring for the past 10 days. Russian forces have reached the city centre.",
      "timestamp": "2025-09-06T05:49:58.706212Z"
    },
    {
      "original": "In the Pokrovsk direction, over the past week Russian forces have continued to expand their zone of control inside the city and have made significant progress towards the city centre.\nRussian forces advanced in two areas. In the north, they completed the capture of the southwestern streets of the city and crossed the E-50 Highway to the market district. They were able to rapidly capture the city central markets, reaching the city centre from the west. They also advanced southeast down the highway to the edge of the Shakhtarskyi District, and reached Yuvileynyy Park from the north. Additionally, the Russians completed the capture of the village of Troyanda, which was previously partially in the grey zone. \nIn the south, Russian forces advanced further east through the Kalynivka District, capturing additional positions in the low-rise residential buildings and the nearby dachas. They were also able to enter the southwestern part of the Lazurnyi District, establishing control over several high-rise buildings. \nThe main goal for Russia in Pokrovsk seems to be to reach the railway station in the northeastern part of the city. In the area of the railway station - north of the railway tracks - is a heavily fortified industrial area, which contains a network of bunkers and coal tunnels which stretch out to the rest of Pokrovsk. It is believed to be one of the largest underground tunnel systems in all of Europe. \n+ ~2.00 km² in favour of Russia.",
      "timestamp": "2025-09-06T05:49:58.706218Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces resumed their assault operations southwest of Udachne and reached the Donetsk-Dnipropetrovsk regional border.\nAfter improving their positions on the treeline southeast of Molodetske, Russian forces advanced west to the forest plantations and the treeline on the regional border. They gained a foothold in both and used the treeline to enter and capture positions in the southwestern houses of Molodetske. \n+ ~2.15 km² in favour of Russia.",
      "timestamp": "2025-09-06T05:49:58.706223Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Dnipro. At least 30 impacts were recorded. One of the main targets seems to have been the Salyut Plant (48.527413, 35.093740), which has refrigeration units with ammonia, as well as fuel and oil storage.",
      "timestamp": "2025-09-06T05:49:58.706227Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Dnipro. At least 30 impacts were recorded. One of the main targets seems to have been the Salyut Plant (48.527413, 35.093740), which has refrigeration units with ammonia, as well as fuel and oil storage.",
      "timestamp": "2025-09-06T05:49:58.706230Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-06T05:49:58.706234Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-06T05:49:58.706237Z"
    },
    {
      "original": "Flying to Khotin",
      "timestamp": "2025-09-06T05:49:58.706240Z"
    },
    {
      "original": "Another Iskander was launched",
      "timestamp": "2025-09-06T05:49:58.706242Z"
    },
    {
      "original": "Both disappeared",
      "timestamp": "2025-09-06T05:49:58.706245Z"
    },
    {
      "original": "The speed suggests they were S-300s in Ground-to-ground mode",
      "timestamp": "2025-09-06T05:49:58.706248Z"
    },
    {
      "original": "Another missile flying in the same direction",
      "timestamp": "2025-09-06T05:49:58.706252Z"
    },
    {
      "original": "Another missile flying in the same direction",
      "timestamp": "2025-09-06T05:49:58.706255Z"
    },
    {
      "original": "This one disappeared too. They are targeting the border area near Khotin.",
      "timestamp": "2025-09-06T05:49:58.706260Z"
    },
    {
      "original": "Another S-300 to Khotin",
      "timestamp": "2025-09-06T05:49:58.706263Z"
    },
    {
      "original": "Another S-300 to Khotin",
      "timestamp": "2025-09-06T05:49:58.706266Z"
    },
    {
      "original": "Two were launched here. Both impacted the same area near the frontline.",
      "timestamp": "2025-09-06T05:49:58.706269Z"
    }
  ],
  "script_run_time": "2025-09-06T05:49:59.338586Z"
}