{
  "messages": [
    {
      "original": "🛵\n БпЛА з Харківщини на Полтавщину",
      "timestamp": "2025-11-16T04:28:25.920712Z"
    },
    {
      "original": "🛵\nБпЛА з акваторії Чорного моря  у напрямку Одещини. напрямок н.п.Сергіївка",
      "timestamp": "2025-11-16T04:28:25.920729Z"
    },
    {
      "original": "🛵\n БпЛА в Роменському районі Сумщини, курс південний.",
      "timestamp": "2025-11-16T04:28:25.920737Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини на Дніпропетровщину, напрямок Павлоград.",
      "timestamp": "2025-11-16T04:28:25.920743Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс на південь.",
      "timestamp": "2025-11-16T04:28:25.920747Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-16T04:28:25.920752Z"
    },
    {
      "original": "🚀\nКАБ в східній частині Дніпропетровщини",
      "timestamp": "2025-11-16T04:28:25.920756Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курс в напрямку м.Чернігів",
      "timestamp": "2025-11-16T04:28:25.920760Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-16T04:28:25.920765Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння",
      "timestamp": "2025-11-16T04:28:25.920769Z"
    },
    {
      "original": "🚀\nШвидкісна ціль курсом на Сумщину",
      "timestamp": "2025-11-16T04:28:25.920781Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Полтавщини, курсом на Дніпропетровщину.\n🛵\n БпЛА на півночі Чернігівщини, курсом на захід.\n🛵\n БпЛА на півдні Харківщини, курсом на захід.",
      "timestamp": "2025-11-16T04:28:25.920790Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-16T04:28:25.920798Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-16T04:28:25.920803Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині \n➡️\n курсом на Томаківку.",
      "timestamp": "2025-11-16T04:28:25.920809Z"
    },
    {
      "original": "🛵\n Група БпЛА на півдні Дніпропетровщини, курсом на Миколаївщину.\n🛵\n БпЛА на півночі Чернігівщини, курсом на південь.\n🛵\n БпЛА в центральній частині Сумщини, курсом на південь.\n🛵\n Група БпЛА на сході Кіровоградщини, курсом на захід.\n курсом на захід.",
      "timestamp": "2025-11-16T04:28:25.920818Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з Брянська.",
      "timestamp": "2025-11-16T04:28:25.920824Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-16T04:28:25.920828Z"
    },
    {
      "original": "🛵\n Група БпЛА на заході Миколаївщини, курсом на Одещину.",
      "timestamp": "2025-11-16T04:28:25.920833Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Одеса - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-16T04:28:25.920841Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, making important progress.\nIn the northeast, following the withdrawal of the remaining Ukrainian formations, Russian forces completed the capture of the large, fortified forest east of Predtechyne and captured numerous treeline positions further west. \nTo the west, Russian forces continued advancing down the railway line and entered southeastern Kostyantynivka from a new direction. Other forces continued advancing through the Stare Selyshche District, where they captured new positions in the direction of the railway station, and crossed the Naumykha River to the railway line. \nTo the south, after advancing from the northwest, Russian forces cleared most of the rest of southern Ivanopillya, and captured positions along the railway line northwest of Pleshchiivka.\nIn the southwest, after capturing a bunker system, the Russians advanced further west through the forests behind the Kleban-Bykske Reservoir, with some groups nearly reaching the northernmost part of it.\n+ ~13.66 km² in favour of Russia",
      "timestamp": "2025-11-16T04:28:26.731168Z"
    },
    {
      "original": "On the southwestern flank of Kostyantynivka and in the Dobropillya direction, both Russian and Ukrainian forces have advanced.\nRussian forces resumed their assault operations north of Rusyn Yar and captured the rest of the treeline south of a gulley. They then crossed the gulley and captured positions in the forests outside the chalk quarries.\nTo the west, sometime recently, Ukrainian forces advanced east from Shakhove to a gulley and nearby orchards, along with a forested area, recapturing positions there.\nMeanwhile, Russian forces advanced from the southern part of Volodymyrivka and recaptured most of the rest of the village. Other forces recaptured the treelines south of the Novyy Reservoir, along with the agricultural complex on the eastern outskirts of Volodymyrivka. The Ukrainians are continuing their attempts at cutting off Russian assault groups in western Shakhove. \nTo the southwest, Russian forces crossed the tributary of the Kazenyi Torets River and recaptured the main part of the village of Zatyshok. Ukrainian forces are counterattacking from Sukhetske and the western dachas of Zatyshok towards the eastern dachas.\n+ ~8.08 km² in favour of Russia.\n+ ~2.25 km² in favour of Ukraine.",
      "timestamp": "2025-11-16T04:28:26.731185Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued assault operations in the besieged city of Myrnohrad, capturing new positions in three different areas.\nIn the south, after gaining a foothold in the first few high-rise buildings of the Zapadny District, Russian forces advanced further and captured at least 11 more buildings and are fighting for the area of School No. 9. Additionally, they are attempting to advance further west through the low-rise residential areas to the south, where the grey zone is expanding.\nTo the northeast, Russian forces marginally advanced in the high-rise blocks of eastern Myrnohrad. After bombing Ukrainian positions with FABs, they were able to approach the local school and kindergarten, capturing at least four more high-rise buildings.\nTo the northwest, Russian forces continued to slowly expand their zone of control in northern Myrnohrad. They were able to capture the locomotive depot and enter the abandoned \"Novator\" mine.\n+ ~0.25 km² in favour of Russia.",
      "timestamp": "2025-11-16T04:28:26.731192Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Russian forces intensified their assault operations in the area of the Donetsk - Dnipropetrovsk regional border and have made important progress in two different areas.\nIn the west, Russian forces advanced west from the village of Molodetske, crossing the border towards Novopidhorodne. They consolidated in the windbreaks on either side of the railway tracks and entrenched in the southeastern houses of Novopidhorodne. They were also able to advance along the treeline north of Molodetske, while other forces enter the forest plantations next to the gulley to the northeast.\nIn the east, Russian forces advanced further north from western Udachne, capturing new treeline positions and entering the western part of the Pokrovsk Coal Mine. Other forces advanced north up the treeline from eastern Udachne to the southern part of the mine, and down the road to the western part of the mine. \n+ ~3.06 km² in favour of Russia.",
      "timestamp": "2025-11-16T04:28:26.731198Z"
    },
    {
      "original": "In the Novopavlivka and Prosyana directions, Russian forces intensified their assault operations and have made significant progress.\nIn the east, Russian forces advanced further northeast through southern Novopavlivka, reaching the town centre and the bridge over the Solena River. Other forces secured the treelines and agricultural buildings to the south. A mechanised assault was then carried out through the grey-zone down the highway, taking advantage of a gap in the anti-tank ditches and dragon's teeth fortifications. They were able to break into the eastern part of the town and reach the northern outskirts. Consolidation is ongoing in many areas.\nIn the west, after earlier infiltrations by DRGs, Russian forces advanced from western Ivanivka to the large forest east of Havrylivka, where they established control over most of it. Additionally, the Russians advanced south of the Vovcha River from the western outskirts of Zelenyi Hai to the other large forest in the area, establishing control over it. \n+ ~11.61 km² in favour of Russia.",
      "timestamp": "2025-11-16T04:28:26.731203Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces intensified their assault operations south of the Vovcha River and have captured two villages.\nIn the east, Russian forces advanced further east through Orestopil, capturing the rest of the village. They also advanced north and downhill up the treelines to the Vorona River, establishing control over them and the forest plantations on its southern bank. They also recaptured the village of Sosnivka, which has been partially in the grey zone for some time, and advanced west through the forested areas from Novoselivka and the area of Vorone. Other forces carried out attacks towards the rear of Oleksandrohrad in an attempt to force a Ukrainian withdrawal from the village.\nIn the west, Russian forces widened their spearhead to Orestopil by advancing to and establishing control over part of the nearby gulley. Additionally, they advanced north and downhill up two treelines, before branching off towards the village of Vovche, where they entrenched in the nearby forested area on the southern bank of the Vovcha River. \n+ ~17.39 km² in favour of Russia.",
      "timestamp": "2025-11-16T04:28:26.731209Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, Russian forces continued to rapidly advance, making substantial progress in four different areas.\nIn the north, after earlier attempts at attacking the village, Russian forces were able to establish full control over Danylivka, physically cutting the Pokrovsk'e - Hulyaipole road. At the same time, they advanced further west through the treelines on the tactical heights south of Danylivka, capturing positions in numerous different treelines, and beginning attacks to the southwest in the direction of Radisne. Other forces advanced south through the treelines west and northwest of Zlahoda, seizing new positions there too.\nTo the south, after capturing Solodke and entering Rivnopillya, Russian forces continued to build on their momentum and advanced for more than 3.3 km through the treelines on the tactical heights to the southwest of Solodke. This was done in conjunction with other forces advancing directly west from Solodke, and through the treelines northwest of Rivnopillya. Meanwhile, the Russians completed the capture of Rivnopillya and Yablukove after approximately two days of fighting, and began advancing further west beyond these two settlements, where they captured new treeline positions towards the rear of Hulyaipole. \nTo the southwest, after capturing Yablukove, Russian forces began a series of attacks along the tactical heights towards the village of Zatyshshya. They were able to advance for around 3 km, bypassing Vesele from the west and approaching the eastern outskirts of Zatyshshya. Other forces levelled the frontline between this new spearhead and the positions north of Vesele. \nIn the south, Russian forces improved their positions northeast of Vesele, reaching the northeastern outskirts of the village and capturing a treeline north of the Hulyaipole - Malynivka Road. They also levelled the frontline east of Vysoke, capturing new positions in eight different treelines. \n+ ~44.86 km² in favour of Russia.",
      "timestamp": "2025-11-16T04:28:26.731216Z"
    },
    {
      "original": "🇸🇾\n \n— Two Katyusha rockets were fired against a target in the Al-Muzzah municipality, western Damascus, Syria. The perpretrator of the attacks is unknown.",
      "timestamp": "2025-11-16T04:28:26.731223Z"
    },
    {
      "original": "Yesterday's events in Damascus foreshadow a potential inter-terrorist conflict in Syria in the coming months. ISIS has managed to infiltrate STG forces (formerly HTS + other terrorist groups) and the country's major cities. They have moved from systematic killings to multi-pronged attacks against civilian targets (mainly minorities) as well as military targets (attacks on Damascus authorities' checkpoints). The most interesting aspect of this change in dynamics lies in the attempted attacks against Jolani, which have revealed a deep rift between the security forces, which must be supplemented by Turkish and US intelligence.\nDespite Washington's resounding support (to the detriment of the SDF) and the limited lifting of sanctions as well as normalization (recognition of a terrorist as a Syrian “leader”), Jolani faces an internal danger that he can hardly resolve by opposing his own nature.\nComparisons are odious, but the Libyan formula seems to prevail in the face of events.\nMay God protect decent Syrians.\n🙏🏻",
      "timestamp": "2025-11-16T04:28:26.731229Z"
    },
    {
      "original": "Overnight, a large-scale Geran-2 drone attack was carried out on the village of Starokozache, Odesa Oblast. \nAt least 25 drones attacked in three large groups, striking the Starokozache Solar Park and 110 kV electrical substation. Large fires broke out as a result, and widespread power outages were reported in the surrounding areas.",
      "timestamp": "2025-11-16T04:28:26.731234Z"
    },
    {
      "original": "Overnight, a large-scale Geran-2 drone attack was carried out on the village of Starokozache, Odesa Oblast. \nAt least 25 drones attacked in three large groups, striking the Starokozache Solar Park and 110 kV electrical substation. Large fires broke out as a result, and widespread power outages were reported in the surrounding areas.",
      "timestamp": "2025-11-16T04:28:26.731238Z"
    },
    {
      "original": "Last night, approximately 15 Russian Geran-2 drones attacked the town of Lymanivka, Kharkiv Oblast.\nThe drones targeted a joint facility containing a gas compressor station and a 110 kV electrical substation. A large fire broke out as a result. \nCoordinates: 48.93854, 36.26079",
      "timestamp": "2025-11-16T04:28:26.731247Z"
    },
    {
      "original": "Last night, approximately 15 Russian Geran-2 drones attacked the town of Lymanivka, Kharkiv Oblast.\nThe drones targeted a joint facility containing a gas compressor station and a 110 kV electrical substation. A large fire broke out as a result. \nCoordinates: 48.93854, 36.26079",
      "timestamp": "2025-11-16T04:28:26.731252Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again swarmed eastern Dnipropetrovsk Oblast. \nAt least 22 impacts were recorded, targeting the settlements of Vasylkivka, Chaplyne, Pokrovsk'e, Dmytrivka, and Shakhtarske. No videos or photos have been published yet.",
      "timestamp": "2025-11-16T04:28:26.731256Z"
    },
    {
      "original": "Multiple Ukrainian UAVs attacked Samara Oblast, targeting an electrical substation outside the city limits. At least one impact was recorded, resulting in a fire breaking out afterwards.\nThe distance from the nearest Ukrainian-controlled territory is around 930 km.",
      "timestamp": "2025-11-16T04:28:26.731260Z"
    },
    {
      "original": "Multiple Ukrainian UAVs attacked Samara Oblast, targeting an electrical substation outside the city limits. At least one impact was recorded, resulting in a fire breaking out afterwards.\nThe distance from the nearest Ukrainian-controlled territory is around 930 km.",
      "timestamp": "2025-11-16T04:28:26.731264Z"
    },
    {
      "original": "Overnight, Ukrainian UAVs and Neptune cruise missiles attacked Novorossiysk, Krasnodar Krai. One Neptune missile impacted a Russian S-400 air defence installation, as seen in media 1.   UAVs also struck the Sheskharis oil transshipment complex, as seen in…",
      "timestamp": "2025-11-16T04:28:26.731267Z"
    },
    {
      "original": "New satellite imagery shows that as a result of the combined Ukrainian missile and drone attack on Novorossiysk, Krasnodar Krai, four S-400 surface-to-air missile launchers were destroyed and 2 radars were damaged/destroyed.",
      "timestamp": "2025-11-16T04:28:26.731271Z"
    },
    {
      "original": "New satellite imagery shows that as a result of the combined Ukrainian missile and drone attack on Novorossiysk, Krasnodar Krai, four S-400 surface-to-air missile launchers were destroyed and 2 radars were damaged/destroyed.",
      "timestamp": "2025-11-16T04:28:26.731276Z"
    },
    {
      "original": "Additional satellite imagery reveals the damage to the Sheskharis oil transshipment complex in Novorossiysk. \nThe oil transshipment elements, oil measuring systems, and technological pipelines suffered significant damage.",
      "timestamp": "2025-11-16T04:28:26.731280Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557713Z"
    },
    {
      "original": "Venezuela’s Maduro Calls For 'Peace' As U.S. Announces ‘Operation Southern Spear’ (Photos) \nDespite recent escalation by the administration of President Donald Trump, President Nicolás Maduro told CNN on November 13 that the people of the United States should unite with Venezuela for the peace of the Americas.\nSpeaking to the news network from the middle of a rally in Caracas, Maduro urged the U.S. against entering another prolonged conflict,\nAs Maduro was calling for peace, U.S. Defense Secretary Pete Hegseth formally announced the launch of a U.S. military operation to target so-called “narco-terrorists.”\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557729Z"
    },
    {
      "original": "Over Hundred Russian Drones And Hypersonic Missiles Hit Ukraine Overnight (Videos)\nMultiple hypersonic missiles and over a hundred suicide drones attacked targets in Ukraine over the night of November 14 and 15.\nIn a statement, the Ukrainian Air Force said that three Kinzhal air-launched hypersonic ballistic missiles and 135 suicide drones, mostly from the Geran-type, were launched from Russia. As usual, the air force claimed that most of the projectiles were intercepted by air defenses or jammed by electronic warfare means. However, impacts were reported in at least 13 locations.\nBlasts were heard in the regions of Dnipropetrovsk, Kherson, Donetsk, Kharkiv, as well as Sumy, as in the capital, Kiev, itself.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557738Z"
    },
    {
      "original": "Over Hundred Russian Drones And Hypersonic Missiles Hit Ukraine Overnight (Videos)\nMultiple hypersonic missiles and over a hundred suicide drones attacked targets in Ukraine over the night of November 14 and 15.\nIn a statement, the Ukrainian Air Force said that three Kinzhal air-launched hypersonic ballistic missiles and 135 suicide drones, mostly from the Geran-type, were launched from Russia. As usual, the air force claimed that most of the projectiles were intercepted by air defenses or jammed by electronic warfare means. However, impacts were reported in at least 13 locations.\nBlasts were heard in the regions of Dnipropetrovsk, Kherson, Donetsk, Kharkiv, as well as Sumy, as in the capital, Kiev, itself.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557746Z"
    },
    {
      "original": "Russian Army Captures Yablokovo, Reaches Depth Of Defenses In Novopavlivka (Videos)\nOn November 15, the Russian military captured yet another settlement from Kiev forces in Zaporizhzhia, and broke through Ukrainian defenses inside a large settlement in Dnepropetrovsk.\nThe capture of Yablokovo in Zaporizhzhia by the Vostok [East] Group of Forces was announced by the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 114th Motorised Rifle Regiment of the 5th Combined Arms Army.\nIn addition to the advance in Zaporizhzhia, the Vostok Group of Forces is developing its operations in Novopavlivka in Dnepropetrovsk.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557755Z"
    },
    {
      "original": "Russian Army Captures Yablokovo, Reaches Depth Of Defenses In Novopavlivka (Videos)\nOn November 15, the Russian military captured yet another settlement from Kiev forces in Zaporizhzhia, and broke through Ukrainian defenses inside a large settlement in Dnepropetrovsk.\nThe capture of Yablokovo in Zaporizhzhia by the Vostok [East] Group of Forces was announced by the Russian Ministry of Defense, which noted in a statement that the attack on the settlement was led by the the 114th Motorised Rifle Regiment of the 5th Combined Arms Army.\nIn addition to the advance in Zaporizhzhia, the Vostok Group of Forces is developing its operations in Novopavlivka in Dnepropetrovsk.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557763Z"
    },
    {
      "original": "Military Situation In Syria On November 15, 2025 (Map Update)",
      "timestamp": "2025-11-16T04:28:27.557767Z"
    },
    {
      "original": "Russian Army Makes Gains In Myrnohrad And Shakhove Near Pokrovsk (Videos)\nOn November 15, the Russian military advanced in two settlements close to Pokrovsk and repelled more Ukrainian counterattacks nearby in Donetsk.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces reportedly made gains in the eastern and northern parts of Myrnohrad, taking over several high-rise buildings. In addition, the Russian Ministry of Defense said in its daily briefing that the group, more specifically the 51st Army, advanced in the Vostochny neighborhood, made gains in the southern part of the large settlement, and approached the Zapadny microdistrict.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557774Z"
    },
    {
      "original": "Russian Army Makes Gains In Myrnohrad And Shakhove Near Pokrovsk (Videos)\nOn November 15, the Russian military advanced in two settlements close to Pokrovsk and repelled more Ukrainian counterattacks nearby in Donetsk.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces reportedly made gains in the eastern and northern parts of Myrnohrad, taking over several high-rise buildings. In addition, the Russian Ministry of Defense said in its daily briefing that the group, more specifically the 51st Army, advanced in the Vostochny neighborhood, made gains in the southern part of the large settlement, and approached the Zapadny microdistrict.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557782Z"
    },
    {
      "original": "Military Situation In Ukraine On November 15, 2025 (Maps Update)",
      "timestamp": "2025-11-16T04:28:27.557790Z"
    },
    {
      "original": "Military Situation In Ukraine On November 15, 2025 (Maps Update)",
      "timestamp": "2025-11-16T04:28:27.557794Z"
    },
    {
      "original": "Iran’s Revolutionary Guards Confirms Seizure Of Oil Tanker In Strait Of Hormuz\nIran’s Islamic Revolutionary Guard Corps (IRGC) confirmed on November 15 that it had seized a tanker in the strategic Strait of Hormuz a day earlier.\nThe Talara tanker, sailing under the flag of the Marshall Islands, was travelling from the United Arab Emirates (UAE) to Singapore.\nIn a brief statement carried by the Iranian state-run television, the IRGC stated that “the tanker was in violation for carrying unauthorized cargo.”\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557802Z"
    },
    {
      "original": "Saudi Arabia Wants F-35s From U.S. And Israel Wants Normalization In Return\nU.S. President Donald Trump revealed on November 14 that he is considering agreeing to a deal to supply Saudi Arabia with F-35 Lightning stealth strike fighters.\n“They wanna buy a lot of jets,” Trump told reporters aboard Air Force One. “I’m looking at that. They’ve asked me to look at it. They want to buy a lot of ‘35’ - but they want to buy actually more than that, fighter jets.”\nTrump plans to host Saudi Crown Prince Mohammed bin Salman at the White House next week. The two are expected to sign major economic and defense agreements.\nThe very next day, November 15, Axios reported that Israel does not object to the sale of F-35s to Saudi Arabia but insists that any transfer of such advanced fighter jets be conditioned on the normalization of relations.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557811Z"
    },
    {
      "original": "Saudi Arabia Wants F-35s From U.S. And Israel Wants Normalization In Return\nU.S. President Donald Trump revealed on November 14 that he is considering agreeing to a deal to supply Saudi Arabia with F-35 Lightning stealth strike fighters.\n“They wanna buy a lot of jets,” Trump told reporters aboard Air Force One. “I’m looking at that. They’ve asked me to look at it. They want to buy a lot of ‘35’ - but they want to buy actually more than that, fighter jets.”\nTrump plans to host Saudi Crown Prince Mohammed bin Salman at the White House next week. The two are expected to sign major economic and defense agreements.\nThe very next day, November 15, Axios reported that Israel does not object to the sale of F-35s to Saudi Arabia but insists that any transfer of such advanced fighter jets be conditioned on the normalization of relations.\nRead more \nHERE",
      "timestamp": "2025-11-16T04:28:27.557820Z"
    }
  ],
  "script_run_time": "2025-11-16T04:28:27.558566Z"
}