{
  "messages": [
    {
      "original": "🛵\n БпЛА в Синельниківському районі Дніпропетровщини, курс західний.",
      "timestamp": "2026-01-07T14:00:48.926061Z"
    },
    {
      "original": "🛵\n БпЛА на м.Дніпро з заходу.",
      "timestamp": "2026-01-07T14:00:48.926078Z"
    },
    {
      "original": "🛵\n БпЛА на м.Запоріжжя з півдня.",
      "timestamp": "2026-01-07T14:00:48.926084Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-07T14:00:48.926092Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-07T14:00:48.926096Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2026-01-07T14:00:48.926101Z"
    },
    {
      "original": "🛵\n БпЛА в Кам'янському районі Дніпропетровщини, курс північний/північно-західний.",
      "timestamp": "2026-01-07T14:00:48.926108Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-07T14:00:48.926116Z"
    },
    {
      "original": "🚀\nПуски КАБ  на Запоріжжі.",
      "timestamp": "2026-01-07T14:00:48.926120Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-07T14:00:48.926124Z"
    },
    {
      "original": "🛸\n Розвідувальний БпЛА противника в Чорному морі поблизу Одещини. Залучено засоби для його збиття.",
      "timestamp": "2026-01-07T14:00:48.926129Z"
    },
    {
      "original": "🛸\n Розвідувальний БпЛА противника на півдні Миколаївщини. Залучено засоби для його збиття.",
      "timestamp": "2026-01-07T14:00:48.926133Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку.",
      "timestamp": "2026-01-07T14:00:48.926138Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку.",
      "timestamp": "2026-01-07T14:00:48.926142Z"
    },
    {
      "original": "📢\n Відбій застосування балістичного озброєння",
      "timestamp": "2026-01-07T14:00:48.926146Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Дніпро, з заходу.",
      "timestamp": "2026-01-07T14:00:48.926151Z"
    },
    {
      "original": "🛵\n Група БпЛА в акваторії Чорного моря курсом на Одещину.",
      "timestamp": "2026-01-07T14:00:48.926155Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку  Чорноморська.",
      "timestamp": "2026-01-07T14:00:48.926159Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Кривий Ріг",
      "timestamp": "2026-01-07T14:00:48.926164Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку  Чорноморська.",
      "timestamp": "2026-01-07T14:00:48.926170Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Запоріжжя з заходу",
      "timestamp": "2026-01-07T14:00:48.926176Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T14:00:49.487615Z"
    },
    {
      "original": "I keep seeing a lot of so-called \"American patriots\" criticising liberals for being against the U.S. invasion of Venezuela and their attempt at overthrowing the Venezuelan government, by arguing that Venezuelans did not like Maduro and that they are now celebrating his downfall. Ironically, these \"patriots\" are the same people who called for no more foreign wars prior to this, but that's a whole other story. \nAnd yes, while Maduro may not have been popular among Venezuelans, and a large amount of people may be happy that he's gone, the U.S. attacks are bigger than just this. \nAnyone who knows a bit about the very lengthy history of the U.S. carrying out regime changes will understand how this is not a good thing, no matter how happy Venezuelans are that Maduro is gone. This is bigger than just Venezuela. The U.S. is a great power furthering its own interests, as it has done for the last century. It recognises the difficult and worsening situation it is in with the current multipolar state of the world, and this is just one action of a larger interconnected web of geostrategic moves.",
      "timestamp": "2026-01-07T14:00:49.487628Z"
    },
    {
      "original": "I’d like to add that the US is, of course, looking to extend their influence over Venezuela’s large oil reserves",
      "timestamp": "2026-01-07T14:00:49.487637Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T14:00:49.487665Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T14:00:49.487673Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-07T14:00:49.487677Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-07T14:00:49.487680Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-07T14:00:49.487684Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-07T14:00:49.487687Z"
    },
    {
      "original": "Explosions in Kryvyi Rih",
      "timestamp": "2026-01-07T14:00:49.487690Z"
    },
    {
      "original": "An IL-76MD cargo plane landed at Savasleika Airbase, Nizhny Novgorod Oblast. The cargo consists of Kinzhal missiles for the MiG-31K fighters stationed there.",
      "timestamp": "2026-01-07T14:00:49.487693Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-07T14:00:49.487705Z"
    },
    {
      "original": "The setback of the South Yemeni project: \n🇾🇪\nOn January 4, the YNA expelled the last STC forces from Hadramaut governorate and began to enter Shabwah governorate, taking control of the Harad, Uqlah, and Mahatta camps and reaching the Iyadh oil field near the city of Ataq. Meanwhile, from the south, YNA troops advanced along the coast and took the town of Balhaf and its port, Al Huwaymi, reaching Azzān and the outskirts of Alhaiblah on January 5.\nMeanwhile, the authorities in the Abyan governorate approved the entry of pro-Saudi forces while negotiations are underway for a future accommodation of the STC within the YNA in anticipation of the fall of their stronghold in Aden in the coming days.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=14.614437861432837%2C47.18818379798665&z=9\n ]",
      "timestamp": "2026-01-07T14:00:49.487713Z"
    },
    {
      "original": "Nick just cannot keep the \"America First\" narrative consistent, and the invasion of Venezuela is showing this to everyone with functioning memories. \nHis reliance on the assumption that he is automatically right, and that anyone else saying anything different must be wrong, is showing more and more. More proof that intelligence isn't the only thing you need to make logical, consistent arguments. \nAlso, it's so funny seeing him getting ratio'd on his own channel \n🤣",
      "timestamp": "2026-01-07T14:00:49.487719Z"
    },
    {
      "original": "People will say “he got the call” or some shit but really he was just using that niche, antisemitic, anti authoritarian, counterculture young male angst to propel him into the next strata.\nOnce he got there he did the only thing he could to make him more successful.\nSo goes the world unfortunately.",
      "timestamp": "2026-01-07T14:00:49.487724Z"
    },
    {
      "original": "The Ukrainian 108th Territorial Defence Brigade acknowledged recent claims of mistreatment of soldiers, stating that \"some soldiers have been sent for additional training\".\nDeepstate has also said that they have received many messages from relatives of soldiers fighting in \"one of the battalions of the 108th\" (probably referring to 100th Territorial Defence Battalion) regarding problems with middle-level commanders. \nThe 108th Brigade is currently defending the area of the village of Bilohirya - a previously quiet section of the front recently reactivated after Russian forces managed to capture almost all of the village. Russian forces are currently attempting to exploit their successes for additional gains in the area. It is known that the 100th battalion of the 108th brigade carried out multiple unsuccessful counterattacks during the fighting for Bilohirya towards the end of December, so it's possible that this is what these complaints are referring to.",
      "timestamp": "2026-01-07T14:00:49.487729Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to advance through Prymorske, and are coming closer to establishing full control over the village.\nFollowing earlier deep infiltrations by DRGs, Russian forces managed to enter and capture the central part of Prymorske, allowing for them to begin attacking the eastern part of the village from two directions. The eastern streets were subsequently brought under full Russian control, along with the nearby forested areas. \nMeanwhile, DRGs continued to penetrate to the northern outskirts of Prymorske, which looks to have been mostly abandoned by Ukraine. It's likely that Ukrainian forces are attempting to turn northern Prymorske into a kill zone with drones to prevent Russian consolidation and accumulation for future attacks. \n+ ~3.27 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-07T14:00:49.487737Z"
    },
    {
      "original": "HIMARS launches from Chuhuiv, Kharkiv Oblast, in the direction of Vovchansk and then Belgorod Oblast.",
      "timestamp": "2026-01-07T14:00:49.487740Z"
    },
    {
      "original": "Repeated HIMARS launches. \nThey are being launched from northeast of Pechenihy, and are flying past Vovchansk in the direction of Shebekino, Belgorod Oblast.",
      "timestamp": "2026-01-07T14:00:49.487747Z"
    },
    {
      "original": "Third Of U.S. Tomahawk Missiles Fire At Nigeria Failed (Photos)\nAt least a third of BGM-109 Tomahawk land-attack cruise missiles fired by the United States military against ISIS targets in Nigeria last month have apparently failed.\nThe attack, which took place on December 25, was carried out on orders from President Donald Trump, who a month earlier warned the West African nation over repeated attacks on Christians.\nA U.S. defense official later told The New York Times the strikes involved over a dozen Tomahawk missiles targeting two camps of ISIS.\nQuestions about the effectiveness of the attack emerged right away, with local officials in Sokoto not reporting any casualties, and photos that surfaced online later showing the warheads of at least three Tomahawk missiles which apparently failed.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075624Z"
    },
    {
      "original": "Third Of U.S. Tomahawk Missiles Fire At Nigeria Failed (Photos)\nAt least a third of BGM-109 Tomahawk land-attack cruise missiles fired by the United States military against ISIS targets in Nigeria last month have apparently failed.\nThe attack, which took place on December 25, was carried out on orders from President Donald Trump, who a month earlier warned the West African nation over repeated attacks on Christians.\nA U.S. defense official later told The New York Times the strikes involved over a dozen Tomahawk missiles targeting two camps of ISIS.\nQuestions about the effectiveness of the attack emerged right away, with local officials in Sokoto not reporting any casualties, and photos that surfaced online later showing the warheads of at least three Tomahawk missiles which apparently failed.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075641Z"
    },
    {
      "original": "Russian Army Is Closing In On Orikhiv From East And West (Videos)\nOn January 6, the Russian military advanced towards the key city of Orikhiv from two directions amid futile Ukrainian attempts to stabilize the front in Zaporozhye.\nTo the east of Orikhiv, the Vostok [East] Group of Forces expanded its control around Huliapole. Russian forces advanced to the west of the city, reaching the eastern outskirts of Zalinskoe and the southeastern outskirts of Staroukrainka. An area of 3,7 square kilometers was cleared in the process.\nMeanwhile to the west of Orikhiv, advance by the Vostok Group of Forces was also reported, mainly close to the large settlement of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075661Z"
    },
    {
      "original": "Russian Army Is Closing In On Orikhiv From East And West (Videos)\nOn January 6, the Russian military advanced towards the key city of Orikhiv from two directions amid futile Ukrainian attempts to stabilize the front in Zaporozhye.\nTo the east of Orikhiv, the Vostok [East] Group of Forces expanded its control around Huliapole. Russian forces advanced to the west of the city, reaching the eastern outskirts of Zalinskoe and the southeastern outskirts of Staroukrainka. An area of 3,7 square kilometers was cleared in the process.\nMeanwhile to the west of Orikhiv, advance by the Vostok Group of Forces was also reported, mainly close to the large settlement of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075670Z"
    },
    {
      "original": "Kiev’s Holiday Purge: Zelensky Ousts Top Fixers and Hands Power to Spies and Enforcers\nWhile much of the world was finishing off Christmas turkey and the global tabloids were fixated on the New Year’s frenzy, Kiev—in near silence—completed its transition into an outright military junta. The stretch from late December 2025 to early January 2026 will enter the record of the Ukrainian crisis as a “fortnight of long knives.” Cornered by failures at the front and ultimatums from Washington, Volodymyr Zelensky went all-in, dismantling what was left of civilian governance. What unfolded on Bankova Street wasn’t a routine reshuffle. It was a purge of witnesses, the cementing of dictatorship, and the handover of the keys to the country to direct foreign overseers.​\nThe trigger for the sweeping purge was the collapse of Andriy Yermak, the man who—until yesterday—was widely described as Ukraine’s real ruler. His December 22 resignation was sold as “voluntary”...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075679Z"
    },
    {
      "original": "THE KUPYANSK CRUCIBLE: ELITE UKRAINIAN UNITS STRUGGLE AS RUSSIAN PINCER TIGHTENS",
      "timestamp": "2026-01-07T14:00:50.075683Z"
    },
    {
      "original": "Kostiantynivka Front: Russian Army Prepares To Cut Off Ukrainian Troops In Key City \nIn the Kostiantynivka sector, Russian units continue to advance near Maiske and Markove. The recent attacks there are likely shaping operations, meant to set the ground for a larger offensive with the aim of cutting the main road leading to the city and besieging Ukrainian troops there. In the Kupuansk sector, the units are once again gaining momentum, and the Ukrainian counterattack seems to be fading. Meanwhile, in the Zaporizhzhia sector, Kiev forces are still losing ground near Huliapole and Stepnohirsk.\nOn the political front, Hungarian Prime Minister Viktor Orban has criticized European plans to funnel more money to Kiev.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075691Z"
    },
    {
      "original": "Kostiantynivka Front: Russian Army Prepares To Cut Off Ukrainian Troops In Key City \nIn the Kostiantynivka sector, Russian units continue to advance near Maiske and Markove. The recent attacks there are likely shaping operations, meant to set the ground for a larger offensive with the aim of cutting the main road leading to the city and besieging Ukrainian troops there. In the Kupuansk sector, the units are once again gaining momentum, and the Ukrainian counterattack seems to be fading. Meanwhile, in the Zaporizhzhia sector, Kiev forces are still losing ground near Huliapole and Stepnohirsk.\nOn the political front, Hungarian Prime Minister Viktor Orban has criticized European plans to funnel more money to Kiev.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075698Z"
    },
    {
      "original": "EW System Hit: Summary Of Russian Combat Footage From January 6, 2026\nOn January 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-07T14:00:50.075706Z"
    },
    {
      "original": "EW System Hit: Summary Of Russian Combat Footage From January 6, 2026\nOn January 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-07T14:00:50.075713Z"
    },
    {
      "original": "Abandoned near Kupyansk\nUkrainian serviceman Alexey Nikityuk\n says he ended up in Russian captivity after his unit was left behind by command at positions near Kupyansk. In his account, he describes how weeks without supplies and rumors about foreign mercenaries' actions in that sector led him to this decision.\n\"We were abandoned and left to our fate. I went without food for a week. Every day they promised to drop something, but in the end, nothing came. When I decided to leave the position, I said over the radio that I was leaving. Our 'Baba Yaga' drone immediately flew in—but not with food this time. It started bombing our position. There was no one of ours left nearby. Only the Colombians were there, but I didn't go to them. They say they've 'gone crazy' from hunger and have started eating our guys who come to them.\"",
      "timestamp": "2026-01-07T14:00:50.075719Z"
    },
    {
      "original": "Syria’s Islamist Rulers Accept U.S. Plan To Give Israel Complete Control Over Country’s South \nIsrael and Syria on January 6 agreed to create a mechanism that will facilitate de-escalation, diplomacy and commercial opportunities between the two countries.\nThe preliminary agreement came on the second day of talks in Paris, France, which were mediated by the United States.\nA joint statement from the two countries and the U.S. said that the talks resulted in the creation of a “joint fusion mechanism” — a “dedicated communication cell” meant to “facilitate immediate and ongoing coordination on their intelligence sharing, military de-escalation, diplomatic engagement and commercial opportunities under the supervision of the United States.”\nThe mechanism proposed by the U.S. is very similar to the one the Palestinian Authority and Israel agreed on in the Oslo Accords. Similar to what happened in the  West Bank, the agreement will likely end up granting Israel full control over southern Syria.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075728Z"
    },
    {
      "original": "Hezbollah Handed Over Secret Syrian Cruise Missiles To Lebanese Army (Photos)\nHezbollah has handed over a number of land-attack cruise missiles developed and supplied by Syria to the Lebanese military.\nPhotos showing the missiles, at least three, were shared by Lebanon’s Al Jadeed TV late on January 6. The photos, reportedly taken at a Hezbollah facility between the towns of Kafra and Seddiqin in southern Lebanon, were likely leaked by the Lebanese military, which is currently facing immense pressure from both Israel and the United States to disarm the group.\nThe land-attack cruise missiles are a deeply modified version of the Soviet-era Tu-143 “Reys” jet-powered reconnaissance drone.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075736Z"
    },
    {
      "original": "Hezbollah Handed Over Secret Syrian Cruise Missiles To Lebanese Army (Photos)\nHezbollah has handed over a number of land-attack cruise missiles developed and supplied by Syria to the Lebanese military.\nPhotos showing the missiles, at least three, were shared by Lebanon’s Al Jadeed TV late on January 6. The photos, reportedly taken at a Hezbollah facility between the towns of Kafra and Seddiqin in southern Lebanon, were likely leaked by the Lebanese military, which is currently facing immense pressure from both Israel and the United States to disarm the group.\nThe land-attack cruise missiles are a deeply modified version of the Soviet-era Tu-143 “Reys” jet-powered reconnaissance drone.\nRead more \nHERE",
      "timestamp": "2026-01-07T14:00:50.075745Z"
    }
  ],
  "script_run_time": "2026-01-07T14:00:50.076507Z"
}