{
  "messages": [
    {
      "original": "🛵\n БпЛА з Брянської обл., рф, \n➡️\n на північ Чернігівщини!",
      "timestamp": "2025-11-06T02:42:44.628166Z"
    },
    {
      "original": "🛸\n Поблизу узбережжя Одещини -  ворожий розвідувальний БпЛА, який може бути навідником  ворожих засобів ураження!\nЗалучено засоби для збиття.",
      "timestamp": "2025-11-06T02:42:44.628185Z"
    },
    {
      "original": "🛵\n БпЛА на південному заході Дніпропетровщини \n➡️\n курсом на Кривий Ріг.\n🛵\n БпЛА на сході Кіровоградщини  \n➡️\n курсом на захід.\n🛵\n БпЛА на сході Харківщини \n➡️\n курсом на Куп'янськ.\n🛵\n БпЛА на південному заході Київщини \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-11-06T02:42:44.628201Z"
    },
    {
      "original": "🛵\n БпЛА на південному заході Київщини \n➡️\n курсом на Білу Церкву.",
      "timestamp": "2025-11-06T02:42:44.628210Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Дніпропетровщини \n➡️\n курсом на Павлоград.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Городню.\n🛵\n БпЛА на межі Київщини та Житомирщини\n➡️\n курсом на північ.",
      "timestamp": "2025-11-06T02:42:44.628223Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з північного  сходу!",
      "timestamp": "2025-11-06T02:42:44.628229Z"
    },
    {
      "original": "Швидкісна на Суми!",
      "timestamp": "2025-11-06T02:42:44.628233Z"
    },
    {
      "original": "Ще одна швидкісна ціль на Суми!",
      "timestamp": "2025-11-06T02:42:44.628236Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Чернігів!",
      "timestamp": "2025-11-06T02:42:44.628242Z"
    },
    {
      "original": "Знову швидкісна ціль на Суми!",
      "timestamp": "2025-11-06T02:42:44.628246Z"
    },
    {
      "original": "Знову швидкісна ціль на Суми!",
      "timestamp": "2025-11-06T02:42:44.628249Z"
    },
    {
      "original": "Швидкісна на Суми!",
      "timestamp": "2025-11-06T02:42:44.628252Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-06T02:42:44.628260Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-06T02:42:44.628264Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-06T02:42:44.628269Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з північного  сходу!",
      "timestamp": "2025-11-06T02:42:44.628274Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-06T02:42:44.628278Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-06T02:42:44.628286Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході Харківщини \n➡️\n курсом на південь.\n🛵\n БпЛА на півдні Сумщини \n➡️\n курсом на Харківщину.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Городню.",
      "timestamp": "2025-11-06T02:42:44.628297Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-06T02:42:44.628301Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф, \n➡️\n на північ Харківщини.\n🛵\n БпЛА на північному заході Харківщини \n➡️\n курсом на південь.\n🛵\n БпЛА на заході Сумщини \n➡️\n курсом на північ.\n🛵\n Кілька БпЛА на півночі Чернігівщини \n➡️\n курсом на Городню, Мену, Короп.",
      "timestamp": "2025-11-06T02:42:44.628315Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-06T02:42:45.181253Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-06T02:42:45.181266Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nThe battle for Pokrovsk is approaching its end as the parts of the city begin to come under Russian control.\nIn the northern part of the city, Russian forces established control over new positions in the northernmost residential neighbourhoods, fully establishing themselves along the southern bank of the Hrishynka River. Additionally, they advanced from the area of School no. 14 and the northwestern industrial zone, to the remaining residential streets not yet under Russian control, capturing new positions towards the northern outskirts.\nIn the northeastern part of Pokrovsk, Russian forces consolidated in the southern part of the high-rise district and operationally encircled the remaining Ukrainian formations in the district. To the southeast, they made additional progress in the low-rise residential areas towards the eastern outskirts of the city, establishing control over most of the rest of the buildings there.\nThe most important news comes from the bottleneck of the Myrnohrad pocket. After entering the high-rise district and compromising it as a blocking position against attempts to physically cut off Myrnohrad, Russian forces advanced beyond northeastern Pokrovsk, past the cemetery, and to the highway, where they entrenched in the windbreaks. From there, they entered and captured the soft drinks factory and infiltrated into the northwestern part of Rivne.\nOn the northern end of the bottleneck, the Russians advanced from their positions near the pig farm and reached the high-rise intersection, establishing full control over it and the surrounding positions. They then went on to advance west down the road, where they have reached the next pig farm complex.\nCurrently, there is a ~1.3 km corridor of open fields and a small, disconnected residential area consisting of two short streets connecting the Myrnohrad pocket with the rest of the front. This area is entirely in the grey zone, and movement in and out of the pocket is now practically impossible. The vast majority of formations still in the pocket will either be killed or captured. \nMeanwhile, north of Pokrovsk, Russian forces began counterattacking against the Ukrainian infiltrations in northern Rodynske. They were able to quickly retake the northern low-rise residential area, and begin assaults on the Ukrainian soldiers entrenched in the three-story buildings. Extremely fierce fighting is ongoing here, with both sides making use of extensive fire power. Some Ukrainian soldiers have been encircled, while others still reside in the grey zone. \n+ ~4.57 in favour of Russia.",
      "timestamp": "2025-11-06T02:42:45.181279Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-06T02:42:45.181285Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-06T02:42:45.181290Z"
    },
    {
      "original": "Can confirm. They entered from the south around 2 days ago.",
      "timestamp": "2025-11-06T02:42:45.181293Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-06T02:42:45.181297Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-06T02:42:45.181301Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-06T02:42:45.181307Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-06T02:42:45.181312Z"
    },
    {
      "original": "Map correction in Pokrovsk:\nSome Ukrainian forces remain entrenched in the high-rise buildings of the Dinas District in northeastern Pokrovsk. They are effectively cut off from the rest of the Myrnohrad pocket.",
      "timestamp": "2025-11-06T02:42:45.181317Z"
    },
    {
      "original": "Scenes from the Dinas District of Pokrovsk. Russian soldiers are currently clearing it. \nIt is widely considered to be the last Ukrainian stronghold in the city.",
      "timestamp": "2025-11-06T02:42:45.181321Z"
    },
    {
      "original": "Ukraine could do the funniest thing...",
      "timestamp": "2025-11-06T02:42:45.181324Z"
    },
    {
      "original": "Anyway, sorry for the lack of posts these last couple of days. I've been very busy with irl stuff, as well as some other interesting things you'll see soon \n👀\nI probably won't return to posting at my usual rates until this weekend, but I'll publish some map updates shortly.",
      "timestamp": "2025-11-06T02:42:45.181331Z"
    },
    {
      "original": "One thing I've found interesting about Pokrovsk and Myrnohrad is how intact the city infrastructure is. You'd think that for such an intense and long battle, both cities would be destroyed at a Bakhmut level, or even Vovchansk or Marinka levels.\nInterestingly, most buildings in both cities remain intact for civilians. Damage is obviously extensive, but if you look at some of the videos from the ground, there are still curtains and roofs on houses, with damage being limited to broken windows and damaged roofs. \nHowever, this is for the low-rise buildings. Obviously, the high-rise blocks have largely been burnt out or partially collapsed. Myrnohrad has more high-rises, so naturally it received more damage than Pokrovsk. \nBut nevertheless, if you compare it to cities that also experienced large, prolonged battles, it is less than usual. It reminds me somewhat of Selydove.",
      "timestamp": "2025-11-06T02:42:45.181337Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T02:42:45.181356Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T02:42:45.181372Z"
    },
    {
      "original": "🇲🇱\n - Current situation in Bamako, the capital of Mali:\nJNIM have begun an active blockade of the city, while their attacks on fuel supplies have become popular, the group have also struck convoys of almost all goods and supplies going heading to the capital. \nSeveral countries have advised their citizens to leave the country immediately, including the United States.\nRerum Novarum's map shows the 8 different routes into Bamako:\n- Four routes are (partially) under JNIM control, RN5, RN7, RN27 and RN3. \n- Three routes are contested, RN24, RR6 and RN6.\n- Mali has a single reliable supply route, the RN26 highway.",
      "timestamp": "2025-11-06T02:42:45.181380Z"
    },
    {
      "original": "One thing I've found interesting about Pokrovsk and Myrnohrad is how intact the city infrastructure is. You'd think that for such an intense and long battle, both cities would be destroyed at a Bakhmut level, or even Vovchansk or Marinka levels.  Interestingly…",
      "timestamp": "2025-11-06T02:42:45.181384Z"
    },
    {
      "original": "Also another thing to consider with this is that there are less Ukrainian soldiers to target nowadays, so that would contribute to less damaged buildings.",
      "timestamp": "2025-11-06T02:42:45.181387Z"
    },
    {
      "original": "The Ukrainian SSO claims that it struck a transport-loading vehicle for Iskander-M ballistic missiles near the village of Ovsyannikovo, Kursk Oblast, likely with UAVs, on October 4.\nI can confirm that transportation and loading of Iskander-M and Iskander-K missiles were taking place in this area of Kursk Oblast at around this date. The claims remain unconfirmed, but they line up with what was happening. \nAdditionally, they reported that they hit and destroyed a 1L122 \"Garmon\" radar station on duty near the village of Nizhniy Reutets, Kursk Oblast.",
      "timestamp": "2025-11-06T02:42:45.181392Z"
    },
    {
      "original": "Military Situation In Ukraine On November 5, 2025 (Maps Update)",
      "timestamp": "2025-11-06T02:42:45.719706Z"
    },
    {
      "original": "Military Situation In Ukraine On November 5, 2025 (Maps Update)",
      "timestamp": "2025-11-06T02:42:45.719719Z"
    },
    {
      "original": "Venezuela Approves Plans For ‘Armed Resistance’ As It Braces For U.S. Attack (Videos)\nVenezuelan President Nicolas Maduro on November 5 approved a proposal by his ruling party to initiate “armed resistance” if the United States attacks the country.\nThe U.S. has been escalating against Venezuela since last August, when it doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges.\n\"[The proposals] have been approved, and the United Socialist Party of Venezuela must immediately begin implementing them by developing operational plans for every street and community, so that our people — calmly, with restraint, yet with determination and courage — remain at the highest state of readiness,\" Maduro said at the congress of the United Socialist Party of Venezuela.\nMaduro added that he had received a document outlining \"a set of ideas to transition from an unarmed struggle to an armed one.\"\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719731Z"
    },
    {
      "original": "Venezuela Approves Plans For ‘Armed Resistance’ As It Braces For U.S. Attack (Videos)\nVenezuelan President Nicolas Maduro on November 5 approved a proposal by his ruling party to initiate “armed resistance” if the United States attacks the country.\nThe U.S. has been escalating against Venezuela since last August, when it doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges.\n\"[The proposals] have been approved, and the United Socialist Party of Venezuela must immediately begin implementing them by developing operational plans for every street and community, so that our people — calmly, with restraint, yet with determination and courage — remain at the highest state of readiness,\" Maduro said at the congress of the United Socialist Party of Venezuela.\nMaduro added that he had received a document outlining \"a set of ideas to transition from an unarmed struggle to an armed one.\"\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719741Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 5, 2025 (Map Update)",
      "timestamp": "2025-11-06T02:42:45.719746Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719755Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719764Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719775Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719784Z"
    },
    {
      "original": "AS POKROVSK FALLS, RUSSIAN OFFENSIVE INTENSIFIES ON NORTHERN FRONTS",
      "timestamp": "2025-11-06T02:42:45.719788Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719795Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-06T02:42:45.719801Z"
    }
  ],
  "script_run_time": "2025-11-06T02:42:45.720709Z"
}