{
  "messages": [
    {
      "original": "🛵\n БпЛА на Чернігівщині:\n- район н.п. Гончарівка на захід,\n- район н.п. Славутич на місто,\n- район н.п. Куликівка на південь.",
      "timestamp": "2025-10-22T14:53:54.846770Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на півночі Харківщини (на захід від н.п. Старий Салтів), курсом на північ.\n🛸\n🛵\n БпЛА на сході Дніпропетровщини, курсом на схід та  на південь.\n🛸\n🛵\n БпЛА на півночі від Павлограду на Дніпропетровщині, курсом північно-східним.",
      "timestamp": "2025-10-22T14:53:54.846791Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-10-22T14:53:54.846796Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-10-22T14:53:54.846804Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-22T14:53:54.846809Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-10-22T14:53:54.846813Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-22T14:53:54.846818Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів із заходу.",
      "timestamp": "2025-10-22T14:53:54.846822Z"
    },
    {
      "original": "🛵\nХарків - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-22T14:53:54.846826Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-22T14:53:54.846834Z"
    },
    {
      "original": "🛵\n БпЛА на заході Чернігівщини, курс південно-західний.",
      "timestamp": "2025-10-22T14:53:54.846838Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T14:53:54.846842Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-22T14:53:54.846846Z"
    },
    {
      "original": "🛵\n БпЛА на  сході Сумщини, курс південно-західний.",
      "timestamp": "2025-10-22T14:53:54.846850Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-22T14:53:54.846854Z"
    },
    {
      "original": "🛵\nХарків - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-22T14:53:54.846858Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T14:53:54.846862Z"
    },
    {
      "original": "🛵\nЧернігів - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-22T14:53:54.846866Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Ізюмський район), курс східний.",
      "timestamp": "2025-10-22T14:53:54.846872Z"
    },
    {
      "original": "🚀\n \n🚀\nХарківська область (Куп'янський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-22T14:53:54.846878Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the city of Makhachkala, Republic of Dagestan, Russia. At least two impacts were recorded, including one at NPZ LLC Dagnotech, and another in a residential area.\nNPZ LLC Dagnotech specialises in the production of \nEuro-4 and Euro-5 compliant gasoline and diesel, refined oil products such as lubricant, and base oils.",
      "timestamp": "2025-10-22T14:53:55.433417Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the city of Makhachkala, Republic of Dagestan, Russia. At least two impacts were recorded, including one at NPZ LLC Dagnotech, and another in a residential area.\nNPZ LLC Dagnotech specialises in the production of \nEuro-4 and Euro-5 compliant gasoline and diesel, refined oil products such as lubricant, and base oils.",
      "timestamp": "2025-10-22T14:53:55.433431Z"
    },
    {
      "original": "Ukrainian SBU drones targeted an airfield in Kherson Oblast used to house Russian light aircraft involved in shooting down long-range UAVs, after Russian TV leaked the positions of the aircraft 5 days ago. 2 aircraft were hit by drones.",
      "timestamp": "2025-10-22T14:53:55.433438Z"
    },
    {
      "original": "Once again, the so-called \"experts\" are posting the usual statistical slop.  \"Russia advanced X amount last year, so it will take them 500 years to take all of Ukraine!\"  I cannot believe people still fall for this shit. Advances in a war of attrition are…",
      "timestamp": "2025-10-22T14:53:55.433441Z"
    },
    {
      "original": "Here is what a Ukrainian Senior Lieutenant has to say about The Economist's \"analysis\" on Russia's potential in Ukraine. \nBut don't worry, at this rate it will take another 100 years for Russia to win. Whatever keeps you safe and happy in your little bubble.",
      "timestamp": "2025-10-22T14:53:55.433445Z"
    },
    {
      "original": "Interesting Russian movements happening right now.\nAt least 1 Tu-95MS and 2 Tu-22M3s strategic bombers are flying south from Olenya Airbase, Murmansk Oblast, towards Saratov Oblast. They should arrive at any potential launch lines in the next 30 minutes.\nIf they intend to carry out a missile strike, it would be at a very odd time. Also, Tu-22M3s and Tu-95s don't usually fly together during combat sorties, but the Tu-22s may split off in the near future. \nI will continue to monitor the situation.",
      "timestamp": "2025-10-22T14:53:55.433451Z"
    },
    {
      "original": "Interesting Russian movements happening right now.  At least 1 Tu-95MS and 2 Tu-22M3s strategic bombers are flying south from Olenya Airbase, Murmansk Oblast, towards Saratov Oblast. They should arrive at any potential launch lines in the next 30 minutes.…",
      "timestamp": "2025-10-22T14:53:55.433455Z"
    },
    {
      "original": "No new updates regarding these aircraft.\nHowever, 5 Tu-95MS bombers from Ukrainka Airbase, Amur Oblast are airborne, either carrying out large-scale training or redeploying to western Russia.",
      "timestamp": "2025-10-22T14:53:55.433459Z"
    },
    {
      "original": "⚡️\n🇸🇾\n🇫🇷\n Violent clashes are taking place around the \"Muhajireen\" camp in the city of Harem, north of Idlib, between members of the HTS regime forces on one side, and foreign fighters of French and Uzbek nationalities on the other.\nLocal sources reported that the foreign fighters inside the camp made \"panic\" calls via loudspeakers, demanding support after being surrounded by HTS regime forces who were attempting to storm the camp.\n@wfwitness",
      "timestamp": "2025-10-22T14:53:55.433468Z"
    },
    {
      "original": "No new updates regarding these aircraft.  However, 5 Tu-95MS bombers from Ukrainka Airbase, Amur Oblast are airborne, either carrying out large-scale training or redeploying to western Russia.",
      "timestamp": "2025-10-22T14:53:55.433471Z"
    },
    {
      "original": "2 IL-78 tankers are accompanying the 5 Tu-95s from Ukrainka Airbase. This likely means they will fly to Engels-2/Olenya in preparation for the next large-scale missile attack.",
      "timestamp": "2025-10-22T14:53:55.433475Z"
    },
    {
      "original": "As of currently, information about the clearing of most Russian presence in Pokrovsk city does NOT correspond to reality. The situation remains extremely difficult, just like logistics, and Russian presence is recorded throughout all of the city.",
      "timestamp": "2025-10-22T14:53:55.433479Z"
    },
    {
      "original": "As of currently, information about the clearing of most Russian presence in Pokrovsk city does NOT correspond to reality. The situation remains extremely difficult, just like logistics, and Russian presence is recorded throughout all of the city.",
      "timestamp": "2025-10-22T14:53:55.433482Z"
    },
    {
      "original": "Who could've guessed.",
      "timestamp": "2025-10-22T14:53:55.433485Z"
    },
    {
      "original": "David, for your own sake, please stop making predictions.",
      "timestamp": "2025-10-22T14:53:55.433488Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇸🇪\nUkrainian President Zelenskyy and Swedish Prime Minister Kristersson signed a letter of intent to export between 100 and 150 Gripen E fighter jets and strengthen Ukraine’s air defense capabilities.\n@wfwitness",
      "timestamp": "2025-10-22T14:53:55.433495Z"
    },
    {
      "original": "⚡\n🇸🇪\n🇺🇦\n✈️\n Gripen news.\nThe Swedish Airforce recieved yesterday its first Gripen E fighter jets a modernized version of the domestic Gripen C/D. \nAnd today, Ukraine and Sweden signed a memorandum for the purchase of 100 to 150 Gripen E. \nThe Gripen is arguably the best fighter available for the Ukrainian Airforce, its supply was first considered in 2023 but the effort was postponed to let room for the F-16. \nToday Ukraine is looking for a long-term solution for its airforce, all aircrafts in the Ukrainian Airforce are near or at their end of life and will need to be replaced eventually.\nUkraine could also get Gripen C/D retired from the Swedish Airforce for training and a smooth transition.\nThe aircraft itself was built with simplicity and low-operating cost. It can operate from improvised airstripes and is designed for easy maintenance (a team of 10 conscripts and a specialist are enough for most of the maintenance tasks).\nThis rusticity is what allows the Ukrainian Airforce to survive years into the war.\nBut the Gripen E has also advanced avionics, EW and can use the Meteor air-to-air missile, an improvement from the AIM-120 of the F-16s.\nThe memorandum is not a contract, don't expect the Gripens to fight this war.\n@wfwitness",
      "timestamp": "2025-10-22T14:53:55.433508Z"
    },
    {
      "original": "2 IL-78 tankers are accompanying the 5 Tu-95s from Ukrainka Airbase. This likely means they will fly to Engels-2/Olenya in preparation for the next large-scale missile attack.",
      "timestamp": "2025-10-22T14:53:55.433511Z"
    },
    {
      "original": "These 5 Tu-95s, alongside 3 IL-78 tankers, are carrying out large-scale, long-range training. This is likely related to Russia's ongoing nuclear exercises.",
      "timestamp": "2025-10-22T14:53:55.433516Z"
    },
    {
      "original": "Footage showing the launch of a Russian nuclear-capable Intercontinental ballistic missile 15P155M \"YARS\" during today's nuclear exercises.",
      "timestamp": "2025-10-22T14:53:55.433518Z"
    },
    {
      "original": "Russia is expected to launch Oreshnik IRBMs from today until the end of October as part of their ongoing nuclear exercises. As a result, country-wide air raid alerts may be issued for Ukraine due to activity at the Kapustin Yar Training Ground in Astrakhan Oblast.\nThe probability of any Oreshnik strikes on Ukraine is practically 0%.",
      "timestamp": "2025-10-22T14:53:55.433523Z"
    },
    {
      "original": "The first Russian soldiers have entered Kostyantynivka proper.",
      "timestamp": "2025-10-22T14:53:55.433526Z"
    },
    {
      "original": "A very stupid and borderline suicidal idea in my opinion. Russia hasn't even properly consolidated east of the city, with the grey zone stretching nearly 9 km east of this infiltration. \nThe entire area is completely covered by Ukrainian drones as there are practically endless hiding spots for drone operators, and Russia has been really struggling to locate and destroy them for literally the last 8 months.\nThere is simply no way to properly consolidate right now, unless some terrible weather conditions and fog arrive, allowing for the Russians to sneak in significant reinforcements and supplies. I predict that this infiltration will be reversed in under two weeks from now, but let's wait and see.",
      "timestamp": "2025-10-22T14:53:55.433532Z"
    },
    {
      "original": "Siversk, Pokrovsk, Kupyansk, Bilohorivka... when will they learn not to storm these \"cauldron cities\" like this? Makes zero sense, and the only time that I can think of when something similar to this has worked was in Toretsk, and even then the whole city had to be wiped out for them to take it, and proper consolidation had taken actually place in the previous, much larger settlements.",
      "timestamp": "2025-10-22T14:53:55.433535Z"
    },
    {
      "original": "Of course, it's nothing compared to Ukraine's storming of places like Tetkino, Toretsk, Klishchiivka, Robotyne, etc, but you would still expect Russia to show more adaptation when it comes to this.",
      "timestamp": "2025-10-22T14:53:55.433538Z"
    },
    {
      "original": "The Capture Of Malaya Tokmachka: Russia’s 58th Army Expands Its Bridgehead In Zaporozhye\nRussian units in Pokrovsk have cut off the M-30 highway near the industrial zone. The 58th Army has established control over a significant portion of Malaya Tokmachka. \nThe EU and Ukraine are developing a 12-point conflict resolution plan.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034099Z"
    },
    {
      "original": "The Capture Of Malaya Tokmachka: Russia’s 58th Army Expands Its Bridgehead In Zaporozhye\nRussian units in Pokrovsk have cut off the M-30 highway near the industrial zone. The 58th Army has established control over a significant portion of Malaya Tokmachka. \nThe EU and Ukraine are developing a 12-point conflict resolution plan.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034118Z"
    },
    {
      "original": "SIGINT System Hit: Summary Of Russian Combat Footage From October 21, 2025\nOn October 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-22T14:53:56.034125Z"
    },
    {
      "original": "SIGINT System Hit: Summary Of Russian Combat Footage From October 21, 2025\nOn October 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-22T14:53:56.034132Z"
    },
    {
      "original": "Germany Pays The Price For Blindly Following Biden Admin In Ukraine Crisis\nGermany is experiencing a serious economic crisis with no prospect of a short-term solution, especially as the economy is expected to grow by only around 0.2% to 1.3% in 2025 after contracting by 0.2% in 2024, following a decline of 0.3% in 2023. This recovery is compensatory and the country would not even be in a crisis if Berlin did not blindly follow the Joe Biden administration into the Ukraine conflict.\nAlthough Germany was experiencing economic difficulties before Russia launched its Special Military Operation in February 2022, the boomerang effect of anti-Russia sanctions has turned the economic situation into a crisis, with Europe’s once economic powerhouse now losing in competition with China.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034140Z"
    },
    {
      "original": "Syrian Government Forces Attack French Jihadists In Idlib (Videos)\nThe forces of Syria’s Islamist-led Interim Government launched overnight an operation against a small jihadist group led by infamous French jihadist Omar Diaby in Idlib, causing tensions all over the northern governorate which is known to be a stronghold for foreign jihadists.\nDiaby, 48, moved to fight for al-Qaeda in Syria in 2013. He was reportedly behind the recruitment of the vast majority of French-speaking jihadists in Syria and Iraq. In 2016, Diaby, more known by his nom-de-guerre “Omar Omsen,” was recognized by the United States as a specially designated global terrorist.\nFirqat al-Ghuraba, which is led by Diaby, is based at a camp located near the town of Harem in the northern Idlib countryside. The group mostly consists of dozens of foreign fighters from Europe with many originating from France and Belgium. It is also believed to have sworn allegiance to al-Qaeda.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034148Z"
    },
    {
      "original": "Syrian Government Forces Attack French Jihadists In Idlib (Videos)\nThe forces of Syria’s Islamist-led Interim Government launched overnight an operation against a small jihadist group led by infamous French jihadist Omar Diaby in Idlib, causing tensions all over the northern governorate which is known to be a stronghold for foreign jihadists.\nDiaby, 48, moved to fight for al-Qaeda in Syria in 2013. He was reportedly behind the recruitment of the vast majority of French-speaking jihadists in Syria and Iraq. In 2016, Diaby, more known by his nom-de-guerre “Omar Omsen,” was recognized by the United States as a specially designated global terrorist.\nFirqat al-Ghuraba, which is led by Diaby, is based at a camp located near the town of Harem in the northern Idlib countryside. The group mostly consists of dozens of foreign fighters from Europe with many originating from France and Belgium. It is also believed to have sworn allegiance to al-Qaeda.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034156Z"
    },
    {
      "original": "Russian Army Advances Near Mala Tokmachka, Captures Pavlovka And Ivanovka (Videos)\nOn October 22, the Russian military advanced near Mala Tokmachka, where it launched a surprise attack a day earlier, and captured two settlements further to the west in the directions of Zaporozhye and Dnepropetrovsk.\nThe Vostok [East] Group of Forces is currently controlling the southern part of Mala Tokmachka and fighting to take over the center of the settlement.\nWhile Kiev forces have been putting fierce resistance within Mala Tokmachka, their defenses nearby are collapsing. Russian troops have advanced to the north of Robotyne, reaching the southern outskirts of Novodanylivka. This could soon allow the troops to attack the center of Mala Tokmachka from the west.\nMoving to the west in Zaporozhye, the Vostok Group of Forces captured Pavlovka along the Yanchur River, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034164Z"
    },
    {
      "original": "Russian Army Advances Near Mala Tokmachka, Captures Pavlovka And Ivanovka (Videos)\nOn October 22, the Russian military advanced near Mala Tokmachka, where it launched a surprise attack a day earlier, and captured two settlements further to the west in the directions of Zaporozhye and Dnepropetrovsk.\nThe Vostok [East] Group of Forces is currently controlling the southern part of Mala Tokmachka and fighting to take over the center of the settlement.\nWhile Kiev forces have been putting fierce resistance within Mala Tokmachka, their defenses nearby are collapsing. Russian troops have advanced to the north of Robotyne, reaching the southern outskirts of Novodanylivka. This could soon allow the troops to attack the center of Mala Tokmachka from the west.\nMoving to the west in Zaporozhye, the Vostok Group of Forces captured Pavlovka along the Yanchur River, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034173Z"
    },
    {
      "original": "Military Situation In Syria On October 22, 2025 (Map Update)",
      "timestamp": "2025-10-22T14:53:56.034176Z"
    },
    {
      "original": "Israel Prepares For Next War With Light Attack Aircraft\nIsrael is arming its air force with light attack aircraft that will allow it to defend its border from large infiltrations, as well as to conduct intense operations over neighboring countries with no real air defense capabilities.\nOn October 15, Israel Aerospace Industries (IAI) and the American defense contractor L3Harris announced that they had signed a memorandum of understanding to jointly develop an Israeli configuration of L3Harris’s Sky Warden aircraft. Sky Warden was designed on the basis of the Air Tractor AT-802, which was originally developed for agriculture and firefighting.\nL3Harris is already producing the Sky Warden under the name OA-1K Skyraider II for the United States Special Operations Command.\nRead more \nHERE",
      "timestamp": "2025-10-22T14:53:56.034184Z"
    }
  ],
  "script_run_time": "2025-10-22T14:53:56.034871Z"
}