{
  "messages": [
    {
      "original": "🛵\n Кіровоградщина- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937926Z"
    },
    {
      "original": "🛵\n Київ, Житомир - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937944Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.\n🛵\n Івано-Франківська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937952Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-10T02:36:43.937957Z"
    },
    {
      "original": "🛵\n БпЛА в Черкаському районі\n➡️\n   курсом на південь.\n🛵\n БпЛА на півдні Кіровоградщини\n➡️\n   курсом на північно-східний напрямок.\n🛵\n БпЛА на заході та півдні Чернігівщини\n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на півночі та в центрі  Київщини \n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на заході Полтавщини\n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на Житомирщині, Рівненщині  \n➡️\n   курсом на південно-західний напрямок.\n🛵\n БпЛА на півночі Іванофранківщини\n➡️\n   курсом на південно-західний  напрямок.",
      "timestamp": "2025-09-10T02:36:43.937979Z"
    },
    {
      "original": "🛵\n Вінниця - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937984Z"
    },
    {
      "original": "🛵\n Стрийський, Дрогобицький райони Львівської області - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937988Z"
    },
    {
      "original": "🛵\n Вінниця - ударні БпЛА над містом. Під час тривоги перебувайте в безпечних місцях.",
      "timestamp": "2025-09-10T02:36:43.937992Z"
    },
    {
      "original": "🛵\n Житомир -в напрямку міста ударні БпЛА.",
      "timestamp": "2025-09-10T02:36:43.937996Z"
    },
    {
      "original": "🛵\n З східного напрямку на Вінницю ударний БпЛА.",
      "timestamp": "2025-09-10T02:36:43.938000Z"
    },
    {
      "original": "🛬\nАктивність ворожої тактичної авіації на південно-східному напрямку та Синельниківському району! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-09-10T02:36:43.938007Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-10T02:36:43.938011Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на схід Харківщини.",
      "timestamp": "2025-09-10T02:36:43.938015Z"
    },
    {
      "original": "🛵\n На Київ рухається ударний БпЛА. Бережіть себе, під час повітряної тривоги перебувайте в укриттях!",
      "timestamp": "2025-09-10T02:36:43.938020Z"
    },
    {
      "original": "🛵\n Біла Церква - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-10T02:36:43.938024Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Сумщині   , курсом на захід, на Охтирку.",
      "timestamp": "2025-09-10T02:36:43.938028Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Сумщині   , курсом на захід, на Охтирку.",
      "timestamp": "2025-09-10T02:36:43.938032Z"
    },
    {
      "original": "На Полтавщину, на Гадяч!",
      "timestamp": "2025-09-10T02:36:43.938036Z"
    },
    {
      "original": "🚀\nЩе швидкісна ціль на Сумщині   , по тому ж маршруту!",
      "timestamp": "2025-09-10T02:36:43.938040Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харківщині, курсом на Балаклію",
      "timestamp": "2025-09-10T02:36:43.938046Z"
    },
    {
      "original": "🚀\nКрилата ракета на Сумщині, курсом на Чупахівку, на південно-західний напрямок!",
      "timestamp": "2025-09-10T02:36:43.938052Z"
    },
    {
      "original": "Geran-2 drones are now entering Moldovan Airspace.   Additional Gerans are flying through Belarus towards Warsaw, Poland.",
      "timestamp": "2025-09-10T02:36:44.615095Z"
    },
    {
      "original": "The numbers of Gerans flying through Belarusian airspace are unknown, but it could be anywhere from 5 to 13. Belarusian Su-30s are airborne in roughly the same area as the drones.",
      "timestamp": "2025-09-10T02:36:44.615106Z"
    },
    {
      "original": "Polish fighter jets are heard over the city of Lublin, eastern Poland.",
      "timestamp": "2025-09-10T02:36:44.615110Z"
    },
    {
      "original": "It seems 8 Tu-95s from Engels-2 Airbase are airborne. Those are all of the bombers at the airbase. Not all of them will launch missiles.",
      "timestamp": "2025-09-10T02:36:44.615113Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers landed at Engels-2 Airbase. No missile launches have been recorded.",
      "timestamp": "2025-09-10T02:36:44.615116Z"
    },
    {
      "original": "No drone flights have been reported in Polish airspace for the past 10 minutes.",
      "timestamp": "2025-09-10T02:36:44.615119Z"
    },
    {
      "original": "A U.S. Airforce F-35 was just refueled by an Airbus A330-243 near Mielec, southeastern Poland.",
      "timestamp": "2025-09-10T02:36:44.615122Z"
    },
    {
      "original": "Reportedly photos from the scene of a downed Russian Geran-2 drone in the city of Zamość, eastern Poland. \nAs of now, Polish airspace appears to be clear of aerial targets.\nEDIT: The image from the initial post is old and edited to make it seem new. I reverse image searched it quite a few times but didn't find any matches, so I posted it.",
      "timestamp": "2025-09-10T02:36:44.615129Z"
    },
    {
      "original": "Polish airspace is now confirmed to be fully clear of drones. The remaining ones were shot down by aviation from several different countries. \nThe remaining Geran-2 drones in western Ukraine are attacking the cities of Lviv and Rivne.",
      "timestamp": "2025-09-10T02:36:44.615136Z"
    },
    {
      "original": "Channel photo updated",
      "timestamp": "2025-09-10T02:36:44.615139Z"
    },
    {
      "original": "2 of the Tu-95s that departed from Engels-2 Airbase earlier are carrying out a training mission in northern Saratov Oblast and are not expected to launch any missiles.",
      "timestamp": "2025-09-10T02:36:44.615144Z"
    },
    {
      "original": "Reportedly photos from the scene of a downed Russian Geran-2 drone in the city of Zamość, eastern Poland.   As of now, Polish airspace appears to be clear of aerial targets.  EDIT: The image from the initial post is old and edited to make it seem new. I reverse…",
      "timestamp": "2025-09-10T02:36:44.615148Z"
    },
    {
      "original": "Another video from Zamosc showing the downed Geran drone.\nEDIT: This video is likely old. I can't say for certain as I can't find any matches, but I wouldn't recommend using it.",
      "timestamp": "2025-09-10T02:36:44.615154Z"
    },
    {
      "original": "Warsaw International Airport has temporarily closed due to “unplanned military activity related to ensuring state security”",
      "timestamp": "2025-09-10T02:36:44.615157Z"
    },
    {
      "original": "2 of the Tu-95s that departed from Engels-2 Airbase earlier are carrying out a training mission in northern Saratov Oblast and are not expected to launch any missiles.",
      "timestamp": "2025-09-10T02:36:44.615160Z"
    },
    {
      "original": "The remaining Tu-95s have landed at Diaghilev and Olenya Airbases. No missiles were launched.",
      "timestamp": "2025-09-10T02:36:44.615163Z"
    },
    {
      "original": "In the Prosyana direction, Russian forces resumed their assault operations and improved their positions in the direction of Andriivka-Klevstove.\nRussian forces advanced from in and around Tolstoi, west to the rest of the orchards and took up new positions in the treelines there. As a result, Ukrainian forces withdrew back into Andriivka-Klevstove, where a large grey zone has formed in front of it that neither side can hold a permanent presence in. \n+ ~9.75 km² in favour of Russia.",
      "timestamp": "2025-09-10T02:36:44.615168Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces resumed their assault operations and have recaptured previously lost positions in two areas.\nIn the north, around five days ago, Russian forces advanced from the area of Novomykolaivka, across the bridge over the tributary of the Solona River, and entered the eastern houses of Muravka. They were able to secure positions in at least a dozen buildings here. Meanwhile, other forces attacked from the treeline running to Muravka from the south and entered its southern street, linking up with formations in the eastern houses of the village. As a result, around 40% of Muravka is under Russian control, with the main Ukrainian presence confined to the northwestern part. \nIn the south, Russian forces began pushing back towards the Donetsk-Dnipropetrovsk regional border. They recaptured trenches in the vicinity of the reservoir southwest of Kotlyrarivka, and advanced up the adjacent treeline to the north. \n+ ~3.09 km² in favour of Russia.",
      "timestamp": "2025-09-10T02:36:44.615174Z"
    },
    {
      "original": "Warsaw International Airport has temporarily closed due to “unplanned military activity related to ensuring state security”",
      "timestamp": "2025-09-10T02:36:44.615179Z"
    },
    {
      "original": "Warsaw airport has been reopened.",
      "timestamp": "2025-09-10T02:36:44.615182Z"
    },
    {
      "original": "In the Kostyantynivka direction, both Russian and Ukrainian forces have advanced, with Russian forces making important progress towards Nelipivka.\nAfter consolidating in the area of the Terykon, Russian forces began attacking north towards Nelipivka, where they have approached the village. They were able to capture positions along the highway, as well as in the nearby forest plantations. \nMeanwhile, after nearly two weeks of positional battles, Ukrainian forces were able to advance past Zelena Street in the centre of Kleban-Byk and pushed Russian forces back to the southern edge of the village, where they recaptured the local school and hospital.\n+ ~2.85 km² in favour of Russia.\n+ ~0.20 km² in favour of Ukraine.",
      "timestamp": "2025-09-10T02:36:44.615188Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast.",
      "timestamp": "2025-09-10T02:36:44.615191Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continue to advance and have made new advances in three areas.\nIn the south, after securing most of the Serebryanksyi Forest, Russian forces advanced across the Zherebets River at a new point, and entered the forests south of Zarichne. They were able to advance west for approximately 2.3 km, capturing numerous new positions. Russian soldiers are now operating int he area of the Zarichne - Yampil Road, but no consolidation has occurred there yet. \nTo the north, Russian forces continued to advance in Zarichne and have managed to break through to the western outskirts. They advanced west down Tsentralna Street and captured positions towards its western edge. Positions were also captured on the streets to the north and south, as well as at the local school and church in the village centre.\nIn the north, Russian forces continued to expand their bridgehead in northern Zarichne, and are approaching the Stavky - Zarichne Road. Here, they were able to deepen their zone of control along Poshtova and Chapayeva Streets, putting the remaining Ukrainian positions in the northern part of the village in a salient.\n+ ~5.71 km² in favour of Russia.",
      "timestamp": "2025-09-10T02:36:44.615197Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast.",
      "timestamp": "2025-09-10T02:36:44.615200Z"
    },
    {
      "original": "Currently 3 Tu-95s are circling in the area of Engels-2 Airbase.",
      "timestamp": "2025-09-10T02:36:44.615203Z"
    },
    {
      "original": "Genuinely speaking, i don’t think much will come out of this. A strong NATO condemnation for sure, but it’ll be interesting to see what Russia’s intent was with this. Perhaps testing the waters",
      "timestamp": "2025-09-10T02:36:44.615207Z"
    }
  ],
  "script_run_time": "2025-09-10T02:36:45.252007Z"
}