{
  "messages": [
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 72 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 26 листопада (з 19:00 25 листопада) противник атакував двома балістичними ракетами Іскандер-М (пуски із Ростовської області - рф), та 90-та ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Приморсько-Ахтарськ, – рф, Гвардійське - ТОТ АР Крим, близько 55 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 72 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання ракет та 10 ударних БпЛА на 10 локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги.",
      "timestamp": "2025-11-26T18:51:35.986935Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T18:51:35.986947Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-26T18:51:35.986956Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Харківщину.",
      "timestamp": "2025-11-26T18:51:35.986960Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-11-26T18:51:35.986966Z"
    },
    {
      "original": "Український пілот про ефективність Mirage2000/Ukrainian Pilot on the Effectiveness of the Mirage2000\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nФранцузьких Mirage 2000 в Повітряних Силах України не багато, тому зустріти цей літак на оперативному аеродромі – справжня удача для нашої знімальної групи, ще й під час виконання пілотом реального бойового завдання.\nЛьотчик Mirage 2000 та авіаційні техніки розповіли про ефективність французького літака на полі бою та необхідність подальшої міжнародної  підтримки України у боротьбі проти агресора.\nhttps://youtu.be/WsFGyKRVbUY?si=dJGZxvKg2_5mp8TY",
      "timestamp": "2025-11-26T18:51:35.986979Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-26T18:51:35.986984Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.\n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T18:51:35.986992Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.  \n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T18:51:35.987000Z"
    },
    {
      "original": "🛵\n Через Сумщину БпЛА \n➡️\n у напрямку Чернігівщини.",
      "timestamp": "2025-11-26T18:51:35.987006Z"
    },
    {
      "original": "🛵\n Чернігівщина:\n- БпЛА повз Батурин \n➡️\n курсом на південь.\n- БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T18:51:35.987014Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-26T18:51:35.987018Z"
    },
    {
      "original": "🛵\n Чернігівщина: - БпЛА повз Батурин \n➡️\n курсом на південь. - БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T18:51:35.987025Z"
    },
    {
      "original": "🛵\n Чернігівщина: нові групи БпЛА з півночі \n➡️\n курсом на Холми, Короп.\n🛵\n Сумщина: БпЛА \n➡️\n у напрямку Ямполя.",
      "timestamp": "2025-11-26T18:51:35.987033Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T18:51:35.987038Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T18:51:35.987043Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T18:51:35.987048Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини.\nБпЛА \n➡️\n курсом на Ізюм.\n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T18:51:35.987059Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T18:51:35.987068Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T18:51:35.987077Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T18:51:35.987086Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T18:51:35.987091Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T18:51:35.987096Z"
    },
    {
      "original": "🛵\n Полтавщина: група БпЛА повз Зіньків \n➡️\n курсом на південь.",
      "timestamp": "2025-11-26T18:51:35.987102Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T18:51:35.987109Z"
    },
    {
      "original": "🛵\n Через Харківщину БпЛА \n➡️\n у напрямку Дніпропетровщини.",
      "timestamp": "2025-11-26T18:51:35.987114Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на Чернігівщину.",
      "timestamp": "2025-11-26T18:51:35.987120Z"
    },
    {
      "original": "Following an increase in attacks from Palestinian armed groups, the IDF has announced a new, large-scale military operation in the northern part of the West Bank.\nIsraeli forces have been deployed to the cities of Tubas and Qabatiya, where they are carrying out operations aimed at arresting Palestinian militants from local armed groups affiliated with the Palestinian Islamic Jihad and Hamas. \nEarlier, clashes took place in the village of Marka, near the city of Jenin, as well as in Balata Refugee Camp in the city of Nablus, during which two militants were killed by Israeli soldiers. \nThe IDF already effectively occupies the cities of Tulkarm and Jenin following their earlier military operation which began in January 2025, which largely forced Palestinian armed groups across the northern West Bank to scatter to the surrounding towns and villages. It is from here where they have been attempting to regroup and continue their sporadic attacks, which likely prompted this new military operation.",
      "timestamp": "2025-11-26T18:51:36.570124Z"
    },
    {
      "original": "Following an increase in attacks from Palestinian armed groups, the IDF has announced a new, large-scale military operation in the northern part of the West Bank.\nIsraeli forces have been deployed to the cities of Tubas and Qabatiya, where they are carrying out operations aimed at arresting Palestinian militants from local armed groups affiliated with the Palestinian Islamic Jihad and Hamas. \nEarlier, clashes took place in the village of Marka, near the city of Jenin, as well as in Balata Refugee Camp in the city of Nablus, during which two militants were killed by Israeli soldiers. \nThe IDF already effectively occupies the cities of Tulkarm and Jenin following their earlier military operation which began in January 2025, which largely forced Palestinian armed groups across the northern West Bank to scatter to the surrounding towns and villages. It is from here where they have been attempting to regroup and continue their sporadic attacks, which likely prompted this new military operation.",
      "timestamp": "2025-11-26T18:51:36.570134Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate. \nThe IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from their homes and converting them into military positions. \nMajor roads have been closed, with Palestinian movement in this area being heavily limited. A curfew has also been imposed on the entirety of the Tubas Governorate as Israeli soldiers begin to carry out raids.",
      "timestamp": "2025-11-26T18:51:36.570140Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian command post and equipment accumulation point near the village of Otradne, Kharkiv Oblast.\nThe strike took place around 34 km from Kupyansk.",
      "timestamp": "2025-11-26T18:51:36.570144Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡\n- \"I urge people not to rush to conclusions that the war in Ukraine will end soon,\" - Dmitri Peskov, Kremlin Spokesman.",
      "timestamp": "2025-11-26T18:51:36.570150Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡\n- \"I urge people not to rush to conclusions that the war in Ukraine will end soon,\" - Dmitri Peskov, Kremlin Spokesman.",
      "timestamp": "2025-11-26T18:51:36.570156Z"
    },
    {
      "original": "I cannot believe that people genuinely think THIS round of peace negotiations will end the war.",
      "timestamp": "2025-11-26T18:51:36.570159Z"
    },
    {
      "original": "I’ve said it every time before and I’ll say it again: this peace plan will amount to nothing. \nNone of the sides in this war (US, Ukraine, Russia) have a plan which they will all agree to, and the U.S. is trying to continue extend the war’s longevity by delaying the inevitable. \nIt is in US foreign interests to keep Russia and Ukraine fighting. Extend Russia, focus on china, combat and topple opposers to their hegemonic ambitions one by one - not all at once.",
      "timestamp": "2025-11-26T18:51:36.570164Z"
    },
    {
      "original": "Stop buying into the hopium and engagement farming posts from people who have no idea what they are talking about and don't understand the goals of Russia and the US. \nMark my words, in 3 months time, everyone will have forgotten about the \"28 point peace plan\".",
      "timestamp": "2025-11-26T18:51:36.570168Z"
    },
    {
      "original": "A coup has taken place in Guinea-Bissau, where unidentified gunmen arrested President Embalo and seized the National Electoral Commission building in the capital of Bissau.\nAn election took place in Guinea-Bissau on Sunday, where Embalo claimed victory with 65% of the vote",
      "timestamp": "2025-11-26T18:51:36.570172Z"
    },
    {
      "original": "4 Russian Tu-22m3 strategic bombers have been equipped with Kh-22 cruise missiles at Engels-2 Airbase, Saratov Oblast, and have since redeployed to Olenya Airbase, Murmansk Oblast. \nAdditionally, 1 Tu-160M strategic bomber redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase. Another IL-76MD cargo plane has also landed at Engels-2 Airbase, carrying Kh-101 cruise missiles.\nActivity on frequencies used by strategic bombers at Ukrainka Airbase suggest that either training or redeployments will be carried out tonight. If redeployments take place to Engels-2, there will be an increased threat of another large-scale, combined Russian missile and drone attack on Ukraine in the coming days.",
      "timestamp": "2025-11-26T18:51:36.570177Z"
    },
    {
      "original": "Smoke is seen rising from a tire service facility in the city of Dobropillya, Donetsk Oblast, following Russian Geran-2 drone strikes today.\nCoordinates: 48.450151, 37.100155 (~11 km from the frontline).",
      "timestamp": "2025-11-26T18:51:36.570181Z"
    },
    {
      "original": "Russian forces have captured the village of Tykhe, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~125.\nTotal land area: ~0.63 km².\nThe fighting for Tykhe lasted approximately 7 days.",
      "timestamp": "2025-11-26T18:51:36.570187Z"
    },
    {
      "original": "Russian MLRS strikes and artillery shelling targeted two electrical substations in Kherson City, resulting in partial power outages in the Dniprovsky District and city centre.",
      "timestamp": "2025-11-26T18:51:36.570190Z"
    },
    {
      "original": "Russian MLRS strikes and artillery shelling targeted two electrical substations in Kherson City, resulting in partial power outages in the Dniprovsky District and city centre.",
      "timestamp": "2025-11-26T18:51:36.570194Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovsk'e directions, Russian forces continue to rapidly advance east of the Haichur River amid a continued local collapse of Ukrainian lines.\nIn the north, Russian forces continued their assault operations along the tactical heights towards the Haichur River. Following the capture of the villages of Nechaivka, Radisne, and Nove Zaporizhzhya, Russian forces began finalising their operation aimed at eliminating the Ukrainian salient to the southeast. They pushed south down several treelines on a wide front east of Nove Zaporizhzhya, while other forces continued to push west from the Solodke - Rybne area, squeezing the Ukrainians out of the salient. They also entered Dobropillya from the north, attacking towards the centre of the village. \nThen, in coordination with attacks from the south and southeast, Russian forces exploited the withdrawal of Ukrainian forces from the salient towards the Haichur River by advancing northwest down a gulley and west down a treeline to the north, breaking through to the eastern outskirts of Dobropillya and therefore completing the elimination of the Ukrainian salient. Progress was also made along several treelines further south in the direction of Varvarivka. \nTo the south, Russian forces advanced further along the southern bank of a tributary of the Haichur river, capturing new positions in the forest plantations there. They also advanced further west along the treelines on the tactical heights, approaching their western edge, and improved their positions further along the northern bank of the Kalmychka River. This advance, along with the elimination of the salient in the north, connects and largely aligns the frontline from Nechaivka to the Kalmychka River.\nTo the southeast, Russian forces continued to exploit the collapse of Ukrainian defences in the villages east of Hulyaipole and the encirclement of Ukrainian formations. Earlier, a hasty and uncoordinated deployment of the Ukrainian 201st battalion of the 102nd Territorial Defence Brigade was carried out with the goal of saving the situation at the relatively strong defences east of Hulyaipole, leading to high casualties and part of it being encircled. Russian forces subsequently advanced further west from these villages through lightly defended Ukrainian lines, quickly reaching the outskirts of Hulyaipole and establishing themselves in the treelines directly east of the city.\nAdditionally, the Russians advanced from Zatyshshya and managed to capture one of the agricultural complexes on the outskirts of Hulyaipole, as well as the adjacent forest plantations. DRGs subsequently intensified their activity within the city limits, while assault groups began infiltrations into the northeastern streets situated north of the Haichur River. \nMeanwhile, south of the Haichur River, taking advantage of the chaotic situation further north, Russian assault groups broke through Ukrainian positions northwest of Marfopil, advancing along the road to the edge of Hulyaipole. They were able to quickly enter the city and capture the outermost streets, however fighting is already ongoing further west towards Huryanskyy Street. Additionally, Russian forces captured the remaining positions east of a tributary of the Haichur River, as well as an agricultural building and adjacent treeline to the west.\n+ ~59.62 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570202Z"
    },
    {
      "original": "In the Pokrovsk'e and Prosyana directions, Russian forces continued to advance south of the Vovcha River, further cementing their presence along its southern bank.\nIn the west, following earlier infiltration attempts, Russian forces entered and captured the eastern part of the village of Tykhe before advancing west and capturing the rest of the settlement. Additionally, they advanced north up a treeline towards western Tykhe, establishing control over it. \nIn the east, following earlier infiltrations, Russian forces consolidated in part of the Dibrovsky Forest Reserve, as well as in the forest plantation to the south.\n+ ~4.36 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570208Z"
    },
    {
      "original": "In the Prosyana and Novopavlivka directions, both Russian and Ukrainian forces have advanced in key areas.\nIn the west, at some point recently, Ukrainian forces launched a series of counterattacks aimed at eliminating the Russian presence west of Ivanivka and re-establishing themselves in the village. They were able to advance from their stronger positions east of Havrylivka, and re-entered the Yasenky Forest, capturing positions in the west and north of it. Russian forces retain control over positions in the forest closer to the Vovcha River. \nAdditionally, Ukrainian forces recaptured the treeline leading to the westernmost part of Ivanivka, and consolidated in positions in the residential area there. Russian forces also captured some additional positions in western Ivanivka which were previously in the grey zone. \nIn the east, following the breakthrough to Novopavlivka, Russian forces began consolidating in the positions to the rear of the town. They established full control over the stretch of highway leading into Novopavlivka, and consolidated in the agricultural complex on the eastern edge of the time. They also advanced up two parallel treelines east of the highway, taking advantage of Ukrainian withdrawals from the salient there. \n+ ~9.62 km² in favour of Ukraine. \n+ ~7.89 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570214Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued their assault operations north of Udachne and have captured the Pokrovsk Coal mine.\nAfter gaining a foothold in the southern buildings of the mine, Russian soldiers pushed fowards through the rest of the mine, establishing full control over it. Ukrainian forces withdrew to the treelines further north, and Russian forces have begun infiltrations into the forest plantations along the Matiushyna Gulley, west of the coal mine's waste dump. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570223Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to make progress in the besieged city of Myrnohrad, capturing additional positions in the northern suburbs.\nIn eastern Myrnohrad, Russian forces made new advances in the Skhidnyi and Damanskyi Microdistricts. They captured at least 11 more high-rise buildings, along with Kindergarten No. 19 and the secondary school. \nIn northeastern Myrnohrad, Russian forces advanced further in the 8th District, where they captured new positions in the low-rise residential areas northwest of the Skhidnyi Microdistrict, reached Hrynka Street in the direction of the city centre, and began fighting for School No. 4 and the surrounding areas. \nIn northern Myrnohrad, Russian forces advanced southwest from the 8th District to the Tsentralna Mine, capturing new positions in the residential areas there and entering the mine. Additionally, they captured the remaining two blocks of three-story buildings in the Novator District and established control over large parts of the low-rise residential areas to the south and southwest.\nIn northwestern Myrnohrad, following earlier infiltration attempts, Russian forces consolidated at the city bus station, and began pushing into the Brianka District. Here, they were able to penetrate southeast, capturing positions in the low-rise residential areas west of Myrna Street, while infiltrations took place further west towards Voronova Street and the city centre.\nFurther west, as a result of the advances into northwestern Myrnohrad, the Russians managed to capture most of the rest of Rivne, consolidating in the central, northern, and southern parts of the village. \n+ ~1.92 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570230Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces intensified their assault operations, making new progress in several different areas.\nIn the northeast, Russian forces continued to build on their success on the tactical heights east of the Kazenyi Torets River and began advancing downhill towards the river. They advanced along multiple treelines to the southeastern edge of Sofiivka and entered the outer houses of the village. Attacks were also carried out along treelines further north, and from the newly captured strongpoints in the forested gulley, with Russian soldiers reaching the road leading northeast from Sofiivka.\nTo the southwest, Russian forces continued to make progress in Shakhove, further expanding their zone of control in the main part of the village. Additionally, they consolidated in the trench fortifications to the north, encircling a small number of Ukrainian soldiers in the settlement. \nTo the west, Russian forces resumed assault operations west of Shakhove. They were able to recapture some positions in the forest plantations north and south of the Shakhove - Nove Shakhove Road.\nIn the southwest, after earlier infiltrations, the Russians recaptured the northern part of the forests west of Nykanorivka and re-entered southern Dorozhnje where they are once again fighting for the freight train station. \n+ ~8.93 km² in favour of Russia.",
      "timestamp": "2025-11-26T18:51:36.570237Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast. \nTaganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-26T18:51:36.570241Z"
    },
    {
      "original": "The Fall Of Vovchansk: Russian Troops Entrench Themselves In Depth Of Ukraine’s Defenses \nThe Russian Ministry of Defense has confirmed its control over Ivanopolye. In the Kharkiv sector, Russian units have begun mop-up operations after taking control of Vovchansk. \nMeanwhile, negotiations between Russian and American delegations regarding the updated U.S. administration's peace plan have begun in Abu Dhabi.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152941Z"
    },
    {
      "original": "The Fall Of Vovchansk: Russian Troops Entrench Themselves In Depth Of Ukraine’s Defenses \nThe Russian Ministry of Defense has confirmed its control over Ivanopolye. In the Kharkiv sector, Russian units have begun mop-up operations after taking control of Vovchansk. \nMeanwhile, negotiations between Russian and American delegations regarding the updated U.S. administration's peace plan have begun in Abu Dhabi.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152953Z"
    },
    {
      "original": "Iran’s Revolutionary Guards Vows Revenge For Hezbollah Military Chief\nIran’s Islamic Revolutionary Guard Corps (IRGC) on November 24 called for “revenge” for the assassination of Hezbollah’s military chief of staff Haytham Ali Tabatabai, increasing the chances of a new war with Israel.\nThe commander was killed a day earlier in an Israeli strike that targeted the southern suburbs of the Lebanese capital, Beirut.\nTabatabai was the most senior member of Hezbollah to be killed by the Israeli Defense Forces (IDF) since a ceasefire in Lebanon brokered by the United States entered into effect nearly a year ago. In the group’s command and control chain, he was considered second only to Secretary-General Naim Qassem.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152962Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152971Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152979Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152987Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.152995Z"
    },
    {
      "original": "Military Situation In Syria On November 26, 2025 (Map Update)",
      "timestamp": "2025-11-26T18:51:37.152999Z"
    },
    {
      "original": "Hungary Opposes Funding For Ukraine's \"Military Mafia\"\nHungarian Prime Minister Viktor Orbán gave a sharp response to European Commission President Ursula von der Leyen's request for additional funds for Ukraine, comparing the request to trying to help an alcoholic by sending them another crate of vodka.\nIn her letter, von der Leyen indicated that Ukraine is facing a serious funding shortfall and asked EU member states to increase their support. Orbán stated: \"Giving money to the Ukrainian mafia is like trying to cure an alcoholic by giving them a crate of vodka\", adding that the \"military mafia is siphoning off European taxpayers' money for God knows what\", and that instead of demanding audits and restricting payments, Brussels is proposing to send even more funds. He emphasized: \"It's like trying to make an alcoholic quit drinking by sending them another crate of vodka\".\n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T18:51:37.153008Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T18:51:37.153012Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T18:51:37.153016Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.153028Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.153036Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.153044Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T18:51:37.153052Z"
    }
  ],
  "script_run_time": "2025-11-26T18:51:37.153484Z"
}