{
  "messages": [
    {
      "original": "🛵\n БпЛА на північному заході та заході Харківщини, курс - південний/західний/південно-східний;\n🛵\n БпЛА на сході та північному сході Полтавщини, курс - південно-західний;",
      "timestamp": "2025-11-06T20:14:32.048315Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину!",
      "timestamp": "2025-11-06T20:14:32.048332Z"
    },
    {
      "original": "🛵\n БпЛА  в напрямку Полтави з північного сходу.",
      "timestamp": "2025-11-06T20:14:32.048339Z"
    },
    {
      "original": "🛵\n Група БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T20:14:32.048344Z"
    },
    {
      "original": "🛵\n Група БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T20:14:32.048349Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Дніпропетровщини в напрямку Павлограду.",
      "timestamp": "2025-11-06T20:14:32.048353Z"
    },
    {
      "original": "🛵\n БпЛА курсом на/повз Полтаву з півночі.",
      "timestamp": "2025-11-06T20:14:32.048358Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині курсом на/повз Тростянець.",
      "timestamp": "2025-11-06T20:14:32.048362Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-11-06T20:14:32.048371Z"
    },
    {
      "original": "🛵\n Група БпЛА на Запоріжжі курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T20:14:32.048376Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-11-06T20:14:32.048383Z"
    },
    {
      "original": "📢\n Відбій загрози",
      "timestamp": "2025-11-06T20:14:32.048389Z"
    },
    {
      "original": "🛵\n  Нова група БпЛА на півночі Харківщини курсом на південь",
      "timestamp": "2025-11-06T20:14:32.048394Z"
    },
    {
      "original": "🛵\n Дніпропетровщина - БпЛА курсом на Павлоград.",
      "timestamp": "2025-11-06T20:14:32.048399Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Харківщини \n➡️\n курсом на захід.\n🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на піденний схід.",
      "timestamp": "2025-11-06T20:14:32.048407Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-06T20:14:32.048415Z"
    },
    {
      "original": "🚀\nКАБ на Сумщину!",
      "timestamp": "2025-11-06T20:14:32.048419Z"
    },
    {
      "original": "🛵\n Група БпЛА на півдні Харківщини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T20:14:32.048425Z"
    },
    {
      "original": "🛵\n Група БпЛА на Донеччині \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T20:14:32.048430Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину!",
      "timestamp": "2025-11-06T20:14:32.048435Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південний захід.\n🛵\n БпЛА на сході Полтавщини \n➡️\n курсом на південь.\n🛵\n Група БпЛА на Харківщині \n➡️\n продовжує рух на південь",
      "timestamp": "2025-11-06T20:14:32.048446Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині \n➡️\n курсом на н.п Шахтарське.",
      "timestamp": "2025-11-06T20:14:32.048452Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T20:14:32.636183Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T20:14:32.636205Z"
    },
    {
      "original": "🇲🇱\n - Current situation in Bamako, the capital of Mali:\nJNIM have begun an active blockade of the city, while their attacks on fuel supplies have become popular, the group have also struck convoys of almost all goods and supplies going heading to the capital. \nSeveral countries have advised their citizens to leave the country immediately, including the United States.\nRerum Novarum's map shows the 8 different routes into Bamako:\n- Four routes are (partially) under JNIM control, RN5, RN7, RN27 and RN3. \n- Three routes are contested, RN24, RR6 and RN6.\n- Mali has a single reliable supply route, the RN26 highway.",
      "timestamp": "2025-11-06T20:14:32.636214Z"
    },
    {
      "original": "One thing I've found interesting about Pokrovsk and Myrnohrad is how intact the city infrastructure is. You'd think that for such an intense and long battle, both cities would be destroyed at a Bakhmut level, or even Vovchansk or Marinka levels.  Interestingly…",
      "timestamp": "2025-11-06T20:14:32.636228Z"
    },
    {
      "original": "Also another thing to consider with this is that there are less Ukrainian soldiers to target nowadays, so that would contribute to less damaged buildings.",
      "timestamp": "2025-11-06T20:14:32.636232Z"
    },
    {
      "original": "The Ukrainian SSO claims that it struck a transport-loading vehicle for Iskander-M ballistic missiles near the village of Ovsyannikovo, Kursk Oblast, likely with UAVs, on October 4.\nI can confirm that transportation and loading of Iskander-M and Iskander-K missiles were taking place in this area of Kursk Oblast at around this date. The claims remain unconfirmed, but they line up with what was happening. \nAdditionally, they reported that they hit and destroyed a 1L122 \"Garmon\" radar station on duty near the village of Nizhniy Reutets, Kursk Oblast.",
      "timestamp": "2025-11-06T20:14:32.636237Z"
    },
    {
      "original": "Yesterday, at least 1 Tu-95MS strategic bomber redeployed from Ukrainka Airbase, Amur Oblast, back to Engels-2 Airbase, Saratov Oblast, after it was equipped with Kh-101 cruise missiles. The true number of Tu-95MS that redeployed is unknown, but we should find out in the next 1-3 days.\nAdditionally, 1 Tu-95MS carried out a training mission from Engels-2 Airbase yesterday afternoon, where it carried out simulated launches of missiles with electronic warfare from the old launch lines, which are no longer used, over Guryanovo Training Ground, Saratov Oblast (the new launch lines are slightly further southwest near the village of Uzmore).\nInterestingly, this Tu-95MS from Engels-2 has not been known to conduct simulated launches of missiles over the past few months, and has only carried out ordinary, scheduled training missions, often for younger pilots. This could signal an imminent return to combat duty, alongside the other strategic bombers currently at Ukrainka Airbase.",
      "timestamp": "2025-11-06T20:14:32.636242Z"
    },
    {
      "original": "Vovchansk looks like it's finally being cleaned up. \nRussia controls nearly two thirds of the city and has advanced past most of the flattened areas which are much harder to hold. Also, Ukraine has lost most of their strongholds in the city and is currently in constant retreat.",
      "timestamp": "2025-11-06T20:14:32.636246Z"
    },
    {
      "original": "Some more about Stepnohirsk.\nRussian forces report that Ukrainian UAV numbers have increased, which severely complicates their advancements in the area.\nAccording to some of their estimates, we're talking of about 120 crews, with some belonging to the National Guard and GUR. They provide recon, strikes on Russian forward groups and logistics control.\nGUR operators specifically have \"RAM-2X\" drones, and other UAV battalions have \"Rubak\" and \"Shark\" recon drones.\nAs reported some time ago, these drones are being used en masse at distances of over 60km, easily reaching Vasylivka, primary Russian supply hub in the area.",
      "timestamp": "2025-11-06T20:14:32.636252Z"
    },
    {
      "original": "Update on the Pokrovsk direction:\nActive fighting continues within Pokrovsk's city limits. The northern part of the city remains a grey zone, with some more consolidation from the southeast. Small Russian and Ukrainian assault groups continue to clear each other out of positions in what has become a very fluid and dynamic area, with no defined line of contact.\nIn northeastern Pokrovsk, Ukrainian units in the high-rise part of the Dinas District have begun attempts at withdrawing to Rivne and appear to have been somewhat successful. However, they are withdrawing into a larger, cut-off pocket, so most/all of them won't escape the area. Russian building-by-building clearing operations continue in the Dinas District, where the Ukrainians are still putting up resistance. It's likely that the soldiers there are not fully aware of the situation in the bottleneck of the larger Myrnohrad pocket. Active clearing operations also continue in the shrinking grey zone in the low-rise residential areas of eastern Pokrovsk. \nAs for the bottleneck, Russian DRGs were able to infiltrate into the small, two-street residential area. If assault groups consolidate here, a physical encirclement of Myrnohrad will be made. But that would not make much difference, as any movement in and out of the city is practically impossible right now. Additionally, Russian DRGs infiltrated further to the next pig farm along the road to the rear of Pokrovsk and reached positions beyond it. No consolidation has occurred here yet.",
      "timestamp": "2025-11-06T20:14:32.636258Z"
    },
    {
      "original": "Ukrainian UAVs attacked Volgograd last night. At least three impacts were recorded.\nAt least two drones impacted the Volgograd Oil Refinery (48.48916, 44.62722), where a large fire can be seen burning.\nOne drone impacted a high-rise residential building, however it's unclear if it was affected by Russian electronic warfare.",
      "timestamp": "2025-11-06T20:14:32.636263Z"
    },
    {
      "original": "Ukrainian UAVs attacked Volgograd last night. At least three impacts were recorded.\nAt least two drones impacted the Volgograd Oil Refinery (48.48916, 44.62722), where a large fire can be seen burning.\nOne drone impacted a high-rise residential building, however it's unclear if it was affected by Russian electronic warfare.",
      "timestamp": "2025-11-06T20:14:32.636268Z"
    },
    {
      "original": "Last night, multiple Ukrainian HIMARS GMLRS struck a large Russian ammunition depot near Donetsk City. As a result, a massive explosion occurred due to secondary detonations. A large fire broke out afterwards.",
      "timestamp": "2025-11-06T20:14:32.636271Z"
    },
    {
      "original": "Last night, multiple Ukrainian HIMARS GMLRS struck a large Russian ammunition depot near Donetsk City. As a result, a massive explosion occurred due to secondary detonations. A large fire broke out afterwards.",
      "timestamp": "2025-11-06T20:14:32.636275Z"
    },
    {
      "original": "At least three Ukrainian UAVs struck the Kostroma GRES Thermal Power Plant in the city of Volgorechensk, Kostroma Oblast. A fire is now burning there. \nCoordinates: 57.45806, 41.17486",
      "timestamp": "2025-11-06T20:14:32.636279Z"
    },
    {
      "original": "At least three Ukrainian UAVs struck the Kostroma GRES Thermal Power Plant in the city of Volgorechensk, Kostroma Oblast. A fire is now burning there. \nCoordinates: 57.45806, 41.17486",
      "timestamp": "2025-11-06T20:14:32.636286Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on Dnipropetrovsk Oblast. Three main settlements were hit: Vasylkivka, Petropavlivka, and Kamianske. \nAt least 20 drones impacted the city of Kamianske, targeting the thermal power plant and railway substation. Large fires were seen burning at both of these places. [Media 2 & 3]\nAt least 7 drones targeted the town of Petropavlivka. The target is unknown, and there are no major substations there.  \nAt least 4 drones targeted the town of Vasylkivka. The target there was something in the town, and therefore not the nearby 150 kV substation. [Media 1]",
      "timestamp": "2025-11-06T20:14:32.636292Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on Dnipropetrovsk Oblast. Three main settlements were hit: Vasylkivka, Petropavlivka, and Kamianske. \nAt least 20 drones impacted the city of Kamianske, targeting the thermal power plant and railway substation. Large fires were seen burning at both of these places. [Media 2 & 3]\nAt least 7 drones targeted the town of Petropavlivka. The target is unknown, and there are no major substations there.  \nAt least 4 drones targeted the town of Vasylkivka. The target there was something in the town, and therefore not the nearby 150 kV substation. [Media 1]",
      "timestamp": "2025-11-06T20:14:32.636297Z"
    },
    {
      "original": "Army of Deserters: How Kiev’s Leadership Drove Its Own Military to Despair\nUkraine’s army is coming apart at the seams. Behind the upbeat talk of “heroic defenders” lies a flood of desertions, collapsing command, and deepening despair among officers. Hundreds of thousands of criminal cases for leaving one’s unit, thousands of soldiers fleeing the front, and demoralization even among border guards — these are no longer isolated incidents but a system. Kiev no longer looks for excuses or tries to “save face.” It relies on the only tools it still trusts — fear and repression.\nWhen a government loses respect, it reaches for the criminal code.\nIn Ukraine’s Verkhovna Rada (parliament), lawmakers are once again debating how to tighten punishment for desertion: freezing bank accounts, seizing property, extending prison terms. \n(Video\n: Mobilized lawyer rams border barriers in Zakarpattia and flees to Hungary).\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190734Z"
    },
    {
      "original": "Army of Deserters: How Kiev’s Leadership Drove Its Own Military to Despair\nUkraine’s army is coming apart at the seams. Behind the upbeat talk of “heroic defenders” lies a flood of desertions, collapsing command, and deepening despair among officers. Hundreds of thousands of criminal cases for leaving one’s unit, thousands of soldiers fleeing the front, and demoralization even among border guards — these are no longer isolated incidents but a system. Kiev no longer looks for excuses or tries to “save face.” It relies on the only tools it still trusts — fear and repression.\nWhen a government loses respect, it reaches for the criminal code.\nIn Ukraine’s Verkhovna Rada (parliament), lawmakers are once again debating how to tighten punishment for desertion: freezing bank accounts, seizing property, extending prison terms. \n(Video\n: Mobilized lawyer rams border barriers in Zakarpattia and flees to Hungary).\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190752Z"
    },
    {
      "original": "Russian Officer Vows To Capture Kupyansk In Week As Ukraine Launches More Futile Attacks \nThe Russian military’s Zapad [West] Group of Forces will fully liberate Kupyansk in Kharkiv within a week, one of the commanders leading operations inside the key city announced on November 6.\n“My unit is carrying out the task of clearing and liberating Kupyansk. Over the past day, we have liberated 25 buildings in the city. In its western part, my soldiers advanced along three streets, liberating 16 buildings. Nine houses were liberated on Pervaya Zapadnaya Street, four on Levadny Vyezd Street, and three on Sinkovskaya Street. Our neighbors are also doing well; they have liberated another nine buildings at a feed mill. We continue to advance on the right bank; there are still about 130 buildings left,” the commander of the assault unit of the 121st Regiment of the 68th Motorized Rifle Division, with the call sign “Lavrik,” said in a video released by the Russian Ministry of Defense.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190761Z"
    },
    {
      "original": "Russian Officer Vows To Capture Kupyansk In Week As Ukraine Launches More Futile Attacks \nThe Russian military’s Zapad [West] Group of Forces will fully liberate Kupyansk in Kharkiv within a week, one of the commanders leading operations inside the key city announced on November 6.\n“My unit is carrying out the task of clearing and liberating Kupyansk. Over the past day, we have liberated 25 buildings in the city. In its western part, my soldiers advanced along three streets, liberating 16 buildings. Nine houses were liberated on Pervaya Zapadnaya Street, four on Levadny Vyezd Street, and three on Sinkovskaya Street. Our neighbors are also doing well; they have liberated another nine buildings at a feed mill. We continue to advance on the right bank; there are still about 130 buildings left,” the commander of the assault unit of the 121st Regiment of the 68th Motorized Rifle Division, with the call sign “Lavrik,” said in a video released by the Russian Ministry of Defense.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190770Z"
    },
    {
      "original": "Israel Escalates Strikes On Hezbollah In First Step Towards War\nIsrael stepped up strikes on Lebanon on November 6, right after Hezbollah rejected any “political negotiation” in an official open letter.\nThe escalation began with an Israeli strike that targeted the area between the towns of Toura and Aabbasiyyeh in southern Lebanon, the heartland of Hezbollah. The strike killed one person and wounded three others, according to the Lebanese Health Ministry.\nIn a statement shortly after the deadly strike, the Israeli Defense Forces (IDF) alleged that operatives of Hezbollah’s so-called construction unit were targeted.\nThe operatives were targeted while gathered at a Hezbollah site, the military said, adding that the site was used to “produce equipment used by the organization’s terrorists to restore terror infrastructure” that was destroyed in the fighting last year.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190779Z"
    },
    {
      "original": "Israel Escalates Strikes On Hezbollah In First Step Towards War\nIsrael stepped up strikes on Lebanon on November 6, right after Hezbollah rejected any “political negotiation” in an official open letter.\nThe escalation began with an Israeli strike that targeted the area between the towns of Toura and Aabbasiyyeh in southern Lebanon, the heartland of Hezbollah. The strike killed one person and wounded three others, according to the Lebanese Health Ministry.\nIn a statement shortly after the deadly strike, the Israeli Defense Forces (IDF) alleged that operatives of Hezbollah’s so-called construction unit were targeted.\nThe operatives were targeted while gathered at a Hezbollah site, the military said, adding that the site was used to “produce equipment used by the organization’s terrorists to restore terror infrastructure” that was destroyed in the fighting last year.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190789Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: The State of Ukraine's Energy Grid\nBetween November 4 and 5, Russia and Ukraine continued their exchange of strikes. According to data from the Russian Ministry of Defence, Russian air defence systems destroyed 91 Ukrainian UAVs. For their part, the Ukrainian Air Force reported an attack involving 135 strike UAVs, of which, according to their information, 108 were shot down or suppressed.\nOver the past two months, Russian forces have conducted a series of massive strikes on Ukraine's energy infrastructure. It is reported that despite extensive damage, a full-scale collapse of the power grids has so far been avoided. At some damaged facilities, such as the Tripolska Thermal Power Plant (TPP) and the Zmijivska TPP, repairs were promptly carried out.\nNevertheless, the damage to the energy infrastructure is substantial. In northern regions, nearly all high-voltage substations above 330 kV in the Sumy and Chernihiv regions have been disabled.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190798Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: The State of Ukraine's Energy Grid\nBetween November 4 and 5, Russia and Ukraine continued their exchange of strikes. According to data from the Russian Ministry of Defence, Russian air defence systems destroyed 91 Ukrainian UAVs. For their part, the Ukrainian Air Force reported an attack involving 135 strike UAVs, of which, according to their information, 108 were shot down or suppressed.\nOver the past two months, Russian forces have conducted a series of massive strikes on Ukraine's energy infrastructure. It is reported that despite extensive damage, a full-scale collapse of the power grids has so far been avoided. At some damaged facilities, such as the Tripolska Thermal Power Plant (TPP) and the Zmijivska TPP, repairs were promptly carried out.\nNevertheless, the damage to the energy infrastructure is substantial. In northern regions, nearly all high-voltage substations above 330 kV in the Sumy and Chernihiv regions have been disabled.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T20:14:33.190807Z"
    },
    {
      "original": "ISRAEL SETS STAGE FOR ITS NEXT WAR",
      "timestamp": "2025-11-06T20:14:33.190810Z"
    }
  ],
  "script_run_time": "2025-11-06T20:14:33.191503Z"
}