{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🛸\n Ворожий БпЛА на півдні Кіровоградщини! Залучено засоби для  збиття. Під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-08-29T14:33:25.195546Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА  в районі Кривого Рогу! Даний безпілотник може бути навідником ворожих засобів ураження! Залучено засоби для його збиття.",
      "timestamp": "2025-08-29T14:33:25.195560Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-29T14:33:25.195566Z"
    },
    {
      "original": "⚠\nУвага!\n🛵\n Київ - загроза застосування ворогом ударних БпЛА! Під час тривоги перебувайте в безпечних місцях.",
      "timestamp": "2025-08-29T14:33:25.195575Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-29T14:33:25.195583Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-29T14:33:25.195588Z"
    },
    {
      "original": "⚠\nУвага!\n🛵\n Північні райони Київщини - загроза застосування ворогом ударних БпЛА!",
      "timestamp": "2025-08-29T14:33:25.195594Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину та Донеччину.",
      "timestamp": "2025-08-29T14:33:25.195598Z"
    },
    {
      "original": "⚠\nУвага!\n На Чернігівщині повітряна тривога через роботу ворожого розвідувального БпЛА. Даний безпілотник може бути навідником ворожих засобів ураження! Під час тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-29T14:33:25.195603Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-08-29T14:33:25.195608Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на  Дніпропетровщині та Запоріжжі! Дані безпілотники можуть бути навідниками ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-29T14:33:25.195612Z"
    },
    {
      "original": "⚠\nУвага!\n🛵\nОдеська обл - загроза застосування ворогом ударних БпЛА!",
      "timestamp": "2025-08-29T14:33:25.195618Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-29T14:33:25.195624Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-29T14:33:25.195632Z"
    },
    {
      "original": "☄️\n Загроза балістичного озброєння з північно-східного напрямку",
      "timestamp": "2025-08-29T14:33:25.195636Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння Київська область.",
      "timestamp": "2025-08-29T14:33:25.195641Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-08-29T14:33:25.195645Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-08-29T14:33:25.195649Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на  Чернігівщині! Дані безпілотники можуть бути навідниками ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-29T14:33:25.195653Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-08-29T14:33:25.195658Z"
    },
    {
      "original": "Several Israeli airstrikes targeted the Houthi-controlled Yemeni capital of Sana'a. Strong explosions were heard, and large fires are now burning. The strikes coincided with a speech being delivered by Houthi leader Abdul-Malik al-Houthi.\nThe IDF is yet to comment on the strikes, but they were reportedly carried out by both the Airforce and the navy.",
      "timestamp": "2025-08-29T14:33:25.752298Z"
    },
    {
      "original": "Several Israeli airstrikes targeted the Houthi-controlled Yemeni capital of Sana'a. Strong explosions were heard, and large fires are now burning. The strikes coincided with a speech being delivered by Houthi leader Abdul-Malik al-Houthi.\nThe IDF is yet to comment on the strikes, but they were reportedly carried out by both the Airforce and the navy.",
      "timestamp": "2025-08-29T14:33:25.752308Z"
    },
    {
      "original": "Several Israeli airstrikes targeted the Houthi-controlled Yemeni capital of Sana'a. Strong explosions were heard, and large fires are now burning. The strikes coincided with a speech being delivered by Houthi leader Abdul-Malik al-Houthi.  The IDF is yet to…",
      "timestamp": "2025-08-29T14:33:25.752312Z"
    },
    {
      "original": "There are unconfirmed reports from Israeli sources that the strikes were targeted assassination attempts against Houthi officials.",
      "timestamp": "2025-08-29T14:33:25.752316Z"
    },
    {
      "original": "In the early hours of this morning, a Russian BEK (sea drone) struck the Ukrainian Navy's medium reconnaissance ship “Simferopol” at the mouth of the Danube River near the southern tip of Odesa Oblast.   The Russian MOD claimed that the ship sunk, while the…",
      "timestamp": "2025-08-29T14:33:25.752319Z"
    },
    {
      "original": "Footage showing the Russian BEK (sea drone) strike on the Ukrainian medium reconnaissance ship \"Simferopol\" at the mouth of the Danube River this morning.",
      "timestamp": "2025-08-29T14:33:25.752322Z"
    },
    {
      "original": "Around an hour ago, Ukraine attempted a Neptune missile strike on Krasnodar Krai. \nFour Russian S-300 air defence missiles were launched from the area of Cape Chauda, Crimea, intercepting them. Traffic on the Kerch Straight Bridge was briefly closed due to the danger, but reopened once the missiles were shot down.",
      "timestamp": "2025-08-29T14:33:25.752326Z"
    },
    {
      "original": "Last night another large-scale combined missile attack was carried out on Ukraine. The main target was Kyiv, although Starkostyantyniv Airbase in Khmelnytskyi Oblast, Vasylkiv in Kyiv Oblast, and targets in Ivano Frankivsk and Zhytomyr Oblasts were also hit.…",
      "timestamp": "2025-08-29T14:33:25.752330Z"
    },
    {
      "original": "Russian sources report that one of the targets from last night's missile attack was Kolomya Airbase in Ivano-Frankivsk Oblast. Although officially it isn't used for military purposes, the airbase is believed to host MiG-29 fighters which carry out regular strikes using glide-bombs on Russian positions, as well as helicopters which are used to shoot down Russian Geran-2/Gerbera drones, and small trainer aircraft. \nThe reports did not state what missiles were used, but as I previously reported, 2 of the 4 Kinzhal missiles launched last night were flying in that direction.",
      "timestamp": "2025-08-29T14:33:25.752334Z"
    },
    {
      "original": "New satellite imagery of Morozovsk Airbase, Rostov Oblast from August 27 shows the extent of Russia's construction of concrete hangars here.\nA total of 18 hangars have been completed, which house Su-34 fighters and Su-24MR reconnaissance aircraft. The image shows just one Su-34 out in the open, and construction is still ongoing for additional hangars. \nThese hangars aim to prevent Ukrainian UAVs from damaging or destroying the aircraft stationed here, with similar construction efforts currently ongoing at several other airbases. Currently, aircraft which have dedicated hangars only leave them before takeoff, with all maintenance being carried out inside them. \nThe airbase's warehouse is also visible in the imagery, which stores KAB glide-bombs which are used daily by the Su-34s to strike frontline targets in Ukraine. \nImage credit: \nhttps://t.me/StrategicaviationT/17419",
      "timestamp": "2025-08-29T14:33:25.752345Z"
    },
    {
      "original": "New satellite imagery of Morozovsk Airbase, Rostov Oblast from August 27 shows the extent of Russia's construction of concrete hangars here.\nA total of 18 hangars have been completed, which house Su-34 fighters and Su-24MR reconnaissance aircraft. The image shows just one Su-34 out in the open, and construction is still ongoing for additional hangars. \nThese hangars aim to prevent Ukrainian UAVs from damaging or destroying the aircraft stationed here, with similar construction efforts currently ongoing at several other airbases. Currently, aircraft which have dedicated hangars only leave them before takeoff, with all maintenance being carried out inside them. \nThe airbase's warehouse is also visible in the imagery, which stores KAB glide-bombs which are used daily by the Su-34s to strike frontline targets in Ukraine. \nImage credit: \nhttps://t.me/StrategicaviationT/17419",
      "timestamp": "2025-08-29T14:33:25.752353Z"
    },
    {
      "original": "Footage showing the Russian BEK (sea drone) strike on the Ukrainian medium reconnaissance ship \"Simferopol\" at the mouth of the Danube River this morning.",
      "timestamp": "2025-08-29T14:33:25.752356Z"
    },
    {
      "original": "Clearer footage showing the Russian BEK strike on the Ukrainian medium reconnaissance ship \"Simferopol\".",
      "timestamp": "2025-08-29T14:33:25.752359Z"
    },
    {
      "original": "Satellite imagery from yesterday (August 27) shows ~55 Russian Geran-2 drones positioned on launch pads at Millerovo airbase, Rostov Oblast. These drones took part in last night's combined missile and drone attack on Ukraine, along with hundreds of other Gerans launched from several other points. \nImage credit: \nhttps://t.me/kiber_boroshno/11997",
      "timestamp": "2025-08-29T14:33:25.752363Z"
    },
    {
      "original": "The settlement of Komyshuvakha (Kamyshevakha) is now under significant risk of encirclement as Russian forces north of it push toward Pokrovsk’e. Expect Ukraine to be soon forced out of the salient",
      "timestamp": "2025-08-29T14:33:25.752367Z"
    },
    {
      "original": "To be honest, I can see why Bullying is needed.",
      "timestamp": "2025-08-29T14:33:25.752370Z"
    },
    {
      "original": "To be honest, I can see why Bullying is needed.",
      "timestamp": "2025-08-29T14:33:25.752373Z"
    },
    {
      "original": "What's funny is that I ratio'd the fuck out of the guy promoting this ridiculous theory that was put forth. \nDo you think he was just mad I put him as a C-tier on my Ukraine war mapping tierlist? \n🤣",
      "timestamp": "2025-08-29T14:33:25.752378Z"
    },
    {
      "original": "What's funny is that I ratio'd the fuck out of the guy promoting this ridiculous theory that was put forth. \nDo you think he was just mad I put him as a C-tier on my Ukraine war mapping tierlist? \n🤣",
      "timestamp": "2025-08-29T14:33:25.752395Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Rubizhne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~105.\nTotal land area: ~0.38km².",
      "timestamp": "2025-08-29T14:33:25.752400Z"
    },
    {
      "original": "Russian forces have captured the village of Serednje, Lyman direction, Donetsk Oblast.\nPre-war population: ~156.\nTotal land area: ~1.36 km².",
      "timestamp": "2025-08-29T14:33:25.752405Z"
    },
    {
      "original": "Around an hour ago, Ukraine attempted a Neptune missile strike on Krasnodar Krai.   Four Russian S-300 air defence missiles were launched from the area of Cape Chauda, Crimea, intercepting them. Traffic on the Kerch Straight Bridge was briefly closed due to…",
      "timestamp": "2025-08-29T14:33:25.752408Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian Neptune anti-ship missile launcher near the village of Lyubyts'ke, Zaporizhzhia Oblast. This is the same Neptune system which launched missiles at Crimea. It was destroyed just a few hours later. \nThis is the first ever recorded destruction of a Neptune system. The footage also clearly demonstrates the effects of the Iskander's shrapnel, even though it impacted away from its target.",
      "timestamp": "2025-08-29T14:33:25.752412Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations, retaking previously lost positions in both Kharkiv and Donetsk Oblast.\nAfter Ukrainian forces from Azov attacked into and briefly established control over the village of Novomykhailivka, Russian forces regrouped to the east and northeast, before launching their own attacks. They were able to re-enter the village from the east, capturing positions in the first houses, and also established control over the agricultural buildings on the northern outskirts.\nTo the west, Russian forces resumed their attacks on Hlushchenkove. They were able to cross the Nitrius River and secured a foothold in the southern part of the settlement.\n+ ~2.09km² in favour of Russia.",
      "timestamp": "2025-08-29T14:33:25.752418Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have made important progress towards the village of Derylove.\nRussian forces advanced in two areas. Most of the progress was made in the southeast, where after a series of failed attacks on Shandryholove, the Russians began expanding their eastern flank along the low-lying ground, occupying various new positions in the forest plantations. From there, they were able to break through Ukrainian positions in a southwesterly direction, advancing for around 3.9km to the next set of tactical heights, where they took up new positions in the treelines. They were also able to improve their positions along two parallel treelines on the heights south of Zelena Dolnya.\nTo the northwest, Russian forces continued to slowly advance in the village of Seredjne. They advanced from the centre of the village, reaching its southern outskirts. Additionally, once reinforcements were brought in, they began expanding their zone of control west of the settlement, capturing new treeline positions. \nAdditionally, Russian forces were confirmed to have withdrawn from the northern outskirts of Shandryholove after failing to consolidate. Ukrainian forces, on the other hand, withdrew from their positions north of Serednje, where a grey zone has formed. \n+ ~6.64km² in favour of Russia.",
      "timestamp": "2025-08-29T14:33:25.752426Z"
    }
  ],
  "script_run_time": "2025-08-29T14:33:26.131590Z"
}