{
  "messages": [
    {
      "original": "🛵\n БпЛА в Ніжинському  районі Чернігівщини, курс південний.",
      "timestamp": "2025-12-08T23:53:45.311481Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині, напрямок Миргород, Ромодан",
      "timestamp": "2025-12-08T23:53:45.311498Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Харків з півночі.",
      "timestamp": "2025-12-08T23:53:45.311503Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Полтава з півночі і сходу.",
      "timestamp": "2025-12-08T23:53:45.311511Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Черкащини (Золотоніський район)",
      "timestamp": "2025-12-08T23:53:45.311517Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Харків з півночі.",
      "timestamp": "2025-12-08T23:53:45.311522Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Дніпро/Павлоград з півночі.",
      "timestamp": "2025-12-08T23:53:45.311527Z"
    },
    {
      "original": "🛵\n БпЛА в Конотопському районі Сумщини, вектор м.Конотоп.",
      "timestamp": "2025-12-08T23:53:45.311531Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-12-08T23:53:45.311539Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-08T23:53:45.311543Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-12-08T23:53:45.311548Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини на Полтавщину (Миргородський р-н)",
      "timestamp": "2025-12-08T23:53:45.311552Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півдня.",
      "timestamp": "2025-12-08T23:53:45.311556Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпро з північно-східного напрямку.",
      "timestamp": "2025-12-08T23:53:45.311560Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-12-08T23:53:45.311566Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-08T23:53:45.311572Z"
    },
    {
      "original": "🛵\n БпЛА в Чернігівському  районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-12-08T23:53:45.311577Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, повз Ніжин південно-західним курсом.",
      "timestamp": "2025-12-08T23:53:45.311581Z"
    },
    {
      "original": "🛸\n На Запоріжжі розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття",
      "timestamp": "2025-12-08T23:53:45.311586Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині,напрямок Харків зі сходу.",
      "timestamp": "2025-12-08T23:53:45.311590Z"
    },
    {
      "original": "Pro-Russians must be the only group to complain about a 99% success rate for their missiles getting through.   I’ll never forget the cope about   every single Iskander interception video supposedly being AI.",
      "timestamp": "2025-12-08T23:53:46.133907Z"
    },
    {
      "original": "Well, an edited version of one the videos has been posted so I can share it here. \nThis video shows Kinzhal debris falling just short of the oil refinery.\nObviously the Ukrainian airforce claim is false. One Kinzhal was shot down, not two.",
      "timestamp": "2025-12-08T23:53:46.133922Z"
    },
    {
      "original": "Well, an edited version of one the videos has been posted so I can share it here.   This video shows Kinzhal debris falling just short of the oil refinery.  Obviously the Ukrainian airforce claim is false. One Kinzhal was shot down, not two.",
      "timestamp": "2025-12-08T23:53:46.133930Z"
    },
    {
      "original": "This video recorded at exactly 1:30 am shows one Geran hitting (on the left), one Kinzhal hitting (centre) and two Iskanders with cluster warheads hitting (on the right).\nI wonder where the second Kinzhal went? \n😁",
      "timestamp": "2025-12-08T23:53:46.133936Z"
    },
    {
      "original": "Footage showing the moment of two Russian Grom-E1 rocket-powered glide-bombs striking the Pechenihy Dam. Earlier, what was reportedly a Banderol jet-drone impacted it.\nThe road over this dam is one of the primary supply routes for the entire section of the frontline between Vovchansk and Kupyansk. \nCoordinates: 49.88231, 36.98045",
      "timestamp": "2025-12-08T23:53:46.133942Z"
    },
    {
      "original": "Footage showing the moment of two Russian Grom-E1 rocket-powered glide-bombs striking the Pechenihy Dam. Earlier, what was reportedly a Banderol jet-drone impacted it.\nThe road over this dam is one of the primary supply routes for the entire section of the frontline between Vovchansk and Kupyansk. \nCoordinates: 49.88231, 36.98045",
      "timestamp": "2025-12-08T23:53:46.133947Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt. \nECOWAS has since announced that they are deploying their \"Standby Force\" to assist the Benin Government.",
      "timestamp": "2025-12-08T23:53:46.133952Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt. \nECOWAS has since announced that they are deploying their \"Standby Force\" to assist the Benin Government.",
      "timestamp": "2025-12-08T23:53:46.133956Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt.   ECOWAS has since announced that they are deploying their \"Standby Force\" to assist…",
      "timestamp": "2025-12-08T23:53:46.133959Z"
    },
    {
      "original": "Local sources reported that a ground assault was carried out on the Togbin Barracks a few hours ago, which was held by approximately 30 armed men, including one of the coup leaders. The complex has since been deserted, and a large number of weapons have reportedly been seized.",
      "timestamp": "2025-12-08T23:53:46.133962Z"
    },
    {
      "original": "Violent clashes have broken out along the Thai-Cambodia border, with both sides engaged in mutual artillery shelling and small-arms battles.\nThe Thai Royal Air Force has carried out at least 8 airstrikes against Cambodian positions, while Cambodian artillery shelling has killed at least one Thai soldiers.",
      "timestamp": "2025-12-08T23:53:46.133966Z"
    },
    {
      "original": "Two Russian Geran-2 drone strikes on the Chernihiv Power Plant in Chernihiv City.",
      "timestamp": "2025-12-08T23:53:46.133970Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Tykhe, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~125.\nTotal land area: ~0.63 km².",
      "timestamp": "2025-12-08T23:53:46.133975Z"
    },
    {
      "original": "Russian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.47 km².",
      "timestamp": "2025-12-08T23:53:46.133979Z"
    },
    {
      "original": "Russian forces have captured the village of Rivne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~667.\nTotal land area: ~0.70 km².\nThe fighting for Rivne lasted approximately 1 months, 4 days.",
      "timestamp": "2025-12-08T23:53:46.133984Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Thailand’s Burapha Task Force announces they have launched operations to “reclaim sovereign territory” on the Sa Kaeo border. \nThey claim Cambodian forces were in maximum combat readiness along the border, moving personnel and heavy weapons into fortified positions and closely monitoring Thailand.\n@wfwitness",
      "timestamp": "2025-12-08T23:53:46.133994Z"
    },
    {
      "original": "To add to this: I believe russia could improve by making a more concerted effort to consolidate in towns before pushing past them. Almost like what they failed to do in the early stages of the SMO on a much smaller scale. Perhaps a dedicated brigade/task force could follow behind the main assault group and mop up properly",
      "timestamp": "2025-12-08T23:53:46.133998Z"
    },
    {
      "original": "To add to this: I believe russia could improve by making a more concerted effort to consolidate in towns before pushing past them. Almost like what they failed to do in the early stages of the SMO on a much smaller scale. Perhaps a dedicated brigade/task force…",
      "timestamp": "2025-12-08T23:53:46.134001Z"
    },
    {
      "original": "It only ever seems to be certain directions where this happens too.",
      "timestamp": "2025-12-08T23:53:46.134005Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Smoke can be seen near the Sa Kaeo border following Thailand’s announcement of launching operations in the area. \n@wfwitness",
      "timestamp": "2025-12-08T23:53:46.134011Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces intensified their assault operations, making substantial progress over the last few days.\nIn the southeast, Russian forces broke through Ukrainian defences east of Kamyanske, advancing northeast up both banks of the river. Other forces cleared the western houses of Stepove, and levelled the frontline northwest of the village. \nFrom there, a general push north was carried out, with Russian forces advancing downhill to the gulleys, and consolidating further northwest in coordination with the push up the northern bank of the river. Russian soldiers then infiltrated from their newly captured positions, advancing uphill towards the gulley west of Pavlivka, while others pushed northwest across another gulley into the former Mining and Processing Plant. Additionally, some Russian soldiers infiltrated from eastern Stepnohirsk towards the Solar field in coordination with the push to the Mining and Processing Plant, threatening to encircle the remaining Ukrainian strongpoints in the fields to the south. \nTo the northwest, Russian forces continued their assault operations in Stepnohirsk. They were able to capture Molodizhna and Radianska Streets and consolidate in the first high-rise buildings of the town centre. They also consolidated in the residential areas northeast and northwest of the central high-rise buildings and are clearing the remaining areas of Stepnohirsk still in the grey zone. \n+ ~18.75 km² in favour of Russia.",
      "timestamp": "2025-12-08T23:53:46.134018Z"
    },
    {
      "original": "In the Orikhiv direction, some time over the last few weeks Ukrainian forces carried out a series of successful counterattacks in Mala Tokmachka, recapturing most of the village.\nFollowing the earlier Russian advances and the arrival of Ukrainian reinforcements from Orikhiv, Ukrainian forces managed to regain the initiative and begin pushing back through the settlement. After heavy fighting, they were able to clear the forward Russian positions in the western streets, and due to a lack of Russian manpower in the village, reached the centre, entering the prison and local school. Fighting is still ongoing for the central part of the village. \n+ ~10.10 km² in favour of Ukraine.",
      "timestamp": "2025-12-08T23:53:46.134022Z"
    },
    {
      "original": "Lot’s of reports on Russian assault operations and advances coming out of the front southwest of Siversk. \nIf Russia can get exploit these movements to make tactical gains, they could place FPV drone operators far enough forward to begin turning Kramatorsk into a “dead city” (like Dobropillya) and make logistics and accumulation there far more difficult for Ukraine. \nRemember, there are currently no anti-drone nets within Kramatorsk.",
      "timestamp": "2025-12-08T23:53:46.134028Z"
    },
    {
      "original": "Lot’s of reports on Russian assault operations and advances coming out of the front southwest of Siversk.   If Russia can get exploit these movements to make tactical gains, they could place FPV drone operators far enough forward to begin turning Kramatorsk…",
      "timestamp": "2025-12-08T23:53:46.134031Z"
    },
    {
      "original": "Keep in mind, this front has remained largely stagnant since the fall of Bakhmut in May 2023.",
      "timestamp": "2025-12-08T23:53:46.134034Z"
    },
    {
      "original": "Coup Attempt Shakes France’s Grip On Benin\nA coup d’état was foiled in Benin on December 7, with signs of indirect intervention by France. The poor planning of the coup attempt suggests that it may have been a trap for dissatisfied officers. Still, the attempt highlighted the growing instability in the former French colony.\nThe coup attempt began in the early hours of December 7, with troops from the country’s National Guard attacking the residence of President Patrice Talon in the port city of Cotonou. The troops quickly seized the national broadcaster, and the home of Major General Abou Issa, the army chief of staff.\nEight of the troops declared on state television that Talon had been “removed from office as president of the republic”. They also announced the suspension of the constitution and state institutions, and identified themselves as the Military Committee for Refoundation [French: Comité Militaire pour la Refondation] (CMR) headed by Lieutenant Colonel Pascal Tigri.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897259Z"
    },
    {
      "original": "Coup Attempt Shakes France’s Grip On Benin\nA coup d’état was foiled in Benin on December 7, with signs of indirect intervention by France. The poor planning of the coup attempt suggests that it may have been a trap for dissatisfied officers. Still, the attempt highlighted the growing instability in the former French colony.\nThe coup attempt began in the early hours of December 7, with troops from the country’s National Guard attacking the residence of President Patrice Talon in the port city of Cotonou. The troops quickly seized the national broadcaster, and the home of Major General Abou Issa, the army chief of staff.\nEight of the troops declared on state television that Talon had been “removed from office as president of the republic”. They also announced the suspension of the constitution and state institutions, and identified themselves as the Military Committee for Refoundation [French: Comité Militaire pour la Refondation] (CMR) headed by Lieutenant Colonel Pascal Tigri.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897276Z"
    },
    {
      "original": "Military Situation In Yemen On December 8, 2025 (Map Update)",
      "timestamp": "2025-12-08T23:53:46.897281Z"
    },
    {
      "original": "Emboldened By Turkey, Damascus Is Gearing Up For Battle With Kurdish Forces\nThe deadline for the implementation of the integration agreement signed by the Islamist-led Syrian Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) in March is nearing the end of the year. No progress has been made yet, and both sides appear to be inching closer to a heated battle.\nDespite reports of advance in talks on implementing the agreement, which is meant to integrate the SDF into the government’s civilian and military institutions, Al-Monitor revealed late in November that the process, mediated by the United States, has reached a halt.\nAldar Khalil, a senior official in the political wing of the SDF, revealed to the news outlet that there has been no communication from the government since October, accusing them of creating an “illusion of process” ahead of President Ahmed al-Sharaa’s Washington visit earlier that month.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897291Z"
    },
    {
      "original": "Emboldened By Turkey, Damascus Is Gearing Up For Battle With Kurdish Forces\nThe deadline for the implementation of the integration agreement signed by the Islamist-led Syrian Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) in March is nearing the end of the year. No progress has been made yet, and both sides appear to be inching closer to a heated battle.\nDespite reports of advance in talks on implementing the agreement, which is meant to integrate the SDF into the government’s civilian and military institutions, Al-Monitor revealed late in November that the process, mediated by the United States, has reached a halt.\nAldar Khalil, a senior official in the political wing of the SDF, revealed to the news outlet that there has been no communication from the government since October, accusing them of creating an “illusion of process” ahead of President Ahmed al-Sharaa’s Washington visit earlier that month.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897300Z"
    },
    {
      "original": "'Unprovoked Invasion': How The West Won The Narrative War\nIn 2013, Ukraine found itself at a crossroads. The former Soviet Republic was in dire financial straits, and had been offered the opportunity to sign an association agreement with the European Union. This would have fostered political and economic ties between Kiev and Brussels, and been an incremental step towards Ukraine becoming a full-member of the bloc.\nUkraine’s Baltic neighbours Lithuania, Latvia, and Estonia had all become EU members in 2004, and had also joined NATO in the same year. Ukraine becoming an EU member would have resulted in a political, and potentially military, encirclement of Russia along its western border.\nAs well as the security risks posed by the association agreement, the ethnic makeup of Ukraine was also a factor. The east of the country was composed primarily of ethnic Russians. This included the Crimean Peninsula which was originally Russian territory, but ceded to Ukraine during the Soviet-era. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897309Z"
    },
    {
      "original": "'Unprovoked Invasion': How The West Won The Narrative War\nIn 2013, Ukraine found itself at a crossroads. The former Soviet Republic was in dire financial straits, and had been offered the opportunity to sign an association agreement with the European Union. This would have fostered political and economic ties between Kiev and Brussels, and been an incremental step towards Ukraine becoming a full-member of the bloc.\nUkraine’s Baltic neighbours Lithuania, Latvia, and Estonia had all become EU members in 2004, and had also joined NATO in the same year. Ukraine becoming an EU member would have resulted in a political, and potentially military, encirclement of Russia along its western border.\nAs well as the security risks posed by the association agreement, the ethnic makeup of Ukraine was also a factor. The east of the country was composed primarily of ethnic Russians. This included the Crimean Peninsula which was originally Russian territory, but ceded to Ukraine during the Soviet-era. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897318Z"
    },
    {
      "original": "Military Situation In Ukraine On December 8, 2025 (Maps Update)",
      "timestamp": "2025-12-08T23:53:46.897321Z"
    },
    {
      "original": "Military Situation In Ukraine On December 8, 2025 (Maps Update)",
      "timestamp": "2025-12-08T23:53:46.897326Z"
    },
    {
      "original": "The U.S. National Security Strategy: Signaling a Strategic Rift with Europe\nThe White House has officially approved its approach to the Ukrainian conflict. It presents a new vision of the current situation in Europe. The previously monolithic unity of the West is beginning to crack.\nIn November 2025, the U.S. government published a new National Security Strategy. This document significantly impacted the country's foreign policy. It outlines the primary issues in the realm of US national security and the planned solutions.\nThe strategy indicates the direction in which Americans will focus their political, economic, and military efforts in the coming years. The first edition of the strategy was released in 1987 during the Reagan administration. Since then, each administration has published at least one version of the strategy. The country's priorities have changed in line with the strategy.\n👉\n Read more \nHERE\n________________________\nU.S. National Security Strategy (November 2025) [PDF]",
      "timestamp": "2025-12-08T23:53:46.897337Z"
    },
    {
      "original": "THE COLLAPSE OF SEVERSK DEFENSE: UKRAINE'S SHRINKING RESERVES TAKE THEIR TOLL",
      "timestamp": "2025-12-08T23:53:46.897341Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897348Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-08T23:53:46.897355Z"
    }
  ],
  "script_run_time": "2025-12-08T23:53:46.898190Z"
}