{
  "messages": [
    {
      "original": "🚀\nКАБи на захід Донеччини, схід Дніпропетровщини!",
      "timestamp": "2025-10-04T11:50:54.642290Z"
    },
    {
      "original": "🚀\nКАБи на захід Донеччини, схід Дніпропетровщини!",
      "timestamp": "2025-10-04T11:50:54.642306Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на захід.",
      "timestamp": "2025-10-04T11:50:54.642312Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини \n➡️\n курсом на південний захід.",
      "timestamp": "2025-10-04T11:50:54.642318Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛАна півдні Харківщини! \nЗалучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-04T11:50:54.642324Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Суми з півночі!",
      "timestamp": "2025-10-04T11:50:54.642332Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Сумщини! \nЗалучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-04T11:50:54.642339Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T11:50:54.642345Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Херсонщини! \nЗалучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-04T11:50:54.642351Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з півдня \n➡️\n курсом на Запоріжжя.",
      "timestamp": "2025-10-04T11:50:54.642356Z"
    },
    {
      "original": "🚀\nКАБи на північ Запорізької області!",
      "timestamp": "2025-10-04T11:50:54.642360Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T11:50:54.642366Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Київщину.",
      "timestamp": "2025-10-04T11:50:54.642371Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини та Сумщини \n➡️\n курсом на південний схід.",
      "timestamp": "2025-10-04T11:50:54.642377Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному  напрямку зберігається! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-04T11:50:54.642392Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T11:50:54.642399Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-10-04T11:50:54.642405Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Херсонщини, південніше Запоріжжя, на північному сході Харківщини, на сході Дніпропетровщини. на північному заході Донеччини! \nЗалучено засоби для збиття.\nБпЛА можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-04T11:50:54.642410Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Суми з півночі!\n🛵\n \"Шахеди\" у центрі Сумщини \n➡️\n курсом на південь.\n🛵\n Ворожі БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T11:50:54.642420Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-10-04T11:50:54.642425Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-10-04T11:50:54.642431Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщину! Південно-східний напрямок!",
      "timestamp": "2025-10-04T11:50:54.642434Z"
    },
    {
      "original": "Hamas has agreed to immediately enter negotiations to end the war in Gaza, after stating its readiness to release all remaining dead and alive hostages in return for the release of thousands of Palestinian prisoners. \nIDF activity in the Gaza Strip has significantly decreased over the past couple of hours, after the chief of staff convened a special situation assessment where Israel has \"advanced readiness for the implementation of the first phase of the Trump plan\". \nTrump stated on Truth Social that Hamas is ready for a \"lasting peace\" and called on Israel to stop bombing Gaza so that hostages can be safely released.",
      "timestamp": "2025-10-04T11:50:55.325240Z"
    },
    {
      "original": "Last night, a Russian Iskander-M ballistic missile launched from Voronezh Oblast impacted the Kramatorsk Thermal Power Plant in Donetsk Oblast.\nAs a result, partial power outages have occurred in the cities of Druzhkivka, Kramatorsk, and Slovyansk. Reports of full power outages in any of these cities are false as the Slovyansk TPP (which was recently restored) and other substations are still working.",
      "timestamp": "2025-10-04T11:50:55.325249Z"
    },
    {
      "original": "Last night, a Russian Iskander-M ballistic missile launched from Voronezh Oblast impacted the Kramatorsk Thermal Power Plant in Donetsk Oblast.\nAs a result, partial power outages have occurred in the cities of Druzhkivka, Kramatorsk, and Slovyansk. Reports of full power outages in any of these cities are false as the Slovyansk TPP (which was recently restored) and other substations are still working.",
      "timestamp": "2025-10-04T11:50:55.325254Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance and have made additional progress towards the goal of securing the eastern bank of the Yanchur River.\nIn the south, Russian forces were able to break through the remaining Ukrainian positions outside Poltavka, capturing numerous treelines east of the village, and forcing a Ukrainian withdrawal from the positions southeast of the village. They then went on to enter the easternmost houses of Poltavka, capturing positions there. \nIn the north, Russian advances have slowed, but remain steady towards the Yanchur River. They were able to make further progress down the Novoivanivka - Novovasylivske Road, capturing positions in the adjacent treelines on the tactical heights.\n+ ~12.61 km² in favour of Russia.",
      "timestamp": "2025-10-04T11:50:55.325261Z"
    },
    {
      "original": "In the Druzhkivka direction, Russian forces continued their offensive and over the last two weeks have made important progress to the rear of the Ukrainian Shakhove Salient.\nAfter capturing important fortifications around the northern reservoir of the Poltavka River, Russian forces began pushing west, uphill, through the treelines which were previously heavily bombed by FABs equipped with UMPK modules. As they moved further west towards the road, the concentration of FAB bombardment shifted over the Kazenyi Torets River to the Toretske River. After several days of fighting and consolidation, Russian forces were able to secure a small section of the main road leading into Ukraine's Shakhove salient, significantly constricting supplies into the area. Attempts are now underway to expand their zone of control to the adjacent forested areas in the grey-zone and consolidate further.\nFurther south, under heavy air and artillery cover, Russian forces began developing a second axis of attack towards the village of Shakhove. They advanced from their recently re-secured positions northwest of Poltavka, pushing through the treelines on the tactical heights, and forcing a Ukrainian withdrawal towards the eastern approaches to Shakhove. Russia has been heavily bombing the Ukrainian strongpoints in the forested gulley east of Sofiivka, where clearing operations are now ongoing. \n + ~10.40 km² in favour of Russia.",
      "timestamp": "2025-10-04T11:50:55.325266Z"
    },
    {
      "original": "The Russian sweep westwards:\nVuhledar - \n✅\n (October 1, 2024)\nVelyka Novosilka - \n✅\n (January 25, 2025)\nHulyaipole - \n⏳",
      "timestamp": "2025-10-04T11:50:55.325275Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued to advance in the area of Siversk, making important gains in two different areas.\nIn the south, Russian forces continued their assault operations in the area of Vyimka, and have advanced to the outskirts of the village from the southeast. From there they were able to penetrate Ukrainian lines north of the village and captured a section of the heavily fortified railway line, as well as nearby positions to the north. \nIn the north, after capturing Serebryanka and consolidating in the mine, Russian forces began storming the village of Rudnik. They were able to secure the treelines and forested areas to the east, before entering and capturing the main part of the settlement. \n+ ~17.24 km² in favour of Russia.",
      "timestamp": "2025-10-04T11:50:55.325281Z"
    },
    {
      "original": "Possible Iskander launch from Voronezh Oblast",
      "timestamp": "2025-10-04T11:50:55.325284Z"
    },
    {
      "original": "Possible Iskander launch from Voronezh Oblast",
      "timestamp": "2025-10-04T11:50:55.325287Z"
    },
    {
      "original": "Flying to Kharkiv Oblast",
      "timestamp": "2025-10-04T11:50:55.325290Z"
    },
    {
      "original": "Flying to Kharkiv Oblast",
      "timestamp": "2025-10-04T11:50:55.325293Z"
    },
    {
      "original": "Ukrainian monitors are blind right now...",
      "timestamp": "2025-10-04T11:50:55.325296Z"
    },
    {
      "original": "No missiles in Ukrainian airspace. Not sure what was detected, but it wasn't a missile or a rocket.",
      "timestamp": "2025-10-04T11:50:55.325299Z"
    },
    {
      "original": "A missile has appeared, flying through Kharkiv Oblast. Clarifying.",
      "timestamp": "2025-10-04T11:50:55.325302Z"
    },
    {
      "original": "A missile has appeared, flying through Kharkiv Oblast. Clarifying.",
      "timestamp": "2025-10-04T11:50:55.325305Z"
    },
    {
      "original": "The Iskander impacted the Krasnokuts'k area of Kharkiv Oblast.",
      "timestamp": "2025-10-04T11:50:55.325308Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to steadily advance, while Ukrainian forces have intensified their counterattacks.\nRussian forces advanced in three areas. In the north, a series of assault operations were carried out from the central part of Zarichne, clearing out the last pockets of Ukrainian resistance in the southern streets, and the industrial zone which was previously used as a forward Ukrainian supply hub. Immediately after completing the capture of Zarichne, Russian forces went on to advance west of the village down the gulley leading to the large forests further west. They were able to establish control over the eastern part of the gulley and are now attempting to repel Ukrainian counterattacks. \nUkrainian forces are also attempting to infiltrate the agricultural buildings and surrounding residential areas in the northwestern part of Zarichne from their positions in the forests but have so far been unsuccessful. Additionally, an unsuccessful Ukrainian counterattack involving an APC was made towards the industrial zone, with the goal of preventing Russian consolidation in the southwestern part of Zarichne. At the same time, Ukraine has intensified their FPV drone strikes on Torske, as well as general Russian supply lines.\nFurther south, Russian forces continued to slowly push through the Yampil Forest and have advanced by approximately 700 metres. Ukrainian forces are attempting to counterattack against the southern flank of the Russian positions west of the Yampil - Zarichne Road. \nIn the south, despite the layered and complex situation, Russian forces have managed to consolidate further in Yampil, securing their positions in the area of the railway station in the northern part of the village. They are also continuing their assault operations through the central part of the village towards the western streets and are trying to enter northwestern Yampil from the railway crossing area. \nIn turn, Ukrainian forces are counterattacking towards the railway crossing, nullifying Russian progress. Ukrainian forces are also infiltrating along the northern bank of Tserkovne Lake in southern Yampil, towards the southeastern part of the village, which remains in the grey zone. Russian forces have subsequently intensified their FPV drone strikes on Ukrainian supply lines, forward deployment points, and positions further into the rear. \n+ ~4.57 km² in favour of Russia.",
      "timestamp": "2025-10-04T11:50:55.325316Z"
    },
    {
      "original": "In the Lyman and Borova direction, both Russian and Ukrainian forces have advanced, seizing positions in the low-lying areas.\nRussian forces continued their preparatory assault operations on Drobysheve, and were able to capture the Drobysheve Fish Farm, and entered the adjacent forest. \nMeanwhile, following failed Russian consolidation efforts, Ukrainian forces counterattacked in the village of Novoselivka, pushing Russian forces away from the centre of the settlement, and into the northernmost streets. \nFurther north, the Ukrainians counterattacked in Karpivka, crossing the Nitrius River once again, and securing a bridgehead over the river in the northern part of the village, supporting their position in neighbouring Ridkodub. \n+ ~1.49 km² in favour of Ukraine\n+ ~1.14 km² in favour of Russia",
      "timestamp": "2025-10-04T11:50:55.325323Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations in the area of Boriivska Andriivka, and have reached the outskirts of the settlement.\nRussian forces advanced from their positions on the southern bank of the nearby reservoir, entering and capturing two large trench fortifications, as well as the treeline bisecting them. They were also able to improve their positions in the treelines west of Zelenyi Hai.\n+ ~3.82 km² in favour of Russia.",
      "timestamp": "2025-10-04T11:50:55.325327Z"
    },
    {
      "original": "Iskander threat from Bryansk Oblast. High threat of missile launches.",
      "timestamp": "2025-10-04T11:50:55.325333Z"
    },
    {
      "original": "Iskander threat from Bryansk Oblast. High threat of missile launches.",
      "timestamp": "2025-10-04T11:50:55.325336Z"
    },
    {
      "original": "Possible Iskander launches",
      "timestamp": "2025-10-04T11:50:55.325339Z"
    },
    {
      "original": "Another Iskander launch from Bryansk",
      "timestamp": "2025-10-04T11:50:55.325342Z"
    },
    {
      "original": "The first missile has entered Ukrainian airspace, flying southwest towards Chernihiv Oblast.",
      "timestamp": "2025-10-04T11:50:55.325345Z"
    },
    {
      "original": "Russia Devastates Ukrainian Defense-Linked Energy Facilities With Powerful Strikes \nThe Russian military launched one of its most powerful group strikes against defense factories and affiliated energy facilities in Ukraine over the night of October 2 and 3, with Kiev responding with more “deep strikes” that ultimately failed to make an impact.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141714Z"
    },
    {
      "original": "Russia Devastates Ukrainian Defense-Linked Energy Facilities With Powerful Strikes \nThe Russian military launched one of its most powerful group strikes against defense factories and affiliated energy facilities in Ukraine over the night of October 2 and 3, with Kiev responding with more “deep strikes” that ultimately failed to make an impact.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141726Z"
    },
    {
      "original": "Russian Army Approaches Seversk From New Direction, Advances In Kupyansk (Videos)\nThe Russian military continues to develop its offensive towards Seversk in the Donetsk direction as of October 3, all while maintaining momentum in the Kharkiv direction.\nThe Yug [South] Group of Forces has renewed its advance to the southwest of Seversk, entering Fedorivka after a successful attack that was likely launched from Sakko i Vantsetti, Rozdolivka and Pereizne. Preliminary reports indicate the settlement has been fully secured by Russian troops. This is yet to be confirmed by the Russian Ministry of Defense, however.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141734Z"
    },
    {
      "original": "Russian Army Approaches Seversk From New Direction, Advances In Kupyansk (Videos)\nThe Russian military continues to develop its offensive towards Seversk in the Donetsk direction as of October 3, all while maintaining momentum in the Kharkiv direction.\nThe Yug [South] Group of Forces has renewed its advance to the southwest of Seversk, entering Fedorivka after a successful attack that was likely launched from Sakko i Vantsetti, Rozdolivka and Pereizne. Preliminary reports indicate the settlement has been fully secured by Russian troops. This is yet to be confirmed by the Russian Ministry of Defense, however.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141741Z"
    },
    {
      "original": "Russian Troops Repel Attack In Dobropillya, Make Gains In Dnepropetrovsk And Zaporozhye (Videos)\nThe Russian military repelled a Ukrainian counterattack in the Dobropillya salient in the Donetsk direction, and made more gains in the directions of Dnepropetrovsk and Zaporozhye by October 3.\nThe Ukrainian counterattack in the Dobropillya salient targeted Dorozhnye. It was spearheaded by two American-made Bradley infantry fighting vehicles. Both were damaged by landmines, then finished off by the Tsentr [Center] Group of Forces with drones.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141748Z"
    },
    {
      "original": "Russian Troops Repel Attack In Dobropillya, Make Gains In Dnepropetrovsk And Zaporozhye (Videos)\nThe Russian military repelled a Ukrainian counterattack in the Dobropillya salient in the Donetsk direction, and made more gains in the directions of Dnepropetrovsk and Zaporozhye by October 3.\nThe Ukrainian counterattack in the Dobropillya salient targeted Dorozhnye. It was spearheaded by two American-made Bradley infantry fighting vehicles. Both were damaged by landmines, then finished off by the Tsentr [Center] Group of Forces with drones.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141755Z"
    },
    {
      "original": "Venezuela Deploys Air Defenses As U.S. Strikes Fourth Drug Boat (Videos)\nUnited States Defense Secretary Pete Hegseth on October 3 announced a fourth “lethal, kinetic strike” on a boat in the Caribbean Sea, accusing the vessel of carrying drugs.\nIn another sign of nearing escalation, Venezuela said on October 2 that it had detected five U.S. fighter jets flying near its Caribbean coast.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141762Z"
    },
    {
      "original": "Venezuela Deploys Air Defenses As U.S. Strikes Fourth Drug Boat (Videos)\nUnited States Defense Secretary Pete Hegseth on October 3 announced a fourth “lethal, kinetic strike” on a boat in the Caribbean Sea, accusing the vessel of carrying drugs.\nIn another sign of nearing escalation, Venezuela said on October 2 that it had detected five U.S. fighter jets flying near its Caribbean coast.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141769Z"
    },
    {
      "original": "TOMAHAWKS FOR UKRAINE: A TECHNICAL BREAKTHROUGH OR A STRATEGIC RISK?",
      "timestamp": "2025-10-04T11:50:56.141791Z"
    },
    {
      "original": "Fighting For Key Defense Hubs: Russian Forces Increase Pressure Near Kupyansk And Seversk\nUkrainian forces are continuing to attempt a counterattack in Kupyansk. Meanwhile, south of Seversk, Russian assault troops have entered the village of Zvanovka. \nAt the same time, Russian sabotage groups are blocking supply routes near Konstantinovka. \nIn addition, mass protests against supplying weapons to Ukraine have taken place in Germany.\nRead more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141804Z"
    },
    {
      "original": "Drone Rain: Summary Of Russian Combat Footage From October 3, 2025\nSeveral videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online on October 3 and prior days.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-10-04T11:50:56.141812Z"
    },
    {
      "original": "Drone Rain: Summary Of Russian Combat Footage From October 3, 2025\nSeveral videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online on October 3 and prior days.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-10-04T11:50:56.141819Z"
    },
    {
      "original": "Trump Targeting Generals, Courting Domestic Turmoil: “War Against Enemies Within”\nQuantico’s historic event revealed a US President confronting his generals, demanding loyalty, and escalating rhetoric against internal “enemies,” fueling concern over domestic stability and US military cohesion.\nOn September 30, 2025, at Marine Corps Base Quantico in Virginia, an unusual scene unfolded — one that may signal the start of a deep military crisis in the United States. President Donald Trump, flanked by Defense Secretary Pete Hegseth, addressed nearly 800 generals, admirals, and senior enlisted advisors — summoned at short notice from global outposts, at considerable taxpayer expense, just as whispers of a government shutdown loomed. What was billed as an unusual military gathering quickly turned into a clash.\nHegseth, in a 45-minute tirade, lambasted “fat generals” and decried the Pentagon’s “decades of decay” under diversity initiatives, vowing an end to “dudes in dresses,”...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T11:50:56.141828Z"
    }
  ],
  "script_run_time": "2025-10-04T11:50:56.142261Z"
}