{
  "messages": [
    {
      "original": "🛵\n БпЛА в напрямку н.п.Лозова",
      "timestamp": "2026-01-02T17:32:25.057849Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря курсом на Вилкове.",
      "timestamp": "2026-01-02T17:32:25.057869Z"
    },
    {
      "original": "🛵\n БпЛА в Ізюмському районі Харківщини, повз н.п.Барвінкове",
      "timestamp": "2026-01-02T17:32:25.057875Z"
    },
    {
      "original": "🛵\n БпЛА курсом на  м.Запоріжжя з південно-східного напрямку.",
      "timestamp": "2026-01-02T17:32:25.057880Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку м.Запоріжжя з півдня.",
      "timestamp": "2026-01-02T17:32:25.057884Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-02T17:32:25.057893Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-02T17:32:25.057897Z"
    },
    {
      "original": "🛵\n БпЛА на м.Миколаїв з півдня.",
      "timestamp": "2026-01-02T17:32:25.057902Z"
    },
    {
      "original": "🛵\n БпЛА курсом на  м.Запоріжжя з південно-східного напрямку.",
      "timestamp": "2026-01-02T17:32:25.057906Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-02T17:32:25.057914Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2026-01-02T17:32:25.057918Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-02T17:32:25.057923Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-02T17:32:25.057927Z"
    },
    {
      "original": "🛵\n БпЛА курсом на  м.Запоріжжя з південного напрямку.",
      "timestamp": "2026-01-02T17:32:25.057931Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщину.",
      "timestamp": "2026-01-02T17:32:25.057935Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, напрямок н.п.Савинці/Балаклія.",
      "timestamp": "2026-01-02T17:32:25.057939Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-02T17:32:25.057946Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2026-01-02T17:32:25.057951Z"
    },
    {
      "original": "🛵\n БпЛА курсом на м.Харків.",
      "timestamp": "2026-01-02T17:32:25.057958Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Миколаїв з півдня.",
      "timestamp": "2026-01-02T17:32:25.057963Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance following the fall of Hulyaipole and have made new progress in two different areas.\nIn the northeast, Russian forces continued advancing through the fields west of Hulyaipole, and entered the neighbouring town of Zaliznychne. They advanced along the two gulleys leading from the western edge of the city, establishing control over positions in the forest plantations there. \nOther forces advanced along the highway, capturing positions in two clusters of agricultural buildings and some treelines, before breaking into Zaliznychne. They quickly captured the railway station in the town centre, however, the 425th Separate Assault Regiment \"Skala\" launched a counterattack and managed to clear them out. Fighting continues in the eastern part of the town.\nIn the southwest, Russian forces restarted assault operations west of Luhivske. They advanced down the road to Bilohiriya and entrenched in the eastern houses of the village. Other forces crossed the Konka River from Novopokrovka and captured the southern part of Bilohirya, linking up with the first assault groups and continuing the clearing of the settlement.\n+ ~4.95 km² in favour of Russia.\n+ ~0.29 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806902Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance west of Pokrovsk and have recaptured the Pokrovsk Coal Mine.\nBuilding on their success southwest of the mine, Russian forces re-entered the western part of the mine from the nearby gulley. Other assault groups entered from the south, allowing for them to re-establish full control over it. \nUsing the mine as an accumulation point, the Russians began pushing further north, capturing new positions in the forest plantations. Infiltrations were carried out to areas as far as 1.9 km north of the mine.\n+ ~2.92 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806919Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have made additional progress north of the Kleban-Bykske Reservoir.\nRussian forces continued pushing west through the forests along the northern bank of the reservoir and captured new positions there as Ukrainian forces continued to withdraw. Other forces advanced from the north, capturing positions in the treelines and reaching the edge of the forests.\n+ ~4.06 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806925Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance in and around Dibrova.\nAfter capturing the central and western part of Dibrova, Russian forces launched their final attacks on the main part of the village, establishing control over the remaining streets. Ukrainian forces retain control over a small residential area along the northern bank of the Sivserkyi Donets River. \nOther assault groups continued clearing the forests to the northwest and expanded their zone of control south of the earlier spearhead.\n+ ~1.35 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806932Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks and have made new progress on both banks of the Oskil River.\nIn the east, Ukrainian forces continued building on their previous successes and advanced further through the forests northwest of Petropavlivka, recapturing new positions there and establishing control over the small residential area that makes up part of the northwestern outskirts of the village. Additionally, they continued advancing northwest from Kucherivka, capturing new positions in the industrial zone and the adjacent forests. \nIn the west, after extensive clearing operations, the last Russian soldiers surrendered in the \"Comb\" stronghold, which is made up of a number of high-rise buildings, allowing for the Ukrainians to establish full control over it and shift their efforts towards completing the capture of the city centre.\n+ ~2.42 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806938Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to slowly advance and have captured new positions in the direction of Kolodyazne.\nAfter entering the small forest southeast of Dvorichanske, Russian forces captured the rest of it, entrenching along both sides of the gulley there. Other assault groups crossed the road northwest of Kamyanka and established control over another forest.\n+ ~1.09 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806944Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their assault operations and have made new progress in two different areas.\nIn the southwest, Russian forces managed to break through Ukrainian positions in the forests west of Lyman and reached the outskirts of Hrafske, consolidating in large parts of the forests. This allowed for them to finally entrench in around half of Prylipka after weeks of unsuccessful assaults, and capture positions in the forests to the south. Additionally, the Russians improved their positions in the forests southwest of Lyman in the direction of the Hrafske - Symynivka Road. \nMeanwhile, additional Ukrainian reinforcements were redeployed to this sector, who are now carrying out intensified counterattacks on Russian positions in southern Vilcha and southern Lyman. So far, the attacks on Vilcha have been unsuccessful and no confirmed advances have been made in Lyman. \nIn the northeast, Russian forces continued incrementally advancing through Vovchanski-Khutory and captured most of the central part of the village. Fighting is ongoing for additional residential streets there.\n+ ~4.60 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806951Z"
    },
    {
      "original": "In the Krasnopillya direction, over the last 10 days Russian forces continued to advance and have captured additional positions west of the international border.\nIn the south, Russian forces captured the last parts of the large forests and managed to capture the Ukrainian strongpoints along the railway line, which are situated at the highest elevation in all of Sumy Oblast. These positions were used by Ukrainian drone operators and contained repeaters for FPV drones used to attack border regions of Belgorod Oblast, including the town of Krasnaya Yaruga. Capturing this point was likely the primary objective of these Russian incursions (on the tactical level).\nIn the north, Russian forces advanced from the village of Vysoke into the nearby gulley and established control over positions in the forest plantations there. \n+ ~1.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806957Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made new progress in the direction of Mala Korchakivka.\nIn the east, following an increase in their ability to supply Oleksiivka from the ground, Russian forces advanced south from the village down the C-191504 Road, capturing new positions in the treelines on either side of it. Other assault groups advanced from the treelines to the northwest, capturing additional positions further south down the road. From there, the Russians began pushing southeast down a treeline in the direction of forests north of Korchakivka.\nIn the west, under the cover of fog, Russian forces continued their assault operations in Andriivka and managed to dislodge the Ukrainians from their last positions in the southwestern houses of the village, thereby establishing full control over the settlement.\n+ ~4.16 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T17:32:25.806963Z"
    },
    {
      "original": "Last night, Russia carried out a large-scale Geran-2 attack on Zaporizhzhia City.\nApproximately 16 drones were used, of which around 9 impacted targets in the city. Air defence shot down the remaining ~7. It appears that 2 of the drones impacted the Dnipro Hydroelectric Power Plant (47.86918, 35.08121).",
      "timestamp": "2026-01-02T17:32:25.806967Z"
    },
    {
      "original": "Last night, Russia carried out a large-scale Geran-2 attack on Zaporizhzhia City.\nApproximately 16 drones were used, of which around 9 impacted targets in the city. Air defence shot down the remaining ~7. It appears that 2 of the drones impacted the Dnipro Hydroelectric Power Plant (47.86918, 35.08121).",
      "timestamp": "2026-01-02T17:32:25.806971Z"
    },
    {
      "original": "Overnight, Russia attacked the city of Slovyansk, Donetsk Oblast, with Geran-2 drones. \nAt least five impacts were recorded within the city limits. Additionally, at least 3 drones impacted a target near Kramatorsk, closer to the frontline.",
      "timestamp": "2026-01-02T17:32:25.806975Z"
    },
    {
      "original": "Overnight, Russia attacked the city of Slovyansk, Donetsk Oblast, with Geran-2 drones. \nAt least five impacts were recorded within the city limits. Additionally, at least 3 drones impacted a target near Kramatorsk, closer to the frontline.",
      "timestamp": "2026-01-02T17:32:25.806979Z"
    },
    {
      "original": "Unidentified missile to Kharkiv",
      "timestamp": "2026-01-02T17:32:25.806981Z"
    },
    {
      "original": "Explosion in Kharkiv",
      "timestamp": "2026-01-02T17:32:25.806984Z"
    },
    {
      "original": "Another missile. Possibly Tornado-S",
      "timestamp": "2026-01-02T17:32:25.806987Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-02T17:32:25.806990Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles and possibly Storm Shadows were just launched at Belgorod City. \nAt least one missile has been intercepted.\nA Russian S-400 air defence missile was fired at the Ukrainian jets as they flew over Chuhuiv, Kharkiv Oblast.",
      "timestamp": "2026-01-02T17:32:25.806994Z"
    },
    {
      "original": "Footage showing the moment of an interception over Belgorod.",
      "timestamp": "2026-01-02T17:32:25.806997Z"
    },
    {
      "original": "It seems that one Storm Shadow cruise missile was intercepted, at an altitude of about 100 metres, over the city centre.",
      "timestamp": "2026-01-02T17:32:25.807000Z"
    },
    {
      "original": "‘Locked And Loaded’: Trump Threatens Iran Over Protests In Bid To Topple Regime\nPresident Donald Trump said on January 2 that the United States is “locked and loaded and ready to go,” threatening that Washington would step in if Iran “shoots and violently kills peaceful protesters.\"\n“If Iran shoots and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go. Thank you for your attention to this matter!” Trump wrote on his Truth Social network.\nIran has been witnessing protests since December 28, when shopkeepers first took to the streets to condemn the government's handling of a sharp currency slide and rapidly rising prices.\nThe protests escalated into deadly clashes with security forces on January 1. According to the semi-official Fars news agency, three protesters were killed and 17 were injured during an attack on a police station in Iran's western province of Lorestan.\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591890Z"
    },
    {
      "original": "‘Locked And Loaded’: Trump Threatens Iran Over Protests In Bid To Topple Regime\nPresident Donald Trump said on January 2 that the United States is “locked and loaded and ready to go,” threatening that Washington would step in if Iran “shoots and violently kills peaceful protesters.\"\n“If Iran shoots and violently kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go. Thank you for your attention to this matter!” Trump wrote on his Truth Social network.\nIran has been witnessing protests since December 28, when shopkeepers first took to the streets to condemn the government's handling of a sharp currency slide and rapidly rising prices.\nThe protests escalated into deadly clashes with security forces on January 1. According to the semi-official Fars news agency, three protesters were killed and 17 were injured during an attack on a police station in Iran's western province of Lorestan.\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591908Z"
    },
    {
      "original": "China Loads Unique Truck-Mounted Electromagnetic Catapult Used To Launch Drones On Cargo Ship\nChina has apparently developed a truck-mounted electromagnetic aircraft launch system, or more simply a mobile electromagnetic catapult, for large drones.\nThe catapult, which is made up from at least three eight-wheeled trucks that look designed to lock together seamlessly in a chain, first came out from Hudong-Zhonghua shipyard on December 29. What appears to be a mockup of a Feihong FH-97 jet-powered stealth combat drone was loaded onto the catapult, and another appeared next to it.\nThe FH-97, first unveiled in 2021, was developed as a “loyal wingman” drone, designed to suppress air defenses with electronic countermeasures, fly ahead of fighter jets to provide early warning, and absorb damage from attacks, as well as providing reconnaissance and damage evaluation. The drone can deploy not just precision-guided munitions, but also loitering munitions.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591917Z"
    },
    {
      "original": "China Loads Unique Truck-Mounted Electromagnetic Catapult Used To Launch Drones On Cargo Ship\nChina has apparently developed a truck-mounted electromagnetic aircraft launch system, or more simply a mobile electromagnetic catapult, for large drones.\nThe catapult, which is made up from at least three eight-wheeled trucks that look designed to lock together seamlessly in a chain, first came out from Hudong-Zhonghua shipyard on December 29. What appears to be a mockup of a Feihong FH-97 jet-powered stealth combat drone was loaded onto the catapult, and another appeared next to it.\nThe FH-97, first unveiled in 2021, was developed as a “loyal wingman” drone, designed to suppress air defenses with electronic countermeasures, fly ahead of fighter jets to provide early warning, and absorb damage from attacks, as well as providing reconnaissance and damage evaluation. The drone can deploy not just precision-guided munitions, but also loitering munitions.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591926Z"
    },
    {
      "original": "With Saudi Air Support, Yemeni Government Begins Battle Against UAE-Backed Forces (Videos)\nYemen’s Hadramout governor Salem al-Khanbashi announced on January 2 that an operation to expel the forces of the Southern Transitional Council (STC), which is backed by the United Arab Emirates, had begun.\nIn a televised address, al-Khanbashi, an ally of the Saudi-backed Presidential Leadership Council chief Rashad al-Alimi, said that Homeland Shield forces have launched a military operation dubbed “Taking Over the Camps” in Hadramout, aimed at assuming control of military sites “peacefully and in an organized manner.”\nLater, al-Khanbashi said that airstrikes targeted “aggressors against government-backed Homeland Shield forces” that had moved to take control of military sites in Hadhramaut.\nThe STC accused Saudi Arabia of bombing its forces near the border\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591934Z"
    },
    {
      "original": "With Saudi Air Support, Yemeni Government Begins Battle Against UAE-Backed Forces (Videos)\nYemen’s Hadramout governor Salem al-Khanbashi announced on January 2 that an operation to expel the forces of the Southern Transitional Council (STC), which is backed by the United Arab Emirates, had begun.\nIn a televised address, al-Khanbashi, an ally of the Saudi-backed Presidential Leadership Council chief Rashad al-Alimi, said that Homeland Shield forces have launched a military operation dubbed “Taking Over the Camps” in Hadramout, aimed at assuming control of military sites “peacefully and in an organized manner.”\nLater, al-Khanbashi said that airstrikes targeted “aggressors against government-backed Homeland Shield forces” that had moved to take control of military sites in Hadhramaut.\nThe STC accused Saudi Arabia of bombing its forces near the border\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591943Z"
    },
    {
      "original": "Russian Geran Drones Are Now Jamming Ukrainian Interceptors With Infrared Lights\nRussia has begun to equip its Geran-2 suicide drones with a simple infrared light system to jam Ukrainian interceptor drones.\nThe upgrade was revealed by Serhii “Flash” Beskrestnov, a Ukrainian expert in radio communications and electronic warfare, who shared on January 2 a photo showing the wreckage of a Geran-2 drone equipped with the new system to his Telegram channel.\nThe photo shows a small plate with six infrared LED lights installed on the rear of one of the vertical stabilizers at the drone’s wingtips.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591951Z"
    },
    {
      "original": "Battle Of Orikhiv Has Not Begun Yet, But Ukraine Is Already Losing It (Videos)\nOn January 2, the Russian military expanded its control around the city of Huliaipole, and resumed advance near the city of Orikhiv, without facing much resistance from Kiev forces which appear to be struggling in all directions within Zaporozhye.\nThe Vostok [East] Group of Forces advanced to the west of Huliaipole, securing 4,5 kilometers of territory along the road leading to Zalinskoe. Russian troops also advanced in the southern outskirts of the city, clearing the entire area down to Dorozhnyanka.\nThe advance from Huliaipole is clearly meant to pressure Ukrainian troops in the direction of Orikhiv, which is becoming more active.\nThe Vostok Group of Forces resumed advance to the southeast of the city, mainly between Mala Tokmachka and Luhivske. According to preliminary reports, Russian troops imposed full control over Bilohirya.\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591959Z"
    },
    {
      "original": "Battle Of Orikhiv Has Not Begun Yet, But Ukraine Is Already Losing It (Videos)\nOn January 2, the Russian military expanded its control around the city of Huliaipole, and resumed advance near the city of Orikhiv, without facing much resistance from Kiev forces which appear to be struggling in all directions within Zaporozhye.\nThe Vostok [East] Group of Forces advanced to the west of Huliaipole, securing 4,5 kilometers of territory along the road leading to Zalinskoe. Russian troops also advanced in the southern outskirts of the city, clearing the entire area down to Dorozhnyanka.\nThe advance from Huliaipole is clearly meant to pressure Ukrainian troops in the direction of Orikhiv, which is becoming more active.\nThe Vostok Group of Forces resumed advance to the southeast of the city, mainly between Mala Tokmachka and Luhivske. According to preliminary reports, Russian troops imposed full control over Bilohirya.\nRead more \nHERE",
      "timestamp": "2026-01-02T17:32:26.591967Z"
    },
    {
      "original": "Geran Attack: Summary Of Russian Combat Footage From January 2, 2026\nOn January 2, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-02T17:32:26.591974Z"
    },
    {
      "original": "Geran Attack: Summary Of Russian Combat Footage From January 2, 2026\nOn January 2, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-02T17:32:26.591980Z"
    }
  ],
  "script_run_time": "2026-01-02T17:32:26.592678Z"
}