{
  "messages": [
    {
      "original": "🚀\nШвидкісна ціль на Донеччині   \n➡️\n курсом на Харківщину !",
      "timestamp": "2025-08-12T21:43:49.411688Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-12T21:43:49.411710Z"
    },
    {
      "original": "🛸\n У Чернігівській області  -активність розвідувального БпЛА! Залучено засоби щодо його збиття. У разі оголошення тривоги - прямуйте в укриття!",
      "timestamp": "2025-08-12T21:43:49.411717Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння де оголошена повітряна тривога.",
      "timestamp": "2025-08-12T21:43:49.411725Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nДонецька область - загроза застосування ударних  БпЛА зі сходу.",
      "timestamp": "2025-08-12T21:43:49.411734Z"
    },
    {
      "original": "🛵\nНаразі декілька груп ударних БпЛА  рухаються територією Чернігівської області, у західному напрямку.",
      "timestamp": "2025-08-12T21:43:49.411740Z"
    },
    {
      "original": "⚠\n Увага! \nХарківщина рух ударних БпЛА у вашому напрямку з Донецької області.\nУ разі оголошення тривоги прямуйте в укриття.",
      "timestamp": "2025-08-12T21:43:49.411748Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-12T21:43:49.411758Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину .",
      "timestamp": "2025-08-12T21:43:49.411763Z"
    },
    {
      "original": "🛵\nНаразі група ударних БпЛА  рухаються територією Сумської області, у південно-західному напрямку.",
      "timestamp": "2025-08-12T21:43:49.411769Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-12T21:43:49.411775Z"
    },
    {
      "original": "🛵\nГруп ударних БпЛА на Полтавщині, рухається у південному напрямку.",
      "timestamp": "2025-08-12T21:43:49.411780Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-08-12T21:43:49.411789Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину та Сумщину.",
      "timestamp": "2025-08-12T21:43:49.411794Z"
    },
    {
      "original": "🛵\nНова група ударних БпЛА  рухаються територією Сумської області, у південно-західному напрямку.",
      "timestamp": "2025-08-12T21:43:49.411799Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння де оголошена повітряна тривога.",
      "timestamp": "2025-08-12T21:43:49.411804Z"
    },
    {
      "original": "Ракета на Кременчук.",
      "timestamp": "2025-08-12T21:43:49.411809Z"
    },
    {
      "original": "Кременчук перебувайте в укриттях.",
      "timestamp": "2025-08-12T21:43:49.411812Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-08-12T21:43:49.411817Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-08-12T21:43:49.411821Z"
    },
    {
      "original": "Photo from a Telegram chat reportedly showing a Russian DRG in front of the Dobropillya Bus Station. He apparently sent this to a local resident last night at 11:33pm. \n(This kind of thing can easily be faked).\nCoordinates: 48.456936, 37.087578",
      "timestamp": "2025-08-12T21:43:49.945571Z"
    },
    {
      "original": "Russian forces have captured the village of Kucheriv Yar,  Bilozerske direction, Donetsk Oblast.\nPre-war population: ~110.\nTotal land area: ~0.72km².",
      "timestamp": "2025-08-12T21:43:49.945586Z"
    },
    {
      "original": "Russian forces have captured the village of Predtechyne, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~377.\nTotal land area: ~1.11km².",
      "timestamp": "2025-08-12T21:43:49.945592Z"
    },
    {
      "original": "It's far worse than what Deepstate is allowed to show by the way.",
      "timestamp": "2025-08-12T21:43:49.945596Z"
    },
    {
      "original": "In the Bilozerske direction, Russian forces continued to exploit their breakthrough and advanced even deeper through Ukrainian lines, physically cutting the Dobropillya - Kramatorsk Highway. \nAfter securing a deep wedge between Dobropillya and Shakhove, Russian assault detachments continued to follow behind DRGs, who at that point were operating as far as 10km ahead, causing massive disruption amongst Ukrainian units. This, combined with poor Ukrainian coordination, incompetent commanders, disorganisation, and catastrophic levels of manpower shortages, resulted in the Ukrainians being completely unable to carry out any form of containment operations, despite more than two new brigades being redeployed here.\nThere were two main assault vectors that Russian soldiers took. The first, and most significant, was west of the Velyka Balka Gulley, where they penetrated to Zolotyi Kolodyaz and entrenched in the southern street of the village. Other forces turned west, crossing the Hruzka River and bypassed the village. They moved northwest and uphill along two separate gulleys and managed to physically cut the Dobropillya - Kramatorsk Highway at two points\nThe second attack vector was east of the Velyka Balka Gulley, where Russian forces captured three quarries, and bypassed the village of Kucheriv Yar from the east, moving north along the treelines on the tactical heights towards the villages of Vesele and Hruzke, which both lie on the banks of the Hruzka River. Once they reached the southern bank of the river, the Russians crossed it and establishd control over around half of Vesele, where they are accumulating reinforcements for further attacks. Other forces moved down from the heights and into Kucheriv Yar (which was largely empty), occupying it with little resistance. \nAs for DRGs, they have begun to turn west, infiltrating through the fields around Rubizhne, Stepy, Novyi Donbas, Vilne, Novovodyane, Vesele Pole, and Nove Shakhove, where they entered the cities of Dobropillya, and Bilozerske. Dobropillya is seeing more DRG activity than Bilozerske as Russian forces don't have to go as far through the wedge to reach the city. \nMeanwhile, further south, Russian forces continued to clear positions northeast of Bilytske. They re-established control over the forest west of Nykanorivka, and advanced along the treeline to northern Dorozhnje. They also made further progress in the treelines south of Nove Shakhove. \n+ ~48.31km² in favour of Russia.",
      "timestamp": "2025-08-12T21:43:49.945605Z"
    },
    {
      "original": "In the Bilozerske direction, Russian forces continued to exploit their breakthrough and advanced even deeper through Ukrainian lines, physically cutting the Dobropillya - Kramatorsk Highway.   After securing a deep wedge between Dobropillya and Shakhove, Russian…",
      "timestamp": "2025-08-12T21:43:49.945609Z"
    },
    {
      "original": "I have overlayed \n@Playfra0's\n fortification map with my control map. With this, you can see that not only has the Dobropillya - Kramatorsk Highway been cut, but the Russians have also breached and captured a section of the \"New Donbas Line\", which is Ukraine's final line of defence in Donetsk Oblast.\nThis line was designed to protect Kharkiv and Dnipropetrovsk Oblasts, and was actually built behind Kramatorsk and Slovyansk. It's safe to say that the Ukrainian command did not expect the front to move like this.",
      "timestamp": "2025-08-12T21:43:49.945615Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-12T21:43:49.945619Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-12T21:43:49.945625Z"
    },
    {
      "original": "This is his \"trap\" then vs now.",
      "timestamp": "2025-08-12T21:43:49.945629Z"
    },
    {
      "original": "Wait... but I thought top military analyst David D reported that the Russian breakthrough to Pokrovsk was a trap? Now Russia is *checks notes* 40km northwest of David's map.",
      "timestamp": "2025-08-12T21:43:49.945634Z"
    },
    {
      "original": "Oh damn, this is the one year anniversary of the \"Its a trap\" tweet.",
      "timestamp": "2025-08-12T21:43:49.945637Z"
    },
    {
      "original": "Where are all the linear/constant warfare mathematicians today?",
      "timestamp": "2025-08-12T21:43:49.945641Z"
    },
    {
      "original": "Ukrainian artillery shelling is targeting eastern Rodynske, confirming the Russian entry into the city. \nGeolocation\n: 48.353474, 37.212539",
      "timestamp": "2025-08-12T21:43:49.945645Z"
    },
    {
      "original": "Russian forces have captured the village of Leontovychi,  Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~698.\nTotal land area: ~2.10km².",
      "timestamp": "2025-08-12T21:43:49.945650Z"
    },
    {
      "original": "Russian forces have captured the village of Novoekonomichne, Northeastern flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~2,763.\nTotal land area: ~5.24km² .",
      "timestamp": "2025-08-12T21:43:49.945655Z"
    },
    {
      "original": "Russian forces have captured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.52km².",
      "timestamp": "2025-08-12T21:43:49.945659Z"
    },
    {
      "original": "Russian forces have captured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-12T21:43:49.945664Z"
    },
    {
      "original": "Russian forces have captured the village of Nove Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~191.\nTotal land area: ~0.53km².",
      "timestamp": "2025-08-12T21:43:49.945668Z"
    },
    {
      "original": "Russian forces have captured the village of Zolotyi Kolodyaz, Bilozerske Direction, Donetsk Oblast.\nPre-war population: ~910.\nTotal land area: ~2.50km².",
      "timestamp": "2025-08-12T21:43:49.945673Z"
    },
    {
      "original": "In the Bilozerske direction, Russian forces continued to exploit their breakthrough and advanced even deeper through Ukrainian lines, physically cutting the Dobropillya - Kramatorsk Highway.   After securing a deep wedge between Dobropillya and Shakhove, Russian…",
      "timestamp": "2025-08-12T21:43:49.945676Z"
    },
    {
      "original": "The disaster for Ukraine in Pokrovsk-Bilozerske continues to unfold. \nHere's what we know has happened:\nA new breakthrough was achieved towards Hryshyne from the east following weeks of DRG activities. The full extent of this breakthrough remains unknown, but DRGs are operating on the outskirts of both Hryshyne and Novooleksandrivka. This makes the second to last road out of Pokrovsk-Myrnohrad unusable.\nDorozhnje and the freight train station of the same name have been occupied after over a week of battles, along with Ivanivka and Nove Shakhove to the north. \nDRGs continue to operate in and around Novyi Donbas  and on the approaches to Dobropillya. No new DRG activity within Dobropillya's city limits has been recorded over the past 12 hours. \nThe 12th \"Azov\" Brigade of the National Guard of Ukraine was deployed to Rubizhne (circled in green), which has prevented it's capture. Nevertheless, Zolotyi  Kolodyaz - the focus of the initial media frenzy - has come under Russian control. DRGs continue to operate on the approaches to Hruzke. \nRussian forces captured the Krasnolymanskaya Mine and the adjacent terykon. They also secured part of eastern Rodynske and made additional progress in Chervonyi Lyman. \nNovoekonomichne has come under Russian control, and progress was made northwest of Hrodivka and west of Myrolyubivka. \nThe rest of Lysivka has moved into the grey zone, with unconfirmed reports of its capture. Suhkyi Yar and the guitar-shaped fortification continue to hold.\nRussian forces continue to push north through western Pokrovsk and completed the capture of Leontovychi.\nPositions were improved in northern Kotlyne and east of the village.\nSouthern Udachne and the town's train station was captured by Russian forces. Most of the rest of the town is a kill-zone or in the grey zone. \nThe remaining Ukrainian soldiers in Pokrovsk, Myrnohrad, and the surrounding villages are about to be encircled if nothing is done very soon. Only one road remains even slightly safe for a withdrawal to take place. \nI will make a full and more accurate map update tomorrow, but I thought I should share these developments sooner rather than later.",
      "timestamp": "2025-08-12T21:43:49.945688Z"
    },
    {
      "original": "The 12th \"Azov\" Brigade (1st corps) of the National Guard of Ukraine (NGU) has been redeployed to the Novyi Donbas-Stepy-Rubizhne line in an attempt to contain the chaotic situation east of Dobropillya.",
      "timestamp": "2025-08-12T21:43:49.945692Z"
    },
    {
      "original": "Russian forces have captured the village of Vilne, Dobropillya direction, Donetsk Oblast. \nPre-war population: ~71.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-12T21:43:49.945696Z"
    },
    {
      "original": "Keep in mind, most of the updates from the Pokrovsk-Dobropillya-Bilozerske area are days behind. The true situation will be much worse than is shown, especially considering almost all of this is being done in media silence.",
      "timestamp": "2025-08-12T21:43:49.945699Z"
    }
  ],
  "script_run_time": "2025-08-12T21:43:50.351375Z"
}