{
  "messages": [
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Синельниківський район), курс північно-західний.",
      "timestamp": "2025-10-22T20:41:23.919821Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-10-22T20:41:23.919842Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині, курс Чернігівщина.",
      "timestamp": "2025-10-22T20:41:23.919848Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T20:41:23.919853Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині (Сумський район), курс південний.",
      "timestamp": "2025-10-22T20:41:23.919858Z"
    },
    {
      "original": "🛵\n БпЛА з Херсонщини курсом на Миколаївщину.\n🛵\n Чернігів - БпЛА в напрямку міста.\n🛵\n Павлоград - БпЛА над містом!!",
      "timestamp": "2025-10-22T20:41:23.919866Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-22T20:41:23.919874Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курс Київщина (Вишгородський р-н)",
      "timestamp": "2025-10-22T20:41:23.919881Z"
    },
    {
      "original": "🚀\nПуски КАБ на Херсонщину.",
      "timestamp": "2025-10-22T20:41:23.919886Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T20:41:23.919890Z"
    },
    {
      "original": "🛵\n БпЛА на  півдні Чернігівщини, курс Київщина (Броварський р-н)",
      "timestamp": "2025-10-22T20:41:23.919894Z"
    },
    {
      "original": "🛵\n  БпЛА над Київським водосховищем, курс на захід.",
      "timestamp": "2025-10-22T20:41:23.919901Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на  південному  та південно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-22T20:41:23.919908Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Бровари",
      "timestamp": "2025-10-22T20:41:23.919913Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Київ з півночі.",
      "timestamp": "2025-10-22T20:41:23.919917Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині, курс на Миколаївщину.",
      "timestamp": "2025-10-22T20:41:23.919922Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Криворізький район) , курс на північ",
      "timestamp": "2025-10-22T20:41:23.919926Z"
    },
    {
      "original": "🛵\n Група БпЛА з Херсонщини на Дніпропетровщину",
      "timestamp": "2025-10-22T20:41:23.919930Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини на Кіровоградщину (Олександрійський р-н)",
      "timestamp": "2025-10-22T20:41:23.919935Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-22T20:41:23.919939Z"
    },
    {
      "original": "Siversk, Pokrovsk, Kupyansk, Bilohorivka... when will they learn not to storm these \"cauldron cities\" like this? Makes zero sense, and the only time that I can think of when something similar to this has worked was in Toretsk, and even then the whole city had to be wiped out for them to take it, and proper consolidation had taken actually place in the previous, much larger settlements.",
      "timestamp": "2025-10-22T20:41:24.511551Z"
    },
    {
      "original": "Of course, it's nothing compared to Ukraine's storming of places like Tetkino, Toretsk, Klishchiivka, Robotyne, etc, but you would still expect Russia to show more adaptation when it comes to this.",
      "timestamp": "2025-10-22T20:41:24.511564Z"
    },
    {
      "original": "These 5 Tu-95s, alongside 3 IL-78 tankers, are carrying out large-scale, long-range training. This is likely related to Russia's ongoing nuclear exercises.",
      "timestamp": "2025-10-22T20:41:24.511568Z"
    },
    {
      "original": "Some of the communications between one of the Tu-95MS and ground controllers \"Khlebobor & Troitsa\" as they carry out training missions over the Kuril Islands area of the Pacific Ocean.\nThey may carry out simulated launches of Kh-101 cruise missiles with electronic warfare as a part of the training, as they did earlier this week.",
      "timestamp": "2025-10-22T20:41:24.511573Z"
    },
    {
      "original": "4 out of 5 operational Hydroelectric Power Plants were hit by Russian missiles last night...",
      "timestamp": "2025-10-22T20:41:24.511577Z"
    },
    {
      "original": "Ukraine's Ukrenergo has announced additional rolling hourly power outages for household consumers. They will take place for 18 hours every day between 7am and 11pm, and are being put in place due to today's Russian missile strikes on Ukrainian energy infrastructure, as well as earlier attacks.\nIndustrial consumers will be prioritised, with power limitation schedules being put in place for them rather than outright outages.",
      "timestamp": "2025-10-22T20:41:24.511582Z"
    },
    {
      "original": "Interesting Russian movements happening right now.  At least 1 Tu-95MS and 2 Tu-22M3s strategic bombers are flying south from Olenya Airbase, Murmansk Oblast, towards Saratov Oblast. They should arrive at any potential launch lines in the next 30 minutes.…",
      "timestamp": "2025-10-22T20:41:24.511588Z"
    },
    {
      "original": "The 2 Tu-22m3 and 1 Tu-95MS strategic bomber flights which I reported on earlier were taking part in the ongoing Russian nuclear exercises. \nThis video shows the two Tu-22m3s carrying out training, alongside escort crews of Su-34S and Su-27 aircraft. One of the Tu-22m3s can be seen equipped with a Kh-22 cruise missile. These training flights lasted for more than 5 hours.",
      "timestamp": "2025-10-22T20:41:24.511593Z"
    },
    {
      "original": "I put together a short Twitter thread on today's Russian Geran-2 drone \"strike\" on a kindergarten in Kharkiv City. In it, I outline why I think it was caused by Ukrainian electronic warfare, and outline how I reached that conclusion. \nLink: \nhttps://x.com/AMK_Mapping_/status/1981053186430718459",
      "timestamp": "2025-10-22T20:41:24.511598Z"
    },
    {
      "original": "A very stupid and borderline suicidal idea in my opinion. Russia hasn't even properly consolidated east of the city, with the grey zone stretching nearly 9 km east of this infiltration.   The entire area is completely covered by Ukrainian drones as there are…",
      "timestamp": "2025-10-22T20:41:24.511601Z"
    },
    {
      "original": "Russian mapper Radov corroborates my reports on the complicated situation east of Kostyantynivka. \nFor those who think Russia has properly consolidated here.",
      "timestamp": "2025-10-22T20:41:24.511605Z"
    },
    {
      "original": "Russian forces have captured the village of Molodetske, western flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~148.\nTotal land area: ~0.95 km².",
      "timestamp": "2025-10-22T20:41:24.511610Z"
    },
    {
      "original": "Russian forces have captured the village of Promin, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~73.\nTotal land area: ~0.16 km².",
      "timestamp": "2025-10-22T20:41:24.511615Z"
    },
    {
      "original": "KAB launches to Kherson City",
      "timestamp": "2025-10-22T20:41:24.511618Z"
    },
    {
      "original": "KAB launches to Kherson City",
      "timestamp": "2025-10-22T20:41:24.511621Z"
    },
    {
      "original": "Correction: flying to the Komyshany area, west of Kherson.",
      "timestamp": "2025-10-22T20:41:24.511624Z"
    },
    {
      "original": "Correction: flying to the Komyshany area, west of Kherson.",
      "timestamp": "2025-10-22T20:41:24.511627Z"
    },
    {
      "original": "Explosions in Kherson.",
      "timestamp": "2025-10-22T20:41:24.511633Z"
    },
    {
      "original": "4 KABs were used on the western suburbs of Kherson. The Su-34s are returning to Crimea, where a Su-35 (currently circling near Krasnoperekopsk, northern Crimea) will escort them back to their airbase.\nWe will probably see a video of the strikes filmed from a Russian recon drone in the coming hours.",
      "timestamp": "2025-10-22T20:41:24.511637Z"
    },
    {
      "original": "Ukrainian UAVs attacked the city of Kopeysk, Chelyabinsk Oblast. At least one drone impacted a production workshop of the JSC \"Platmass\" Plant, which specialises in the production of ammunition for barrel, naval, tank, and self-propelled artillery.\nThis impact is approximately 1,700 km from the nearest Ukrainian-controlled territory.  \nCoordinates: 55.125726, 61.573481",
      "timestamp": "2025-10-22T20:41:24.511642Z"
    },
    {
      "original": "Ukrainian UAVs attacked the city of Kopeysk, Chelyabinsk Oblast. At least one drone impacted a production workshop of the JSC \"Platmass\" Plant, which specialises in the production of ammunition for barrel, naval, tank, and self-propelled artillery.\nThis impact is approximately 1,700 km from the nearest Ukrainian-controlled territory.  \nCoordinates: 55.125726, 61.573481",
      "timestamp": "2025-10-22T20:41:24.511647Z"
    },
    {
      "original": "The Wall Street Journal, citing U.S. officials, reports that the Trump administration has lifted restrictions preventing Ukraine from using western long-range weapons to strike targets inside internationally recognised parts of Russia. \nYesterday, the Ukrainian general staff reported that Ukrainian Storm Shadow cruise missiles impacted the Bryansk Chemical Plant. While there is no visual confirmation of this yet, some Russian channels have corroborated these claims.",
      "timestamp": "2025-10-22T20:41:24.511651Z"
    },
    {
      "original": "U.S. Secretary of the Treasury Scott Bessent has announced that the U.S. will implement additional sanctions against Russia. The details of this sanctions package are expected to be announced as early as this evening. Meanwhile, the EU has agreed to implement their 19th package of sanctions against Russia.\nThis comes as Trump and Putin's scheduled meeting in the Hungarian capital of Budapest was cancelled yesterday, with Trump saying that he was avoiding a \"wasted meeting\", after reports that Putin refused to freeze the frontline along its current line of contact in a phone call with Trump.",
      "timestamp": "2025-10-22T20:41:24.511657Z"
    },
    {
      "original": "There's an increased threat of Russian Iskander-M ballistic missile launches from OTRK installations in Bryansk and Voronezh Oblasts for the next 24 hours, following new deliveries of missiles over the past few days. \nLaunches from these regions primarily target Kyiv Oblast, Chernihiv Oblast, Poltava Oblast, Donetsk Oblast, Kharkiv Oblast, and Dnipropetrovsk Oblast.",
      "timestamp": "2025-10-22T20:41:24.511661Z"
    },
    {
      "original": "Kyiv is under attack from Russian Geran-2 drones. The target is the CHP-6 power plant.",
      "timestamp": "2025-10-22T20:41:24.511664Z"
    },
    {
      "original": "Explosions in Kyiv. They are striking the Kyiv Hydroelectric Power Plant.",
      "timestamp": "2025-10-22T20:41:24.511667Z"
    },
    {
      "original": "Russian Army Advances Near Mala Tokmachka, Captures Pavlovka And Ivanovka (Videos)\nOn October 22, the Russian military advanced near Mala Tokmachka, where it launched a surprise attack a day earlier, and captured two settlements further to the west in the directions of Zaporozhye and Dnepropetrovsk.\nThe Vostok [East] Group of Forces is currently controlling the southern part of Mala Tokmachka and fighting to take over the center of the settlement.\nWhile Kiev forces have been putting fierce resistance within Mala Tokmachka, their defenses nearby are collapsing. Russian troops have advanced to the north of Robotyne, reaching the southern outskirts of Novodanylivka. This could soon allow the troops to attack the center of Mala Tokmachka from the west.\nMoving to the west in Zaporozhye, the Vostok Group of Forces captured Pavlovka along the Yanchur River, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084872Z"
    },
    {
      "original": "Russian Army Advances Near Mala Tokmachka, Captures Pavlovka And Ivanovka (Videos)\nOn October 22, the Russian military advanced near Mala Tokmachka, where it launched a surprise attack a day earlier, and captured two settlements further to the west in the directions of Zaporozhye and Dnepropetrovsk.\nThe Vostok [East] Group of Forces is currently controlling the southern part of Mala Tokmachka and fighting to take over the center of the settlement.\nWhile Kiev forces have been putting fierce resistance within Mala Tokmachka, their defenses nearby are collapsing. Russian troops have advanced to the north of Robotyne, reaching the southern outskirts of Novodanylivka. This could soon allow the troops to attack the center of Mala Tokmachka from the west.\nMoving to the west in Zaporozhye, the Vostok Group of Forces captured Pavlovka along the Yanchur River, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084895Z"
    },
    {
      "original": "Military Situation In Syria On October 22, 2025 (Map Update)",
      "timestamp": "2025-10-22T20:41:25.084900Z"
    },
    {
      "original": "Israel Prepares For Next War With Light Attack Aircraft\nIsrael is arming its air force with light attack aircraft that will allow it to defend its border from large infiltrations, as well as to conduct intense operations over neighboring countries with no real air defense capabilities.\nOn October 15, Israel Aerospace Industries (IAI) and the American defense contractor L3Harris announced that they had signed a memorandum of understanding to jointly develop an Israeli configuration of L3Harris’s Sky Warden aircraft. Sky Warden was designed on the basis of the Air Tractor AT-802, which was originally developed for agriculture and firefighting.\nL3Harris is already producing the Sky Warden under the name OA-1K Skyraider II for the United States Special Operations Command.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084910Z"
    },
    {
      "original": "Military Situation In Ukraine On October 22, 2025 (Maps Update)",
      "timestamp": "2025-10-22T20:41:25.084914Z"
    },
    {
      "original": "Military Situation In Ukraine On October 22, 2025 (Maps Update)",
      "timestamp": "2025-10-22T20:41:25.084918Z"
    },
    {
      "original": "Russian Troops Make Steady Advance In Pokrovsk Amid Ukrainian Collapse (Video)\nOn October 22, the Russian military advanced within Pokrovsk and in areas located near the key city in the Donetsk direction as Ukraine threw in more reinforcements.\nThe Tsentr [Center] Group of Forces broke through Ukrainian defenses along the railway tracks in the center of the city, advancing into its northern part, mainly in the Olshansky Street. Reports indicate, however, that some Ukrainian troops present in the southern part of the city, very possibly trapped, between Prokofyeva Street and Yubileyny Park.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084925Z"
    },
    {
      "original": "Guards’ Chief Vows To Open ‘Gates Of Hell’ If Israel Attacks After Unveiling New Missiles (Videos)\nIran’s Islamic Revolutionary Guard Corps (IRGC) chief on October 21 warned that the Islamic Republic would “open the gates of hell” on Israel if it attacks again.\nMaj. Gen. Mohammad Pakpour made the warning during a meeting with Iraqi National Security Adviser Qasim al‑Araji, according to Iran’s Tasnim news agency.\nSince the end of the war, the Islamic Republic has been working to boost its military capabilities. On October 18, the IRGC unveiled upgraded versions of two of its homegrown ballistic missiles, along with overhauled launchers that were damaged during the war.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084933Z"
    },
    {
      "original": "Guards’ Chief Vows To Open ‘Gates Of Hell’ If Israel Attacks After Unveiling New Missiles (Videos)\nIran’s Islamic Revolutionary Guard Corps (IRGC) chief on October 21 warned that the Islamic Republic would “open the gates of hell” on Israel if it attacks again.\nMaj. Gen. Mohammad Pakpour made the warning during a meeting with Iraqi National Security Adviser Qasim al‑Araji, according to Iran’s Tasnim news agency.\nSince the end of the war, the Islamic Republic has been working to boost its military capabilities. On October 18, the IRGC unveiled upgraded versions of two of its homegrown ballistic missiles, along with overhauled launchers that were damaged during the war.\nRead more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084942Z"
    },
    {
      "original": "The Next Gen of Russian Military's Tactics: A Key to Recent Battlefield Successes\nThis secret is the key to the Russian army's success on the battlefield. It is a complete overhaul of warfare methods, abandoning old strategies. This has created more bottlenecks and operational crises for the Ukrainian army.\nOver the three-and-a-half years of the Ukrainian conflict, serious changes have been made to tactics and the use of weapons. These will affect how the most developed countries deploy their troops in future combat operations. The emergence of new, inexpensive, mass-produced means of destroying armoured vehicles and manpower will change the course of future wars forever.\nIn 2022–23, both Russian and Ukrainian units largely adhered to the traditional 'Soviet' approach to warfare. At the same time, Kyiv's Western advisers experimented with a concept developed in the mid-20th century to deter Soviet tank columns advancing towards the English Channel, which they tested on the AFU.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084952Z"
    },
    {
      "original": "The Next Gen of Russian Military's Tactics: A Key to Recent Battlefield Successes\nThis secret is the key to the Russian army's success on the battlefield. It is a complete overhaul of warfare methods, abandoning old strategies. This has created more bottlenecks and operational crises for the Ukrainian army.\nOver the three-and-a-half years of the Ukrainian conflict, serious changes have been made to tactics and the use of weapons. These will affect how the most developed countries deploy their troops in future combat operations. The emergence of new, inexpensive, mass-produced means of destroying armoured vehicles and manpower will change the course of future wars forever.\nIn 2022–23, both Russian and Ukrainian units largely adhered to the traditional 'Soviet' approach to warfare. At the same time, Kyiv's Western advisers experimented with a concept developed in the mid-20th century to deter Soviet tank columns advancing towards the English Channel, which they tested on the AFU.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T20:41:25.084960Z"
    },
    {
      "original": "MOUNTING PRESSURE: BLACKOUTS, A FALTERING FRONT IN POKROVSK, AND NEW THREATS IN KHERSON",
      "timestamp": "2025-10-22T20:41:25.084964Z"
    }
  ],
  "script_run_time": "2025-10-22T20:41:25.085938Z"
}