{
  "messages": [
    {
      "original": "🛵\n Нова група БпЛА з акваторії Чорного моря курсом на південь Одещини (Вилкове/Татарбунари).",
      "timestamp": "2025-11-22T11:38:15.736059Z"
    },
    {
      "original": "Запоріжжя - над містом ворожий БпЛА.",
      "timestamp": "2025-11-22T11:38:15.736073Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Одещини рухаються у напрямку Ізмаїл/Орлівка з півночі. Перебувайте в укриттях!",
      "timestamp": "2025-11-22T11:38:15.736083Z"
    },
    {
      "original": "📢\n Відбій загрози застосування ворожих БпЛА по областях.",
      "timestamp": "2025-11-22T11:38:15.736087Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-11-22T11:38:15.736092Z"
    },
    {
      "original": "🛵\n Павлоградський район, Дніпропетровська область - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-11-22T11:38:15.736096Z"
    },
    {
      "original": "🚀\nЗагроза застосування авіаційних засобів ураження для Донецької та Дніпропетровської областей.",
      "timestamp": "2025-11-22T11:38:15.736101Z"
    },
    {
      "original": "🛸\n🛵\n Ворожі БпЛА на сході тв південному сході Дніпропетровщини, вектор руху Павлоград/Дніпро.",
      "timestamp": "2025-11-22T11:38:15.736106Z"
    },
    {
      "original": "🛵\n Ізюмський район (Харківська область) - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-11-22T11:38:15.736111Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА південніше Павлограду у напрямку Дніпра.",
      "timestamp": "2025-11-22T11:38:15.736115Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу! \nНе ігноруйте сигнал повітряної тривоги!",
      "timestamp": "2025-11-22T11:38:15.736122Z"
    },
    {
      "original": "🚀\nШвидкісна ціль південніше Павлограду, курс північно-західний",
      "timestamp": "2025-11-22T11:38:15.736126Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 89 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 22 листопада (з 19:00 21 листопада) противник атакував однією балістичною ракетою Іскандер-М із ТОТ АР Крим, та 104-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Брянськ, Шаталово, Міллєрово, Приморсько-Ахтарськ, – рф, Чауда - ТОТ АР Крим та ТОТ Донецьк, близько 65 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 89 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 13 ударних БпЛА на 6 локаціях, а також балістичної ракети на одній локації. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги.",
      "timestamp": "2025-11-22T11:38:15.736146Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння зі сходу!  Не ігноруйте сигнал повітряної тривоги!",
      "timestamp": "2025-11-22T11:38:15.736152Z"
    },
    {
      "original": "📢\nВідбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-22T11:38:15.736157Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-22T11:38:15.736163Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-11-22T11:38:15.736167Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на південний захід\\північ.",
      "timestamp": "2025-11-22T11:38:15.736173Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на південно-східному напрямку!  \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-22T11:38:15.736179Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщину та Запоріжжя.",
      "timestamp": "2025-11-22T11:38:15.736183Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Донеччини \n➡️\n курсом на Харківщину.\n🛵\n Група БпЛА на сході Дніпропетровщини \n➡️\n курсом на північний захід.\n🛵\n Група БпЛА на Запоріжжі \n➡️\n курсом на південний захід, південь.",
      "timestamp": "2025-11-22T11:38:15.736195Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Sadove, Kupyansk direction, Kharkiv Oblast. \nPre-war population: ~59.\nTotal land area: ~0.24 km².",
      "timestamp": "2025-11-22T11:38:16.458855Z"
    },
    {
      "original": "Regarding the situation in Siversk:\nRecently, there have been a lot of differing claims from various sources about the situation in this critical city. Some are claiming that Russia has broken through and captured large parts of the city, while others say the situation is under control for Ukraine. Based on the information I have gathered, I can come to a somewhat conclusive position on what the true situation is here.\nFirstly, one major correction was made to the map. It turns out that previous Russian attempts to seize a series of Ukrainian strongpoints southeast of Siversk in September and October failed, with Ukrainian forces retaining control over important positions on the tactical heights there. The Russians instead opted to bypass these areas, advancing along the railway line and from the area of Verkhnokamyanske. \nOver the last week, attacks intensified. Russian forces assaulted and captured Ukrainian positions on the treeline leading to the southeastern edge of Siversk, which they then used to infiltrate into the city. A number of Russian soldiers scattered in the houses there, leaving the Ukrainian strongpoints to the southeast in an operational encirclement. \nHowever, the main vector of attack on Siversk took place from the south. A number of Russians on motorcycles broke into the southern part of the city, which was already in the grey zone. The surviving infantry then advanced north towards the city centre, scattering in additional residential areas and linking up with the forces from the east. This was achieved with minimal resistance from Ukrainian soldiers on the ground due to Ukrainian manpower shortages inside the city itself, as well as new logistical problems which Ukraine is facing due to recent Russian advances on the flanks. \nDespite this small number of Ukrainian soldiers, a massive number of drones remain in the sky as usual, monitoring every movement and striking anything that moves. Russia deployed only a small number of soldiers in these attacks (likely 30-50, not including already established positions on the southern outskirts), which is not enough to consolidate larger areas and bring in additional supplies and reinforcements. Naturally, due to a lack of Ukrainian manpower, drone operators are now attempting to pick off the Russian soldiers to prevent any consolidation, ahead of small assault groups moving in. Currently, only a portion of the Russian soldiers have been killed/wounded, and work is underway to find the rest of them. Earlier strikes mainly took place in the southern parts of the city but are now moving further north to hit the Russians who penetrated deeper. \nMeanwhile to the south of Siversk, Russian forces have made new advances in Zvanivka. They captured at least 60% of the village, reached its western edge, and are now trying to push further north and consolidate on its northern edge. Advances also took place downhill from the tactical heights next to the railway line, forcing the remaining Ukrainian soldiers still in the salient northeast of Pereizne to withdraw.",
      "timestamp": "2025-11-22T11:38:16.458873Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on the Orlivka Gas Compresser Station in southern Odesa Oblast near the border with Romania. \nApproximately 38 drones took part in the attack, most/all of which impacted. \nCoordinates: 45.30433, 28.54219",
      "timestamp": "2025-11-22T11:38:16.458879Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on the Orlivka Gas Compresser Station in southern Odesa Oblast near the border with Romania. \nApproximately 38 drones took part in the attack, most/all of which impacted. \nCoordinates: 45.30433, 28.54219",
      "timestamp": "2025-11-22T11:38:16.458884Z"
    },
    {
      "original": "Russia is winning the war; therefore any peace negotiations will favour them.\nPeople are so hooked up on hopium, and are looking at this from an idealist point of view. War doesn't work like a Hollywood movie where the good guys win and the bad guys lose. The stronger side wins and the weaker side loses - at least in a war of attrition. \nThe fact that people think THIS plan is unacceptable to Ukraine is insane to me and shows how delusional many have gotten. With how things are going, in the next year and a half Ukraine likely will have been defeated. \nEven for people who see this war as a linear \"Russia took X number of kilometres in Y amount of time, therefore it will take 200 years for them to get to Kyiv\" are being proven wrong by reality now. Using that logic, at this current rate of advance, Russia will reach the Dnipro River at Zaporizhzhia City (a city of over 700k people) in less than a year. The linear claim used to be 90 years, or 1,000 years. \n\"Oh, but Russia could just leave, why should Ukraine cede territory!\" Trump could also resign today, Elon Musk could donate $50 Billion to charity. The amount of brain rotting shit that people try to portray as actual arguments is mind numbing.\nThis isn't how war works. Why would Russia leave? They are winning and know they will win if they keep pushing. People are seriously conflating reality with their perception of an ideal situation, and the fact that this opinion is so widely accepted and promoted is proof of what emotional attachments to entities (Ukraine), and propaganda can do.",
      "timestamp": "2025-11-22T11:38:16.458892Z"
    },
    {
      "original": "Explosion in Pavlohrad, Dnipropetrovsk Oblast. Iskander-M ballistic missile strike.",
      "timestamp": "2025-11-22T11:38:16.458896Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in and around Vovchansk, making new progress in two different areas.\nIn the northeast, Russian forces expanded their zone of control in the denser low-rise residential areas in the south of the city, eventually reaching its eastern edge. They also crossed the highway further north, entering the southeastern neighbourhoods and capturing the technical school along with around 9 more residential blocks.\nTo the southwest, after entering the main part of Synelnykove, Russian forces quickly pushed to its eastern outskirts, completing the capture of the village. From there, they entered the Tsehelne industrial facilities and established full control over them and the surrounding forested areas. \n+ ~2.93 km² in favour of Russia.",
      "timestamp": "2025-11-22T11:38:16.458907Z"
    },
    {
      "original": "For all those saying I'm a psyop account living in Russia \n😁",
      "timestamp": "2025-11-22T11:38:16.458912Z"
    },
    {
      "original": "For all those saying I'm a psyop account living in Russia \n😁",
      "timestamp": "2025-11-22T11:38:16.458918Z"
    },
    {
      "original": "🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🇳🇿\n🔥\n🔥\n🔥\n🔥\n🔥\n🔥\n🔥",
      "timestamp": "2025-11-22T11:38:16.458935Z"
    },
    {
      "original": "Throwback to when Prigozhin held up one of his maps with a pin which happened to be on the Chatham Islands (part of NZ), and then gaslit our media into thinking Wagner was gonna invade.",
      "timestamp": "2025-11-22T11:38:16.458939Z"
    },
    {
      "original": "Throwback to when Prigozhin held up one of his maps with a pin which happened to be on the Chatham Islands (part of NZ), and then gaslit our media into thinking Wagner was gonna invade.",
      "timestamp": "2025-11-22T11:38:16.458942Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards the village of Novoplatonivka and have reached the low-lying ground next to the Oskil River.\nAfter securing the main section of the tactical heights, Russian forces advanced downhill to the southwest along two gulleys, capturing new positions in the forest plantations there. They also captured a treeline west of a tributary of the Oskil River, and marginally advanced in Borivska Andriivka, entering the western part of the village. \n+ ~4.54 km² in favour of Russia.",
      "timestamp": "2025-11-22T11:38:16.458947Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are advancing, each attempting to retake positions in various areas.\nIn the east, the remaining Russian soldiers who attempted the earlier pipeline operation were killed/captured. Ukrainian forces subsequently moved back into the positions, resecuring logistics into the village of Varachyne which was now being stormed by Russian troops. Ukrainian forces recaptured the southern street, and Russian soldiers subsequently withdrew from the north after their initial assaults were repelled by Ukrainian FPV drones. \nSince then, the Russians have resumed their attacks, carrying out intensive operations aimed at re-entering Varachyne. These attacks have seen mixed results, but they were able to recapture positions in the treeline north of the village.\nTo the west, Russian forces began a series of attacks aimed at entering the village of Andriivka. This time they advanced from the north, bypassing the large grey zone on the western approaches to Oleksiivka. They were able to capture the rest of a treeline and entrench along the road on the northern outskirts of Andriivka. \nFurther west, at some point recently, Ukrainian forces were able to clear out the easternmost street of Kindrativka from Russian soldiers who infiltrated the village last month. \n+ ~3.05 km² in favour of Ukraine.\n+ ~1.43 km² in favour of Russia.",
      "timestamp": "2025-11-22T11:38:16.458955Z"
    },
    {
      "original": "Russian forces have captured the village of Nechaivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~126.\nTotal land area: ~0.62 km².",
      "timestamp": "2025-11-22T11:38:16.458960Z"
    },
    {
      "original": "Russian forces have captured the village of Radisne, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~164.\nTotal land area: ~1.03 km².",
      "timestamp": "2025-11-22T11:38:16.458964Z"
    },
    {
      "original": "Russian forces have captured the village of Nove Zaporizhzhya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~103.\nTotal land area: ~1.00 km².",
      "timestamp": "2025-11-22T11:38:16.458968Z"
    },
    {
      "original": "In the Lyman direction and on the northern flank of Siversk, Russian forces have made significant progress, advancing in important parts of the frontline.\nIn the southeast, after capturing Dronivka, Russian forces advanced to the southwest through the forests to Platonivka, quickly establishing control over the village. They then captured the adjacent treelines and are now trying to advance through the forests and break through the Ukrainian defence at Zakitne. Additionally, the Russians advanced west from their new positions on the northern bank of the Siverskyi Donets River, and captured additional positions in the forests further west.\nTo the northwest, Russian forces advanced further through the forests west of Yampil and reached the Lyman - Siversk Highway. They then broke into the southern houses of Yampil, allowing for the rest of the village to be cleared. Fighting is now taking place for the strongpoints south and southwest of Yampil in the area of the highway. \nFurther northwest, following earlier failed attacks, Russian assault groups once again entered the Masliakivka District of Lyman and consolidated in its eastern half. Clearing operations continue in the western part of the district, and unsuccessful attacks took place on the neighbouring Kommunal'nyy District.\n+ ~24.50 km² in favour of Russia.",
      "timestamp": "2025-11-22T11:38:16.458975Z"
    },
    {
      "original": "Russian forces have captured the village of Zelenyi Hai, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~68.\nTotal land area; ~1.03 km².",
      "timestamp": "2025-11-22T11:38:16.458979Z"
    },
    {
      "original": "Russian forces have captured the village of Vysoke, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~517.\nTotal land area: ~0.89 km².",
      "timestamp": "2025-11-22T11:38:16.458984Z"
    },
    {
      "original": "Russian forces advanced east of Rive (Rovnoye), as the Myrnograd pocket continues to collapse slowly.",
      "timestamp": "2025-11-22T11:38:16.458987Z"
    },
    {
      "original": "Impunity in the Ukrainian Armed Forces: From Execution of Prisoners of War to Killing Their Own Soldiers\nVideo footage allegedly showing the execution of prisoners of war has been published in Ukrainian Telegram channels. The footage, captured from a drone and a trench, shows a group of soldiers in Ukrainian uniforms firing at an unarmed, kneeling man. The captive's clothing displays white bands, which are used by the Russian military for identification. The incident is presumed to have taken place in the Donetsk direction; however, the precise time, location, and further corroborating details are currently unavailable.\nThe deliberate killing of prisoners of war constitutes a gross violation of international humanitarian law, namely the Geneva Conventions and other international norms. There have been previous, non-isolated instances of Ukrainian military personnel killing Russian prisoners of war.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283695Z"
    },
    {
      "original": "Impunity in the Ukrainian Armed Forces: From Execution of Prisoners of War to Killing Their Own Soldiers\nVideo footage allegedly showing the execution of prisoners of war has been published in Ukrainian Telegram channels. The footage, captured from a drone and a trench, shows a group of soldiers in Ukrainian uniforms firing at an unarmed, kneeling man. The captive's clothing displays white bands, which are used by the Russian military for identification. The incident is presumed to have taken place in the Donetsk direction; however, the precise time, location, and further corroborating details are currently unavailable.\nThe deliberate killing of prisoners of war constitutes a gross violation of international humanitarian law, namely the Geneva Conventions and other international norms. There have been previous, non-isolated instances of Ukrainian military personnel killing Russian prisoners of war.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283711Z"
    },
    {
      "original": "New Russian Push Along Haichur Brings Huliapole Battle Closer (Videos)\nOn November 21, the Russian military expanded its control along the Haichur River in Dnepropetrovsk, moving closer to the key city of Huliapole in Zaporozhye.\nThe Vostok [West] Group of Forces took over Radisne which is located right on the Haichur in Dnepropetrovsk, some 20 kilometers to the north of Huliapole, according to the Russian Ministry of Defense.\nThe attack on Radisne was led by the 64th Guards Motorized Rifle Brigade, which managed to secure an area of up to 30 square kilometers along the Haichur in recent days including not only this settlement, but also nearby Nechaivka and farmlands up to the Danylivka to the north along the Yanchur River.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283721Z"
    },
    {
      "original": "New Russian Push Along Haichur Brings Huliapole Battle Closer (Videos)\nOn November 21, the Russian military expanded its control along the Haichur River in Dnepropetrovsk, moving closer to the key city of Huliapole in Zaporozhye.\nThe Vostok [West] Group of Forces took over Radisne which is located right on the Haichur in Dnepropetrovsk, some 20 kilometers to the north of Huliapole, according to the Russian Ministry of Defense.\nThe attack on Radisne was led by the 64th Guards Motorized Rifle Brigade, which managed to secure an area of up to 30 square kilometers along the Haichur in recent days including not only this settlement, but also nearby Nechaivka and farmlands up to the Danylivka to the north along the Yanchur River.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283730Z"
    },
    {
      "original": "A ‘Kill Count’ Incentive: How Ukraine’s Military Rewards System Led to a Surge in War Crimes \nThis is what the gamification of war leads to. From this side of the screen, war does not seem so terrible. The distance between opponents can lead to an exponential increase in cruelty.\nThe conflict in Ukraine is currently the most significant factor influencing the development of military science worldwide. Bloody battles have brought a whole new type of weapon to the fore: FPV (first-person view) drones. Advanced countries had previously been developing their own unmanned systems. However, this type of weapon had not previously been widely used. While the United States has used large strike drones in operations around the world, they have not achieved widespread use.\nThe ongoing war of attrition in Ukraine has forced the combatants to seek cheap, effective and mass-produced weapons. These have taken the form of tactical strike drones. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283739Z"
    },
    {
      "original": "A ‘Kill Count’ Incentive: How Ukraine’s Military Rewards System Led to a Surge in War Crimes \nThis is what the gamification of war leads to. From this side of the screen, war does not seem so terrible. The distance between opponents can lead to an exponential increase in cruelty.\nThe conflict in Ukraine is currently the most significant factor influencing the development of military science worldwide. Bloody battles have brought a whole new type of weapon to the fore: FPV (first-person view) drones. Advanced countries had previously been developing their own unmanned systems. However, this type of weapon had not previously been widely used. While the United States has used large strike drones in operations around the world, they have not achieved widespread use.\nThe ongoing war of attrition in Ukraine has forced the combatants to seek cheap, effective and mass-produced weapons. These have taken the form of tactical strike drones. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283749Z"
    },
    {
      "original": "UKRAINE'S MANPOWER CRISIS DEEPENS: AIRFIELD PERSONNEL FORCED TO THE FRONT LINES",
      "timestamp": "2025-11-22T11:38:17.283752Z"
    },
    {
      "original": "Russian Army Returns To Lyman: Ukraine Loses Yampol And Stavki \nRussian troops have  taken control of Yampol in the Lyman sector. Ukrainian units have carried out several counterattacks in the Gai and Sladkoye areas of the Zaporizhzhia sector. \nAdditionally, German Chancellor Friedrich Merz discussed the new American peace plan to resolve the conflict in Ukraine with US President Donald Trump.\nRead more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283763Z"
    },
    {
      "original": "Russian Army Returns To Lyman: Ukraine Loses Yampol And Stavki \nRussian troops have  taken control of Yampol in the Lyman sector. Ukrainian units have carried out several counterattacks in the Gai and Sladkoye areas of the Zaporizhzhia sector. \nAdditionally, German Chancellor Friedrich Merz discussed the new American peace plan to resolve the conflict in Ukraine with US President Donald Trump.\nRead more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283772Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From November 21, 2025\nOn November 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283779Z"
    },
    {
      "original": "Intense Airstrikes: Summary Of Russian Combat Footage From November 21, 2025\nOn November 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-22T11:38:17.283787Z"
    }
  ],
  "script_run_time": "2025-11-22T11:38:17.284601Z"
}