{
  "messages": [
    {
      "original": "Швидкісна ціль на прикордоння Сумщини.",
      "timestamp": "2025-11-09T22:45:15.983426Z"
    },
    {
      "original": "Ще швидкісні цілі на Сумщину!",
      "timestamp": "2025-11-09T22:45:15.983443Z"
    },
    {
      "original": "Ціль в напрямку Сум/н.п.Степанівка.",
      "timestamp": "2025-11-09T22:45:15.983448Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-11-09T22:45:15.983457Z"
    },
    {
      "original": "📢\nВідбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-09T22:45:15.983463Z"
    },
    {
      "original": "🛵\n Група БпЛА - на південний схід Харківщини.",
      "timestamp": "2025-11-09T22:45:15.983468Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-09T22:45:15.983472Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-09T22:45:15.983478Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Самара з північного сходу.",
      "timestamp": "2025-11-09T22:45:15.983483Z"
    },
    {
      "original": "🛵\n🛸\nНові групи БпЛА на межі Сумщини і Харківщини, курс - південний/південно-східний.",
      "timestamp": "2025-11-09T22:45:15.983489Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Самара з північного сходу.",
      "timestamp": "2025-11-09T22:45:15.983493Z"
    },
    {
      "original": "Змінив курс на Павлоград.",
      "timestamp": "2025-11-09T22:45:15.983496Z"
    },
    {
      "original": "Змінив курс на Павлоград.",
      "timestamp": "2025-11-09T22:45:15.983500Z"
    },
    {
      "original": "🛵\n БпЛА на півдні від Самара, постійно змінює напрямок руху.",
      "timestamp": "2025-11-09T22:45:15.983504Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на сході Київщини, курс - південно-західний.",
      "timestamp": "2025-11-09T22:45:15.983509Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Харківщині в напрямку н.п.Великий Бурлук з півночі.",
      "timestamp": "2025-11-09T22:45:15.983515Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині в напрямку н.п.Васильківка.",
      "timestamp": "2025-11-09T22:45:15.983519Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К",
      "timestamp": "2025-11-09T22:45:15.983527Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на півночі Сумщини в напрямку Мени",
      "timestamp": "2025-11-09T22:45:15.983532Z"
    },
    {
      "original": "Ракета на Київ!",
      "timestamp": "2025-11-09T22:45:15.983537Z"
    },
    {
      "original": "🚀\nШвидкісні цілі на півночі Сумщини в напрямку Мени",
      "timestamp": "2025-11-09T22:45:15.983541Z"
    },
    {
      "original": "Продовжує рух на Київ!",
      "timestamp": "2025-11-09T22:45:15.983544Z"
    },
    {
      "original": "Продовжує рух на Київ!",
      "timestamp": "2025-11-09T22:45:15.983547Z"
    },
    {
      "original": "Ракета продовжує рух в напрямку Житомира",
      "timestamp": "2025-11-09T22:45:15.983550Z"
    },
    {
      "original": "Київ, Житомир - в укриття!!",
      "timestamp": "2025-11-09T22:45:15.983553Z"
    },
    {
      "original": "Ракета продовжує рух в напрямку Житомира",
      "timestamp": "2025-11-09T22:45:15.983557Z"
    },
    {
      "original": "Ракета продовжує рух на Хмельниччину!",
      "timestamp": "2025-11-09T22:45:15.983560Z"
    },
    {
      "original": "Старкон - в укриття!",
      "timestamp": "2025-11-09T22:45:15.983565Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, over the past five days Russian forces have continued their offensive operations, capturing new positions in several different areas. \nIn the north, Russian forces advanced from positions east of Oleksivika towards Orestopil, establishing control over two separate treelines and some nearby forest plantations. DRGs were able to enter the residential part of Orestopil. \nTo the southwest, the Russians continued expanding their zone of control around Zlahoda. They advanced down two perpendicular treelines south and southwest of the village, capturing new positions there. \nTo the south, after securing the central part of Uspenivka, Russian forces managed to capture the rest of the village, along with the agricultural buildings on its southern outskirts. They then crossed the Yanchur River at a new point from Pryvilne, and began advancing down a gulley and adjacent treelines towards Solodke. Russian soldiers quickly captured Solodke due to a lack of Ukrainian manpower in the area and consolidated in the treelines to the east.\nTo the southeast, the Russians advanced south and downhill from Uspenivka towards Nove, capturing positions in several different treelines and entering the village. Other forces advanced towards Novouspenivske from the southeast, crossing a gulley and capturing a forest along with nearby treeline positions to the north, northeast and south. As a result, any remaining Ukrainian soldiers still stationed west of Okhotnyche withdrew further west, allowing for the Russians to establish control over the treelines west of the Yanchur River there.\nFurther south, Russian forces continued to slowly advance west of Malynivka. They captured the rest of the gulley leading west from the village and secured new positions in two separate treelines, therefore reaching the eastern outskirts of Zelenyi Hai.\n+ ~30.98 km² in favour of Russia.",
      "timestamp": "2025-11-09T22:45:16.671465Z"
    },
    {
      "original": "Fun fact that a lot of people need to hear: both sides advance in Ukraine. \nJust because the side you don't support makes progress, it doesn't automatically mean its fake or cope, even though one country obviously advances more than the other.",
      "timestamp": "2025-11-09T22:45:16.671485Z"
    },
    {
      "original": "Ukrainian source Deepstate has provided some additional information regarding the deteriorating situation for Ukraine in the Hulyaipole and Pokrovsk'e directions. This, along with some information from other sources allows for us to paint a clearer picture of the events that unfolded here over the past 10 days. \nThey report that 50% of the Ukrainian soldiers defending the area of Uspenivka were withdrawn to improve the deteriorating situation near Vyshneve. At the time, Russia had quickly captured this relatively large village, crossed two rivers, and were advancing well beyond it to the north and west. These reinforcements somewhat stabilised the situation there, but it left a large gap in the defence of the Uspenivka area.\nAs a result, at least 200 Russian soldiers from the 14th Guards Spetsnaz Brigade, 218th Tank Regiment, and the 394th Motorized Rifle Brigade were able to enter Uspenivka, and bring it under their control relatively quickly. The 394th brigade consolidated in the village while the 14th brigade and 218th regiment began pushing to the nearby villages of Nove, Novouspenivske, Solodke, and Rivnopillya. \nIn order to try save the situation, one unspecified battalion of Ukraine's 102nd Territorial Defence Brigade was deployed to Uspenivka, but suffered heavy casualties due to Russia having already brought in significant reinforcements to the village, and just because of the fact that the battalion was low on manpower. \nA severe lack of coordination in cohesion in this sector, along with commanders not accurately reporting the situation to headquarters or neighbouring units, is partially responsible for these rapid losses in ground that should have been able to hold for some time. Critical manpower shortages also play a major role in this. These levels of incompetence, shortages, and inability to coordinate properly are beyond anything I have ever seen for Ukraine so far. \nAs a result of this chain of events over the past 10 days, Russia has been able to fully compromise Ukrainian defences on the western bank of the Yanchur River and is now pushing through the fields further west. Fighting is ongoing for the villages of Nove, Novouspenivske, and Rivnopillya, while Solodke was captured a few days ago. Rybne is also under threat of being encircled due to Russian advances near Zlahoda and Solodke, and all the while, the newly reinforced front further north is still not stabilised.",
      "timestamp": "2025-11-09T22:45:16.671494Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T22:45:16.671498Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T22:45:16.671502Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n 1 was killed in the israeli drone strike that targeted Kherbet Selm.\n@wfwitness",
      "timestamp": "2025-11-09T22:45:16.671510Z"
    },
    {
      "original": "Russian FPV drones continue to fly relatively freely over Kramatorsk, Donetsk Oblast. Interestingly, this video shows that Ukraine has begun constructing trenches in the city park.",
      "timestamp": "2025-11-09T22:45:16.671513Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T22:45:16.671517Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T22:45:16.671520Z"
    },
    {
      "original": "Last night, at least 7 Russian Geran-2 drones attacked energy infrastructure in the city of Lozova, Kharkiv Oblast. Power outages occurred as a result. A Grom-E1 rocket-powered glide-bomb also impacted the city, although it's unclear if it also targeted energy infrastructure. \nMeanwhile, due to previous missile and drone strikes in Kharkiv City, large parts of the city remain without power.",
      "timestamp": "2025-11-09T22:45:16.671525Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T22:45:16.671529Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T22:45:16.671533Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T22:45:16.671537Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T22:45:16.671543Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T22:45:16.671548Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T22:45:16.671552Z"
    },
    {
      "original": "Russian forces have captured the village of Rybne, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~50.\nTotal land area: ~0.62 km².",
      "timestamp": "2025-11-09T22:45:16.671556Z"
    },
    {
      "original": "While everyone focuses on Pokrovsk, the situation in the Hulyaipole direction continues to deteriorate even further for Ukraine. \nRussia is advancing to new areas while facing minimal resistance and is now approaching the rear of Hulyaipole itself.",
      "timestamp": "2025-11-09T22:45:16.671562Z"
    },
    {
      "original": "Regarding the Myrnohrad pocket, I think a lot of people are significantly overestimating the number of Ukrainian soldiers encircled there.\nMyrnohrad is a big city, and when you include its surroundings there are a lot of other positions to hold. But Ukraine has become increasingly reliant on drones, often spreading infantry very thin across lines, creating a disorganised and often incoherent ground defence. Myrnohrad is an example of this, and there are a lot of nearby settlements that are good for concentrations of drone operators. \nAdditionally, many Ukrainian soldiers actually escaped this pocket back when it was still a salient. This is what allowed for Russia to penetrate deeper into the northern and southern parts of the city. \nFor an area of its size, with a significantly reduced garrison, I estimate that there are anywhere between 300 and 700 Ukrainian soldiers currently trapped there. It's impossible to know how many right now, but with the state the war is in today and other patterns observed from this front, it will be less than many people expect.",
      "timestamp": "2025-11-09T22:45:16.671567Z"
    },
    {
      "original": "Large-Scale Destruction Of Ukraine's Energy Infrastructure Is Complicating Repair Efforts And Causing Blackouts\nRussia and Ukraine continued exchanging strikes on the night of November 8-9. According to the Russian Ministry of Defense, Russian air defense forces destroyed 44 Ukrainian unmanned aerial vehicles (UAVs). The Ukrainian Air Force stated that Russian forces launched 69 UAVs, of which 34 were shot down or suppressed.\nThe First Deputy Minister of Energy of Ukraine, Artem Nekrasov, said that the repair of Ukraine's power generation infrastructure is significantly hampered due to large-scale destruction. All thermal power plants (TPPs) of the state-owned company «Centrenergo», which until recently accounted for about 18% of the country's total generation, have ceased operation. Nekrasov noted:\n«There is a power deficit, and spare parts are lacking. Under these conditions, hourly power outages are inevitable, and they have already been introduced in most regions...»\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.277969Z"
    },
    {
      "original": "Large-Scale Destruction Of Ukraine's Energy Infrastructure Is Complicating Repair Efforts And Causing Blackouts\nRussia and Ukraine continued exchanging strikes on the night of November 8-9. According to the Russian Ministry of Defense, Russian air defense forces destroyed 44 Ukrainian unmanned aerial vehicles (UAVs). The Ukrainian Air Force stated that Russian forces launched 69 UAVs, of which 34 were shot down or suppressed.\nThe First Deputy Minister of Energy of Ukraine, Artem Nekrasov, said that the repair of Ukraine's power generation infrastructure is significantly hampered due to large-scale destruction. All thermal power plants (TPPs) of the state-owned company «Centrenergo», which until recently accounted for about 18% of the country's total generation, have ceased operation. Nekrasov noted:\n«There is a power deficit, and spare parts are lacking. Under these conditions, hourly power outages are inevitable, and they have already been introduced in most regions...»\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.277987Z"
    },
    {
      "original": "Military Situation In Ukraine On November 9, 2025 (Maps Update)",
      "timestamp": "2025-11-09T22:45:17.277992Z"
    },
    {
      "original": "Military Situation In Ukraine On November 9, 2025 (Maps Update)",
      "timestamp": "2025-11-09T22:45:17.277997Z"
    },
    {
      "original": "Drugs & Drones: The Cartelization Of The Ukrainian Front\nSince the intensification of hostilities across eastern Ukraine, a disturbing transformation has taken place within the country’s armed forces. What was once presented as a national resistance effort supported by ideologically motivated foreign volunteers has increasingly given way to a fragmented, crisis-driven force reliant on irregular fighters with deep ties to transnational organized crime. Among the most consequential is the presence of operatives linked to Latin American drug cartels operating within Ukraine’s International Legion.\nThese individuals are active participants in some of the Western Hemisphere’s most violent criminal syndicates, including Colombia’s Clan del Golfo and Mexico’s Sinaloa and Jalisco Nueva Generación cartels. Their recruitment is coordinated through Segurcol Ltd., a private military entity headquartered in Medellín, which serves as the central hub for channeling cartel-affiliated personnel...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278006Z"
    },
    {
      "original": "Drugs & Drones: The Cartelization Of The Ukrainian Front\nSince the intensification of hostilities across eastern Ukraine, a disturbing transformation has taken place within the country’s armed forces. What was once presented as a national resistance effort supported by ideologically motivated foreign volunteers has increasingly given way to a fragmented, crisis-driven force reliant on irregular fighters with deep ties to transnational organized crime. Among the most consequential is the presence of operatives linked to Latin American drug cartels operating within Ukraine’s International Legion.\nThese individuals are active participants in some of the Western Hemisphere’s most violent criminal syndicates, including Colombia’s Clan del Golfo and Mexico’s Sinaloa and Jalisco Nueva Generación cartels. Their recruitment is coordinated through Segurcol Ltd., a private military entity headquartered in Medellín, which serves as the central hub for channeling cartel-affiliated personnel...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278014Z"
    },
    {
      "original": "Ukrainian Troops Encircled near Pokrovsk: Testimonies from Prisoners\nThe situation on the Pokrovsk (Krasnoarmeysk) direction is characterized by a significant operational pressure from Russian troops. Despite statements from the Commander-in-Chief of the Ukrainian Armed Forces, Alexander Syrsky, about the existence of various action plans, including contingency options, and assurances that the situation is under control, incoming reports indicate a tightening encirclement. \nEstimates suggest that several dozen Ukrainian Armed Forces battalions, totaling up to two thousand personnel, have been trapped in the Pokrovsk area. All routes for safe withdrawal have reportedly been blocked, and attempts to organize supplies or redeploy reinforcements have been unsuccessful.\nUkrainian servicemen caught in these conditions are forced to lay down their arms and surrender to Russian military personnel. These decisions are driven by a complete lack of food, medicine, and hope for support.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278023Z"
    },
    {
      "original": "Ukrainian Troops Encircled near Pokrovsk: Testimonies from Prisoners\nThe situation on the Pokrovsk (Krasnoarmeysk) direction is characterized by a significant operational pressure from Russian troops. Despite statements from the Commander-in-Chief of the Ukrainian Armed Forces, Alexander Syrsky, about the existence of various action plans, including contingency options, and assurances that the situation is under control, incoming reports indicate a tightening encirclement. \nEstimates suggest that several dozen Ukrainian Armed Forces battalions, totaling up to two thousand personnel, have been trapped in the Pokrovsk area. All routes for safe withdrawal have reportedly been blocked, and attempts to organize supplies or redeploy reinforcements have been unsuccessful.\nUkrainian servicemen caught in these conditions are forced to lay down their arms and surrender to Russian military personnel. These decisions are driven by a complete lack of food, medicine, and hope for support.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278031Z"
    },
    {
      "original": "A Breach In The Ukrainian Defense: Capture Of Rybne Village Allows Key Fortifications To Be Bypassed From The North\nThe Russian army has taken control of the suburban area of Dinas in the Pokrovsk sector. Units of the Russian 37th Motorised Rifle Brigade have taken control of the village of Rybne.The United States has suspended shipments of weapons to NATO allies worth more than five billion dollars due to the government shutdown.\nMain combat operations are ongoing on the northern outskirts of Pokrovsk. The suburban area of Dinas has fallen under the control of Russian forces. Russian forces advancing towards the village of Rivne have tightened the squeeze on Ukrainian units by Rodynske area.\nRussian «Centre» units continue to fight in the northwestern part of Pokrovsk, near the «8th Group», where Ukrainian forces are carrying out counterattacks. To the north, units advancing from Rodynske and Krasnyi Lyman have advanced approximately 5 km along the Rodynske-Pokrovsk road. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278040Z"
    },
    {
      "original": "A Breach In The Ukrainian Defense: Capture Of Rybne Village Allows Key Fortifications To Be Bypassed From The North\nThe Russian army has taken control of the suburban area of Dinas in the Pokrovsk sector. Units of the Russian 37th Motorised Rifle Brigade have taken control of the village of Rybne.The United States has suspended shipments of weapons to NATO allies worth more than five billion dollars due to the government shutdown.\nMain combat operations are ongoing on the northern outskirts of Pokrovsk. The suburban area of Dinas has fallen under the control of Russian forces. Russian forces advancing towards the village of Rivne have tightened the squeeze on Ukrainian units by Rodynske area.\nRussian «Centre» units continue to fight in the northwestern part of Pokrovsk, near the «8th Group», where Ukrainian forces are carrying out counterattacks. To the north, units advancing from Rodynske and Krasnyi Lyman have advanced approximately 5 km along the Rodynske-Pokrovsk road. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T22:45:17.278049Z"
    }
  ],
  "script_run_time": "2025-11-09T22:45:17.278990Z"
}