{
  "messages": [
    {
      "original": "🛵\n БпЛА курсом на Васильків.",
      "timestamp": "2025-10-12T11:26:12.193026Z"
    },
    {
      "original": "🛵\n Загроза застосування ударних БпЛА по Кам'янському та Криворізькому районах Дніпропетровщини.",
      "timestamp": "2025-10-12T11:26:12.193046Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Запоріжжя! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-12T11:26:12.193054Z"
    },
    {
      "original": "🛵\n БпЛА на схід від Білої Церкви, курсом на місто.",
      "timestamp": "2025-10-12T11:26:12.193059Z"
    },
    {
      "original": "🛵\n Ударний БпЛА з півдня Дніпропетровщини на Миколаївщину.",
      "timestamp": "2025-10-12T11:26:12.193063Z"
    },
    {
      "original": "🛵\n Київська область та м. Київ - загроза застосування ворожих БПЛА.\n⚡\n Залучено засоби для їх збиття.",
      "timestamp": "2025-10-12T11:26:12.193070Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-12T11:26:12.193078Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Дніпропетровщині та Запоріжжі.",
      "timestamp": "2025-10-12T11:26:12.193082Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-12T11:26:12.193086Z"
    },
    {
      "original": "⚠\n Увага!\nРакетна небезпека на Херсонщині по розвідувальному БпЛА!",
      "timestamp": "2025-10-12T11:26:12.193093Z"
    },
    {
      "original": "🚀\nПуски КАБ на сході Запоріжжя в напрямку півдня Дніпропетровщини(н.п. Новомиколаївка)",
      "timestamp": "2025-10-12T11:26:12.193099Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-12T11:26:12.193105Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини, курсом на південь.\n🛵\n БпЛА на півдні Кіровоградщини, курсом на захід.",
      "timestamp": "2025-10-12T11:26:12.193111Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА в центрі Сумщини, курсом на н.п. Миколаївка.",
      "timestamp": "2025-10-12T11:26:12.193116Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова з півночі!",
      "timestamp": "2025-10-12T11:26:12.193120Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на схід від Сум, курсом на північ.",
      "timestamp": "2025-10-12T11:26:12.193125Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини та заході Сумщини, курсом на південь.",
      "timestamp": "2025-10-12T11:26:12.193129Z"
    },
    {
      "original": "🛵\n БпЛА західніше Харкова, курсом на південь.",
      "timestamp": "2025-10-12T11:26:12.193133Z"
    },
    {
      "original": "🛵\n БпЛА на схід від Харкова, курсом на південно-західний напрямок.",
      "timestamp": "2025-10-12T11:26:12.193137Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T11:26:12.193143Z"
    },
    {
      "original": "Id like to make some general predictions regarding the future of Pokrovsk and its corresponding front. I've colour coded red as the first step of Russian advances, purple as the 2nd step and pink as the 3rd step. Ukrainian withdrawal is represented by blue and future Russian advances by orange. The first and most critical step for Russian forces is to seize the coal mine north of Udachnoye. This will serve as a critical base for Russian attacks to both Sergeyevka and Grishino. Once Russia secures the coal mine and consolidates, they can move NE to cut the E50 highway and put the O0525 under fire control. This will be in sync with russia taking Rodinskoye, allowing them to launch attacks and pressure the remaining routes into the city from both the SW and NE. Inevitably, the AFU will be forced to withdraw to more defensible positions by leaving Lysovka, Sukhyy Yar and Promon. (1/2)",
      "timestamp": "2025-10-12T11:26:12.852726Z"
    },
    {
      "original": "Once the E50 and O0525 are cut, Pokrovsk will fall along with Grishino in Avdeyevka style fashion. From here, a very much Ocheretino-style push will occur, with Russian forces essentially steamrolling northeast to Dobropellya and Slavyanka. In the long term, by developing a significant breach of the final AFU defensive line, Russian forces will be able to sweep behind Kramatorsk and Druzhkovka, finally collapsing the Donbass. This post serves to educate people on how truly strategically crucial Pokrovsk is. (2/2)",
      "timestamp": "2025-10-12T11:26:12.852738Z"
    },
    {
      "original": "Id like to make some general predictions regarding the future of Pokrovsk and its corresponding front. I've colour coded red as the first step of Russian advances, purple as the 2nd step and pink as the 3rd step. Ukrainian withdrawal is represented by blue…",
      "timestamp": "2025-10-12T11:26:12.852743Z"
    },
    {
      "original": "We can't forget about the Kucheriv Yar salient either. Now that it has been largely secured, it could form a northeastern flank for Dobropillya once Pokrovsk falls",
      "timestamp": "2025-10-12T11:26:12.852746Z"
    },
    {
      "original": "Russian FPV drones must be hunting out NAFO vehicles at this point. \nPriority targets",
      "timestamp": "2025-10-12T11:26:12.852751Z"
    },
    {
      "original": "Russian FPV drones must be hunting out NAFO vehicles at this point.   Priority targets",
      "timestamp": "2025-10-12T11:26:12.852754Z"
    },
    {
      "original": "I kinda feel bad for the poor nafos funding these vehicles.\nThey should really be putting that money into humanitarian aid, or teams like white angels who are rescuing civilians from frontline areas.",
      "timestamp": "2025-10-12T11:26:12.852758Z"
    },
    {
      "original": "The city of Chuhuiv in Kharkiv Oblast came under attack from Russian Geran-2 drones for the second night in a row. 3-4 impacts were recorded within the city limits. The target is currently unknown.",
      "timestamp": "2025-10-12T11:26:12.852761Z"
    },
    {
      "original": "The city of Chuhuiv in Kharkiv Oblast came under attack from Russian Geran-2 drones for the second night in a row. 3-4 impacts were recorded within the city limits. The target is currently unknown.",
      "timestamp": "2025-10-12T11:26:12.852765Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continue to advance and have made additional progress in the village of Poltavka.\nAfter securing the whole eastern bank of the Yanchur River in this sector, Russian forces crossed the river at the bridge, and entered the eastern houses of the main part of Poltavka. They were able to consolidate their initial bridgehead, and expand outwards, pushing northwest to the village administrative building, and south to the two 3-story buildings and surrounding houses. \nMLRS and artillery shelling is targeting the remaining Ukrainian positions in the village, and in the last couple of days, the southern part of the settlement has moved into the grey zone. \n+ ~1.07 km² in favour of Russia.",
      "timestamp": "2025-10-12T11:26:12.852771Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to advance, and have made significant progress in two areas.\nIn the southwest, Russian forces consolidated their positions in the treelines west of Stepove, and began infiltrating north towards the village of Oleksiivka. Despite Ukrainian FPV drone coverage, they were able to secure the southern part of the settlement as other forces began consolidating in the three parallel treelines to the south/southeast. \nIn the northeast, after the Ukrainian counterattacks last week, Russian forces began reversing the Ukrainian progress. They re-entered Sichneve from the east, securing the eastern houses, and began advancing through the treelines south and southwest of the village. They also pushed west through the gulley in the grey zone to Novoselivka, and branched off down two separate treelines to the north and south, reaching the orchards just outside Novoselivka, while approaching the southern bank of the Vovcha River. \nAs a result of these advances, any remaining Ukrainian forces in Sichneve have been operationally encircled (this is the second time this has happened in this village). Also, the situation was clarified north of Sichneve, with Russian forces retaining control over treeline positions there, despite my earlier reports stating that they were in the grey-zone/under Ukrainian control.\n+ ~19.28 km² in favour of Russia.",
      "timestamp": "2025-10-12T11:26:12.852778Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces resumed their assault operations and have completed the capture of the village of Filiya. \nAfter initially crossing the Vovcha River and entrenching in the southern part of the village in late August, the frontline stabilised here. However, over the past 5 days, Russian forces began attacking again, and have managed to push the Ukrainians out of the northern part of the village. \nThey also began advancing into the adjacent forests, approaching the main Ukrainian trench fortification to the north, and have secured new positions in the treelines east and northeast of Filiya.\n+ ~4.48 km² in favour of Russia.",
      "timestamp": "2025-10-12T11:26:12.852783Z"
    },
    {
      "original": "General update from the Pakistan-Afghanistan conflict:\nOver the past 24 hours, fighting erupted between Pakistani and Afghan Taliban forces along the Pakistan-Afghanistan international border following the Pakistani Airforce's strikes against Tehrik-i-Taliban Pakistan (TTP). The clashes involved light weapons, mortar shelling, artillery shelling, tanks, and ATGM strikes. Several Taliban army posts were destroyed, and at least two captured by Pakistani soldiers. \nThe Pakistani Airforce has also continued to strike targets within Afghanistan, primarily against border regions. Both sides entered negotiations after the Afghan Taliban requested a ceasefire, but Pakistan rejected and fighting continued. \nOver the past half hour, the Pakistani Airforce carried out a new round of strikes on Kandahar Province of Afghanistan, reportedly targeting a TTP training centre, as well as an Afghan Taliban HQ. Artillery shelling has also continued in the Nangrahar Province.",
      "timestamp": "2025-10-12T11:26:12.852789Z"
    },
    {
      "original": "Exclusive info from the Russian missile and drone strike on the Dnipro Hydroelectric Powerplant in Zaporizhzhia City on October 10:\nThe second machine hall was completely destroyed, while the first machine hall was undamaged. Additionally, one of the surge gates for the HPP has been opened, reducing the water level. \nAs a result of the damage to the plant, all power generation has been halted and is not yet restored. The images below show what the HPP looked like earlier today.",
      "timestamp": "2025-10-12T11:26:12.852793Z"
    },
    {
      "original": "Exclusive info from the Russian missile and drone strike on the Dnipro Hydroelectric Powerplant in Zaporizhzhia City on October 10:\nThe second machine hall was completely destroyed, while the first machine hall was undamaged. Additionally, one of the surge gates for the HPP has been opened, reducing the water level. \nAs a result of the damage to the plant, all power generation has been halted and is not yet restored. The images below show what the HPP looked like earlier today.",
      "timestamp": "2025-10-12T11:26:12.852798Z"
    },
    {
      "original": "Large and unusual movements of Russian Tu-160 strategic bombers is taking place. \n2 Tu-160Ms redeployed from Anadyr Airbase, Chukotka Autonomous Okrug, to Ukrainka Airbase, Amur Oblast.\n1 Tu-160 redeployed from Borisoglebskoye Airbase, Republic of Tatarstan, to Ukrainka Airbase, Amur Oblast.\n1 Tu-160 is airborne from Engels-2 Airbase, either training or redeploying.\nIt's unclear if the 3 Tu-160s that redeployed to Ukrainka Airbase will be equipped with Kh-101 cruise missiles.",
      "timestamp": "2025-10-12T11:26:12.852804Z"
    },
    {
      "original": "General update from the Pakistan-Afghanistan conflict:  Over the past 24 hours, fighting erupted between Pakistani and Afghan Taliban forces along the Pakistan-Afghanistan international border following the Pakistani Airforce's strikes against Tehrik-i-Taliban…",
      "timestamp": "2025-10-12T11:26:12.852807Z"
    },
    {
      "original": "The Pakistani Airforce published footage showing two of their recent airstrikes on the Afghan Taliban's \"Ismatullah Qarar\" Camp in the city of Spin Buldak, Kandahar Province, Afghanistan.\nCoordinates: 30.98492, 66.34785",
      "timestamp": "2025-10-12T11:26:12.852811Z"
    },
    {
      "original": "The Pakistani Airforce published footage showing two of their recent airstrikes on the Afghan Taliban's \"Ismatullah Qarar\" Camp in the city of Spin Buldak, Kandahar Province, Afghanistan.\nCoordinates: 30.98492, 66.34785",
      "timestamp": "2025-10-12T11:26:12.852815Z"
    },
    {
      "original": "In the Dobropillya direction, and on the northeastern flank of Pokrovsk, Russian forces intensified their assault operations and have made major progress over the past 10 days.\nIn the northeast, at the beginning of October, Russian forces began a concerted effort to regain control over the tactical heights southeast of Volodymyrivka which Ukrainian forces recaptured last month. They began advancing northwest up a gulley and towards the southern bank of the Staryy Reservoir, capturing the treelines between them. These advances, alongside the clearing of the northern street of Novotoretske, forced the AFU to fully withdraw back into Volodymyrivka. \nAt the same time, Russian forces were able to push the Ukrainians back from their forward positions on the western approaches to Poltavka, clearing the northernmost chalk quarry and surrounding positions. They then began attacks through the treelines and forest plantations to the eastern bank of the Staryy Reservoir. \nWith these attacks now complete, under the cover of the fog and rain, two large Russian mechanised columns involving tanks and armoured personnel carriers advanced on Volodymyrivka. The first moved in from the south, advancing up the road and reaching the southern edge of the village. A portion of the vehicles were hit and disabled by Ukrainian FPV drones, however more than 50 Russian soldiers were able to dismount and scatter among the southern part of Volodymyrivka. With the remaining vehicles being able to retreat, these Russian soldiers began clearing the rest of the settlement and captured its central part. The rest of the village is now either in the grey zone, or under Russian control. \nThe second mechanised column advanced down the road from Poltavka towards the rear of Volodymrivka. While more of the vehicles in this column were hit and disabled (with many being hit before reaching the frontline), a number of Russian soldiers were able to dismount and establish control over the forest plantations east of Volodymyrivka, effectively pushing the AFU back into the stronghold village of Shakhove.\nMeanwhile, west of the Kazenyi Torets River, Russian forces were able to consolidate in the southern and central parts of Pankivka, pushing the Ukrainians back into Shakhove. They also improved their positions along the forest plantations towards Shakhove from the west.\nTo the southwest, Russian forces were able to break out of northern Zatyshok, where they established control over the treelines north of the village which were previously in the grey zone. They also re-established control over the central part of Boikivka, as well as the forest plantations and trench fortifications to the west. Additionally, the Russians launched a series of counterattacks from eastern Nykanorivka, recapturing previously lost positions in the northwest of the village, before eventually fully pushing the AFU out of the settlement. With this, Russia was able to eliminate the salient to Boikivka, and have now secured their Kucheriv Yar salient against any Ukrainian encirclement attempts. \nIn the south, Russian forces continued their attacks towards the city of Myrnohrad from the east. They consolidated their positions in the southern part of Novoekonomichne, and began advancing through the forests and treelines towards the village of Balahan. Russian soldiers have entered Balahan, although no consolidation is confirmed yet. Russian infantry was also able to advance from positions west of Mykhailivka, infiltrating and capturing a trench strongpoint and mine shaft no. 2 of the Kapitalna Mine.\n+ ~59.23 km² in favour of Russia.",
      "timestamp": "2025-10-12T11:26:12.852825Z"
    },
    {
      "original": "In the Dobropillya direction, and on the northeastern flank of Pokrovsk, Russian forces intensified their assault operations and have made major progress over the past 10 days.  In the northeast, at the beginning of October, Russian forces began a concerted…",
      "timestamp": "2025-10-12T11:26:12.852828Z"
    },
    {
      "original": "But don't worry - most Pro-Ukrainian maps still have thousands of desperate Russian soldiers encircled in three massive pockets in this direction.",
      "timestamp": "2025-10-12T11:26:12.852831Z"
    },
    {
      "original": "Deepstate has just transferred most of Kupyansk City west of the Oskil River into their dreaded grey-zone.",
      "timestamp": "2025-10-12T11:26:12.852834Z"
    },
    {
      "original": "North Korea Copied American HIMARS Launcher (Photos)\nNorth Korea showcased a multiple rocket launch system with a design similar to the United States’ M142 HIMARS at a military parade on October 10, as it marked 80 years of the ruling Workers’ Party of Korea.\nThe official Korean Central News Agency shared two photos showing at least six of the new launcher marching through Pyongyang during the parade, without revealing its name or any of its characteristics.\nRead more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498703Z"
    },
    {
      "original": "North Korea Copied American HIMARS Launcher (Photos)\nNorth Korea showcased a multiple rocket launch system with a design similar to the United States’ M142 HIMARS at a military parade on October 10, as it marked 80 years of the ruling Workers’ Party of Korea.\nThe official Korean Central News Agency shared two photos showing at least six of the new launcher marching through Pyongyang during the parade, without revealing its name or any of its characteristics.\nRead more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498721Z"
    },
    {
      "original": "Russia Strikes Ukraine’s Fuel And Energy Infrastructure While Zelensky Searches For Culprits\nThe parties to the conflict continued to exchange strikes on October 10–11, with Russian strikes again focused on facilities of Ukraine's fuel, energy, and transport infrastructure. Following the massive attacks in previous days, Ukrainian President Volodymyr Zelenskyy, in a statement concerning damage to Kyiv's TPP-5 and TPP-6, implied blame on Kyiv Mayor Vitali Klitschko for insufficient protection of the facilities.\n\"If we take Kyiv, there is TPP-5 and TPP-6. The issue is not only about air defense. We cannot use Patriot missiles against drones. What questions could there be for the mayor? I could say what I think about all this right now, but I won’t, because the war is the same for all of us. Therefore, I will not make negative comments about those people who are simply incapable of doing anything,\" he stated.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498731Z"
    },
    {
      "original": "Russia Strikes Ukraine’s Fuel And Energy Infrastructure While Zelensky Searches For Culprits\nThe parties to the conflict continued to exchange strikes on October 10–11, with Russian strikes again focused on facilities of Ukraine's fuel, energy, and transport infrastructure. Following the massive attacks in previous days, Ukrainian President Volodymyr Zelenskyy, in a statement concerning damage to Kyiv's TPP-5 and TPP-6, implied blame on Kyiv Mayor Vitali Klitschko for insufficient protection of the facilities.\n\"If we take Kyiv, there is TPP-5 and TPP-6. The issue is not only about air defense. We cannot use Patriot missiles against drones. What questions could there be for the mayor? I could say what I think about all this right now, but I won’t, because the war is the same for all of us. Therefore, I will not make negative comments about those people who are simply incapable of doing anything,\" he stated.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498740Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498747Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498755Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T11:26:13.498761Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T11:26:13.498768Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498777Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T11:26:13.498786Z"
    }
  ],
  "script_run_time": "2025-10-12T11:26:13.499771Z"
}