{
  "messages": [
    {
      "original": "🚀\nКрилаті ракети на Одещині, курсом на південь Вінниччини.",
      "timestamp": "2025-09-10T03:35:12.037535Z"
    },
    {
      "original": "Курсом на  Київщину.",
      "timestamp": "2025-09-10T03:35:12.037550Z"
    },
    {
      "original": "Курсом на Вінниччину!",
      "timestamp": "2025-09-10T03:35:12.037554Z"
    },
    {
      "original": "🚀\nКрилаті ракети на півночі Київщини, курсом на південно-західний напрямок!",
      "timestamp": "2025-09-10T03:35:12.037560Z"
    },
    {
      "original": "🚀\nКрилаті ракети на півночі та на півдні Вінниччини , курсом на захід.",
      "timestamp": "2025-09-10T03:35:12.037565Z"
    },
    {
      "original": "🚀\nКрилата ракета в напрямку Києва , перебувайте в укриттях!",
      "timestamp": "2025-09-10T03:35:12.037569Z"
    },
    {
      "original": "🛵\n З східного напрямку на Вінницю ударний БпЛА.",
      "timestamp": "2025-09-10T03:35:12.037573Z"
    },
    {
      "original": "🚀\nКрилата ракета на сході Житомирщини, курсом на південь.",
      "timestamp": "2025-09-10T03:35:12.037577Z"
    },
    {
      "original": "🚀\nКрилата ракета в напрямку Вінниці , перебувайте в укриттях!",
      "timestamp": "2025-09-10T03:35:12.037585Z"
    },
    {
      "original": "🚀\nКрилата ракета в напрямку Житомира , перебувайте в укриттях!",
      "timestamp": "2025-09-10T03:35:12.037590Z"
    },
    {
      "original": "🚀\nКрилаті ракети на сході Хмельниччини , курсом на захід.",
      "timestamp": "2025-09-10T03:35:12.037607Z"
    },
    {
      "original": "Житомир в укриття!",
      "timestamp": "2025-09-10T03:35:12.037611Z"
    },
    {
      "original": "🚀\nКрилаті ракети на сході Житомирщини, курсом на захід, в напрямку Житомира!",
      "timestamp": "2025-09-10T03:35:12.037615Z"
    },
    {
      "original": "🚀\nКрилаті ракети на півдні Хмельниччини, курсом на захід, на Тернопільщину!",
      "timestamp": "2025-09-10T03:35:12.037619Z"
    },
    {
      "original": "🚀\nКрилата ракета в центрі Хмельниччини, курсом на південно-західний напрямок.",
      "timestamp": "2025-09-10T03:35:12.037624Z"
    },
    {
      "original": "🚀\nКрилаті ракети через Житомир, північніше!",
      "timestamp": "2025-09-10T03:35:12.037628Z"
    },
    {
      "original": "🚀\nКрилаті ракети на Тернопільщині, курсом на захід, в напрямку Івано-Франківщини.",
      "timestamp": "2025-09-10T03:35:12.037632Z"
    },
    {
      "original": "🚀\nКрилаті ракети на півночі Івано-Франківщини, курсом на захід.",
      "timestamp": "2025-09-10T03:35:12.037639Z"
    },
    {
      "original": "Вінниця в укриття!",
      "timestamp": "2025-09-10T03:35:12.037642Z"
    },
    {
      "original": "🚀\nКрилаті ракети на півночі Івано-Франківщини, курсом на захід на Львівщину, на  Жидачів!",
      "timestamp": "2025-09-10T03:35:12.037648Z"
    },
    {
      "original": "Курсом на Львів, перебувайте в укриттях",
      "timestamp": "2025-09-10T03:35:12.037652Z"
    },
    {
      "original": "In the Kostyantynivka direction, both Russian and Ukrainian forces have advanced, with Russian forces making important progress towards Nelipivka.\nAfter consolidating in the area of the Terykon, Russian forces began attacking north towards Nelipivka, where they have approached the village. They were able to capture positions along the highway, as well as in the nearby forest plantations. \nMeanwhile, after nearly two weeks of positional battles, Ukrainian forces were able to advance past Zelena Street in the centre of Kleban-Byk and pushed Russian forces back to the southern edge of the village, where they recaptured the local school and hospital.\n+ ~2.85 km² in favour of Russia.\n+ ~0.20 km² in favour of Ukraine.",
      "timestamp": "2025-09-10T03:35:12.717854Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast.",
      "timestamp": "2025-09-10T03:35:12.717865Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continue to advance and have made new advances in three areas.\nIn the south, after securing most of the Serebryanksyi Forest, Russian forces advanced across the Zherebets River at a new point, and entered the forests south of Zarichne. They were able to advance west for approximately 2.3 km, capturing numerous new positions. Russian soldiers are now operating int he area of the Zarichne - Yampil Road, but no consolidation has occurred there yet. \nTo the north, Russian forces continued to advance in Zarichne and have managed to break through to the western outskirts. They advanced west down Tsentralna Street and captured positions towards its western edge. Positions were also captured on the streets to the north and south, as well as at the local school and church in the village centre.\nIn the north, Russian forces continued to expand their bridgehead in northern Zarichne, and are approaching the Stavky - Zarichne Road. Here, they were able to deepen their zone of control along Poshtova and Chapayeva Streets, putting the remaining Ukrainian positions in the northern part of the village in a salient.\n+ ~5.71 km² in favour of Russia.",
      "timestamp": "2025-09-10T03:35:12.717881Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast.",
      "timestamp": "2025-09-10T03:35:12.717884Z"
    },
    {
      "original": "Currently 3 Tu-95s are circling in the area of Engels-2 Airbase.",
      "timestamp": "2025-09-10T03:35:12.717888Z"
    },
    {
      "original": "Genuinely speaking, i don’t think much will come out of this. A strong NATO condemnation for sure, but it’ll be interesting to see what Russia’s intent was with this. Perhaps testing the waters",
      "timestamp": "2025-09-10T03:35:12.717891Z"
    },
    {
      "original": "~8 Kh-59/69 cruise missiles launched from Su-57s over Kursk Oblast are flying towards Cherkasy Oblast right now. \nAdditionally, launches of Kalibr cruise missiles from the Black Sea was recorded.",
      "timestamp": "2025-09-10T03:35:12.717899Z"
    },
    {
      "original": "~8 Kh-59/69 cruise missiles launched from Su-57s over Kursk Oblast are flying towards Cherkasy Oblast right now.   Additionally, launches of Kalibr cruise missiles from the Black Sea was recorded.",
      "timestamp": "2025-09-10T03:35:12.717904Z"
    },
    {
      "original": "This seems to be a mix of Kh-59s and Kh-101s. \nAdditionally, Kalibrs from the Black Sea have flown past Beryslav, Kherson Oblast, towards Mykolaiv Oblast",
      "timestamp": "2025-09-10T03:35:12.717908Z"
    },
    {
      "original": "~30 missiles in Ukrainian airspace",
      "timestamp": "2025-09-10T03:35:12.717911Z"
    },
    {
      "original": "Approximate situation with the missiles. Around 40 are recorded in Ukrainian airspace.",
      "timestamp": "2025-09-10T03:35:12.717915Z"
    },
    {
      "original": "Updated map.\n6 groups of Kh-101s are flying to Starokostyantyniv, Khmelnytskyi Oblast.\n2 groups of Kh-101s are flying to Kyiv from two directions.\n2 groups of Kh-101s are flying to Korosten, Zhytomyr Oblast.\n1 group of Kalibrs is flying northwest through southern Vinnytsia Oblast.",
      "timestamp": "2025-09-10T03:35:12.717921Z"
    },
    {
      "original": "I'm having issues with the map, so I've just removed the missile paths. \n3 groups of Kh-101s are flying to Ozerne, Zhytomyr Oblast from the northeast.\n6 groups of Kh-101s are flying to southern Ternopil Oblast.\n2 Kh-101s were shot down on approach to Kyiv from the south. \n1 group of Kalibrs is flying towards Vinnytsia from the southeast.",
      "timestamp": "2025-09-10T03:35:12.717927Z"
    },
    {
      "original": "I'm having issues with the map, so I've just removed the missile paths.   3 groups of Kh-101s are flying to Ozerne, Zhytomyr Oblast from the northeast.  6 groups of Kh-101s are flying to southern Ternopil Oblast.  2 Kh-101s were shot down on approach to Kyiv…",
      "timestamp": "2025-09-10T03:35:12.717930Z"
    },
    {
      "original": "Correction: The 2 Kh-101s flying to Kyiv from the east were shot down. \nThe ones flying to the city from the south are flying to Ozerne, Zhytomyr Oblast.\nNo changes to the 6 groups of Kh-101s (~24 missiles in total). \nThe kalibr group (2-3 missiles) is flying to Ozerne from the south.",
      "timestamp": "2025-09-10T03:35:12.717936Z"
    },
    {
      "original": "The first four Kh-101s approach Zhytomyr-Ozerne. Possibly going to strike the airbase.",
      "timestamp": "2025-09-10T03:35:12.717939Z"
    },
    {
      "original": "The first four Kh-101s approach Zhytomyr-Ozerne. Possibly going to strike the airbase.",
      "timestamp": "2025-09-10T03:35:12.717942Z"
    },
    {
      "original": "Over the city",
      "timestamp": "2025-09-10T03:35:12.717945Z"
    },
    {
      "original": "Over the city",
      "timestamp": "2025-09-10T03:35:12.717948Z"
    },
    {
      "original": "Explosions. 2-3 more flying in from the south.",
      "timestamp": "2025-09-10T03:35:12.717951Z"
    },
    {
      "original": "Explosions. 2-3 more flying in from the south.",
      "timestamp": "2025-09-10T03:35:12.717954Z"
    },
    {
      "original": "Approaching Zhytomyr city",
      "timestamp": "2025-09-10T03:35:12.717957Z"
    },
    {
      "original": "Approaching Zhytomyr city",
      "timestamp": "2025-09-10T03:35:12.717960Z"
    },
    {
      "original": "Repeated explosions were heard in Zhytomyr",
      "timestamp": "2025-09-10T03:35:12.717963Z"
    },
    {
      "original": "Updated map.\nThe remaining (~24) Kh-101 cruise missiles are flying through the western regions of Ukraine. \n~16 missiles flying in 4 groups one after another are heading towards Ternopil City. \n~8 missiles are bypassing Khmelnytskyi City from the north.\nI also missed ~2 Kh-101 impacts in Vasylkiv, Kyiv Oblast.",
      "timestamp": "2025-09-10T03:35:12.717969Z"
    },
    {
      "original": "Explosions in Vinnytsia. Likely Kh-101 impacts.",
      "timestamp": "2025-09-10T03:35:12.717974Z"
    },
    {
      "original": "The remaining Kh-101 cruise missiles are flying to Burshtyn, Ivano-Frankivsk Oblast from two directions.",
      "timestamp": "2025-09-10T03:35:12.717978Z"
    }
  ],
  "script_run_time": "2025-09-10T03:35:13.360351Z"
}