{
  "messages": [
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 137 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 05 січня (з 18:00 04 січня) противник атакував 9 балістичними ракетами Іскандер-М/зенітними керованими ракетами С-300 із Брянської та Воронезької обл., а також 165 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Курськ, Шаталово, Орел – рф., близько 100 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено 137 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, центрі та сході країни.\nЗафіксовано влучання балістичних/зенітних керованих ракет та 26 ударних БпЛА на 10 локаціях, а також падіння збитих (уламки) на 9 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-05T11:00:08.876656Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині курсом на Велику Багачку.",
      "timestamp": "2026-01-05T11:00:08.876672Z"
    },
    {
      "original": "🛵\n Миргород - БпЛА з півдня у напрямку міста.",
      "timestamp": "2026-01-05T11:00:08.876677Z"
    },
    {
      "original": "🛵\n БпЛА з півночі Дніпропетровщини, курс на Харківщину.\n🛸\n На Сумщині та Херсонщині розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2026-01-05T11:00:08.876686Z"
    },
    {
      "original": "🛵\n БпЛА на півдні від Запоріжжя, курс на схід.",
      "timestamp": "2026-01-05T11:00:08.876691Z"
    },
    {
      "original": "🛵\n БпЛА з півночі в напрямку Сум.",
      "timestamp": "2026-01-05T11:00:08.876696Z"
    },
    {
      "original": "🛵\n🛸\nБпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-05T11:00:08.876701Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курс на південь.",
      "timestamp": "2026-01-05T11:00:08.876706Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2026-01-05T11:00:08.876710Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпро з півдня.",
      "timestamp": "2026-01-05T11:00:08.876714Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину!",
      "timestamp": "2026-01-05T11:00:08.876719Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Куп'янська.",
      "timestamp": "2026-01-05T11:00:08.876725Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-05T11:00:08.876729Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА через Херсонщину \n➡️\n у напрямку Миколаївщини.",
      "timestamp": "2026-01-05T11:00:08.876735Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА через Херсонщину \n➡️\n у напрямку Миколаївщини.",
      "timestamp": "2026-01-05T11:00:08.876740Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Миколаїв.",
      "timestamp": "2026-01-05T11:00:08.876746Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Дніпро зі сходу.",
      "timestamp": "2026-01-05T11:00:08.876754Z"
    },
    {
      "original": "🛵\n Чернігівське: декілька груп БпЛА \n➡️\n в районі Гончарівського.\n🛵\n Дніпропетровщина: групи БпЛА \n➡️\n у напрямку Павлограда.",
      "timestamp": "2026-01-05T11:00:08.876762Z"
    },
    {
      "original": "🛵\n Харківський р-н, м.Харків \n➡️\n бойова робота по ворожих БпЛА.",
      "timestamp": "2026-01-05T11:00:08.876768Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Чернігів з півночі",
      "timestamp": "2026-01-05T11:00:08.876774Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-05T11:00:08.876778Z"
    },
    {
      "original": "Explosion in Kharkiv. Tornado-S/Iskander-M impacted southwest of the city.",
      "timestamp": "2026-01-05T11:00:09.654507Z"
    },
    {
      "original": "Iskander launch from Bryansk",
      "timestamp": "2026-01-05T11:00:09.654518Z"
    },
    {
      "original": "Iskander launch from Bryansk",
      "timestamp": "2026-01-05T11:00:09.654522Z"
    },
    {
      "original": "No missiles are detected. A threat remains",
      "timestamp": "2026-01-05T11:00:09.654525Z"
    },
    {
      "original": "The 4 Tu-22m3 strategic bombers are now returning north back to Olenya Airbase via Smolensk Oblast.",
      "timestamp": "2026-01-05T11:00:09.654528Z"
    },
    {
      "original": "This whole attack is super weird...\n- All 4 Tu-22m3s landed back at Olenya Airbase\n- 2-5 Tu-95MS landed back at Olenya Airbase\n- 3 Tu-95MS and 3 Tu-160 from the far east have completely disappeared\n- Every single MiG-31K launch maneuver has been simulated\n- Ukraine's airspace is now clear of Geran-2 drones and no more launches have been recorded.\nIt honestly seems like the whole attack was suddenly cancelled.",
      "timestamp": "2026-01-05T11:00:09.654536Z"
    },
    {
      "original": "This whole attack is super weird...  - All 4 Tu-22m3s landed back at Olenya Airbase - 2-5 Tu-95MS landed back at Olenya Airbase - 3 Tu-95MS and 3 Tu-160 from the far east have completely disappeared - Every single MiG-31K launch maneuver has been simulated…",
      "timestamp": "2026-01-05T11:00:09.654540Z"
    },
    {
      "original": "Yeah it looks like it's been completely cancelled. What's odd is that only one strategic frequency was active this whole time. \nI remember in 2023 and 2024 there were similar cases like this, but those ones at least had simulated launch maneuvers from the strategic bombers.\nI will continue to monitor nonetheless, and will update if anything changes.",
      "timestamp": "2026-01-05T11:00:09.654545Z"
    },
    {
      "original": "Last night, Russia carried out a combined missile and drone attack on Chernihiv Oblast. \n6 Iskander-M ballistic missiles and several Geran-2 drones attacked Chernihiv City. The missiles struck an unknown enterprise, resulting in secondary detonations and a large fire. The drones targeted warehouses and energy infrastructure.\n2 Iskander-Ms also impacted an unknown target in the area of Desna. Gerans attacked other targets in the region too. \nCredit to\n Intel Cams | OSINT\n for the first video.",
      "timestamp": "2026-01-05T11:00:09.654552Z"
    },
    {
      "original": "Last night, Russia carried out a combined missile and drone attack on Chernihiv Oblast. \n6 Iskander-M ballistic missiles and several Geran-2 drones attacked Chernihiv City. The missiles struck an unknown enterprise, resulting in secondary detonations and a large fire. The drones targeted warehouses and energy infrastructure.\n2 Iskander-Ms also impacted an unknown target in the area of Desna. Gerans attacked other targets in the region too. \nCredit to\n Intel Cams | OSINT\n for the first video.",
      "timestamp": "2026-01-05T11:00:09.654559Z"
    },
    {
      "original": "Overnight, dozens of Russian Geran-2 drones struck the \"Slavutich\" 330 kV electrical substation in the city of Slavutych, Kyiv Oblast.\nAs a result, the entire city was left without power. Backup generators are currently in use as workers being restoration work on the facility.\nCoordinates: 51.52373, 30.70775",
      "timestamp": "2026-01-05T11:00:09.654569Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their assault operations northeast of Stepnohirsk and have made additional progress near Lukyanivske.\nRussian forces continued advancing east from the solar plant, capturing new positions in the treelines there and reaching Lukyanivske from the south. Infiltrations into the village continued from the west. \nAdditionally, the Russians continued infiltrating further east through the treelines and began attacking along the gulley in the direction of Novoyakovlivka.\n+ ~0.96 km² in favour of Russia.",
      "timestamp": "2026-01-05T11:00:09.654575Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued their assault operations, making new progress in two different areas.\nIn the northeast, Russian forces continued to advance south of Hulyaipole, where they captured new positions in the treelines and forest northwest of Dorozhnyanka.\nIn the southwest, after entering Bilohirya from the south and east, the Russians established control over most of the village, and began attacks to the north in the direction of the Ukrainian positions on the tactical heights. \n+ ~3.78 km² in favour of Russia.",
      "timestamp": "2026-01-05T11:00:09.654581Z"
    },
    {
      "original": "In the Pokrovs'ke direction, Ukrainian forces have consolidated numerous treelines east of the Haichur River following failed Russian operations.\nOver the last month, Ukrainian forces have been incrementally regaining solid control over positions east of the Haichur River. These operations have been conducted in areas where Russian forces did not properly entrench in and only moved through to their forward positions west of the river. \nDue to this lack of Russian consolidation, the Ukrainians were able to regain control over the village of Radisne which had previously been in a sort of zone of Russian influence with no permanent presence, and managed to link up with isolated pockets of soldiers in the treelines further east. As a result, a large grey-zone has formed stretching up to 4.5 km wide in some areas, where both sides have overlapping positions in an extremely fluid and dynamic situation. \nThe establishment of solid positions east of the river by Ukraine has allowed them to increase their overall presence in this grey-zone of mixed positions in recent weeks, significantly complicating Russian logistics to their own bridgeheads west of the Haichur river. Nevertheless, Russian forces continued their operations west of the river, with DRGs still infiltrating the village of Kosivtseve, and for the first time, entering the town of Ternuvate.\n+ ~13.70 km² in favour of Ukraine.",
      "timestamp": "2026-01-05T11:00:09.654588Z"
    },
    {
      "original": "In the Novopavlivka direction, both Russian and Ukrainian forces have advanced, each capturing positions in the village of Novopidhorodne.\nAt some point recently, Ukrainian forces launched counterattacks in northeastern Novopidhorodne, recapturing positions along two residential streets, shrinking the Russian incursion zone. \nSince then, the Russians have resumed their attacks through the southern part of the village, capturing new positions along Shevchenka Street. Additionally, under heavy artillery cover, assault operations are being carried out on the central part of the village, as well as along the railway line to the south. DRGs have also penetrated the western streets. \n+ ~0.66 km² in favour of Ukraine. \n+ ~0.09 km² in favour of Russia.",
      "timestamp": "2026-01-05T11:00:09.654594Z"
    },
    {
      "original": "Explosion in Kharkiv City. Likely a Tornado-S rocket.",
      "timestamp": "2026-01-05T11:00:09.654597Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T11:00:09.654601Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations north of Pokrovsk and recaptured previously lost positions there.\nRussian forces advanced northwest from the forested areas northwest of Myrnohrad, recapturing the highway intersection. Other forces attacked up the treelines on a wide front north of Pokrovsk, re-establishing control over a large section of the road to Hryshyne and one of the pig farms. \n+ ~6.04 km² in favour of Russia.",
      "timestamp": "2026-01-05T11:00:09.654606Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T11:00:09.654611Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T11:00:09.654614Z"
    },
    {
      "original": "To all the geniuses who accuse me of reporting Tornado-S strikes to S-300 ground-to-ground strikes, notice how there is no ballistic threat this time?\nWhen there is a ballistic threat, a non-Iskander target is detected flying and an explosion is heard, that is almost always an S-300 ground-to-ground. Don't ask me why Russia does this, but it happens.",
      "timestamp": "2026-01-05T11:00:09.654618Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T11:00:09.654621Z"
    },
    {
      "original": "Repeated explosions in Kharkiv City",
      "timestamp": "2026-01-05T11:00:09.654624Z"
    },
    {
      "original": "Slovyansk Front: Russian Army Takes On Ukrainian Defenses South Of Key City\nIn the Kupyansk sector, the situation is gradually stabilizing, though there is still heavy fighting in the city center. Russian units have repelled a series of attacks and consolidated their positions in the Moskovka residential development, thwarting the Ukrainian command's plans to use it as a bridgehead.\nIn the Slovyansk sector on the eastern flank, Russian units advanced west of Siversk and drove Ukrainian units from the heights north of Reznykivka. They are currently engaged in fierce fighting for Zakotne and Ilychivka. \nMeanwhile, Kyiv and Washington have finished coordinating a joint military document that defines long-term support parameters.\nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438560Z"
    },
    {
      "original": "Slovyansk Front: Russian Army Takes On Ukrainian Defenses South Of Key City\nIn the Kupyansk sector, the situation is gradually stabilizing, though there is still heavy fighting in the city center. Russian units have repelled a series of attacks and consolidated their positions in the Moskovka residential development, thwarting the Ukrainian command's plans to use it as a bridgehead.\nIn the Slovyansk sector on the eastern flank, Russian units advanced west of Siversk and drove Ukrainian units from the heights north of Reznykivka. They are currently engaged in fierce fighting for Zakotne and Ilychivka. \nMeanwhile, Kyiv and Washington have finished coordinating a joint military document that defines long-term support parameters.\nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438574Z"
    },
    {
      "original": "Near Kupyansk In Ukraine: Intense Urban Fighting and Rear-Echelon Personnel Changes\nThe situation on the Kupyansk axis in Ukraine's Kharkiv region remains extremely tense but is gradually stabilizing. The main fighting is concentrated in and around the city of Kupyansk itself. Russian forces are holding positions in the industrial zone on the left bank of the Oskol River, while on the right bank, Ukrainian units continue attempts to expand their zone of control. Reports indicate that their assault groups reached the city center, including the district court building, but active work by Russian drone crews prevented them from holding these positions for long.\nA significant factor influencing the situation has become the improvement in weather conditions. This has allowed Russian UAV operators to operate at full capacity, which, according to available information, has partially compensated for the numerical superiority of Ukrainian units. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438584Z"
    },
    {
      "original": "Near Kupyansk In Ukraine: Intense Urban Fighting and Rear-Echelon Personnel Changes\nThe situation on the Kupyansk axis in Ukraine's Kharkiv region remains extremely tense but is gradually stabilizing. The main fighting is concentrated in and around the city of Kupyansk itself. Russian forces are holding positions in the industrial zone on the left bank of the Oskol River, while on the right bank, Ukrainian units continue attempts to expand their zone of control. Reports indicate that their assault groups reached the city center, including the district court building, but active work by Russian drone crews prevented them from holding these positions for long.\nA significant factor influencing the situation has become the improvement in weather conditions. This has allowed Russian UAV operators to operate at full capacity, which, according to available information, has partially compensated for the numerical superiority of Ukrainian units. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438593Z"
    },
    {
      "original": "Military Situation In Syria On January 4, 2026 (Map Update)",
      "timestamp": "2026-01-05T11:00:10.438597Z"
    },
    {
      "original": "Due To Catastrophic Male Losses In The AFU, The Share Of Female Officers Has Soared From 4% To 21%\nThe proportion of female officers in the Armed Forces of Ukraine (AFU) has made an unprecedented leap over the past two years, increasing from 4% to 21%. This was reported by Oksana Hryhorieva, gender advisor to the General Staff of the AFU. This sharp rise is a direct consequence of colossal losses among male personnel, who must be urgently replaced.\nAs Hryhorieva notes, female graduates of military universities from 2019 have already attained the ranks of captain and major. Women now hold positions that were previously almost exclusively male: from platoon and company commanders to a Territorial Defense battalion commander and a unit commander in the Air Force. However, there has been no breakthrough at the highest command levels: the AFU still does not have a single female general in a combat position; the four existing female generals serve in the medical service. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438608Z"
    },
    {
      "original": "Military Situation In Ukraine On January 4, 2026 (Maps Update)",
      "timestamp": "2026-01-05T11:00:10.438613Z"
    },
    {
      "original": "Military Situation In Ukraine On January 4, 2026 (Maps Update)",
      "timestamp": "2026-01-05T11:00:10.438617Z"
    },
    {
      "original": "See Kupiansk and Die: Foreign Mercenaries as Expendable Assets in the Battle for the City\nThe conflict in Ukraine continues to claim the lives of foreign mercenaries. Over the past month, Kupiansk has become the primary meat grinder for the Ukrainian Armed Forces' \"Foreign Legion.\" Against the backdrop of catastrophic losses among Ukrainian troops, the command has placed its bet not on its own soldiers, but on Latin American mercenaries—primarily Brazilians and Colombians—used as expendable material in numerous counterattacks.\nAs for the European and American mercenaries, even their privileged status does not save them. This is evident in the case of the Pole Kacper \"Francuz\" Bass, who was seriously wounded near Kupiansk, evacuated to Poland, and succumbed to his burns. The deaths of 33 mercenaries have been confirmed over the past week, with actual losses likely being significantly higher.\nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438627Z"
    },
    {
      "original": "See Kupiansk and Die: Foreign Mercenaries as Expendable Assets in the Battle for the City\nThe conflict in Ukraine continues to claim the lives of foreign mercenaries. Over the past month, Kupiansk has become the primary meat grinder for the Ukrainian Armed Forces' \"Foreign Legion.\" Against the backdrop of catastrophic losses among Ukrainian troops, the command has placed its bet not on its own soldiers, but on Latin American mercenaries—primarily Brazilians and Colombians—used as expendable material in numerous counterattacks.\nAs for the European and American mercenaries, even their privileged status does not save them. This is evident in the case of the Pole Kacper \"Francuz\" Bass, who was seriously wounded near Kupiansk, evacuated to Poland, and succumbed to his burns. The deaths of 33 mercenaries have been confirmed over the past week, with actual losses likely being significantly higher.\nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438634Z"
    },
    {
      "original": "No Rotation, No Rest: The Ukrainian Army's Problems in the Zaporizhzhia Sector and Fighting on Other Fronts\n▪️\nIn the Zaporizhzhia sector, the situation for Ukrainian forces continues to worsen due to critical personnel issues, primarily the prolonged deployment of units without rotation or rest, leading to severe exhaustion. \n▪️\nMeanwhile, on other fronts, the dynamics vary: in the Kupiansk sector, after stabilizing the Radkovka-Holubovka line, the focus has shifted to sabotage and reconnaissance group activities and clearing operations in the forested areas near the city. \n▪️\nIn the Kharkiv sector, Russian units of the \"North\" grouping have consolidated their gains by advancing on several fronts, including the Staritsa area and the forest near Liman, where they captured three strongpoints.\n▪️\n In the Slaviansk sector, intense fighting continues over the dominant heights in the Zakotne area and north of Reznikovka, which are of key tactical importance. \nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438646Z"
    },
    {
      "original": "No Rotation, No Rest: The Ukrainian Army's Problems in the Zaporizhzhia Sector and Fighting on Other Fronts\n▪️\nIn the Zaporizhzhia sector, the situation for Ukrainian forces continues to worsen due to critical personnel issues, primarily the prolonged deployment of units without rotation or rest, leading to severe exhaustion. \n▪️\nMeanwhile, on other fronts, the dynamics vary: in the Kupiansk sector, after stabilizing the Radkovka-Holubovka line, the focus has shifted to sabotage and reconnaissance group activities and clearing operations in the forested areas near the city. \n▪️\nIn the Kharkiv sector, Russian units of the \"North\" grouping have consolidated their gains by advancing on several fronts, including the Staritsa area and the forest near Liman, where they captured three strongpoints.\n▪️\n In the Slaviansk sector, intense fighting continues over the dominant heights in the Zakotne area and north of Reznikovka, which are of key tactical importance. \nRead more \nHERE",
      "timestamp": "2026-01-05T11:00:10.438657Z"
    }
  ],
  "script_run_time": "2026-01-05T11:00:10.439451Z"
}