{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на схід Харківщини.",
      "timestamp": "2025-10-23T20:41:01.874723Z"
    },
    {
      "original": "Курс на північ Донеччини.",
      "timestamp": "2025-10-23T20:41:01.874736Z"
    },
    {
      "original": "🛵\n  БпЛА на заході Харківщини \n➡️\n курсом на захід, на Полтавщину.",
      "timestamp": "2025-10-23T20:41:01.874743Z"
    },
    {
      "original": "🛵\n БпЛА в центрі та на півночі Харківщини, основний курс на захід.",
      "timestamp": "2025-10-23T20:41:01.874748Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-23T20:41:01.874756Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-23T20:41:01.874761Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-23T20:41:01.874768Z"
    },
    {
      "original": "🛵\n БпЛА на північ від н.п. Зіньків на Полтавщині, курсом на захід.",
      "timestamp": "2025-10-23T20:41:01.874773Z"
    },
    {
      "original": "🛵\n БпЛА на півночі, на сході та півдні Харківщини, основний курс на захід.",
      "timestamp": "2025-10-23T20:41:01.874777Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину та на Запорізьку область.",
      "timestamp": "2025-10-23T20:41:01.874781Z"
    },
    {
      "original": "🚀\n КАБ в напрямку Запоріжжя.",
      "timestamp": "2025-10-23T20:41:01.874785Z"
    },
    {
      "original": "🛵\n БпЛА на північ від н.п. Охтирка на Сумщині, курсом на захід.",
      "timestamp": "2025-10-23T20:41:01.874790Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-23T20:41:01.874794Z"
    },
    {
      "original": "🛵\n  Ударні БпЛА на Харківщині:\n- в центрі поблизу н.п. Слобожанське, на північно-західний напрямок;\n- на півночі  на н.п. Богодухів та Старий Салтів.",
      "timestamp": "2025-10-23T20:41:01.874800Z"
    },
    {
      "original": "🛵\n БпЛА на сході Сумщини \n➡️\n на північно-західний напрямок.\n🛵\n БпЛА на заході від Чернігова \n➡️\n курсом на місто.",
      "timestamp": "2025-10-23T20:41:01.874809Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Херсонщини, курсом на Херсон.",
      "timestamp": "2025-10-23T20:41:01.874813Z"
    },
    {
      "original": "🚀\nПуски КАБ на межі Запорізької та Донецької області, курсом на південь Дніпропетровщини.",
      "timestamp": "2025-10-23T20:41:01.874820Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-23T20:41:01.874824Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-10-23T20:41:01.874828Z"
    },
    {
      "original": "🛵\n БпЛА на Суми зі сходу.",
      "timestamp": "2025-10-23T20:41:01.874832Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Херсонщини\n➡️\n курсом на Миколаївщину.",
      "timestamp": "2025-10-23T20:41:01.874838Z"
    },
    {
      "original": "Footage showing Russian Geran-2 drone strikes on a 330 kV electrical substation in the city of Konotop, Sumy Oblast. \nMedia 1 shows the strikes from a reconnaissance drone, while media 2 shows one of the strikes from the ground. At least 6 Gerans impacted the substation, resulting in a large fire breaking out and widespread power outages. \nCoordinates: 51.19231, 33.16702",
      "timestamp": "2025-10-23T20:41:02.408047Z"
    },
    {
      "original": "Footage showing Russian Geran-2 drone strikes on a 330 kV electrical substation in the city of Konotop, Sumy Oblast. \nMedia 1 shows the strikes from a reconnaissance drone, while media 2 shows one of the strikes from the ground. At least 6 Gerans impacted the substation, resulting in a large fire breaking out and widespread power outages. \nCoordinates: 51.19231, 33.16702",
      "timestamp": "2025-10-23T20:41:02.408058Z"
    },
    {
      "original": "Russian Su-34/35s are trying to shoot down Ukrainian F-16s northwest of Sumy.",
      "timestamp": "2025-10-23T20:41:02.408062Z"
    },
    {
      "original": "Russian Su-34/35s are trying to shoot down Ukrainian F-16s northwest of Sumy.",
      "timestamp": "2025-10-23T20:41:02.408065Z"
    },
    {
      "original": "An explosion was heard in Sumy.",
      "timestamp": "2025-10-23T20:41:02.408068Z"
    },
    {
      "original": "From what I've gathered, a Russian Su-35 launched an R-37M air-to-air missile from over Kursk Oblast. It was acting as an escort for Su-34s launching KAB glide-bombs at Krasnopillya, Sumy Oblast, but remained in the area after the Su-34s left.",
      "timestamp": "2025-10-23T20:41:02.408072Z"
    },
    {
      "original": "One F-16 flew back over Sumy on a southwestern course a few minutes ago.",
      "timestamp": "2025-10-23T20:41:02.408075Z"
    },
    {
      "original": "The F-16(s) were going to launch glide-bombs at Sudzha District, Kursk Oblast, but have been forced to abandon the combat mission.",
      "timestamp": "2025-10-23T20:41:02.408078Z"
    },
    {
      "original": "The Russians are breaking through in the Novopavlivka direction. Their bridgehead over the Vovcha River has rapidly expanded, forcing many Ukrainian formations to withdraw from their heavily fortified positions to prevent being encircled. \nDepending how this develops, we could see Novopavlivka begin to be enveloped from the west, and the whole front west of Pokrovsk shift north/northwest towards the important logistical hub of Mezhova.\nKeep an eye on this West Donetsk / East Dnipropetrovsk sector, especially once Pokrovsk and Myrnohrad fall. It could play out something like this map shows.",
      "timestamp": "2025-10-23T20:41:02.408087Z"
    },
    {
      "original": "Apparently 6 soldiers is now a mass surrender lmao. \nAlso, for those who for some stupid reason only look at Deepstate's maps, Kucheriv Yar was never encircled, but rather stormed from the northeast.",
      "timestamp": "2025-10-23T20:41:02.408091Z"
    },
    {
      "original": "Apparently 6 soldiers is now a mass surrender lmao.   Also, for those who for some stupid reason only look at Deepstate's maps, Kucheriv Yar was never encircled, but rather stormed from the northeast.",
      "timestamp": "2025-10-23T20:41:02.408096Z"
    },
    {
      "original": "The victory threshold for Ukraine continues to get lower and lower...",
      "timestamp": "2025-10-23T20:41:02.408099Z"
    },
    {
      "original": "Russian forces have re-established control over Sichneve, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~160.\nTotal land area: ~0.75km².",
      "timestamp": "2025-10-23T20:41:02.408104Z"
    },
    {
      "original": "I present to you, the \"Monster Tank\":\nIt recently took part in a Russian mechanised assault in the Siversk direction, and tanked more than 25 FPV drone hits before finally being disabled. The surviving infantry are now trying to consolidate in the treelines.",
      "timestamp": "2025-10-23T20:41:02.408108Z"
    },
    {
      "original": "I present to you, the \"Monster Tank\":  It recently took part in a Russian mechanised assault in the Siversk direction, and tanked more than 25 FPV drone hits before finally being disabled. The surviving infantry are now trying to consolidate in the treelines.",
      "timestamp": "2025-10-23T20:41:02.408111Z"
    },
    {
      "original": "This video should also give a good idea of the sheer density of FPV drones on the battlefield, especially in places like Siversk where the Ukrainians have very strong defences. There are drones literally everywhere, and all movement within 10km of the frontline is instantly spotted.",
      "timestamp": "2025-10-23T20:41:02.408114Z"
    },
    {
      "original": "Russian KAB glide-bombs are once again striking the bridge to Korobelnyi Island in an attempt to destroy it. So far it remains standing. \nAlso, on a sidenote, the claims of Russian soldiers landing and consolidating on the island are completely false. Don't fall for it.",
      "timestamp": "2025-10-23T20:41:02.408118Z"
    },
    {
      "original": "⚡\n🇱🇧\n🇮🇱\n Reports of Israeli airstrikes in southern Lebanon.\n@wfwitness",
      "timestamp": "2025-10-23T20:41:02.408127Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces are advancing through Mala Tokmachka, attempting to take full control over the village. \nFollowing the earlier mechanised assaults, Russian soldiers were able to scatter throughout the eastern and central parts of the village and begin pushing west. So far, they have been able to consolidate in additional parts of the eastern streets, but infiltrations have occurred 2.3 km west of that. Large amounts of soldiers from at least three different regiments have accumulated here, and are attempting to push further.  \n+ ~1.51 km² in favour of Russia.",
      "timestamp": "2025-10-23T20:41:02.408132Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance west of the Yanchur River, further expanding their bridgehead in two different areas.\nMost of the progress was made in the south, where Russian forces continued pushing west along the Malynivka - Hulyaipole Road. With heavy fighting, they were able to capture a 2.3 km-long stretch of it and begin advancing further towards the villages of Vesele and Zelenyi Hai. At the same time, other forces cleared the northern and southern banks of the small reservoir and pushed northwest up to the road. Additionally, the Russians captured new positions along four parallel treelines north of the road, on the tactical heights. \nIn the north, Russian forces continued to advance further west from the northern part of Poltavka. Here, they captured additional positions along two separate treelines in the low-lying ground and began attacks towards the small reservoir further west. \n+ ~5.30 km² in favour of Russia.",
      "timestamp": "2025-10-23T20:41:02.408137Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovsk'e directions, Russian forces continued to advance east of the Yanchur River, making new progress in three different areas.\nIn the north, after breaking through to Pryvillya, Russian forces began securing their northern flank. Under heavy artillery and drone cover, they began advancing on the village of Vyshneve from two directions and captured a gulley and the section of road between Vyshneve and Verbove. For the past ten days, Vyshneve has been under intense FAB, artillery, and MLRS bombardment. \nFurther south, Russian forces continued securing the southern flank of their breakthrough to Pryvillya. Here, they were able to last section of the tactical heights, and advanced into the treelines in the low-lying ground northeast of Krasnohirske. They also continued pushing west of Novohryhorivka, capturing additional forest plantations west of the reservoir. \nIn the south, Russian forces were able to enter Pavlivka, which was largely abandoned by the Ukrainians in favour of safer positions south of the Yanchur River. The Russians were able to consolidate control over the whole village and captured new positions in the treelines to the southeast. \n+ ~12.22 km² in favour of Russia.",
      "timestamp": "2025-10-23T20:41:02.408143Z"
    },
    {
      "original": "In the Novopavlivka and Prosyana directions, Russian forces continued to advance, making significant progress north of the Vovcha River.\nIn the west, Russian forces rapidly expanded their bridgehead over the Vovcha River in Ivanivka, reaching the centre of the village. Other forces crossed the river further west, entrenching and accumulating infantry in a forest, before advancing into the western part of Ivanivka. From there, they infiltrated the forest further west in the direction of Havrylivka. \nRussian forces then bypassed the rest of the village, and advanced uphill to the north, capturing new treeline positions and consolidating in a forested gulley. They also pushed into the forest north of Ivanivka, and advanced up the treeline, reaching the rear of Novopavlivka. Other forces were able to capture the forest plantations on the tactical heights northeast of Ivanivka. \nTo the east, Russian forces continued their assault operations towards Novopavlivka from the south. They were able to gain a foothold in the next forest northwest of Filiya, while other forces crossed the Solena River, breaking through Ukraine's main layered defence line here by establishing control over positions in the forest. \nTo the southeast, Russian forces continued clearing the Donetsk - Dnipropetrovsk Regional Border area. They advanced further into Dnipropetrovsk from this direction and captured new positions in three separate treelines. Ukrainian forces are beginning their withdrawal from the salient north of Dachne to prevent being encircled. \nTo the northeast, Russian forces recaptured positions south of the reservoir (southeast of Kotlyarivka), and advanced along a treeline towards the Donetsk-Dnipropetrovsk border from the east. \n+ ~22.35 km² in favour of Russia.",
      "timestamp": "2025-10-23T20:41:02.408150Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance in Pokrovsk City, making new progress primarily south of the railway line.\nIn the west, following infiltrations over the railway line, Russian forces were able to consolidate in roughly 40% of the northwestern industrial zone and begin attacks further north/northwest. They also crossed the tracks a new point, capturing new positions in the eastern buildings of the industrial zone.\nTo the southeast, Russian forces consolidated further in the Pervomaika District, and secured positions in the city centre via Prokofieva and Zaliznychna Streets. It is from here that they operate at the railway station and surrounding areas.\nIn the southern part of Pokrovsk, Russian forces finally cleared the forests on the outskirts of the city, along with Yuvileynyy Park, and captured the rest of the Market District and southeastern part of the Pervomaika District.\nIn the southeastern part of Pokrovsk, the Russians advanced further north through the Sobachivka District, reaching the city centre via Samarska Street. They were also able to significantly expand their zone of control in the rest of the district and are approaching the eastern outskirts of the city.\nTo the southeast, Russian forces continued to advance in Novopavlivka. They secured the centre of the village and are now advancing through the northeastern houses.\n+ ~4.23 km² in favour of Russia.",
      "timestamp": "2025-10-23T20:41:02.408158Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 22, 2025\nOn October 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-23T20:41:02.948321Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 22, 2025\nOn October 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-23T20:41:02.948335Z"
    },
    {
      "original": "Britain’s Investment In “Combating Russian Hybrid Threats” Sparks Instability In The Balkans\nBritish Foreign Secretary Yvette Cooper announced within the Berlin Process that the United Kingdom would invest £4 million to “combat the constant flood of Russian hybrid threats aimed at destabilizing the region, and fanning ethnic tensions,” after which she also promised a wider £10 million in programs in the Western Balkans. In effect, this investment, evidently aimed against Serbia, contributes to an increasingly volatile situation in the region by implementing London’s old imperial logic of divide and rule.\nCooper hosted a meeting earlier this month within the framework of the Berlin Process, which was also attended by Serbian Foreign Minister Marko Đurić, and at which she confirmed “commitment to stability, security and prosperity in the Western Balkans,” adding that the “security in the Western Balkans affects the security of the whole of Europe and the security for us here in the UK.”\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948345Z"
    },
    {
      "original": "U.S. Takes War On Drugs To Eastern Pacific, Strikes Two Boats There And Threatens Colombia\nThe United States military struck two boats allegedly carrying drugs in the eastern Pacific Ocean on October 21 and 22, in a departure from previous strikes that targeted vessels in the Caribbean Sea.\nBoth strikes were announced by Defense Secretary Pete Hegseth, who said in two separate posts on X that they were carried out “at the direction” of President Donlad Trump. According to Hegseth, the first strike killed two people, while the second killed three.\n“These strikes will continue, day after day. These are not simply drug runners—these are narco-terrorists bringing death and destruction to our cities. These DTOs are the “Al Qaeda” of our hemisphere and will not escape justice. We will find them and kill them, until the threat to the American people is extinguished,” Hegseth said in the post announcing the second strike.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948355Z"
    },
    {
      "original": "U.S. Takes War On Drugs To Eastern Pacific, Strikes Two Boats There And Threatens Colombia\nThe United States military struck two boats allegedly carrying drugs in the eastern Pacific Ocean on October 21 and 22, in a departure from previous strikes that targeted vessels in the Caribbean Sea.\nBoth strikes were announced by Defense Secretary Pete Hegseth, who said in two separate posts on X that they were carried out “at the direction” of President Donlad Trump. According to Hegseth, the first strike killed two people, while the second killed three.\n“These strikes will continue, day after day. These are not simply drug runners—these are narco-terrorists bringing death and destruction to our cities. These DTOs are the “Al Qaeda” of our hemisphere and will not escape justice. We will find them and kill them, until the threat to the American people is extinguished,” Hegseth said in the post announcing the second strike.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948364Z"
    },
    {
      "original": "Russian Army Reaches Key Road North Of Pokrovsk, Enters Another Town Along Yanchur \nOn October 23, the Russian military reached a key road north of the city of Pokrovsk in the Donetsk direction, and entered another settlement along the Yanchur River in the Dnepropetrovsk direction.\nIn Donetsk, the Tsentr [Center] Group of Forces broke through Ukrainian defenses in Rodynske, located a few kilometers to the north of Pokrovsk, capturing most of the settlement southern part, and reaching the road to its west. This road links Pokrovsk with Dobropillia further to the north. It is one of the last remaining roads that Kiev has been using to supply its forces in Pokrovsk, Myrnohrad and nearby areas.\nRussian troops have reportedly taken over buildings overlooking the road. However, it is unclear yet if they managed to block it. It’s worth noting that the road has been under the first of Russian drone units for a while now.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948373Z"
    },
    {
      "original": "Russian Army Reaches Key Road North Of Pokrovsk, Enters Another Town Along Yanchur \nOn October 23, the Russian military reached a key road north of the city of Pokrovsk in the Donetsk direction, and entered another settlement along the Yanchur River in the Dnepropetrovsk direction.\nIn Donetsk, the Tsentr [Center] Group of Forces broke through Ukrainian defenses in Rodynske, located a few kilometers to the north of Pokrovsk, capturing most of the settlement southern part, and reaching the road to its west. This road links Pokrovsk with Dobropillia further to the north. It is one of the last remaining roads that Kiev has been using to supply its forces in Pokrovsk, Myrnohrad and nearby areas.\nRussian troops have reportedly taken over buildings overlooking the road. However, it is unclear yet if they managed to block it. It’s worth noting that the road has been under the first of Russian drone units for a while now.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948381Z"
    },
    {
      "original": "Military Situation In Northern Palestine On October 23, 2025 (Map Update)",
      "timestamp": "2025-10-23T20:41:02.948385Z"
    },
    {
      "original": "‘31 For 1,000’: New Exchange Of Bodies Reveals Ukraine’s Heavy Losses\nUkraine announced on October 23 that it had received the bodies of 1,000 of its soldiers from Russia as part of a “repatriation operation.”\nThe country’s Coordination Headquarters for the Treatment of Prisoners of War said in a statement that investigators from law enforcement and expert institutions of the Interior Ministry will conduct examinations and identification procedures for the repatriated bodies.\nIt also expressed gratitude to the International Committee of the Red Cross for its assistance in the operation.\nRussian State Duma Deputy Shamsail Saraliev, who represents the parliamentary coordination group on issues related to the military operation, later revealed that Russia received the remains of 31 of its soldiers in return.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948395Z"
    },
    {
      "original": "Military Situation In Ukraine On October 23, 2025 (Maps Update)",
      "timestamp": "2025-10-23T20:41:02.948399Z"
    },
    {
      "original": "Military Situation In Ukraine On October 23, 2025 (Maps Update)",
      "timestamp": "2025-10-23T20:41:02.948414Z"
    },
    {
      "original": "Russian Army Strikes Crossings On Siverskyi Donets River As It Approaches Krasny Liman \nOn October 23, the Russian military approached the key city of Krasny Liman in the Donetsk direction, and struck several Ukrainian crossings on the nearby Siverskyi Donets River.\nTo the northeast of Krasny Liman, the Yug [South] Group of Forces reached Stavky. Fierce fighting with Kiev forces is now reportedly taking place inside the settlement. Russian troops also advanced towards the city from the east, capturing a large swath of land to the west of Zarichne in recent days.\n“The Russian Armed Forces have straightened the engagement line and improved their tactical position in the Stavky-Kirovsk sector of the Krasny Liman direction in the Donetsk People’s Republic. Ukrainian militants continue holding on to the strategic heights near Stavky despite casualties,” military expert Andrey Marochko told TASS.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948423Z"
    },
    {
      "original": "Russian Army Strikes Crossings On Siverskyi Donets River As It Approaches Krasny Liman \nOn October 23, the Russian military approached the key city of Krasny Liman in the Donetsk direction, and struck several Ukrainian crossings on the nearby Siverskyi Donets River.\nTo the northeast of Krasny Liman, the Yug [South] Group of Forces reached Stavky. Fierce fighting with Kiev forces is now reportedly taking place inside the settlement. Russian troops also advanced towards the city from the east, capturing a large swath of land to the west of Zarichne in recent days.\n“The Russian Armed Forces have straightened the engagement line and improved their tactical position in the Stavky-Kirovsk sector of the Krasny Liman direction in the Donetsk People’s Republic. Ukrainian militants continue holding on to the strategic heights near Stavky despite casualties,” military expert Andrey Marochko told TASS.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T20:41:02.948432Z"
    },
    {
      "original": "SYRIA IS ABOUT TO EXPLODE",
      "timestamp": "2025-10-23T20:41:02.948436Z"
    }
  ],
  "script_run_time": "2025-10-23T20:41:02.949141Z"
}