{
  "messages": [
    {
      "original": "🚀\nШвидкісна ціль на Сумщині курсом на Хотінь",
      "timestamp": "2025-08-14T11:46:53.890998Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з курська в областях де оголошено тривогу!",
      "timestamp": "2025-08-14T11:46:53.891015Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-14T11:46:53.891021Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Сумщини \n➡️\n курсом на південно-східний напрямок.\n🛵\n Суми - загроза застосування ударних БпЛА.",
      "timestamp": "2025-08-14T11:46:53.891029Z"
    },
    {
      "original": "🛵\n Сумщина та Чернігівщина - загроза застосування ударних БпЛА.",
      "timestamp": "2025-08-14T11:46:53.891034Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку та Синельниківський район Дніпропетровщини! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-14T11:46:53.891042Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-14T11:46:53.891046Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-14T11:46:53.891063Z"
    },
    {
      "original": "⚠️\n⚠️\nСпостерігається активність  розвідувальних БпЛА в  Дніпропетровській та Сумській областях, залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження. Не ігноруйте сигнали повітряної тривоги!",
      "timestamp": "2025-08-14T11:46:53.891070Z"
    },
    {
      "original": "🛸\n Ворожий  БпЛА в Запорізькому районі! Може бути навідником ворожих засобів ураження!У разі повітряної тривоги бережіть себе та перебувайте у безпечних місцях!",
      "timestamp": "2025-08-14T11:46:53.891074Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 24 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 14 серпня (із 21.00 13 серпня) противник атакував 2-ма зенітними керованими ракетами С-300/400 із Курської обл., 45-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Орел, Брянськ, Приморсько-Ахтарськ, Шаталово – рф. \nУдарними БпЛА атаковано прифронтові райони Донеччини та Чернігівщини, ракетами – Сумщину.\nПовітряний напад відбивали авіація, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 24 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання 21 БпЛА на 12 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-14T11:46:53.891096Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-14T11:46:53.891106Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-14T11:46:53.891114Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину та Харківщину.",
      "timestamp": "2025-08-14T11:46:53.891118Z"
    },
    {
      "original": "⚡\nДніпропетровська область (Синельниківський р-н) - активність  розвідувальних БпЛА, залучено засоби для їх збиття!",
      "timestamp": "2025-08-14T11:46:53.891123Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-14T11:46:53.891130Z"
    },
    {
      "original": "Швидкісна ціль на Харківщині.",
      "timestamp": "2025-08-14T11:46:53.891133Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Дніпропетровщину та Харківщину.",
      "timestamp": "2025-08-14T11:46:53.891138Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-14T11:46:53.891144Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Сум та Харківщини! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-14T11:46:53.891150Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на  Харківщину.",
      "timestamp": "2025-08-14T11:46:53.891155Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-08-14T11:46:54.553477Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-08-14T11:46:54.553488Z"
    },
    {
      "original": "Missile was detected late. It should arrive in ~5 minutes.",
      "timestamp": "2025-08-14T11:46:54.553492Z"
    },
    {
      "original": "Explosion in central Israel.",
      "timestamp": "2025-08-14T11:46:54.553495Z"
    },
    {
      "original": "No sirens sounded in Israel. No reports from the IDF yet.",
      "timestamp": "2025-08-14T11:46:54.553498Z"
    },
    {
      "original": "Flights have temporarily been suspended at Ben Gurion International Airport in Tel Aviv.",
      "timestamp": "2025-08-14T11:46:54.553501Z"
    },
    {
      "original": "Israeli sources report that interceptors were launched earlier. This could have been the source of the explosion in central Israel.",
      "timestamp": "2025-08-14T11:46:54.553504Z"
    },
    {
      "original": "The IDF reports that the ballistic missile was intercepted.",
      "timestamp": "2025-08-14T11:46:54.553508Z"
    },
    {
      "original": "The IDF just chose not to wake people up by triggering the sirens. They knew the result",
      "timestamp": "2025-08-14T11:46:54.553511Z"
    },
    {
      "original": "The IDF just chose not to wake people up by triggering the sirens. They knew the result",
      "timestamp": "2025-08-14T11:46:54.553514Z"
    },
    {
      "original": "Well that's new",
      "timestamp": "2025-08-14T11:46:54.553517Z"
    },
    {
      "original": "Regarding the situation with the Russian breakthrough at Dobropillya-Bilozerske:\nAfter over a week of deep infiltrations, the frontline has largely stabilised following the arrival of reinforcements from both sides.\nNewly arrived Ukrainian units, including the  93rd Mechanized Brigade, 12th \"Azov\" Brigade of the NGU, 4th \"Rubizh\" Brigade of the NGU, 1st \"Da Vinci\" assault battalion and the 25th Assault Battalion, have begun digging in and counterattacking.\nRussian DRGs have largely been cleared from the approaches of Dobropillya and Bilozerske, and Ukrainian counterattacks took place in two main directions. After re-securing the section of the Dobropillya - Kramatorsk Highway, the 1st \"Da Vinci\" assault battalion attempted to enter Zolotyi Kolodyaz, but were repelled by the newly reinforced Russian garrison (which may include special forces) after heavy fighting. The 2nd mechanised battalion of the 93rd brigade counterattacked in the direction of the heights south of Kucheriv Yar. The outcome of this is currently unknown.\nThe 12th \"Azov\" brigade of the NGU has begun digging in around Rubizhne and Novyi Donbas. Rubizhne is contested, but mostly under Ukrainian control. Novyi Donbas is under full Ukrainian control after the DRGs were cleared from around Dobropillya. It's unclear what Ukrainian unit is holding Stepy (possibly the Rubizh Brigade?), which lies between Rubizhne and Novyi Donbas. Additionally, the Russians have accumulated manpower in Nove Shakhove, and now have a strong presence there.\nIn the Dorozhnje area, Ukrainian forces - after withdrawing behind the village - managed to hold a defence in the treelines on the tactical heights there.\nIn the Vesele - Hruzke area, Russian forces were able to capture most of Vesele. There is no information from Hruzke, but the main Ukrainian presence is held in the gulleys to the southeast of the village, suggesting it could be in the grey zone.\nIn Shakhove - Volodomyrivka, Ukrainian forces hold a strong defence in Shakhove, while drones (probably from the \"Typhoon\" company of the NGU) are preventing the Russians from capturing the rest of Volodymyrivka. No new information from Pankivka, which remains under Russian control.\nOverall, the situation has significantly improved for Ukraine here, but at the cost of other sectors of the frontline being significantly weakened - notably the Kostyantynivka direction. This breakthrough will undoubtably be used by Russia in the future for further gains, as it has completely destabilised a section of Ukraine's main defensive line.",
      "timestamp": "2025-08-14T11:46:54.553531Z"
    },
    {
      "original": "Azov has made their first claim on Russian personnel losses in the Dobropillya direction from the actions of the 12th brigade, but has not commented on any counterattacks carried out by their forces.\nCurrently its known that the 1st \"Da Vinci\" Assault battalion and the 2nd battalion of the 93rd mechanised brigade have been counterattacking. No progress has been confirmed, and the attacks by the \"Da Vinci\" battalion on Zolotyi Kolodyaz yesterday were repelled.",
      "timestamp": "2025-08-14T11:46:54.553536Z"
    },
    {
      "original": "Azov has made their first claim on Russian personnel losses in the Dobropillya direction from the actions of the 12th brigade, but has not commented on any counterattacks carried out by their forces.  Currently its known that the 1st \"Da Vinci\" Assault battalion…",
      "timestamp": "2025-08-14T11:46:54.553539Z"
    },
    {
      "original": "This confirms that so far, Azov's efforts have been largely confined to entrenching in new positions to contain the Russian advance, and mopping up DRGs - contrary to those claiming that Azov had cut the Russian spearhead in half.",
      "timestamp": "2025-08-14T11:46:54.553542Z"
    },
    {
      "original": "FSB says in 2024 it uncovered Ukraine’s work on the Sapsan Tactical Ballistic Missile Complex (500–750 km range), mapping production facilities, underground assembly sites, supply routes, and leadership tied to German handlers.\nThe Russian military struck these facilities in Dnipropetrovsk, Zhytomyr, and Sumy, hitting both ground and underground targets, and dealing a major blow to Ukraine’s efforts to build a domestically-produced long-range missile program.",
      "timestamp": "2025-08-14T11:46:54.553546Z"
    },
    {
      "original": "A Russian channel reports that a Ukrainian \"DARTS\" drone hit the Belgorod Oblast Administrative Building just now.",
      "timestamp": "2025-08-14T11:46:54.553549Z"
    },
    {
      "original": "Possible Kh-59 cruise missile in Kharkiv Oblast.",
      "timestamp": "2025-08-14T11:46:54.553553Z"
    },
    {
      "original": "Possible Kh-59 cruise missile in Kharkiv Oblast.",
      "timestamp": "2025-08-14T11:46:54.553557Z"
    },
    {
      "original": "Disappeared. Misidentification",
      "timestamp": "2025-08-14T11:46:54.553560Z"
    },
    {
      "original": "Disappeared. Misidentification",
      "timestamp": "2025-08-14T11:46:54.553563Z"
    },
    {
      "original": "This is an S-400 air defence missile targeting Ukrainian aircraft near Stary Saltiv, Kharkiv Oblast.",
      "timestamp": "2025-08-14T11:46:54.553566Z"
    },
    {
      "original": "Average AMK Mapping twitter comment section. \nSee, this is actually a 10,000 IQ play on my part, where I'm secretly supporting both sides. More sides I support = more followers.\n😱\n😱\n😱",
      "timestamp": "2025-08-14T11:46:54.553575Z"
    },
    {
      "original": "Regarding the situation with the Russian breakthrough at Dobropillya-Bilozerske:  After over a week of deep infiltrations, the frontline has largely stabilised following the arrival of reinforcements from both sides.  Newly arrived Ukrainian units, including…",
      "timestamp": "2025-08-14T11:46:54.553579Z"
    },
    {
      "original": "Ok, we have a critical update from the Zolotyi Kolodyaz breakthrough. This could be the defining moment for Pokrovsk.\n👌\n👌\n👌",
      "timestamp": "2025-08-14T11:46:54.553586Z"
    },
    {
      "original": "Russian forces have captured the village of Andriivka-Klevtsove, Prosyana direction, Donetsk Oblast.\nPre-war population: ~777.\nTotal land area: ~3.49km²",
      "timestamp": "2025-08-14T11:46:54.553590Z"
    }
  ],
  "script_run_time": "2025-08-14T11:46:55.199469Z"
}