{
  "messages": [
    {
      "original": "🛸\n Ворожий БпЛА на півночі Полтавщини! Залучено засоби для збиття.",
      "timestamp": "2025-08-10T18:45:49.230035Z"
    },
    {
      "original": "БпЛА з Полтавщини \n➡️\n на Кіровоградщину.",
      "timestamp": "2025-08-10T18:45:49.230054Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі ударні БпЛА з Бєлгородської обл.. рф \n➡️\n на  північ Харківщини!",
      "timestamp": "2025-08-10T18:45:49.230064Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-08-10T18:45:49.230075Z"
    },
    {
      "original": "🛸\n Північніше Сум, східніше Харкова, на сході Дніпропетровщини - ворожі розвідувальні БпЛА, які можуть бути навідниками ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-08-10T18:45:49.230081Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 70 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 10 серпня (із 23.00 9 серпня) противник атакував 100 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Курськ, Приморсько-Ахтарськ – рф., Гвардійське – ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.00, протиповітряною обороною збито/подавлено 70 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання 30 БпЛА на 12 локаціях у прифронтових регіонах Дніпропетровщини, Харківщини, Сумщини та Чернігівщини, а також падіння збитих (уламки) на 3 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-10T18:45:49.230113Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-08-10T18:45:49.230119Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-10T18:45:49.230124Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та південно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-10T18:45:49.230133Z"
    },
    {
      "original": "🚀\nКАБи на схід Харківщини та Донеччину!",
      "timestamp": "2025-08-10T18:45:49.230138Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-08-10T18:45:49.230143Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Донеччина: група ворожих ударних БпЛА \n➡️\n повз Новоселівку.",
      "timestamp": "2025-08-10T18:45:49.230151Z"
    },
    {
      "original": "⚠\n Увага! \n🛵\n Донеччина: група ворожих ударних БпЛА \n➡️\n повз Новоселівку.",
      "timestamp": "2025-08-10T18:45:49.230160Z"
    },
    {
      "original": "🛵\n Донеччина: ударні БпЛА \n➡️\n в районі Слов'янська, Краматорська, Білозерського.",
      "timestamp": "2025-08-10T18:45:49.230166Z"
    },
    {
      "original": "🛸\n Чернігівщина: розвідувальний БпЛА \n➡️\n в районі Олишівки. Залучено засоби для збиття.",
      "timestamp": "2025-08-10T18:45:49.230172Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-08-10T18:45:49.230179Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Курська.",
      "timestamp": "2025-08-10T18:45:49.230184Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Курська.",
      "timestamp": "2025-08-10T18:45:49.230188Z"
    },
    {
      "original": "Швидкісна ціль \n➡️\n через Сумщину!",
      "timestamp": "2025-08-10T18:45:49.230193Z"
    },
    {
      "original": "🚀\nКАБи \n➡️\n на Харківщину та Сумщину!",
      "timestamp": "2025-08-10T18:45:49.230199Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Курська.",
      "timestamp": "2025-08-10T18:45:49.230203Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-10T18:45:49.230209Z"
    },
    {
      "original": "🚀\nКАБи \n➡️\n на Запорізьку область!",
      "timestamp": "2025-08-10T18:45:49.230215Z"
    },
    {
      "original": "🛵\n Ударні БпЛА з Херсонщини \n➡️\n на Миколаївщину.",
      "timestamp": "2025-08-10T18:45:49.230220Z"
    },
    {
      "original": "🚀\nКАБи \n➡️\n на Сумщину!",
      "timestamp": "2025-08-10T18:45:49.230226Z"
    },
    {
      "original": "Another Iskander to Khotin. Same direction.",
      "timestamp": "2025-08-10T18:45:49.766485Z"
    },
    {
      "original": "Another Iskander to Khotin. Same direction.",
      "timestamp": "2025-08-10T18:45:49.766497Z"
    },
    {
      "original": "This one also disappeared",
      "timestamp": "2025-08-10T18:45:49.766501Z"
    },
    {
      "original": "U.S. President Donald Trump announced that he and Putin will be meeting next Friday on August 15 in Alaska. Kremlin Aide Yuri Ushakov stated that the focus of the meeting will be on working towards a long-term peaceful resolution in Ukraine. An invitation has also been extended to Trump to visit Putin in Russia.\nThis will be the first US-Russia summit since 2021, and the first time since Trump and Putin met since 2018.",
      "timestamp": "2025-08-10T18:45:49.766506Z"
    },
    {
      "original": "Russian forces have captured the village of Rusyn Yar, southwestern flank of Kostyantynivka, Donetsk Oblast.\nPre-war population: ~199.\nTotal land area: ~0.94km².",
      "timestamp": "2025-08-10T18:45:49.766511Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces made significant progress towards capturing two of the most difficult parts of the whole frontline.\nRussian forces advanced in two areas. In the southeast, after DRG activity and the expansion of the grey zone, they began assault operations on the eastern part of the Serebryanskyi Forest from multiple directions. They were able to break through from the north, occupying various trench networks, and reaching the holiday resort on the northern bank of the Siverskyi Donets River. Additional progress was made along the whole line of contact to the east, including along the northern bank of the river. It's unclear if there are any Ukrainian soldiers still in the eastern part of the forest, but if there are they are now surrounded. \nTo the northwest, Russian forces continued to advance in Torske, and after further consolidating their positions in the northern part of the village and bringing in more reinforcements, they made further progress to the south, capturing the central and eastern parts of the settlement, including the church. They were also able to capture most of the remaining Ukrainian strongpoints in the treelines east of Torske.\n+ ~23.78km² in favour of Russia.",
      "timestamp": "2025-08-10T18:45:49.766517Z"
    },
    {
      "original": "Never touching Reddit again",
      "timestamp": "2025-08-10T18:45:49.766520Z"
    },
    {
      "original": "The 10km Russian DRG breakthrough to Zolotyi Kolodyaz, northeast of Dobropillya, has been confirmed. Assault units followed soon afterwards, establishing positions 7km deep into Ukrainian lines. \nThis all occurred in under 48 hours, making it one of the largest and fastest breakthroughs since the transition to attritional warfare.",
      "timestamp": "2025-08-10T18:45:49.766528Z"
    },
    {
      "original": "Russian forces have captured the village of Pankivka, northeastern flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~84.\nTotal land area: ~0.42km².",
      "timestamp": "2025-08-10T18:45:49.766533Z"
    },
    {
      "original": "The 10km Russian DRG breakthrough to Zolotyi Kolodyaz, northeast of Dobropillya, has been confirmed. Assault units followed soon afterwards, establishing positions 7km deep into Ukrainian lines.   This all occurred in under 48 hours, making it one of the largest…",
      "timestamp": "2025-08-10T18:45:49.766537Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a significant breakthrough to the east of Dobropillya, occupying positions 7km deep into Ukrainian lines.\nAfter artillery preparation on the village of Zolotyi Kolodyaz, Russian DRG units infiltrated through lightly defended Ukrainian lines east of Nove Shakhove, and advanced approximately 10km north. They were able to enter Zolotyi Kolodyaz where they engaged in clashes with disorganised and unprepared Ukrainian soldiers. Nevertheless, Ukraine was able to maintain control over the village, however the grey zone now extends to its southern outskirts.\nNormal Russian assault detachments then followed the DRGs, pushing north down the treelines on the tactical heights, and capturing the positions on either side, including on the edges of three different quarries. They were able to reach the southern edge of the Velyka Balka Gulley, and pushed north along it, following the initial path of the DRGs. Russian forces captured positions in this gulley, in three smaller gulleys branching off to the east and west, and in the nearby treelines at the edge of the tactical heights. \nMeanwhile, further south, reinforcements were brought in to support the assault operations. These reinforcements began attacking the flanks, where they entered the village of Nove Shakhove and captured positions in its eastern houses. The Russians were also able to establish control over the rest of the Hetkova Balka Gulley, while other forces approached the eastern outskirts of Vilne. \nTo the east of this breakthrough, Russian forces continued to advance towards Shakhove, and completed the capture of Pankivka, aligning with the front on the opposite bank of the Kazenyi Torets River in Volodymyrivka. Positions were also seized in the treelines on the tactical heights to the west. \nTo the southwest of the breakthrough, Russian forces continued to assault the Ukrainian strongpoints at the Dorozhnje Freight Train Station, and in the adjacent village of the same name. DRGs are also continuing to infiltrate to the south of Bilytske, reaching the Dobropillya - Pokrovsk Highway.\n+ ~22.20km² in favour of Russia.",
      "timestamp": "2025-08-10T18:45:49.766545Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a significant breakthrough to the east of Dobropillya, occupying positions 7km deep into Ukrainian lines.  After artillery preparation on the village of Zolotyi Kolodyaz, Russian DRG units infiltrated…",
      "timestamp": "2025-08-10T18:45:49.766548Z"
    },
    {
      "original": "With this new breakthrough, Russian DRGs are now within 4.5km of the Dobropillya-Kramatorsk Highway., and Russian assault units are within 6.7km \nIf Russian soldiers can capture Zolotyi Kolodyaz, this highway will become unusable for Ukrainian forces, meaning they can only use the Oleksandrivka-Kramatorsk highway to reach Kramatorsk from the west, and subsequently supply Druzhkivka, Kostyantynivka and all the surrounding areas there. \nOf course, this breakthrough may have been opportunistic in nature, and Russia may not even be trying to cut the highway at this moment. They will need to do a lot of consolidation and bring up significant reinforcements to secure this wedge - let alone exploit and expand it. But this development towards the highway is not a good sign for Ukraine, not only from a logistical view, but simply the fact that it happened, and that it happened so suddenly and quickly. \nQuoting Deepstate, Ukraine's manpower situation in the Pokrovsk direction is \"catastrophic\". Major efforts will need to take place in order to constrain and contain this breakthrough, but a lot of it depends on what Russia is focusing on, and how many focuses they have. \nAlso, interesting to note is that the Donetsk OVA head announced that this highway would be closed to all civilian vehicles less than 4 weeks ago on July 16. At that time, the frontline was around 17km away, significantly more than today's 6.7km. It's become clear that these measures come in advance of Russian successes that the Ukrainian command knows are imminent. \nTake the mandatory evacuation orders for families with children from Kramatorsk for example. This occurred shortly before Russia captured Chasiv Yar. \nAnother example is the mandatory evacuation orders of families with children from Dobropillya, which occurred just before the breakthrough to Bilytske. \nOverall, Ukraine's manpower shortages are reaching levels not seen before in this war. Mobilisation is only slowing the inevitable, and these breakthroughs are only set to become larger and more frequent.",
      "timestamp": "2025-08-10T18:45:49.766557Z"
    },
    {
      "original": "Sirens east of Gaza. Threat of rocket launches.",
      "timestamp": "2025-08-10T18:45:49.766560Z"
    },
    {
      "original": "Sirens east of Gaza. Threat of rocket launches.",
      "timestamp": "2025-08-10T18:45:49.766563Z"
    },
    {
      "original": "Explosions are heard. Unclear if from Israeli artillery shelling / airstrikes, or from rockets.",
      "timestamp": "2025-08-10T18:45:49.766566Z"
    },
    {
      "original": "Explosions are heard. Unclear if from Israeli artillery shelling / airstrikes, or from rockets.",
      "timestamp": "2025-08-10T18:45:49.766569Z"
    },
    {
      "original": "Explosions are from Israeli air defence activity.",
      "timestamp": "2025-08-10T18:45:49.766575Z"
    },
    {
      "original": "Explosions are from Israeli air defence activity.",
      "timestamp": "2025-08-10T18:45:49.766580Z"
    },
    {
      "original": "2 rockets were intercepted.",
      "timestamp": "2025-08-10T18:45:49.766583Z"
    },
    {
      "original": "2 rockets were intercepted.",
      "timestamp": "2025-08-10T18:45:49.766586Z"
    },
    {
      "original": "No impacts reported. Probably only 2 launches.",
      "timestamp": "2025-08-10T18:45:49.766589Z"
    },
    {
      "original": "So, what happened to that large-scale combined Russian missile attack that was set occur?\nWell, Steve Witkoff's visit to Moscow coincided with the day that this attack was supposed to take place, resulting in its postponement. Now Trump and Putin have agreed to meet in Alaska on August 15, meaning that it's unlikely that this attack will take place any time before August 17 so as not to tarnish Russia's image of seeking a peaceful resolution to the war. \nHowever, Russia has not been quiet behind the scenes. Accumulation of Geran-2 drones, Kh-101 cruise missiles, and Iskander-M ballistic missiles has been taking place.\nSince the last combined missile attack 13 days ago on July 28, 7 IL-76MD military transport aircraft have made flights to Engels-2 Airbase in Saratov Oblast, which is the main airbase used for equipping Tu-95MS and Tu-160 strategic bombers. 4 Tu-95s are currently stationed at Engels-2, and have been there for over four days, which is a very rare phenomenon recently for this base. Three of these bombers have been conducting nightly training for young pilots, while one is undergoing active maintenance. \nAs for Gerans, very few have been launched over the past 5 days, with no more than 50 per night. While it may seem like a lot from the reports, the vast majority of them are Gerbera drones, which have no warhead and aim to waste and further overwhelm Ukrainian air defence. This means that Gerans are being accumulated at the different launch points for usage in the next combined missile attacks. \nIskanders have also not been used much lately, with some days not witnessing a single strike. This also indicates accumulation, especially in Voronezh, Bryansk and Rostov Oblasts.",
      "timestamp": "2025-08-10T18:45:49.766596Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a significant breakthrough to the east of Dobropillya, occupying positions 7km deep into Ukrainian lines.  After artillery preparation on the village of Zolotyi Kolodyaz, Russian DRG units infiltrated…",
      "timestamp": "2025-08-10T18:45:49.766600Z"
    },
    {
      "original": "This is very true. We saw similar situations occur in south Donetsk Oblast, but that was only with the direction that the fortifications were facing.",
      "timestamp": "2025-08-10T18:45:49.766603Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a significant breakthrough to the east of Dobropillya, occupying positions 7km deep into Ukrainian lines.  After artillery preparation on the village of Zolotyi Kolodyaz, Russian DRG units infiltrated…",
      "timestamp": "2025-08-10T18:45:49.766609Z"
    },
    {
      "original": "Locals report that at least 2 Geran-2 drones impacted the centre of Zolotyi Kolodyaz a short time ago, which is where Russian DRGs infiltrated a few days ago. \nThis is part of a large-scale daytime attack on Donetsk Oblast, which involved approximately 20 Gerans. Several impacts were also recorded in Dobropillya and Bilozerske. Power outages are reported in both cities, while internet connection is fully down in Dobropillya. \nThe video is from Bilozerske, where at least two civilians were injured from the strikes.",
      "timestamp": "2025-08-10T18:45:49.766614Z"
    },
    {
      "original": "Locals report that at least 2 Geran-2 drones impacted the centre of Zolotyi Kolodyaz a short time ago, which is where Russian DRGs infiltrated a few days ago. \nThis is part of a large-scale daytime attack on Donetsk Oblast, which involved approximately 20 Gerans. Several impacts were also recorded in Dobropillya and Bilozerske. Power outages are reported in both cities, while internet connection is fully down in Dobropillya. \nThe video is from Bilozerske, where at least two civilians were injured from the strikes.",
      "timestamp": "2025-08-10T18:45:49.766619Z"
    },
    {
      "original": "Ukraine truly will be known as the whack-a-mole war. Never predict Russia to push in one area for a long time - at least not for now. \nRemember what I and others said about the Sumy and Kharkiv incursions? Don’t lose sight of the true goals of attritional warfare… like people from both sides constantly do.",
      "timestamp": "2025-08-10T18:45:49.766624Z"
    }
  ],
  "script_run_time": "2025-08-10T18:45:50.154272Z"
}