{
  "messages": [
    {
      "original": "🛸\n🛵\n БпЛА в напрямку Сум зі  сходу.",
      "timestamp": "2025-11-18T16:13:15.276875Z"
    },
    {
      "original": "🛵\n БпЛА на межі Харківщини та Сумщини, курс південно-західний.",
      "timestamp": "2025-11-18T16:13:15.276890Z"
    },
    {
      "original": "🛵\n БпЛА по межі Полтавщини і Харківщини курсом на Харківщину (вектор - Златопіль).",
      "timestamp": "2025-11-18T16:13:15.276899Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Дніпропетровщини, курсом на Павлоград.",
      "timestamp": "2025-11-18T16:13:15.276905Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на схід Харківщини!",
      "timestamp": "2025-11-18T16:13:15.276911Z"
    },
    {
      "original": "🛵\n БпЛА на межі Харківщини та Сумщини, курсом на Полтавщину.\n🛵\n БпЛА на півдні Харківщини, курс південно-східний.\n🛸\n Активність розвідувальних БпЛА на Запоріжжі! Залучено засоби для їх збиття.",
      "timestamp": "2025-11-18T16:13:15.276920Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-11-18T16:13:15.276925Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на північ Чернігівщини!",
      "timestamp": "2025-11-18T16:13:15.276929Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на північ Харківщини!",
      "timestamp": "2025-11-18T16:13:15.276941Z"
    },
    {
      "original": "🛵\n БпЛА в південно-західній частині Харківщини, північніше Сахновщини, курс південний/південно-східний.",
      "timestamp": "2025-11-18T16:13:15.276945Z"
    },
    {
      "original": "🛵\n БпЛА в південній частині Харківщини, курсом на Дніпропетровщину.",
      "timestamp": "2025-11-18T16:13:15.276950Z"
    },
    {
      "original": "🛵\n БпЛА в південній частині Харківщини, курсом на Дніпропетровщину.",
      "timestamp": "2025-11-18T16:13:15.276955Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград.",
      "timestamp": "2025-11-18T16:13:15.276959Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-18T16:13:15.276964Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі.",
      "timestamp": "2025-11-18T16:13:15.276968Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння  з північно-східного напрямку.",
      "timestamp": "2025-11-18T16:13:15.276973Z"
    },
    {
      "original": "🚀\n Пуски  керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-18T16:13:15.276977Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння  з північно-східного напрямку.",
      "timestamp": "2025-11-18T16:13:15.276982Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-18T16:13:15.276986Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-11-18T16:13:15.276990Z"
    },
    {
      "original": "Дніпро - в укриття!",
      "timestamp": "2025-11-18T16:13:15.276993Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград з північно-східного напрямку.",
      "timestamp": "2025-11-18T16:13:15.276998Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Брянська.",
      "timestamp": "2025-11-18T16:13:15.277002Z"
    },
    {
      "original": "Sounding the alarms \n😱\nEdit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-18T16:13:16.044489Z"
    },
    {
      "original": "Sounding the alarms \n😱\n  Edit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-18T16:13:16.044517Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-18T16:13:16.044521Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-18T16:13:16.044529Z"
    },
    {
      "original": "This is what happens when you lie to your audience for nearly four years straight, while believing the opposite of what you say behind closed doors.",
      "timestamp": "2025-11-18T16:13:16.044532Z"
    },
    {
      "original": "🇵🇸\n🇮🇱\n⚡️\n- \"If the United Nations pushes for recognition of Palestine, I will order targeted assassinations of senior Palestinian Authority terrorists and the arrest of Mahmoud Abbas himself.\" - Israeli National Security Minister Ben Gvir.",
      "timestamp": "2025-11-18T16:13:16.044539Z"
    },
    {
      "original": "Last night, Russia carried out a combined missile and drone attack on the city of Berestyn, Kharkiv Oblast. \nAt least five Geran-2 drones and four Iskander-M ballistic missiles attacked an unknown target within the city limits.",
      "timestamp": "2025-11-18T16:13:16.044543Z"
    },
    {
      "original": "Over the last week, I've seeing a lot of Pro-Ukraine accounts beginning to doom about the war. People are highlighting the massive issues plaguing the Armed Forces of Ukraine, and the Russian superiority in all the different fields of war.\nBut I guarantee you, that at some point towards the end of 2025 and into 2026, Ukraine will carry out some sort of PR-related operation like Spiderweb or Kursk which will \"win back\" these supporters. And sure enough, they will follow like sheep and good lil' patriots, changing up the presumed narrative, and shifting the goal posts back, once again, to restoring the 2014, or even 1991 borders. \nWe saw a similar phenomenon last year. After Russia entered northern Kharkiv Oblast and attacked the cities of Vovchansk and Lyptsi, and Ukraine redeployed units away from the Donbas, Russia began rapidly advancing in the directions of Pokrovsk, Vuhledar, Ukrainsk, and Kurakhove. Pro-Ukrainians began sounding the alarms, with these rapid advances massively contrasting the prolonged and difficult battle for Avdiivka. Then, in early August, Ukraine launched their Kursk operation, and everything changed back. \nIt's just the ebb and flow of the uninformed parts of the information space. But slowly, the goal posts are shifting. It's not linear, but the goal posts are trending in favour of Russia, and away from the original goal which was set of restoring the 1991 borders. This will only accelerate, but of course with a delay to Russian progress as we have seen in the past.",
      "timestamp": "2025-11-18T16:13:16.044549Z"
    },
    {
      "original": "I cannot believe this. \nUkraine's train stations get hit by 4 ballistic missiles and half a dozen Geran-2 drones, and only result in some rerouting and delays of up to 1 hour. \nMy train lines get COMPLETELY CANCELLED for the entire day for an average of 4 days per week due to \"track repairs\". You're repairing tracks four times per week??? How is that even possible?",
      "timestamp": "2025-11-18T16:13:16.044554Z"
    },
    {
      "original": "🇱🇧\n🇮🇱\n - Israel has now killed 367 Hezbollah members since the Israel-Hezbollah ceasefire 356 days ago. \nHezbollah has responded 0 times.",
      "timestamp": "2025-11-18T16:13:16.044561Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:\nYesterday, 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. It is unlikely to be equipped with Kh-101 cruise missiles, as another Tu-160 redeployed from Engels-2 Airbase to Ukrainka Airbase, suggesting a rotation was carried out for training purposes, as this bomber has been stationed at Engels-2 for a long time and was only ever used for training.\n2 Tu-95MS and 1 Tu-160 landed at Engels-2 Airbase just now after redeploying from Ukrainka airbase and will also be equipped with Kh-101 missiles. The 2 Tu-95MS will likely make a flight to Olenya Airbase, Murmansk Oblast, in the next 36 hours. \nAnother IL-76MD cargo plane, along with an An-26 cargo plane landed at Rostov Airbase. The cargo consists of additional Iskander-M ballistic missiles, which will be delivered to OTRK installations near Taganrog, Rostov Oblast. \nRemember, 2 Iskanders were launched from Taganrog last night at a target in Berestyn, Kharkiv Oblast. It's also possible (but unlikely in my opinion) that a portion of these Iskanders from Rostov Airbase are being delivered to OTRK installations at Millerovo Airbase, Rostov Oblast.\nNew deliveries of at least 150 Geran-2 drones have been made to the launch sites at Millerovo Airbase, Rostov Oblast, and Navlya Test Site, Bryansk Oblast, via rail. Accumulation of drones at launch points surrounding Ukraine that have been allocated for this upcoming attack will be over 400 now. \nOne \"Buyan-M\" Corvette was equipped with up to 8 Kalibr cruise missiles at Novorossiysk Naval Base, Krasnodar Krai. No other Kalibr carriers are known to be equipped with missiles, so if the upcoming attack occurs in the next two days, it's unlikely that Kalibrs will be used\nOne MiG-31K fighter carried out rare, long-range training from Savasleika Airbase, Nizhny Novgorod Oblast. An IL-76M tanker from Diaghilev Airbase, Ryazan Oblast, took part in refueling the aircraft. \nCurrently, there are 8 MiG-31Ks stationed at Savasleika Airbase. Their equipment status is unknown, but likely only a portion are equipped with Kinzhal missiles. The 2 MiG-31Ks at Akhtubinsk Airbase, Astrakhan Oblast, are not equipped with missiles.\nRight now, there are 3 Tu-95MS at Olenya Airbase, 3 Tu-95MS at Engels-2 Airbase, and 5 Tu-160s at Engels-2 Airbase. Currently confirmed to be equipped / are being equipped with missiles are: 6 Tu-95MS and 3 Tu-160s. \nThe next large-scale missile attack is unlikely to take place tonight, but there is an increased threat for Wednesday night / Thursday morning, and the three nights after that.",
      "timestamp": "2025-11-18T16:13:16.044572Z"
    },
    {
      "original": "⚡\n🇷🇺\n \nKommersant:\n Russia’s United Aircraft Corporation (OAK) has delivered two fifth-generation Su-57 stealth fighters to an undisclosed foreign customer. OAK CEO Vadim Badeha stated that the aircraft have already entered combat duty, are performing well, and the buyer is satisfied. \nThe announcement comes as Russia showcased the export version Su-57E and the upgraded Yak-130M at the Dubai Airshow 2025. This marks the first confirmed export delivery of the Su-57.\n@wfwitness",
      "timestamp": "2025-11-18T16:13:16.044581Z"
    },
    {
      "original": "Twitter just realised they almost went a whole week without breaking, so had to quickly fix that.",
      "timestamp": "2025-11-18T16:13:16.044584Z"
    },
    {
      "original": "A car-ramming and stabbing incident has just taken place at Gush Etzion Junction in the Israeli-occupied part of the West Bank. \nThree Palestinians took part in the attack and have reportedly all been killed. One woman is in critical condition and unconscious.",
      "timestamp": "2025-11-18T16:13:16.044588Z"
    },
    {
      "original": "A car-ramming and stabbing incident has just taken place at Gush Etzion Junction in the Israeli-occupied part of the West Bank.   Three Palestinians took part in the attack and have reportedly all been killed. One woman is in critical condition and unconscious.",
      "timestamp": "2025-11-18T16:13:16.044591Z"
    },
    {
      "original": "Four Israelis are injured. The woman in critical condition was reportedly accidentally shot by IDF security forces as they fired on the Palestinian perpetrators.",
      "timestamp": "2025-11-18T16:13:16.044594Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:  Yesterday, 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. It is unlikely to be equipped with Kh-101…",
      "timestamp": "2025-11-18T16:13:16.044598Z"
    },
    {
      "original": "1 Tu-95MS departed from Engels-2 Airbase, Saratov Oblast, redeploying to Olenya Airbase, after it was equipped with Kh-101 cruise missiles. The other bomber will take off shortly.",
      "timestamp": "2025-11-18T16:13:16.044601Z"
    },
    {
      "original": "Autumn logistics in Ukraine.",
      "timestamp": "2025-11-18T16:13:16.044604Z"
    },
    {
      "original": "Polish Prime Minister Donald Tusk reports that the two suspects for blowing up the Warsaw-Dęblin were Ukrainian citizens, collaborating with Russian intelligence services. Both have reportedly flown back to Belarus.",
      "timestamp": "2025-11-18T16:13:16.044609Z"
    },
    {
      "original": "Russian forces have captured the village of Vesele, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~35.\nTotal land area: ~0.18 km².",
      "timestamp": "2025-11-18T16:13:16.044614Z"
    },
    {
      "original": "Multiple Ukrainian ballistic missiles were shot down by Russian air defence over Voronezh. No impacts were reported.\nIt's possible that these were Hrim-2 \"Sapsan\" missiles.",
      "timestamp": "2025-11-18T16:13:16.044618Z"
    },
    {
      "original": "Multiple Ukrainian ballistic missiles were shot down by Russian air defence over Voronezh. No impacts were reported.\nIt's possible that these were Hrim-2 \"Sapsan\" missiles.",
      "timestamp": "2025-11-18T16:13:16.044623Z"
    },
    {
      "original": "There is a possible threat of a large-scale Russian missile attack tonight. Nothing is certain, and nothing significant has been recorded, but there is an increased threat. \nI will update in the morning (NZ time).",
      "timestamp": "2025-11-18T16:13:16.044628Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 17, 2025\nOn November 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-18T16:13:16.846984Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 17, 2025\nOn November 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-18T16:13:16.847000Z"
    },
    {
      "original": "Russian Forces Are Back In Southern Syria As Talks With Israel Reach Dead End (Video)\nThe redeployment of Russian forces in southern Syria appears to be nearing as talks between the country’s new Islamist-led government and Israel are reported to have reached a dead end.\nOn November 18, Russian defense officials conducted a tour in the region, in the first such move since the fall of the regime of President Bashar al-Assad last year.\n“A joint delegation from the Syrian and Russian ministries of defense conducted a field tour that included a number of military points and sites in southern Syria, with the aim of learning about the situation on the ground within the framework of the existing cooperation between the two sides,” a statement from the Media and Communication Department published by the state-run Syrian Arab News Agency reads.\nJust a few hours after the tour was concluded on November 17, Israel’s Kan public broadcaster reported that talks with Syria are currently at a dead end.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847011Z"
    },
    {
      "original": "Russian Forces Are Back In Southern Syria As Talks With Israel Reach Dead End (Video)\nThe redeployment of Russian forces in southern Syria appears to be nearing as talks between the country’s new Islamist-led government and Israel are reported to have reached a dead end.\nOn November 18, Russian defense officials conducted a tour in the region, in the first such move since the fall of the regime of President Bashar al-Assad last year.\n“A joint delegation from the Syrian and Russian ministries of defense conducted a field tour that included a number of military points and sites in southern Syria, with the aim of learning about the situation on the ground within the framework of the existing cooperation between the two sides,” a statement from the Media and Communication Department published by the state-run Syrian Arab News Agency reads.\nJust a few hours after the tour was concluded on November 17, Israel’s Kan public broadcaster reported that talks with Syria are currently at a dead end.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847020Z"
    },
    {
      "original": "Syria Supports One China Principle Amid Reports Of Plan To Extradite Uyghur Jihadists\nSyrian Foreign Minister Asaad al-Shaibani has pledged to deepen collaboration on “counterterrorism” with China on his first visit to Beijing since the fall of the regime of former President Bashar al-Assad last year, amid reports suggesting that the country could extradite Uyghur jihadists.\nA statement published by the state-run Syrian Arab News Agency (SANA) said that al-Shaibani and Chinese counterpart Wang Yi agreed during the visit on November 17 that they would work together on combating “terrorism”.\nThe main issue for China IS the Uighur who had gone to Syria after war broke out in 2011 to fight al-Assad, with many joining the Turkistan Islamic Party (TIP).\nUp to 4,000 Uighurs were reportedly members of the TIP, which was integrated after the fall of Assad into the 84th Division, a unit of the new Syrian military. The Emir of the party was even given the rank of Brigadier General.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847030Z"
    },
    {
      "original": "New Cold War At America’s Doorstep: Trump’s Military Buildup Triggers China–Russia Countermoves\nThe arrival of a major US aircraft carrier strike group in the Caribbean this week has sent shockwaves across Latin America, bringing back a new version of the Monroe Doctrine in the context of the New Cold War in the Hemisphere. The deployment marks the beginning of a massive Trump administration military operation framed as a twin “war on drugs” and “war on terror” campaign in a way that, ironically enough, is also reminiscent of the George W.\nCNN Brasil reports that Caracas has mobilized thousands of Russian-supplied missiles in response.\nWashington’s messaging has been sufficiently vague to allow multiple interpretations, but broad enough to justify a sweeping regional buildup. The operation is unprecedented in scale, which raises the stakes for Venezuela and its allies, with the US selling the operation as an “anti-cartel” surge across the continent.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847040Z"
    },
    {
      "original": "Russia Announces First Delivery Of Su-57 Fighter Jet To Foreign Customer\nRussia has confirmed the first ever export of its Sukhoi Su-57 fifth-generation stealth fighter jet to an unnamed foreign buyer.\nUnited Aircraft Corporation (UAC) Director General Vadim Badeha told the state broadcaster Pyerviy Kanal on November 18 that a foreign customer had already received two Su-57 fighter jets.\n“Our foreign customer and partner has already taken delivery of the first two aircraft. They have begun combat duty and are demonstrating their best qualities. The customer is satisfied,” Badeha said.\nBadeha did not identify the country which received the Su-57 fighter jets, but Russian media reports suggested Algeria as a possible buyer.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847049Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – November 18, 2025",
      "timestamp": "2025-11-18T16:13:16.847053Z"
    },
    {
      "original": "Russian Strikes On Ukraine's Energy And Railway Infrastructure Worsen Crisis\nOn the night of November 18, according to the Ukrainian Air Force, Russian forces launched four Iskander-M ballistic missiles and 114 kamikaze drones, of which 101 aerial targets were reportedly shot down or suppressed.\nThe primary Russian strike was concentrated on targets within four regions of Ukraine. The most intense attacks targeted Dnipropetrovsk Region, particularly the city of Dnipro. The assault focused on railway infrastructure facilities: a suburban depot, a repair shop, and the station building were damaged.\nFurthermore, a strike hit a television and radio center housing the offices of media companies, including the news agency \"Suspilne Dnipro\" and \"Ukrainian Radio.\" Strikes were also recorded in the areas of Vasylkivka, Shakhtarske, Petropavlivka, and the outskirts of Pavlohrad.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847063Z"
    },
    {
      "original": "Russian Strikes On Ukraine's Energy And Railway Infrastructure Worsen Crisis\nOn the night of November 18, according to the Ukrainian Air Force, Russian forces launched four Iskander-M ballistic missiles and 114 kamikaze drones, of which 101 aerial targets were reportedly shot down or suppressed.\nThe primary Russian strike was concentrated on targets within four regions of Ukraine. The most intense attacks targeted Dnipropetrovsk Region, particularly the city of Dnipro. The assault focused on railway infrastructure facilities: a suburban depot, a repair shop, and the station building were damaged.\nFurthermore, a strike hit a television and radio center housing the offices of media companies, including the news agency \"Suspilne Dnipro\" and \"Ukrainian Radio.\" Strikes were also recorded in the areas of Vasylkivka, Shakhtarske, Petropavlivka, and the outskirts of Pavlohrad.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847073Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 18, 2025 (Map Update)",
      "timestamp": "2025-11-18T16:13:16.847077Z"
    },
    {
      "original": "Russian Army Reaches Haichur River As Ukrainian Troops Flee Pokrovsk Disguised As Civilians (Videos)\nOn November 18, the Russian military reached the Haichur River in Dnipropetrovsk and expanded its control in Pokrovsok and nearby areas in Donetsk forcing more Ukrainian troops to flee in a disorganized manner.\nThe Vostok [East] Group of Forces reached Haichur after capturing Nechayevka in Dnipropetrovsk, according to the Russian Ministry of Defense. \nThis Ukrainian failure between Dnipropetrovsk and Zaporozhye is a direct result of Kiev’s decision to prioritize the defense of the strategic city of Pokrovsk in Donetsk to the east. Ukraine is, however, also losing the battle there.\nAbandoned by their command, more and more Ukrainian troops are now attempting to flee Pokrovsk disguised as civilians.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847086Z"
    },
    {
      "original": "Russian Army Reaches Haichur River As Ukrainian Troops Flee Pokrovsk Disguised As Civilians (Videos)\nOn November 18, the Russian military reached the Haichur River in Dnipropetrovsk and expanded its control in Pokrovsok and nearby areas in Donetsk forcing more Ukrainian troops to flee in a disorganized manner.\nThe Vostok [East] Group of Forces reached Haichur after capturing Nechayevka in Dnipropetrovsk, according to the Russian Ministry of Defense. \nThis Ukrainian failure between Dnipropetrovsk and Zaporozhye is a direct result of Kiev’s decision to prioritize the defense of the strategic city of Pokrovsk in Donetsk to the east. Ukraine is, however, also losing the battle there.\nAbandoned by their command, more and more Ukrainian troops are now attempting to flee Pokrovsk disguised as civilians.\nRead more \nHERE",
      "timestamp": "2025-11-18T16:13:16.847095Z"
    }
  ],
  "script_run_time": "2025-11-18T16:13:16.848023Z"
}