{
  "messages": [
    {
      "original": "🛵\n Полтавщина:БпЛА \n➡️\n через Зіньків, Котельву.",
      "timestamp": "2025-11-27T11:56:02.868595Z"
    },
    {
      "original": "🛵\n Групи БпЛА через Полтавщину \n➡️\nна Харківщину.\n🛵\n Дніпропетровщина: БпЛА \n➡️\n на Павлоград, Кам'янське/Дніпро.",
      "timestamp": "2025-11-27T11:56:02.868617Z"
    },
    {
      "original": "🛵\n Групи БпЛА через Полтавщину \n➡️\nна Харківщину. \n🛵\n Дніпропетровщина: БпЛА \n➡️\n на Павлоград, Кам'янське/Дніпро.",
      "timestamp": "2025-11-27T11:56:02.868627Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини продовжують рух на Дніпропетровщину/Донеччину.",
      "timestamp": "2025-11-27T11:56:02.868631Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини продовжують рух на Дніпропетровщину/Донеччину.",
      "timestamp": "2025-11-27T11:56:02.868636Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n в районі Павлограду, Шахтарського.\n🛵\n Харківщина: БпЛА \n➡️\n повз Барвінкове.\n🛵\n Донеччина:БпЛА \n➡️\n в районі Добропілля.",
      "timestamp": "2025-11-27T11:56:02.868647Z"
    },
    {
      "original": "БпЛА \n➡️\n в напрямку Вінниці.",
      "timestamp": "2025-11-27T11:56:02.868652Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n в районі Павлограду, Шахтарського. \n🛵\n Харківщина: БпЛА \n➡️\n повз Барвінкове. \n🛵\n Донеччина:БпЛА \n➡️\n в районі Добропілля.",
      "timestamp": "2025-11-27T11:56:02.868669Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Лозової. \n🛵\n БпЛА із Дніпропетровщини \n➡️\n на Херсонщину.",
      "timestamp": "2025-11-27T11:56:02.868677Z"
    },
    {
      "original": "БпЛА \n➡️\n в напрямку Вінниці.",
      "timestamp": "2025-11-27T11:56:02.868682Z"
    },
    {
      "original": "БпЛА продовжує рух повз Копайгород \n➡️\n в напрямку Мурованих Курилівців.",
      "timestamp": "2025-11-27T11:56:02.868689Z"
    },
    {
      "original": "БпЛА продовжує рух повз Копайгород \n➡️\n в напрямку Мурованих Курилівців.",
      "timestamp": "2025-11-27T11:56:02.868694Z"
    },
    {
      "original": "🛵\n БпЛА із Вінниччини тримає курс \n➡️\nна Хмельниччину.",
      "timestamp": "2025-11-27T11:56:02.868700Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 92 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 27 листопада (з 18:00 26 листопада) противник атакував 142-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллерово, Брянськ, Приморсько-Ахтарськ – рф, Гвардійське - ТОТ АР Крим, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 92 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 42 ударних БпЛА на 18 локаціях, а також падіння збитих (уламки) на трьох локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-27T11:56:02.868719Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-11-27T11:56:02.868727Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-11-27T11:56:02.868733Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-27T11:56:02.868738Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на північ Харківщини!",
      "timestamp": "2025-11-27T11:56:02.868742Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-27T11:56:02.868746Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-27T11:56:02.868751Z"
    },
    {
      "original": "🛵\n  БпЛА на Харків з півдня.",
      "timestamp": "2025-11-27T11:56:02.868755Z"
    },
    {
      "original": "⚠\nУВАГА!\nПовітряна тривога в Одеській області через роботу розвідувального БпЛА  в акваторії Чорного моря, курсом на Одещину.",
      "timestamp": "2025-11-27T11:56:02.868760Z"
    },
    {
      "original": "🛵\n  БпЛА на Харківщині, поблизу н.п. Барвінкове, курс на схід та н.п. Близнюки, курс на північ.",
      "timestamp": "2025-11-27T11:56:02.868766Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Дніпропетровщини, курс на Донеччину.",
      "timestamp": "2025-11-27T11:56:02.868771Z"
    },
    {
      "original": "🛵\n  БпЛА на північ від н.п. Краснопавлівка на Харківщині, курс на північ.",
      "timestamp": "2025-11-27T11:56:02.868775Z"
    },
    {
      "original": "🛵\n  БпЛА на північ від н.п. Богодухів на Харківщині, курс на південь.",
      "timestamp": "2025-11-27T11:56:02.868779Z"
    },
    {
      "original": "🛵\n  БпЛА на межі Харківщини та Полтавщини, курс південний.\n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний.",
      "timestamp": "2025-11-27T11:56:02.868785Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border. \nClarifying.",
      "timestamp": "2025-11-27T11:56:03.659242Z"
    },
    {
      "original": "Possible Ukrainian cruise missile flying to Moscow Oblast. A target was detected flying in a northeastern direction towards the Ryazan - Moscow border.   Clarifying.",
      "timestamp": "2025-11-27T11:56:03.659254Z"
    },
    {
      "original": "Missile threat in place for Tula, Moscow, and Ryazan Oblasts.",
      "timestamp": "2025-11-27T11:56:03.659258Z"
    },
    {
      "original": "Another target was detected flying from Kaluga Oblast towards Moscow Oblast. \nUnclear if this is a jet-drone or a cruise missile.",
      "timestamp": "2025-11-27T11:56:03.659262Z"
    },
    {
      "original": "Both targets detected were jet-powered drones. There are no cruise missiles in Russian airspace.",
      "timestamp": "2025-11-27T11:56:03.659266Z"
    },
    {
      "original": "In the Kupyansk direction, over the past few weeks, Ukrainian forces have launched a series of counterattacks east of the Oskil River. \nFollowing a large Russian advance along the railway line to Pishchane and DRG infiltrations into Kurylivka, Ukrainian forces deployed reinforcements to begin pushing them back. They were able to clear Kurilivka of Russian DRGs and begin a push eastward down the railway line.\nThen, in coordination with assault groups pushing down the highway to the north, the limited Russian presence in Pishchane was eliminated, with Ukrainian forces retaking full control over the village. From there, they recaptured additional positions along the railway line further east, while other forces captured positions in the forest plantations east of the highway and infiltrated the treeline directly west of Stepova Novosilka. \n+ ~24.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-27T11:56:03.659272Z"
    },
    {
      "original": "⚡️\n🇮🇶\n☀️\n Additional footage of the alleged drone attack against the Khor Mor gas field in the Sulaymaniyah Governorate of the Kurdistan Region of Iraq.\nThe gas field is operated by the UAE-owned \"Dana Gas\" company and has a daily production capacity of 750 million cubic feet per day.\n@wfwitness",
      "timestamp": "2025-11-27T11:56:03.659282Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in the vicinity of Vovchansk, making significant progress on a wide front.\nFollowing the fall of Synelnykove and the Tsehelne Industrial Facilities, Russian forces began a series of attacks on the village of Lyman. They advanced south from Synelnykove, entering the northern part of the village where they consolidated. From there, they pushed towards the centre of the village, while other assault groups secured new positions in the surrounding forests. \nTo the east, Russian forces began a series of attacks on the town of Vilcha. They advanced east down the road from the Tsehelne Industrial Facilities, capturing new treeline positions, and entering the western streets of Vilcha. Other forces advanced east down a treeline to the north and are carrying out assault operations towards Vilcha from here too. \nAdditionally, Russian forces advanced from the industrial zone in southern Vovchansk to the nearby warehouse complex, establishing control over it and the adjacent windbreaks on either side of the railway tracks.\n+ ~4.70 km² in favour of Russia.",
      "timestamp": "2025-11-27T11:56:03.659289Z"
    },
    {
      "original": "🇮🇶\n🇮🇶\n💥\n❗️\n — All operations at the Khor Mor gas field have been suspended following the drone strike, which has been confirmed by the KRG Ministry of Natural Resources and Energy.\n@TabZLIVE",
      "timestamp": "2025-11-27T11:56:03.659298Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate.   The IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from…",
      "timestamp": "2025-11-27T11:56:03.659302Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank. \nIn the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant and seized a number of other explosive devices in his car.\nIn the city of Tubas, the local armed group \"Tubas Battalion\" claimed that it detonated multiple IEDs against IDF military vehicles and fired on Israeli soldiers with small arms. \nIn the towns of Tamun and Aqaba, a large-scale arrest campaign has been carried out. The mayor of Tamun is among those arrested.\nIn addition, the IDF carried out raids on the towns of Al-Yamoun and Jaba",
      "timestamp": "2025-11-27T11:56:03.659309Z"
    },
    {
      "original": "Earlier today, 2 Russian IL-76MD cargo planes landed at Rostov Airbase. The cargo consists of Iskander-M ballistic missiles, which will be delivered by road to OTRK installations near the city of Taganrog, Rostov Oblast.\nThere is an increased threat of Iskander launches from here over the next 36 hours.",
      "timestamp": "2025-11-27T11:56:03.659313Z"
    },
    {
      "original": "Multiple Ukrainian UAVs (Likely FP-1/2 drones) have impacted the \"Novoaidarska\" 110 kV electrical substation in Luhansk Oblast. Partial power outages are reported in the town of Novoaidar. \nCoordinates: 48.94245, 39.01565",
      "timestamp": "2025-11-27T11:56:03.659320Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack.\nIn general, for both sides it’s very hard to move without being spotted, even in the forest, because of the total prevalence of drones on both sides. In particular, Ukrainian drones are the ones mostly preventing Russian successes.\nIt looks like the Ukrainian command understands that fighting in the forest is much more convenient than fighting for Lyman city, which confirms my suspicions of the fact that urban warfare is not convenient anymore against infiltration tactics.",
      "timestamp": "2025-11-27T11:56:03.659326Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack. In general, for both sides it’s very hard…",
      "timestamp": "2025-11-27T11:56:03.659330Z"
    },
    {
      "original": "Also important to keep in mind is that currently, supply for Ukrainian forces trying to cross the Siverskyi Donets River into Lyman is hell.\nDespite that, significant Ukrainian reinforcements appear to have deployed there.",
      "timestamp": "2025-11-27T11:56:03.659334Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T11:56:03.659341Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T11:56:03.659346Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-27T11:56:03.659353Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-27T11:56:03.659358Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank.   In the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant…",
      "timestamp": "2025-11-27T11:56:03.659361Z"
    },
    {
      "original": "Israel's new military operation in the northern West Bank continues into its second day.\nThe IDF continues carrying out raids in settlements they deployed to earlier, and have also begun raiding the city of Qalqiya, Nablus, the eastern suburbs of Tulkarm, and the village of Kafr Thulth.\nAdditional widespread arrests have been made in various different settlements, and road closures remain in place, limiting Palestinian movement. IDF military bulldozers also demolished additional streets in the town of Tamun. \nThe centre of these operations remain in the city of Tubas, where hundreds of IDF soldiers have been deployed.",
      "timestamp": "2025-11-27T11:56:03.659366Z"
    },
    {
      "original": "The professional think tank with so-called experts working for it has resorted to the linear warfare argument.\nThey are openly lying about how attritional wars are fought, but people will just eat it up.",
      "timestamp": "2025-11-27T11:56:03.659370Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567496Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567512Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567521Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567530Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567541Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567552Z"
    },
    {
      "original": "THE RACE FOR GULYAIPOLE: HOW UKRAINIAN RESERVE MOVEMENTS MAY DECIDE THE NEXT PHASE OF THE CONFLICT",
      "timestamp": "2025-11-27T11:56:04.567556Z"
    },
    {
      "original": "Novopavlovka Battle: Russian Army Flanks Ukrainian Forces And Advances Across Solenaya River \nPreparing for the Assault on Gulyaypole: Russian units begin encircling the city from multiple sides. The Ukrainian command deploys additional forces to stabilize the situation in the Novopavlovka area. \nCorruption scandals in Ukraine have a demoralizing effect on the Ukrainian Army and their weapon supplies from the US.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567564Z"
    },
    {
      "original": "Novopavlovka Battle: Russian Army Flanks Ukrainian Forces And Advances Across Solenaya River \nPreparing for the Assault on Gulyaypole: Russian units begin encircling the city from multiple sides. The Ukrainian command deploys additional forces to stabilize the situation in the Novopavlovka area. \nCorruption scandals in Ukraine have a demoralizing effect on the Ukrainian Army and their weapon supplies from the US.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567571Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 26, 2025\nOn November 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567582Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 26, 2025\nOn November 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567589Z"
    },
    {
      "original": "The Drone Incident In Moldova: Provocation Or Real Threat?\nIn late November, an incident in Moldova attracted the attention of officials and the public. A drone marked with a \"Z\" was discovered on the roof of a private house in the Florești district, identified by Moldovan authorities as a Russian UAV \"Gerbera.\" According to a statement from the Republic's Ministry of Defense, the device fell from an altitude of one and a half kilometers during a Russian attack on targets in Ukraine. Notably, however, neither the drone itself nor the building's roof sustained any damage.\nLocal residents reacted to the event with skepticism. A resident of the village of Cuhureștii de Jos told journalists:\n\"This is some kind of show, if you ask me. I know this drone has been lying on that roof for two weeks. We have such 'strong' guards that they didn't even notice a drone lying on the roof.\"\nThese words cast doubt on the official version of the drone's recent fall.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567599Z"
    },
    {
      "original": "The Drone Incident In Moldova: Provocation Or Real Threat?\nIn late November, an incident in Moldova attracted the attention of officials and the public. A drone marked with a \"Z\" was discovered on the roof of a private house in the Florești district, identified by Moldovan authorities as a Russian UAV \"Gerbera.\" According to a statement from the Republic's Ministry of Defense, the device fell from an altitude of one and a half kilometers during a Russian attack on targets in Ukraine. Notably, however, neither the drone itself nor the building's roof sustained any damage.\nLocal residents reacted to the event with skepticism. A resident of the village of Cuhureștii de Jos told journalists:\n\"This is some kind of show, if you ask me. I know this drone has been lying on that roof for two weeks. We have such 'strong' guards that they didn't even notice a drone lying on the roof.\"\nThese words cast doubt on the official version of the drone's recent fall.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567608Z"
    },
    {
      "original": "Violence Persists In Sudan As Battles Heat Up And Diplomacy Fails (18+ Videos)\nMore than a month after the massacre in el-Fasher, which reportedly claimed the lives of more than 2,500 people, the power struggle in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) is still ongoing and efforts by the United States to resolve the conflict appears to be failing.\nAfter being widely blamed for the massacre in el-Fasher, the provincial capital of North Darfur, the RSF launched an investigation into the killings and arrested some of the perpetrators. Despite these measures, violence attributed to the paramilitary group has not gone down.\nA gruesome video showing a child whipping a man who appeared to be in a state of distress surfaced online on November 22. The child was reportedly forced to do this by an RSF member, allegedly his own father. The video was apparently taken somewhere in North Darfur.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567617Z"
    },
    {
      "original": "Violence Persists In Sudan As Battles Heat Up And Diplomacy Fails (18+ Videos)\nMore than a month after the massacre in el-Fasher, which reportedly claimed the lives of more than 2,500 people, the power struggle in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) is still ongoing and efforts by the United States to resolve the conflict appears to be failing.\nAfter being widely blamed for the massacre in el-Fasher, the provincial capital of North Darfur, the RSF launched an investigation into the killings and arrested some of the perpetrators. Despite these measures, violence attributed to the paramilitary group has not gone down.\nA gruesome video showing a child whipping a man who appeared to be in a state of distress surfaced online on November 22. The child was reportedly forced to do this by an RSF member, allegedly his own father. The video was apparently taken somewhere in North Darfur.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T11:56:04.567626Z"
    }
  ],
  "script_run_time": "2025-11-27T11:56:04.568419Z"
}