{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-26T19:36:28.624735Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Харківщину.",
      "timestamp": "2025-11-26T19:36:28.624749Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-11-26T19:36:28.624755Z"
    },
    {
      "original": "Український пілот про ефективність Mirage2000/Ukrainian Pilot on the Effectiveness of the Mirage2000\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nФранцузьких Mirage 2000 в Повітряних Силах України не багато, тому зустріти цей літак на оперативному аеродромі – справжня удача для нашої знімальної групи, ще й під час виконання пілотом реального бойового завдання.\nЛьотчик Mirage 2000 та авіаційні техніки розповіли про ефективність французького літака на полі бою та необхідність подальшої міжнародної  підтримки України у боротьбі проти агресора.\nhttps://youtu.be/WsFGyKRVbUY?si=dJGZxvKg2_5mp8TY",
      "timestamp": "2025-11-26T19:36:28.624769Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-26T19:36:28.624774Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.\n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T19:36:28.624786Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.  \n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T19:36:28.624795Z"
    },
    {
      "original": "🛵\n Через Сумщину БпЛА \n➡️\n у напрямку Чернігівщини.",
      "timestamp": "2025-11-26T19:36:28.624803Z"
    },
    {
      "original": "🛵\n Чернігівщина:\n- БпЛА повз Батурин \n➡️\n курсом на південь.\n- БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T19:36:28.624811Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-26T19:36:28.624816Z"
    },
    {
      "original": "🛵\n Чернігівщина: - БпЛА повз Батурин \n➡️\n курсом на південь. - БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T19:36:28.624823Z"
    },
    {
      "original": "🛵\n Чернігівщина: нові групи БпЛА з півночі \n➡️\n курсом на Холми, Короп.\n🛵\n Сумщина: БпЛА \n➡️\n у напрямку Ямполя.",
      "timestamp": "2025-11-26T19:36:28.624831Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T19:36:28.624836Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T19:36:28.624841Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n курсом на Гути.",
      "timestamp": "2025-11-26T19:36:28.624846Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини.\nБпЛА \n➡️\n курсом на Ізюм.\n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T19:36:28.624857Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T19:36:28.624866Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T19:36:28.624873Z"
    },
    {
      "original": "🛵\n Харківщина: декілька груп БпЛА \n➡️\n у напрямку Полтавщини. БпЛА \n➡️\n курсом на Ізюм. \n🛵\n Сумщина: БпЛА \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-26T19:36:28.624883Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T19:36:28.624888Z"
    },
    {
      "original": "🛵\n Сумщина: нова групи БпЛА повз Білопілля, Терни \n➡️\n курсом на південний захід.",
      "timestamp": "2025-11-26T19:36:28.624894Z"
    },
    {
      "original": "🛵\n Полтавщина: група БпЛА повз Зіньків \n➡️\n курсом на південь.",
      "timestamp": "2025-11-26T19:36:28.624899Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА повз Слобожанське, Краснопавлівку, Ізюм \n➡️\n курсом на схід.",
      "timestamp": "2025-11-26T19:36:28.624904Z"
    },
    {
      "original": "🛵\n Через Харківщину БпЛА \n➡️\n у напрямку Дніпропетровщини.",
      "timestamp": "2025-11-26T19:36:28.624910Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини \n➡️\n курсом на Чернігівщину.",
      "timestamp": "2025-11-26T19:36:28.624917Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-26T19:36:28.624924Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T19:36:28.624928Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡\n- \"I urge people not to rush to conclusions that the war in Ukraine will end soon,\" - Dmitri Peskov, Kremlin Spokesman.",
      "timestamp": "2025-11-26T19:36:29.389347Z"
    },
    {
      "original": "I cannot believe that people genuinely think THIS round of peace negotiations will end the war.",
      "timestamp": "2025-11-26T19:36:29.389358Z"
    },
    {
      "original": "I’ve said it every time before and I’ll say it again: this peace plan will amount to nothing. \nNone of the sides in this war (US, Ukraine, Russia) have a plan which they will all agree to, and the U.S. is trying to continue extend the war’s longevity by delaying the inevitable. \nIt is in US foreign interests to keep Russia and Ukraine fighting. Extend Russia, focus on china, combat and topple opposers to their hegemonic ambitions one by one - not all at once.",
      "timestamp": "2025-11-26T19:36:29.389364Z"
    },
    {
      "original": "Stop buying into the hopium and engagement farming posts from people who have no idea what they are talking about and don't understand the goals of Russia and the US. \nMark my words, in 3 months time, everyone will have forgotten about the \"28 point peace plan\".",
      "timestamp": "2025-11-26T19:36:29.389369Z"
    },
    {
      "original": "A coup has taken place in Guinea-Bissau, where unidentified gunmen arrested President Embalo and seized the National Electoral Commission building in the capital of Bissau.\nAn election took place in Guinea-Bissau on Sunday, where Embalo claimed victory with 65% of the vote",
      "timestamp": "2025-11-26T19:36:29.389373Z"
    },
    {
      "original": "4 Russian Tu-22m3 strategic bombers have been equipped with Kh-22 cruise missiles at Engels-2 Airbase, Saratov Oblast, and have since redeployed to Olenya Airbase, Murmansk Oblast. \nAdditionally, 1 Tu-160M strategic bomber redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase. Another IL-76MD cargo plane has also landed at Engels-2 Airbase, carrying Kh-101 cruise missiles.\nActivity on frequencies used by strategic bombers at Ukrainka Airbase suggest that either training or redeployments will be carried out tonight. If redeployments take place to Engels-2, there will be an increased threat of another large-scale, combined Russian missile and drone attack on Ukraine in the coming days.",
      "timestamp": "2025-11-26T19:36:29.389378Z"
    },
    {
      "original": "Smoke is seen rising from a tire service facility in the city of Dobropillya, Donetsk Oblast, following Russian Geran-2 drone strikes today.\nCoordinates: 48.450151, 37.100155 (~11 km from the frontline).",
      "timestamp": "2025-11-26T19:36:29.389382Z"
    },
    {
      "original": "Russian forces have captured the village of Tykhe, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~125.\nTotal land area: ~0.63 km².\nThe fighting for Tykhe lasted approximately 7 days.",
      "timestamp": "2025-11-26T19:36:29.389387Z"
    },
    {
      "original": "Russian MLRS strikes and artillery shelling targeted two electrical substations in Kherson City, resulting in partial power outages in the Dniprovsky District and city centre.",
      "timestamp": "2025-11-26T19:36:29.389391Z"
    },
    {
      "original": "Russian MLRS strikes and artillery shelling targeted two electrical substations in Kherson City, resulting in partial power outages in the Dniprovsky District and city centre.",
      "timestamp": "2025-11-26T19:36:29.389395Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovsk'e directions, Russian forces continue to rapidly advance east of the Haichur River amid a continued local collapse of Ukrainian lines.\nIn the north, Russian forces continued their assault operations along the tactical heights towards the Haichur River. Following the capture of the villages of Nechaivka, Radisne, and Nove Zaporizhzhya, Russian forces began finalising their operation aimed at eliminating the Ukrainian salient to the southeast. They pushed south down several treelines on a wide front east of Nove Zaporizhzhya, while other forces continued to push west from the Solodke - Rybne area, squeezing the Ukrainians out of the salient. They also entered Dobropillya from the north, attacking towards the centre of the village. \nThen, in coordination with attacks from the south and southeast, Russian forces exploited the withdrawal of Ukrainian forces from the salient towards the Haichur River by advancing northwest down a gulley and west down a treeline to the north, breaking through to the eastern outskirts of Dobropillya and therefore completing the elimination of the Ukrainian salient. Progress was also made along several treelines further south in the direction of Varvarivka. \nTo the south, Russian forces advanced further along the southern bank of a tributary of the Haichur river, capturing new positions in the forest plantations there. They also advanced further west along the treelines on the tactical heights, approaching their western edge, and improved their positions further along the northern bank of the Kalmychka River. This advance, along with the elimination of the salient in the north, connects and largely aligns the frontline from Nechaivka to the Kalmychka River.\nTo the southeast, Russian forces continued to exploit the collapse of Ukrainian defences in the villages east of Hulyaipole and the encirclement of Ukrainian formations. Earlier, a hasty and uncoordinated deployment of the Ukrainian 201st battalion of the 102nd Territorial Defence Brigade was carried out with the goal of saving the situation at the relatively strong defences east of Hulyaipole, leading to high casualties and part of it being encircled. Russian forces subsequently advanced further west from these villages through lightly defended Ukrainian lines, quickly reaching the outskirts of Hulyaipole and establishing themselves in the treelines directly east of the city.\nAdditionally, the Russians advanced from Zatyshshya and managed to capture one of the agricultural complexes on the outskirts of Hulyaipole, as well as the adjacent forest plantations. DRGs subsequently intensified their activity within the city limits, while assault groups began infiltrations into the northeastern streets situated north of the Haichur River. \nMeanwhile, south of the Haichur River, taking advantage of the chaotic situation further north, Russian assault groups broke through Ukrainian positions northwest of Marfopil, advancing along the road to the edge of Hulyaipole. They were able to quickly enter the city and capture the outermost streets, however fighting is already ongoing further west towards Huryanskyy Street. Additionally, Russian forces captured the remaining positions east of a tributary of the Haichur River, as well as an agricultural building and adjacent treeline to the west.\n+ ~59.62 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389404Z"
    },
    {
      "original": "In the Pokrovsk'e and Prosyana directions, Russian forces continued to advance south of the Vovcha River, further cementing their presence along its southern bank.\nIn the west, following earlier infiltration attempts, Russian forces entered and captured the eastern part of the village of Tykhe before advancing west and capturing the rest of the settlement. Additionally, they advanced north up a treeline towards western Tykhe, establishing control over it. \nIn the east, following earlier infiltrations, Russian forces consolidated in part of the Dibrovsky Forest Reserve, as well as in the forest plantation to the south.\n+ ~4.36 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389409Z"
    },
    {
      "original": "In the Prosyana and Novopavlivka directions, both Russian and Ukrainian forces have advanced in key areas.\nIn the west, at some point recently, Ukrainian forces launched a series of counterattacks aimed at eliminating the Russian presence west of Ivanivka and re-establishing themselves in the village. They were able to advance from their stronger positions east of Havrylivka, and re-entered the Yasenky Forest, capturing positions in the west and north of it. Russian forces retain control over positions in the forest closer to the Vovcha River. \nAdditionally, Ukrainian forces recaptured the treeline leading to the westernmost part of Ivanivka, and consolidated in positions in the residential area there. Russian forces also captured some additional positions in western Ivanivka which were previously in the grey zone. \nIn the east, following the breakthrough to Novopavlivka, Russian forces began consolidating in the positions to the rear of the town. They established full control over the stretch of highway leading into Novopavlivka, and consolidated in the agricultural complex on the eastern edge of the time. They also advanced up two parallel treelines east of the highway, taking advantage of Ukrainian withdrawals from the salient there. \n+ ~9.62 km² in favour of Ukraine. \n+ ~7.89 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389416Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued their assault operations north of Udachne and have captured the Pokrovsk Coal mine.\nAfter gaining a foothold in the southern buildings of the mine, Russian soldiers pushed fowards through the rest of the mine, establishing full control over it. Ukrainian forces withdrew to the treelines further north, and Russian forces have begun infiltrations into the forest plantations along the Matiushyna Gulley, west of the coal mine's waste dump. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389421Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to make progress in the besieged city of Myrnohrad, capturing additional positions in the northern suburbs.\nIn eastern Myrnohrad, Russian forces made new advances in the Skhidnyi and Damanskyi Microdistricts. They captured at least 11 more high-rise buildings, along with Kindergarten No. 19 and the secondary school. \nIn northeastern Myrnohrad, Russian forces advanced further in the 8th District, where they captured new positions in the low-rise residential areas northwest of the Skhidnyi Microdistrict, reached Hrynka Street in the direction of the city centre, and began fighting for School No. 4 and the surrounding areas. \nIn northern Myrnohrad, Russian forces advanced southwest from the 8th District to the Tsentralna Mine, capturing new positions in the residential areas there and entering the mine. Additionally, they captured the remaining two blocks of three-story buildings in the Novator District and established control over large parts of the low-rise residential areas to the south and southwest.\nIn northwestern Myrnohrad, following earlier infiltration attempts, Russian forces consolidated at the city bus station, and began pushing into the Brianka District. Here, they were able to penetrate southeast, capturing positions in the low-rise residential areas west of Myrna Street, while infiltrations took place further west towards Voronova Street and the city centre.\nFurther west, as a result of the advances into northwestern Myrnohrad, the Russians managed to capture most of the rest of Rivne, consolidating in the central, northern, and southern parts of the village. \n+ ~1.92 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389432Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces intensified their assault operations, making new progress in several different areas.\nIn the northeast, Russian forces continued to build on their success on the tactical heights east of the Kazenyi Torets River and began advancing downhill towards the river. They advanced along multiple treelines to the southeastern edge of Sofiivka and entered the outer houses of the village. Attacks were also carried out along treelines further north, and from the newly captured strongpoints in the forested gulley, with Russian soldiers reaching the road leading northeast from Sofiivka.\nTo the southwest, Russian forces continued to make progress in Shakhove, further expanding their zone of control in the main part of the village. Additionally, they consolidated in the trench fortifications to the north, encircling a small number of Ukrainian soldiers in the settlement. \nTo the west, Russian forces resumed assault operations west of Shakhove. They were able to recapture some positions in the forest plantations north and south of the Shakhove - Nove Shakhove Road.\nIn the southwest, after earlier infiltrations, the Russians recaptured the northern part of the forests west of Nykanorivka and re-entered southern Dorozhnje where they are once again fighting for the freight train station. \n+ ~8.93 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389439Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast. \nTaganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-26T19:36:29.389443Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance in and around Kostyantynivka and have made new progress in five different areas.\nIn the northeast, Russian forces consolidated in additional positions along Camarskandska Street in the Santurinivka District of Kostyantynivka and continued infiltrating into the area of the tram depot further north.\nTo the southwest, the Russians consolidated further in the Stare Selyshche District and reached Mayakovskoho Street. From there, they entered and captured the train depot, while assault groups secured the Michurin Dachas to the east. \nTo the south, following earlier Ukrainian infiltration attempts across the Kryvyi Torets River, Russian forces were able to push back and re-establish control over western Ivanopillya. They also recaptured the northern part of Pleshchiivka following additional earlier Ukrainian infiltration attempts. \nIn the southwest, Russian forces continued their assault operations towards the rear of the Kleban-Bykske Reservoir. They advanced north from the trench fortifications northeast of Yablunivka, along the H-20 highway, and captured new positions in the windbreaks and adjacent trenches. Attacks were then carried out on trench fortifications further north along the highway, however there is no confirmation of consolidation there yet.\n+ ~2.02 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389450Z"
    },
    {
      "original": "Ukrainian Neptune cruise missile launch from Chornomorsk, Odesa Oblast.   Taganrog, Rostov Oblast is currently under attack from UAVs, so its possible that it will fly there.",
      "timestamp": "2025-11-26T19:36:29.389453Z"
    },
    {
      "original": "No missiles were detected flying towards Crimea/Kherson Oblast. Its possible that this was mixed up with launches of UAVs or something else.",
      "timestamp": "2025-11-26T19:36:29.389457Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka and on the southern flank of Siversk, Russian forces continued to slowly advance and have captured new positions on the tactical heights in two areas.\nIn the southwest, Russian forces entered the village of Maiske from their newly captured positions in the treelines to the south. After a few days of fighting, they were able to establish full control over the settlement and the surrounding positions. They also improved their positions in the forested areas south of Markove.\nIn the northeast, Russian forces continued their assault operations northeastern of Orikhovo-Vasylivka, but this time in a new area. They were able to capture new positions along two parallel treelines on the tactical heights and gained a foothold at the intersection of another two treelines to the east, expanding their presence northwest of Zaliznyanske. \n+ ~5.45 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389464Z"
    },
    {
      "original": "In the Siversk direction, Russian forces continued their assault operations in and around Siversk, and have made further progress towards capturing the remaining Ukrainian fortifications outside the city.\nIn the north, following earlier infiltrations from north of the reservoirs, Russian forces advanced west through the forests towards the northeastern outskirts of Siversk, and captured several trench fortifications there, from which assault groups are now infiltrating the city. Heavy fighting is currently ongoing for the low-rise residential areas and the northeastern high-rise buildings.\nIn the south, Russian forces were finally able to break through the strong Ukrainian defences on the tactical heights southeast of Siversk, capturing a series of strongpoints along three different treelines. Heavy fighting continues for the remaining fortifications in the operational encirclement area. \n+ ~2.93 km² in favour of Russia.",
      "timestamp": "2025-11-26T19:36:29.389470Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114927Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114950Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114959Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114967Z"
    },
    {
      "original": "Military Situation In Syria On November 26, 2025 (Map Update)",
      "timestamp": "2025-11-26T19:36:30.114970Z"
    },
    {
      "original": "Hungary Opposes Funding For Ukraine's \"Military Mafia\"\nHungarian Prime Minister Viktor Orbán gave a sharp response to European Commission President Ursula von der Leyen's request for additional funds for Ukraine, comparing the request to trying to help an alcoholic by sending them another crate of vodka.\nIn her letter, von der Leyen indicated that Ukraine is facing a serious funding shortfall and asked EU member states to increase their support. Orbán stated: \"Giving money to the Ukrainian mafia is like trying to cure an alcoholic by giving them a crate of vodka\", adding that the \"military mafia is siphoning off European taxpayers' money for God knows what\", and that instead of demanding audits and restricting payments, Brussels is proposing to send even more funds. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114979Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T19:36:30.114983Z"
    },
    {
      "original": "Military Situation In Ukraine On November 26, 2025 (Maps Update)",
      "timestamp": "2025-11-26T19:36:30.114987Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.114995Z"
    },
    {
      "original": "Intense Airstrikes Hit Huliaipole As Russian Army Advances All Around (Videos)\nOn November 26, the Russian military advanced south, east and north of Huliaipole in Zaporizhzhia, amid heavy airstrikes on Kiev forces inside the key city.\nThe Vostok [East] Group of Forces expanded its control in Huliaipole’s southern and eastern outskirts, securing more than ten square kilometers. Preliminary reports also indicate that Russian troops have already established a presence in the city’s eastern part. However, it is still early to consider that the battle there has begun.\nIn addition to these gains, the Russian Aerospace Forces have stepped up strikes on Ukrainian fortifications inside Huliaipole.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.115003Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.115012Z"
    },
    {
      "original": "Ukraine Could Soon Take Big Blow In Krasny Liman (Videos)\nOn November 26, the Russian military expanded its control in key areas near the city of Krasny Liman in Donetsk, mounting more pressure on Kiev forces there.\nThe Zapad [West] Group of Forces secured the entire area between Zarichne and the eastern outskirts of Krasny Liman. Russian troops also expanded their control to the south of the city, with preliminary reports suggesting that the 25th Army has managed to trap Ukraine’s 117th Territorial Defense Brigade near Dibrova.\nTo the northeast of Krasny Liman, the Zapad Group of Forces is reported to be working to expand its control around Stavky. A push from the settlement towards the northeastern outskirts of the city seems very likely.\nRead more \nHERE",
      "timestamp": "2025-11-26T19:36:30.115020Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T19:36:30.115033Z"
    },
    {
      "original": "Echoes of Operation Midas: Corruption Scandal in Ukraine Threatens Peace Talks\nAttempts by Ukrainian President Zelensky to protect his colleagues from danger. How Europe reacted to a high-profile corruption scandal. The impact of 'gray schemes' on the peace process.\nOn November 10, a major corruption scandal erupted in Ukraine. Operatives from the NABU and the SAPO launched Operation Midas. They conducted mass searches and arrested prominent businessmen and politicians. Coincidentally, the main figures in the case had been warned about the operation in advance, allowing them to safely leave Ukraine.\nTimur Mindich is the alleged mastermind behind the entire Shlagbaum criminal scheme. Mindich is the co-owner of the Kvartal 95 studio and a close associate of the President of Ukraine.\n_________\nIn the video: Alexander Klimenko, head of SAPO, on the persecution of officials engaged in fighting corruption by Ukrainian law enforcement agencies under the orders of Andriy Yermak (\"Ali Baba\").\n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T19:36:30.115045Z"
    }
  ],
  "script_run_time": "2025-11-26T19:36:30.115551Z"
}