{
  "messages": [
    {
      "original": "🛵\n БпЛА з півночі Запоріжжя на Дніпропетровщину.\n🛵\n БпЛА на півдні Миколаївщини, курс на н.п.Снігурівка.",
      "timestamp": "2026-01-06T23:49:29.738621Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-06T23:49:29.738636Z"
    },
    {
      "original": "🛵\n Чергова група БпЛА на Дніпро з півдня.",
      "timestamp": "2026-01-06T23:49:29.738642Z"
    },
    {
      "original": "🛵\n БпЛА з півночі Сумщини, в напрямку н.п.Ямпіль.\n🚀\nПуски КАБ в напрямку Запоріжжя.",
      "timestamp": "2026-01-06T23:49:29.738648Z"
    },
    {
      "original": "🛵\n БпЛА в Чорному морі, в напрямку суходолу Одещини.",
      "timestamp": "2026-01-06T23:49:29.738656Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-06T23:49:29.738661Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Кривого Рогу з півдня Дніпропетровщини.",
      "timestamp": "2026-01-06T23:49:29.738665Z"
    },
    {
      "original": "🛵\n БпЛА в Чорному морі, в напрямку суходолу Одещини.\n🛵\n БпЛА на півдні Миколаївщини, в напрямку Миколаєва.",
      "timestamp": "2026-01-06T23:49:29.738671Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Кривого Рогу з півдня Дніпропетровщини.",
      "timestamp": "2026-01-06T23:49:29.738675Z"
    },
    {
      "original": "На місто, перебувайте в укриттях!",
      "timestamp": "2026-01-06T23:49:29.738679Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря, в напрямку н.п. Чорноморськ.",
      "timestamp": "2026-01-06T23:49:29.738683Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, в напрямку Павлограду зі сходу.",
      "timestamp": "2026-01-06T23:49:29.738688Z"
    },
    {
      "original": "🛵\n БпЛА на сході Кіровоградщини, курс на захід.",
      "timestamp": "2026-01-06T23:49:29.738692Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря, в напрямку н.п. Чорноморськ.",
      "timestamp": "2026-01-06T23:49:29.738696Z"
    },
    {
      "original": "На Чорноморське на Одещині.",
      "timestamp": "2026-01-06T23:49:29.738700Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.\n🛵\n БпЛА  на н.п. Близнюки на Харківщині з півдня.\n🛵\n БпЛА на півдні Кіровоградщини, курс на захід.\n🛵\n БпЛА на сході Одещини, курс на північ.\n🛵\n БпЛА в центрі Миколаївщини, курс на північ.\n🛵\n БпЛА на півночі, на межі Сумщини та Чернігівщини, курс на південь",
      "timestamp": "2026-01-06T23:49:29.738712Z"
    },
    {
      "original": "🛵\n БпЛА на Кривий Ріг.",
      "timestamp": "2026-01-06T23:49:29.738716Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині, курс на н.п.Сарата та на н.п. Затока.\n🛵\n БпЛА на сході Одещини та на півночі Миколаївщини, курс на північ.\n🛵\n БпЛА в центрі Кіровоградщини, курс на н.п. Тишківка.\n🛵\n БпЛА на півночі Чернігівщини, в напрямку обласного.",
      "timestamp": "2026-01-06T23:49:29.738725Z"
    },
    {
      "original": "🛵\n БпЛА на Черкащині, в напрямку Умані з півдня.\n🛵\n БпЛА на н.п.Доброслав із заходу на Одещині.",
      "timestamp": "2026-01-06T23:49:29.738731Z"
    },
    {
      "original": "🛵\n БпЛА на Умань.",
      "timestamp": "2026-01-06T23:49:29.738735Z"
    },
    {
      "original": "🛵\n БпЛА на Умань.",
      "timestamp": "2026-01-06T23:49:29.738741Z"
    },
    {
      "original": "Повторно!",
      "timestamp": "2026-01-06T23:49:29.738752Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-06T23:49:29.738757Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-06T23:49:30.338432Z"
    },
    {
      "original": "Repeated explosions in Kharkiv City",
      "timestamp": "2026-01-06T23:49:30.338442Z"
    },
    {
      "original": "Tornado-S strikes are also being carried out on Slovyansk, Donetsk Oblast simultaneously.",
      "timestamp": "2026-01-06T23:49:30.338446Z"
    },
    {
      "original": "Tornado-S strikes are now carried out on the area of Rohan, to the southeast of Kharkiv City.",
      "timestamp": "2026-01-06T23:49:30.338450Z"
    },
    {
      "original": "Repeated strikes on Kharkiv City.\nA Russian recon drone is operating just north of the city centre, adjusting the strikes.",
      "timestamp": "2026-01-06T23:49:30.338455Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-06T23:49:30.338459Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-06T23:49:30.338462Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-06T23:49:30.338466Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-06T23:49:30.338469Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the southeast, Russian forces resumed their assault operations towards eastern Yarova, recapturing positions in the forests there and reaching the edge of the town.\nTo the west, the Russians advanced south to the western part of Yarova, recapturing positions in the forests south of the railway line. They also began attacks to the southwest and west, improving their positions in the forests and reaching the outskirts of Sosnove.\nTo the north, Russian forces resumed their assault operations in the direction of Oleksandrivka, where they advanced northwest and captured new positions in the forests there.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T23:49:30.338478Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress northeast of Lyman.\nIn the northeast, Russian forces resumed their assault operations northwest of Zarichne and captured new treeline positions north of the gulley. From there, they began attacking the Ukrainian positions east of Stavky. Other assault groups are attempting to attack these same positions via the treelines from the eastern part of Stavky. assault operations are also underway on the agricultural buildings on the western outskirts of Stavky.\nIn the southwest, Russian forces continued incrementally consolidating in the fields west of the Pynkov Yar Gulley, where they were able to capture new treeline positions in the direction of the first cluster of agricultural buildings. DRGs continue to infiltrate further west to the northern outskirts of Lyman.\n+ ~1.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T23:49:30.338488Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T23:49:30.338497Z"
    },
    {
      "original": "I keep seeing a lot of so-called \"American patriots\" criticising liberals for being against the U.S. invasion of Venezuela and their attempt at overthrowing the Venezuelan government, by arguing that Venezuelans did not like Maduro and that they are now celebrating his downfall. Ironically, these \"patriots\" are the same people who called for no more foreign wars prior to this, but that's a whole other story. \nAnd yes, while Maduro may not have been popular among Venezuelans, and a large amount of people may be happy that he's gone, the U.S. attacks are bigger than just this. \nAnyone who knows a bit about the very lengthy history of the U.S. carrying out regime changes will understand how this is not a good thing, no matter how happy Venezuelans are that Maduro is gone. This is bigger than just Venezuela. The U.S. is a great power furthering its own interests, as it has done for the last century. It recognises the difficult and worsening situation it is in with the current multipolar state of the world, and this is just one action of a larger interconnected web of geostrategic moves.",
      "timestamp": "2026-01-06T23:49:30.338504Z"
    },
    {
      "original": "I’d like to add that the US is, of course, looking to extend their influence over Venezuela’s large oil reserves",
      "timestamp": "2026-01-06T23:49:30.338507Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T23:49:30.338514Z"
    },
    {
      "original": "I've added a new layer to the interactive map to show areas behind the frontline of low Russian consolidation, but that are under Russian control.\nThese are areas which Russia uses for logistics and moves through to their more solidified forward positions, but has not properly entrenched in due to the changing nature of this war and the increased reliance by both sides on drones.\nThese areas are the most prone to deep Ukrainian incursions and can result in a very fluid and dynamic situation if the more consolidated Russian forward positions are breached.\nUnfortunately, there is very little data on areas of low consolidation for Ukrainian forces, however I will continue to add and change areas as new information comes in. You can toggle this layer on and off in the side bar.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-06T23:49:30.338521Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-06T23:49:30.338524Z"
    },
    {
      "original": "Iskander on Kryvyi Rih",
      "timestamp": "2026-01-06T23:49:30.338528Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-06T23:49:30.338531Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2026-01-06T23:49:30.338534Z"
    },
    {
      "original": "Explosions in Kryvyi Rih",
      "timestamp": "2026-01-06T23:49:30.338539Z"
    },
    {
      "original": "An IL-76MD cargo plane landed at Savasleika Airbase, Nizhny Novgorod Oblast. The cargo consists of Kinzhal missiles for the MiG-31K fighters stationed there.",
      "timestamp": "2026-01-06T23:49:30.338542Z"
    },
    {
      "original": "The Human Hunt: The Brutal Reality of Ukraine's Forced Mobilization\nForced mobilization in Ukraine continues unabated. Any man of draft age who steps outside is at risk of being targeted. Over the course of this military conflict, the Ukrainian army's territorial recruitment center (TRC) employees have become the direct enemies of civil society.\nThe problem is so widespread that even Western media outlets like Deutsche Welle can no longer hide the harsh truth from their viewers and readers. Even in western Ukraine, far from the front lines, the TRCs' actions are stirring up public opinion. At the same time, residents of these regions are the most pro-European Ukrainians and largely support the war until victory is achieved. Due to public condemnation, recruiters are beginning to feel like outsiders. Despite wearing military uniforms, ordinary people do not see them as defenders but as executioners who send innocent people to their deaths.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918823Z"
    },
    {
      "original": "The Human Hunt: The Brutal Reality of Ukraine's Forced Mobilization\nForced mobilization in Ukraine continues unabated. Any man of draft age who steps outside is at risk of being targeted. Over the course of this military conflict, the Ukrainian army's territorial recruitment center (TRC) employees have become the direct enemies of civil society.\nThe problem is so widespread that even Western media outlets like Deutsche Welle can no longer hide the harsh truth from their viewers and readers. Even in western Ukraine, far from the front lines, the TRCs' actions are stirring up public opinion. At the same time, residents of these regions are the most pro-European Ukrainians and largely support the war until victory is achieved. Due to public condemnation, recruiters are beginning to feel like outsiders. Despite wearing military uniforms, ordinary people do not see them as defenders but as executioners who send innocent people to their deaths.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918837Z"
    },
    {
      "original": "Military Situation In Northern Palestine On January 6, 2026 (Map Update)",
      "timestamp": "2026-01-06T23:49:30.918842Z"
    },
    {
      "original": "Third Of U.S. Tomahawk Missiles Fire At Nigeria Failed (Photos)\nAt least a third of BGM-109 Tomahawk land-attack cruise missiles fired by the United States military against ISIS targets in Nigeria last month have apparently failed.\nThe attack, which took place on December 25, was carried out on orders from President Donald Trump, who a month earlier warned the West African nation over repeated attacks on Christians.\nA U.S. defense official later told The New York Times the strikes involved over a dozen Tomahawk missiles targeting two camps of ISIS.\nQuestions about the effectiveness of the attack emerged right away, with local officials in Sokoto not reporting any casualties, and photos that surfaced online later showing the warheads of at least three Tomahawk missiles which apparently failed.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918851Z"
    },
    {
      "original": "Third Of U.S. Tomahawk Missiles Fire At Nigeria Failed (Photos)\nAt least a third of BGM-109 Tomahawk land-attack cruise missiles fired by the United States military against ISIS targets in Nigeria last month have apparently failed.\nThe attack, which took place on December 25, was carried out on orders from President Donald Trump, who a month earlier warned the West African nation over repeated attacks on Christians.\nA U.S. defense official later told The New York Times the strikes involved over a dozen Tomahawk missiles targeting two camps of ISIS.\nQuestions about the effectiveness of the attack emerged right away, with local officials in Sokoto not reporting any casualties, and photos that surfaced online later showing the warheads of at least three Tomahawk missiles which apparently failed.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918860Z"
    },
    {
      "original": "Russian Army Is Closing In On Orikhiv From East And West (Videos)\nOn January 6, the Russian military advanced towards the key city of Orikhiv from two directions amid futile Ukrainian attempts to stabilize the front in Zaporozhye.\nTo the east of Orikhiv, the Vostok [East] Group of Forces expanded its control around Huliapole. Russian forces advanced to the west of the city, reaching the eastern outskirts of Zalinskoe and the southeastern outskirts of Staroukrainka. An area of 3,7 square kilometers was cleared in the process.\nMeanwhile to the west of Orikhiv, advance by the Vostok Group of Forces was also reported, mainly close to the large settlement of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918868Z"
    },
    {
      "original": "Russian Army Is Closing In On Orikhiv From East And West (Videos)\nOn January 6, the Russian military advanced towards the key city of Orikhiv from two directions amid futile Ukrainian attempts to stabilize the front in Zaporozhye.\nTo the east of Orikhiv, the Vostok [East] Group of Forces expanded its control around Huliapole. Russian forces advanced to the west of the city, reaching the eastern outskirts of Zalinskoe and the southeastern outskirts of Staroukrainka. An area of 3,7 square kilometers was cleared in the process.\nMeanwhile to the west of Orikhiv, advance by the Vostok Group of Forces was also reported, mainly close to the large settlement of Stepnohirsk.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918876Z"
    },
    {
      "original": "Kiev’s Holiday Purge: Zelensky Ousts Top Fixers and Hands Power to Spies and Enforcers\nWhile much of the world was finishing off Christmas turkey and the global tabloids were fixated on the New Year’s frenzy, Kiev—in near silence—completed its transition into an outright military junta. The stretch from late December 2025 to early January 2026 will enter the record of the Ukrainian crisis as a “fortnight of long knives.” Cornered by failures at the front and ultimatums from Washington, Volodymyr Zelensky went all-in, dismantling what was left of civilian governance. What unfolded on Bankova Street wasn’t a routine reshuffle. It was a purge of witnesses, the cementing of dictatorship, and the handover of the keys to the country to direct foreign overseers.​\nThe trigger for the sweeping purge was the collapse of Andriy Yermak, the man who—until yesterday—was widely described as Ukraine’s real ruler. His December 22 resignation was sold as “voluntary”...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918884Z"
    },
    {
      "original": "THE KUPYANSK CRUCIBLE: ELITE UKRAINIAN UNITS STRUGGLE AS RUSSIAN PINCER TIGHTENS",
      "timestamp": "2026-01-06T23:49:30.918888Z"
    },
    {
      "original": "Kostiantynivka Front: Russian Army Prepares To Cut Off Ukrainian Troops In Key City \nIn the Kostiantynivka sector, Russian units continue to advance near Maiske and Markove. The recent attacks there are likely shaping operations, meant to set the ground for a larger offensive with the aim of cutting the main road leading to the city and besieging Ukrainian troops there. In the Kupuansk sector, the units are once again gaining momentum, and the Ukrainian counterattack seems to be fading. Meanwhile, in the Zaporizhzhia sector, Kiev forces are still losing ground near Huliapole and Stepnohirsk.\nOn the political front, Hungarian Prime Minister Viktor Orban has criticized European plans to funnel more money to Kiev.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918895Z"
    },
    {
      "original": "Kostiantynivka Front: Russian Army Prepares To Cut Off Ukrainian Troops In Key City \nIn the Kostiantynivka sector, Russian units continue to advance near Maiske and Markove. The recent attacks there are likely shaping operations, meant to set the ground for a larger offensive with the aim of cutting the main road leading to the city and besieging Ukrainian troops there. In the Kupuansk sector, the units are once again gaining momentum, and the Ukrainian counterattack seems to be fading. Meanwhile, in the Zaporizhzhia sector, Kiev forces are still losing ground near Huliapole and Stepnohirsk.\nOn the political front, Hungarian Prime Minister Viktor Orban has criticized European plans to funnel more money to Kiev.\nRead more \nHERE",
      "timestamp": "2026-01-06T23:49:30.918902Z"
    }
  ],
  "script_run_time": "2026-01-06T23:49:30.919360Z"
}