{
  "messages": [
    {
      "original": "Запорізька, Харківська, Дніпропетровська, Донецька області - ракетна небезпека!",
      "timestamp": "2025-08-31T23:39:02.566913Z"
    },
    {
      "original": "🛸\n на Сумщині та Чернігівщині ворожі БпЛА.\nЗалучено засоби для їх збиття.",
      "timestamp": "2025-08-31T23:39:02.566931Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T23:39:02.566940Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на південно-східному та східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T23:39:02.566948Z"
    },
    {
      "original": "🚀\n КАБи на Донеччині та Сумщині!",
      "timestamp": "2025-08-31T23:39:02.566953Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння в областях, де оголошено повітряну тривогу.",
      "timestamp": "2025-08-31T23:39:02.566958Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.\n🛬\n Продовжується активність ворожої тактичної авіації на східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T23:39:02.566965Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному та східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T23:39:02.566973Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Чернігівщині та Сумщині \n➡️\n курсом на південь.",
      "timestamp": "2025-08-31T23:39:02.566978Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Дніпропетровщині \n➡️\n курсом на захід.",
      "timestamp": "2025-08-31T23:39:02.566984Z"
    },
    {
      "original": "🛵\n ударні БпЛА на Чернігівщині \n➡️\n курсом на Київщину.\n🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Чернігівщину та Полтавщину.",
      "timestamp": "2025-08-31T23:39:02.566993Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.",
      "timestamp": "2025-08-31T23:39:02.566999Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.\n🛵\n ворожі БпЛА на сході Донеччини \n➡️\n курсом на північний схід/південь.",
      "timestamp": "2025-08-31T23:39:02.567007Z"
    },
    {
      "original": "🛵\n нова група ударних БпЛА на Донеччині \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-08-31T23:39:02.567013Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!\n🚀\nПуски КАБ на Сумщину!",
      "timestamp": "2025-08-31T23:39:02.567022Z"
    },
    {
      "original": "🚀\n Запоріжжя - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-31T23:39:02.567027Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.",
      "timestamp": "2025-08-31T23:39:02.567032Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.\n🛵\n ударні БпЛА на Полтавщині \n➡️\n курсом на захід.\n🛵\n ворожі БпЛА на півночі Чернігівщини \n➡️\n курсом північний захід.",
      "timestamp": "2025-08-31T23:39:02.567043Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на захід.\n🛵\n ударні БпЛА на Полтавщині \n➡️\n західним курсом.\n🛵\n ворожі БпЛА на Чернігівщині \n➡️\n курсом північний захід та південь.\n🛵\n ворожі БпЛА на півночі Київщини \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-08-31T23:39:02.567061Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Черкащині \n➡️\n курсом на Київщину.",
      "timestamp": "2025-08-31T23:39:02.567067Z"
    },
    {
      "original": "Russian Geran-2 drone strike on a Ukrainian position in the village of Torske, southwest of Druzhkivka. \nWhen you don't hear about large drone strikes on major Ukrainian cities for a night or two in a row, this is where they fly - the frontline. Dozens of these strikes are often carried out daily, and there is no air defence in most of Ukrainian-controlled Donetsk Oblast to counter them. \nCoordinates: 48.550556, 37.423611",
      "timestamp": "2025-08-31T23:39:03.372214Z"
    },
    {
      "original": "The UKMTO reports that an unknown projectile hit the water in close proximity to a vessel in the Red Sea, around 40 Nautical Miles southwest of Yanbu, Saudi Arabia. The crew is safe, and the ship is continuing its voyage, while authorities are currently investigating the incident.",
      "timestamp": "2025-08-31T23:39:03.372236Z"
    },
    {
      "original": "Regarding the situation in the Orikhiv direction, western Zaporizhzhia Oblast.\nBoth Russian and Ukrainian sources are reporting that Russian forces carried out ground attacks on Mala Tokmachka and Novodanylivka..\nRussian sources reported that Russian forces resumed assault operations in Mala Tokmachka, although it's unclear where from. The last known western-most Russian positions in the village were at the local school in the village centre, although it's unclear if those positions were retained. Ukrainian sources report that the Russian attacks were repelled by Ukrainian FPV drone operators but did not provide additional details.\nRussian sources also reported that attacks took place on Novodanylivka. Currently, there is a massive grey zone stretching from the areas north of Robotyne to the southern outskirts of Novodanylivka, however, Russian forces (likely from the 3rd assault company of the 291st regiment) managed to enter the southern houses of the village. It is currently unclear if they were able to establish any positions there, however. \nThese reports are corroborated by Sentinel imagery, which shows a massive increase in fires burning both on the frontline, and in Ukrainian controlled territory north of Mala Tokmachka on August 29. Almost all of these fires burnt out by August 30. Some small damage to buildings in Mala Tokmachka, likely from FPV drones, was recorded in the central part of the village, but nothing to suggest increased usage in that area.\nAdditionally, according to my information, large artillery duels and FAB bombardment has occurred south of Zaporizhzhia City since August 28. Heavy artillery shelling targeted Ukrainian positions in the area for around an hour straight in the early hours of the morning on August 31. At least 16 glide-bombs were dropped on Ukrainian positions at around 11:30pm for a period of roughly 20 minutes on August 30. Significant FAB bombardment also targeted the town of Malokaterynivka, around 14km south of Zaporizhzhia City on the night of August 28-29, resulting in large fires burning uncontrolled in the dachas and residential areas for over 24 hours. Russian artillery shelling did continue through to August 31, albeit at a decreased rate, and some of it was concentrated on areas west of Orikhiv.",
      "timestamp": "2025-08-31T23:39:03.372244Z"
    },
    {
      "original": "Recent Russian strategic bomber movements suggests that another large-scale combined missile attack on Ukraine is imminent. \nFollowing the strikes on August 31, most of the bombers returned to airbases close to Ukraine and remained there, rather than flying to the far east for equipment with Kh-101 cruise missiles as usual. 2 Tu-95s landed at Olenya Airbase, Murmansk Oblast, 1 Tu-95 landed at Engels-2 Airbase, Saratov Oblast, and 1 Tu-95 landed at Diaghilev Airbase, Ryazan Oblast. \nCurrently, the following aircraft are located near Ukraine:\nOlenya Airbase: 2 Tu-95MS\nEngels-2 Airbase: 3 Tu-95MS, 1 Tu-160\nDiaghilev Airbase: 3 Tu-95MS.\n2 of the Tu-95s at Engels-2 have been equipped with missiles. The status of the third is unknown. Notably, the number of flights to Diaghilev has increased, with one of the aircraft which took part in the most recent combat flight landing there afterwards. \nAs for the Tu-160 that launched missiles during the most recent attack, it flew to Ukrainka Airbase, Amur Oblast, in the far east where it is probably also being equipped with Kh-101 cruise missiles. \nIt is also important to remember that for around 2 weeks, Russian decreased their usage of Iskander-M ballistic missiles, Iskander-K cruise missiles, and significantly decreased their usage of Geran-2 drones. This indicates that stockpiles were built up of these weapons, and while they will have burnt through a decent amount of them since then, there will still be a lot left over.",
      "timestamp": "2025-08-31T23:39:03.372253Z"
    },
    {
      "original": "Striking August\nRussia used 4136 drones 60% of July, probably accumulating them after the mid summer performance.\n691 drone reached a target, even more fall as debris.\nFPVs surpassed barrages by the end of month.\nOverall numbers are next:\nBarrages: 166471 \n⬇️\nFPVs: 147444 \n⬆️\n⬆️\nBombs: 4400 \n⬆️\n⬆️\nMLRS: 2478 \n⬇️",
      "timestamp": "2025-08-31T23:39:03.372267Z"
    },
    {
      "original": "Striking August\nRussia used 4136 drones 60% of July, probably accumulating them after the mid summer performance.\n691 drone reached a target, even more fall as debris.\nFPVs surpassed barrages by the end of month.\nOverall numbers are next:\nBarrages: 166471 \n⬇️\nFPVs: 147444 \n⬆️\n⬆️\nBombs: 4400 \n⬆️\n⬆️\nMLRS: 2478 \n⬇️",
      "timestamp": "2025-08-31T23:39:03.372280Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Plavni, Stepnohirsk direction, Zaporizhzhia Oblast.\nPre-war population: ~329.\nTotal land area: ~2.13 km².",
      "timestamp": "2025-08-31T23:39:03.372285Z"
    },
    {
      "original": "Multiple sources are reporting that the spokesperson for the Al-Qassam Brigades (armed wing of Hamas) was killed in an Israeli airstrike on the Gaza Strip yesterday.   This is unconfirmed and should be treated as such considering Israel's track record of not…",
      "timestamp": "2025-08-31T23:39:03.372289Z"
    },
    {
      "original": "The IDF announced that Al-Qassam Brigades Spokesperson Abu Obeida was killed in an Israeli airstrike yesterday. This was then later confirmed by Palestinian sources affiliated with the Al-Qassam Brigades, as well as relatives of Abu Obeida.",
      "timestamp": "2025-08-31T23:39:03.372292Z"
    },
    {
      "original": "FPV drones from the Ukrainian GUR's \"Prymary\" special operations unit continues to attack valuable Russian targets in Crimea. \nIn a new compilation of footage from recent attacks, FPV drones attacked:\nRLK “Utyos-T” Radar System\nRT-70 radio telescope\n“GLONASS” dome complex\nMR-10M1 Mys radar\n96L6-AP radar for the S-400 Air defence system\nAs usual, the drones were launched from USVs in the waters of the Black Sea.",
      "timestamp": "2025-08-31T23:39:03.372300Z"
    },
    {
      "original": "I personally believe that Israel is gearing up to annex the Palestinian controlled parts of The West Bank. Here are a few reasons why.   1. In their briefings and announcements on \"anti-terrorist operations\" in the West Bank, the IDF has begun referring to…",
      "timestamp": "2025-08-31T23:39:03.372303Z"
    },
    {
      "original": "Let's see if my \nprediction\n from the beginning of the year holds up. \nhttps://t.me/DefenderDome/13550",
      "timestamp": "2025-08-31T23:39:03.372308Z"
    },
    {
      "original": "A Ukrainian UAV attack on the Ilsky refinery in Krasnodar Krai is currently ongoing. There are reports of a fire burning in the area. Russian air defence is currently working on the UAVs from the Primorsko-Akhtarsk - Severskaya area, which is the source of the explosions heard there. \nA U.S. RQ-4B Global Hawk reconnaissance drone was operating over the Black Sea earlier, guiding the Ukrainian drones to their targets in Crimea and Krasnodar Krai.",
      "timestamp": "2025-08-31T23:39:03.372312Z"
    },
    {
      "original": "Launch of 3 Ukrainian Flamingo cruise missiles, likely from Tuzly or somewhere in southern Odessa Oblast.   It remains unclear if these launches were for combat use, as the missile has not yet been reported in any confirmed strike, though the activity appears…",
      "timestamp": "2025-08-31T23:39:03.372315Z"
    },
    {
      "original": "Three Ukrainian flamingo cruise missiles, probably launched from Odesa Oblast, targeted a Russian Army Barracks near the village of Voloshyne, northern Crimea. Local sources report that the barracks partially burned down.\nSatellite imagery has now been published showing significant damage to the complex, confirming the reports. This is the first confirmed usage of the Flamingo missile so far.\nSatellite imagery credit: \nhttps://t.me/Crimeanwind/85519",
      "timestamp": "2025-08-31T23:39:03.372321Z"
    },
    {
      "original": "Three Ukrainian flamingo cruise missiles, probably launched from Odesa Oblast, targeted a Russian Army Barracks near the village of Voloshyne, northern Crimea. Local sources report that the barracks partially burned down.\nSatellite imagery has now been published showing significant damage to the complex, confirming the reports. This is the first confirmed usage of the Flamingo missile so far.\nSatellite imagery credit: \nhttps://t.me/Crimeanwind/85519",
      "timestamp": "2025-08-31T23:39:03.372330Z"
    },
    {
      "original": "Ukrainian UAVs have impacted Sevastopol Airport in Crimea. Multiple explosions were heard, and a large fire is now burning.   Explosions were also heard in the area of Saki Airbase, where three smaller fires are burning. It is unclear if these fires are from…",
      "timestamp": "2025-08-31T23:39:03.372333Z"
    },
    {
      "original": "Satellite imagery shows that as a result of the Ukrainian UAV attack on Crimea on August 30, Simferopol Airport was hit. The imagery shows two impact points with traces of burning where 1 Mi-8 and 1 Mi-24 helicopter were previously stationed. \nImagery credit: \nhttps://t.me/avivector/2944",
      "timestamp": "2025-08-31T23:39:03.372338Z"
    },
    {
      "original": "Russian Geran-2 drones once again attacked the city of Pavlohrad, Dnipropetrovsk Oblast. The main target appears to be the Pavlohrad Chemical plant, where detonations of rocket fuel were observed. \nMore details later.",
      "timestamp": "2025-08-31T23:39:03.372342Z"
    },
    {
      "original": "Guess who found the stickers! \n😱\n👌",
      "timestamp": "2025-08-31T23:39:03.372349Z"
    }
  ],
  "script_run_time": "2025-08-31T23:39:04.004930Z"
}