{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-08T07:55:23.473108Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку!",
      "timestamp": "2025-09-08T07:55:23.473124Z"
    },
    {
      "original": "📢\n Відбій загрози балістики.",
      "timestamp": "2025-09-08T07:55:23.473130Z"
    },
    {
      "original": "🛵\n БпЛА на межі Житомирщини та Рівненщини.\n🛵\n БпЛА на межі Чернігівщини та Сумщини.",
      "timestamp": "2025-09-08T07:55:23.473136Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку!",
      "timestamp": "2025-09-08T07:55:23.473149Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 112 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 8 вересня (із 22.00 7 вересня) противник атакував 142-ма ударними БпЛА типу Shahed, Гербера та безпілотниками інших типів із напрямків: Брянськ, Орел, Приморсько-Ахтарськ – рф., Чауда - ТОТ Криму, понад 100 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.30, протиповітряною обороною збито/подавлено 112 ворожих БпЛА типу Shahed, Гербера та дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 26 ударних БпЛА на 7 локаціях, падіння збитих (уламки) на 1 локації.\nДекілька ворожих БпЛА – в повітрі, атака триває!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-08T07:55:23.473170Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку!",
      "timestamp": "2025-09-08T07:55:23.473174Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння по областях.\n🛵\n Триває загроза застосування ворогом ударних БпЛА на Рівненщині, Житомирщині, Чернігівщині, Сумщині та Запоріжжі.",
      "timestamp": "2025-09-08T07:55:23.473180Z"
    },
    {
      "original": "🛵\n Ворожий ударний БпЛА на північному сході від н.п.Гончарівське (Чернігівщина), курс - західний.",
      "timestamp": "2025-09-08T07:55:23.473186Z"
    },
    {
      "original": "🛵\n Київська область (Вишгородський район)- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-08T07:55:23.473192Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-08T07:55:23.473200Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-08T07:55:23.473204Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-08T07:55:23.473213Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в напрямку Чернігова з північного сходу!",
      "timestamp": "2025-09-08T07:55:23.473217Z"
    },
    {
      "original": "🛵\n  Лозівський район (Харківщина), Синельниківський та Павлоградський райони (Дніпропетровщина) - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-08T07:55:23.473222Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-08T07:55:23.473229Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Сумщини і Харківщини.",
      "timestamp": "2025-09-08T07:55:23.473233Z"
    },
    {
      "original": "🛵\n Чернігів! Перебувайте в укриттях!Ворожі БпЛА у вашому напрямку з північного сходу!",
      "timestamp": "2025-09-08T07:55:23.473237Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Дніпропетровщині в напрямку Павлограда та Петропавлівки з північного сходу, на Харківщині - в напрямку н.п.Близнюки/Лозова зі сходу.",
      "timestamp": "2025-09-08T07:55:23.473241Z"
    },
    {
      "original": "🚀\n КАБ в напрямку Краматорська (Донеччина).",
      "timestamp": "2025-09-08T07:55:23.473245Z"
    },
    {
      "original": "Швидкісні цілі в напрямку Краматорська.",
      "timestamp": "2025-09-08T07:55:23.473249Z"
    },
    {
      "original": "🛵\n Ворожий ударний БпЛА на північному сході від н.п.Гончарівське (Чернігівщина).",
      "timestamp": "2025-09-08T07:55:23.473255Z"
    },
    {
      "original": "Thank God for Ukraine's massively effective air defence shooting down 747 drones last night. But seriously, why is it only Ukraine's government that people are inclined to believe when it comes to unsubstantiated wartime claims... the government that has a long history of lies?",
      "timestamp": "2025-09-08T07:55:24.085038Z"
    },
    {
      "original": "Russian forces have captured the village of Novoselivka, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~295.\nTotal land area: ~0.92 km².",
      "timestamp": "2025-09-08T07:55:24.085059Z"
    },
    {
      "original": "A combined missile and drone attack was carried out on Kremenchuk, Poltava Oblast, last night. At least 30 Geran-2 drones and as many as 4 Iskander-K cruise missiles impacted various targets.  Among the targets hit was the Kremenchuk Railway Depot and its…",
      "timestamp": "2025-09-08T07:55:24.085064Z"
    },
    {
      "original": "Close-up of the damage to the bridge in Kremenchuk after it was hit by two Russian Geran-2 drones yesterday. The damage is minor, as the drones hit the top part of the frame.",
      "timestamp": "2025-09-08T07:55:24.085068Z"
    },
    {
      "original": "Close-up of the damage to the bridge in Kremenchuk after it was hit by two Russian Geran-2 drones yesterday. The damage is minor, as the drones hit the top part of the frame.",
      "timestamp": "2025-09-08T07:55:24.085071Z"
    },
    {
      "original": "Kyiv and the region is currently under a large-scale Russian Geran-2 drone attack. The Trypillia Thermal Power Plant is the main target.",
      "timestamp": "2025-09-08T07:55:24.085075Z"
    },
    {
      "original": "Soon.....",
      "timestamp": "2025-09-08T07:55:24.085078Z"
    },
    {
      "original": "What section of the frontline would you like me to make a long form analysis on, and why? I recently did one on the future of Pokrovske-Prosyana, and how that could influence the battle of Hulyaipole.",
      "timestamp": "2025-09-08T07:55:24.085083Z"
    },
    {
      "original": "Around 20 Geran-2 drones are currently flying over Chernihiv and Poltava, heading towards Kyiv, most likely aiming for Trypillia again",
      "timestamp": "2025-09-08T07:55:24.085089Z"
    },
    {
      "original": "Yesterday, a UAV launched by the Houthis in Yemen impacted Ramon International Airport in southern Israel. Damage was recorded to the passenger hall, and the airport temporarily suspended all flights. Two civilians were injured as a result. \nTo my knowledge, this is the second Houthi UAV to impact its target in Israel, after the impact in Tel Aviv last year.",
      "timestamp": "2025-09-08T07:55:24.085100Z"
    },
    {
      "original": "Yesterday, a UAV launched by the Houthis in Yemen impacted Ramon International Airport in southern Israel. Damage was recorded to the passenger hall, and the airport temporarily suspended all flights. Two civilians were injured as a result. \nTo my knowledge, this is the second Houthi UAV to impact its target in Israel, after the impact in Tel Aviv last year.",
      "timestamp": "2025-09-08T07:55:24.085104Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continue to rapidly advance and have made significant progress over the past 5 days. \nSouth of the Vorona River, after recapturing Vorone and consolidating in the village and surrounding areas, Russian forces resumed their assault operations with the goal of reaching Sosnivka. This was done by attacking in two places. The main assaults were carried out from Komyshuvakha and positions to the north. Here, Russian forces advanced from the village to the outskirts of Ternove, and along the heights to the gulley running southeast from Sosnivka, securing full control over the heights and establishing themselves in the low-lying ground. \nWith the Ukrainians now behind the gulley and unable to effectively counterattack, Russian reinforcements were brought into Vorone, which began attacking from their newly consolidated positions to the Khoroshe Tract, capturing it, and breaking into the northeastern houses of Sosnivka. At the same time, Russian forces entered Sosnivka from the southeast after capturing the eastern edge of the gulley and quickly captured the majority of the village. Currently the northwestern houses are in the grey-zone. Ukrainian soldiers trying to enter it in small groups. \nMeanwhile, north of the Vorona River, Russian forces advanced from their newly consolidated positions northeast of Vorone, advancing northwest along the heights to the southern edge of Novoselivka. They were able to quickly enter the village and establish control over the southern streets, while other forces from the gulley to the north captured the northern houses, bringing the settlement under full Russian control. Additionally, as a result of these advances, the Ukrainians had to abandon the village of Sichneve to avoid being encircled and retreated more than 6 km west to positions north of Sosnivka. \n+ ~33.20 km² in favour of Russia.",
      "timestamp": "2025-09-08T07:55:24.085113Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-08T07:55:24.085117Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-08T07:55:24.085120Z"
    },
    {
      "original": "Disappeared in the area of the border.",
      "timestamp": "2025-09-08T07:55:24.085123Z"
    },
    {
      "original": "Another missile flying in the same direction",
      "timestamp": "2025-09-08T07:55:24.085126Z"
    },
    {
      "original": "Explosions were heard from Sumy",
      "timestamp": "2025-09-08T07:55:24.085129Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces continued to advance, each now focusing on different sections of the frontline.\nAfter completing the capture of Volodymyrivka, Ukrainian forces went on to begin advancing to the southeast towards Popiv Yar and Poltavka. They advanced along two opposite tactical heights, as well as through a gulley, and reached the northern edge of the Popiv Yar Chalk Quarry. Ukrainian soldiers have also been attempting to infiltrate into northern Novotoretske in small groups.  \nRussian forces continued to recapture previously lost positions on the western flank of their salient after the Ukrainians failed to cut them off. They advanced west to the eastern outskirts of Nove Shakhove, capturing treeline positions, and re-entered the northern part of the Hektova Balka Gulley. They also continued to attack west through Nykanorivka.\nAdditionally, the frontline was corrected further west. Sometime in the past 3 weeks, Russia was able to recapture the village of Doroznje and the freight train station of the same name, entrenching in positions there. Due to a lack of positions, Ukrainian forces withdrew over 3 km west, resulting in a large grey zone forming covered by Ukrainian FPV drones. Russian DRGs are actively operating here, attempting to reach the ventilation shafts for the Bilytska Coal Mine (where the current forwards Ukrainian positions are), and have entered the northeastern and eastern streets of Bilytske where Ukrainian forces have been trying to clear them out. \n+ ~14.80 km² in favour of Ukraine. \n+ ~3.64 km² in favour of Russia.",
      "timestamp": "2025-09-08T07:55:24.085136Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continue to advance and have made further progress towards eliminating the Ukrainian pocket east of Kostyantynivka. \nAfter securing the central part of Oleksandro-Shultyne, Russian forces advanced further west, and after several days of fighting secured the western part of the village. From here they began attacking north. Russian infantry pushed uphill along two parallel treelines and entrenched on the southern slope of the heights. \n+ ~2.75 km² in favour of Russia.",
      "timestamp": "2025-09-08T07:55:24.085140Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to push through the remnants of the Serebryanksyi Forest, and have made further gains in two areas.\nIn the west, Russian forces pushed south from their positions southeast of Torske, and broke through to the petting zoo on the northeastern outskirts of Yampil. Battles are ongoing there, as the Russians continue to expand their zone of control to the east and west. \nTo the east, Russian forces advanced south to the northern bank of the Siverskyi Donets River, reaching its intersection with the Zherebets River, and taking up new positions in the forests there. \n+ ~7.21 km² in favour of Russia.",
      "timestamp": "2025-09-08T07:55:24.085146Z"
    }
  ],
  "script_run_time": "2025-09-08T07:55:24.586942Z"
}