{
  "messages": [
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-12-04T02:48:54.448629Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину.",
      "timestamp": "2025-12-04T02:48:54.448649Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на межі Запорізької та Дніпропетровської областей рухаються північно-західним курсом.",
      "timestamp": "2025-12-04T02:48:54.448654Z"
    },
    {
      "original": "🛵\n БпЛА в Ніжинському районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-12-04T02:48:54.448660Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-12-04T02:48:54.448664Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини курсом на Київщину.",
      "timestamp": "2025-12-04T02:48:54.448669Z"
    },
    {
      "original": "🛵\n БпЛА в Бориспільському та Броварському районах Київщини, напрямок Бориспіль.",
      "timestamp": "2025-12-04T02:48:54.448678Z"
    },
    {
      "original": "🛵\n БпЛА в Обухівському районі Київщини, напрямок Обухів.",
      "timestamp": "2025-12-04T02:48:54.448682Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині в напрямку м.Київ з півдня.",
      "timestamp": "2025-12-04T02:48:54.448687Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА з Донеччини на Дніпропетровщину, курс на захід.",
      "timestamp": "2025-12-04T02:48:54.448692Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині в напрямку м.Київ з півдня.",
      "timestamp": "2025-12-04T02:48:54.448696Z"
    },
    {
      "original": "🛵\n БпЛА на Миколаївщині, напрямок н.п.Березанка, курс на Одещину.",
      "timestamp": "2025-12-04T02:48:54.448701Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині, курс західний.",
      "timestamp": "2025-12-04T02:48:54.448706Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині змінили курс на м.Одеса.",
      "timestamp": "2025-12-04T02:48:54.448712Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курс південний.\n🛵\n БпЛА на Миколаївщині, курс Одещина.",
      "timestamp": "2025-12-04T02:48:54.448718Z"
    },
    {
      "original": "🛵\n БпЛА в Синельниківському районі Дніпропетровської області, курс на захід.",
      "timestamp": "2025-12-04T02:48:54.448723Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину.",
      "timestamp": "2025-12-04T02:48:54.448727Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Павлограда.",
      "timestamp": "2025-12-04T02:48:54.448733Z"
    },
    {
      "original": "🚀\n Продовжуються пуски КАБ на Харківщину.",
      "timestamp": "2025-12-04T02:48:54.448738Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в р-ні Петропавлівка та Шахтарське (Дніпропетровщина), курсом на Павлоград.",
      "timestamp": "2025-12-04T02:48:54.448742Z"
    },
    {
      "original": "In the Kupyansk direction, over the last two weeks Ukrainian forces have been making incremental advances in and around Kupyansk.\nUkrainian forces cleared the village of Sobolivka from Russian DRGs and recaptured the rest of Moskovka which was previously in the grey zone. They also secured the rest of the warehouses on the northwestern edge of Kupyansk.\nFrom there, Ukrainian forces were able to consolidate along Yuvileyna Street in the northern part of the city, and captured the vocational school, beginning the fighting for the surrounding high-rise buildings and low-rise residential streets. The most recent attacks were focused on the remaining Russian supply routes into west bank Kupyansk, with attempts underway to recapture a number of enterprises along the P-79 highway. No significant progress has been achieved there yet, however, with drones acting as the main method of disrupting Russian logistics\nMeanwhile in the western part of the city, Ukrainian forces were able to consolidate in the residential streets north of Lermontova Street, while other assault groups spearheaded southeast towards the Yuvileynyi high-rise micro-district. They were able to capture most of the low-rise residential areas west of Yuvileynyi, and infiltrated its western apartment buildings. Attacks are also underway in the direction of the city centre\nFurther south, Ukrainian forces continued to advance northwards, supporting the operations in the western suburbs. They recaptured the rest of the Kolontaivka District in the southern part of the city and took up positions in the surrounding forests. Other forces pushed further north up the highway, linking up with the garrison still holding out in the bridgehead west of the Oskil River, south of the city centre. \n+ ~7.42 km² in favour of Ukraine.",
      "timestamp": "2025-12-04T02:48:54.978743Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced, capturing various positions east of the Oskil River.\nIn the south, Russian forces continued to incrementally advance towards the Borova - Novoplatonivka line over the last week. They advanced south from their initial spearhead towards the P-79 Highway, establishing control over positions on the northern bank of a tributary of the Oskil River. Additionally, the Russians captured the last houses of Borivska Andriivka, and improved their positions in the treelines southeast of the village.\nIn the north, following an earlier Russian attack, Ukrainian forces were able to clear the southeastern part of Bohuslavka from dismounted Russian infantry, re-establishing full control over the village. \n+ ~4.00 km² in favour of Russia.\n+ ~0.66 km² in favour of Ukraine.",
      "timestamp": "2025-12-04T02:48:54.978760Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Ivanivka, Prosyana direction, Dnipropetrovsk Oblast.\nPre-war population: ~1,420.\nTotal land area: ~8.15 km².\nThe fighting for Ivanivka lasted approximately 2 months, 18 days.",
      "timestamp": "2025-12-04T02:48:54.978766Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued their assault operations in the direction of the Kharkiv - Donetsk regional border, capturing new positions in the low-lying ground. \nRussian forces advanced northwest up the forest plantations on the northern end of the gulley, reaching Ukrainian positions on the approaches to Korovii Yar. They also captured a forested area to the southwest and began fighting for the three main strongpoints in the area.\n+ ~1.52 km² in favour of Russia.",
      "timestamp": "2025-12-04T02:48:54.978772Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance southeast and east of Lyman, while Ukrainian forces carry out counterattacks to the north.\nIn the southeast, after several days of fighting, Russian forces captured the main trench strongpoints in the area of the highway south of Yampil. They also further improved their positions to the northwest, crossing the highway at new points. Additionally, Russian forces captured the rest of the chalk quarry and broke through Ukrainian positions in the Sviati Hory National Park, entering the village of Dibrova from the northeast.\nTo the north, Russian forces resumed their assault operations along the Zarichne - Lyman Road, capturing new positions in the strongpoints there. Heavy fighting is ongoing for additional trenches further west. \nIn the northwest, Ukrainian forces continued counterattacks in Stavky, where they consolidated in the eastern agricultural buildings and the southern houses, before infiltrating into the northern part of the village. \n+ ~7.23 km² in favour of Russia. \n+ ~1.20 km² in favour of Ukraine.",
      "timestamp": "2025-12-04T02:48:54.978781Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces intensified their assault operations, making significant progress in three different areas.\nIn the northeast, Russian forces crossed the Bakhmutovka River and entered the eastern outskirts of Sviato-Pokrovske, capturing positions in the agricultural buildings. From there, additional forces crossed the river and began assaults on the eastern residential part of Sviato-Pokrovske, which was subsequently captured. Fighting is now ongoing for the central part of the village.\nTo the southwest, as a result of earlier infiltrations, Russian forces were able to consolidate in two 2.5 km+ long parallel treelines northwest of Fedorivka, and are now fighting for the eastern approaches to Pazeno. From there, assault operations are being carried out on positions to the south from across the Vasyukivka River in Vasyukivka, as well as from the north, forcing the Ukrainians to withdraw from their trenches near the highway which have held for well over 2 years. \nIn the southwest, Russian forces advanced from central Vasyukivka to the western outskirts, finally capturing this village after months of prolonged battles. They are now attempting to clear adjacent trenches and dugouts to the south. \n+ ~10.24 km² in favour of Russia.",
      "timestamp": "2025-12-04T02:48:54.978788Z"
    },
    {
      "original": "Just now, a Russian Orlan-10 reconnaissance drone scouted out targets in the area of Odesa City for Iskander-M OTRK teams in Crimea.\nThere is an increased ballistic threat for Odesa over the next few hours.\nApproximate flight route on the map.",
      "timestamp": "2025-12-04T02:48:54.978794Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nHadramout حضرموت : On November 30, STC forces began advancing from the coast toward the interior of Hadramaut governorate with the aim of “pacifying and stabilizing the region,” ushering in a new phase of the shift of Saudi power and influence in Yemen in favor of the UAE. The new operation, called “Promising Future,” advanced relatively easily northward, taking control of important centers such as Aladwas, Ras Huwaira, Şayqat Al Amir, Ar Rawuk (until reaching the vicinity of the Masila Oil fields), Hajrain, Al-Qatan, Shibām, Ghuraf, Tarim, As-Suwayri, Sharmah, Al Madudah, and the city of Seiyun, the main stronghold of the PLC and Islah on December 3.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.369554552901064%2C48.43579666412567&z=9\n ]",
      "timestamp": "2025-12-04T02:48:54.978803Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nHadramout حضرموت : On November 30, STC forces began advancing from the coast toward the interior of Hadramaut governorate with the aim of “pacifying and stabilizing the region,” ushering in a new phase of the shift of Saudi power and influence in Yemen in favor of the UAE. The new operation, called “Promising Future,” advanced relatively easily northward, taking control of important centers such as Aladwas, Ras Huwaira, Şayqat Al Amir, Ar Rawuk (until reaching the vicinity of the Masila Oil fields), Hajrain, Al-Qatan, Shibām, Ghuraf, Tarim, As-Suwayri, Sharmah, Al Madudah, and the city of Seiyun, the main stronghold of the PLC and Islah on December 3.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.369554552901064%2C48.43579666412567&z=9\n ]",
      "timestamp": "2025-12-04T02:48:54.978811Z"
    },
    {
      "original": "🇾🇪\n⚡\n- \"The south of Yemen [including the Hadhramaut Governorate] will not be a haven for terrorism,\" - Southern Transitional Council of Yemen, UAE-backed.",
      "timestamp": "2025-12-04T02:48:54.978817Z"
    },
    {
      "original": "🇾🇪\n⚡\n- \"The Wadi regions [oil-rich areas around Seiyun of Hadhramaut Governorate in eastern Yemen] were used for years for smuggling in favor of the terrorist Houthis, leading to the bleeding of the sons of the South,\" - Southern Transitional Council of Yemen, UAE-backed.",
      "timestamp": "2025-12-04T02:48:54.978824Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n The IDF, in a statement, stated that during an operation by the Golani reconnaissance unit in eastern Rafah, forces encountered several fighters who allegedly emerged from underground infrastructure in the area. \nA soldier from the unit was seriously wounded in the engagement.\nThree additional soldiers were moderately wounded.\n@wfwitness",
      "timestamp": "2025-12-04T02:48:54.978834Z"
    },
    {
      "original": "This evening, 1 Iskander-M ballistic missile launched from the vicinity of Liski, Voronezh Oblast impacted an unknown target in the Slobidskyi District of Kharkiv City.",
      "timestamp": "2025-12-04T02:48:54.978838Z"
    },
    {
      "original": "This evening, a Russian Iskander-M ballistic missile struck an SBU building in the city of Kryvyi Rih, Dnipropetrovsk Oblast.\nCoordinates: 47.911699, 33.334851",
      "timestamp": "2025-12-04T02:48:54.978843Z"
    },
    {
      "original": "This evening, a Russian Iskander-M ballistic missile struck an SBU building in the city of Kryvyi Rih, Dnipropetrovsk Oblast.\nCoordinates: 47.911699, 33.334851",
      "timestamp": "2025-12-04T02:48:54.978847Z"
    },
    {
      "original": "Two Russian Iskander-M ballistic missiles launched from Crimea impacted a target in the city of Bashtanka, Mykolaiv Oblast. \nOne of the missiles was equipped with a cluster warhead. A large fire is now burning within the city limits.",
      "timestamp": "2025-12-04T02:48:54.978852Z"
    },
    {
      "original": "On the northeastern flank of Kostyantynivka, Russian forces continued their assault operations northwest of Chasiv Yar and have made new progress in two different areas over the last week.\nIn the southeast, Russian forces continued pushing west down the windbreaks on either side of the railway tracks, capturing new positions northwest of Mykolaivka. They also secured additional positions in a forested area north of the railway line.\nIn the northwest, Russian forces began advancing towards the village of Virolyubivka from the captured section of the former Ukrainian defensive line. They were able to improve their positions along a treeline, capturing an intersection with a perpendicular treeline.\n+ ~0.89 km² in favour of Russia.",
      "timestamp": "2025-12-04T02:48:54.978879Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance in and around Kostyantynivka, making new progress in multiple different areas.\nIn the northeast, following a Ukrainian withdrawal, Russian forces were able to secure the remaining isolated trenches south of the reservoirs and completed the capture of Predtechyne. \nTo the west, Russian forces continued to advance in Santurinivka District of Kostyantynivka and captured the tram depot, along with the adjacent trench fortifications. From there, DRGs infiltrated northwest over the Dovhenka Arroyo Gulley to the edge of the Hora District of northeastern Kostyantynivka. Russia was also able to consolidate further in the western streets of Santurinivka District, capturing Kindergarten No. 9. \nTo the south, Ukrainian forces launched a series of counterattacks, crossing the Kryvyi Torets River and re-entering the Mychuryna Dachas, where they linked up with small pockets of resistance previously encircled by Russian soldiers. The situation in the Mychuryna Dachas is very dynamic, with both sides holding positions behind each other.\nFurther south, Russian assault groups crossed the Kryvyi Torets River and entered the small residential area northwest of Ivanopillya. Ukrainian forces, who had accumulated reinforcements in the treelines and forested areas southeast of the Stara Santurynivka District are counterattacking. \nIn the south, Ukrainian forces withdrew from the treelines west of Ivanopillya, allowing for the Russians to capture additional positions in the windbreaks along the railway line. Russian forces also captured additional positions in the forests on the northern bank of the Kleban-Bykske Reservoir and are attacking further west.\n+ ~5.21 km² in favour of Russia.",
      "timestamp": "2025-12-04T02:48:54.978890Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, over the last 10 days both Russian and Ukrainian forces have advanced, with Russian forces making significant progress across several different areas.\nIn the northeast, Russian forces were able to consolidate in the southern part of Sofiivka and the forested areas northeast of the village following earlier assault operations. They were also able to clear the centre of Shakhove and are accumulating additional infantry for further attacks. Ukrainian forces managed to retake some positions in the forest plantations north of Shakhove and are engaged in fighting for the trenches north of the village.\nTo the southwest, Russian forces intensified their assault operations. They advanced along the Shakhove - Nove Shakhove Road, as well as along the parallel forested areas, reaching one of the clay quarries which they are now trying to bypass from the north. \nAdditionally, Russian forces recaptured numerous treeline positions northwest of Mayak and secured the southern part of the Hektova Gulley. During the fighting for the northern part of the Hektova Gulley, Ukrainian forces carried out multiple counterattacks, but were eventually forced back, allowing for the Russians to advance even further north and entrench in the eastern houses of Nove Shakhove. Russian forces also consolidated in the southern part of Dorozhnje, captured the Dorozhnje Freight Train Station and are attempting to seize the northern part of the village.\nTo the south, the Russians continued pushing west from the Fedorivka - Boikivka line and recaptured the treelines north of Zatyshok. From there, they recaptured the gulley stretching to the northwestern approaches to Zatyshok and attempted to regain a foothold along the railway windbreaks. The outcome of the latter attacks is currently unknown.\n+ ~17.16 km² in favour of Russia.",
      "timestamp": "2025-12-04T02:48:54.978906Z"
    },
    {
      "original": "I think I should mention this so people aren't confused:\nGoogle My Maps (the website I use for my interactive maps) is one of the most infuriating things to ever use. This advance pictured above has deleted itself a total of SIX times now. Lots of other people have been experiencing the same problems, but this website is one of those things that is just never updated anymore and left to rot. \nSo, that said, if you see something unusual or out of the ordinary on my interactive map, its likely just google my maps glitching again. Please DM me when this happens so I can fix it asap.",
      "timestamp": "2025-12-04T02:48:54.978913Z"
    },
    {
      "original": "Ukrainian Collapse Continues In Zaporizhzhia, From Huliaipole To Stepnogorsk (Videos)\nOn December 3, the Russian military captured another settlement close to the key city of Huliaipole and made additional gains near the settlement of Stepnogorsk to the west in Zaporozhye.\nThe capture of Chervonoye, also known as Vysoke, to the east of Huliaipole, was announced by the Russian Ministry of Defense, which said that the attack on the settlement was led by the the 38th Guards Motorized Rifle Brigade of the 35th Combined Arms Army, a part of the Vostok [East] Group of Forces.\nTo the west in Zaporozhye, the group is rapidly developing its operations around Stepnogorsk after breaking through Ukrainian defenses there.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494108Z"
    },
    {
      "original": "Ukrainian Collapse Continues In Zaporizhzhia, From Huliaipole To Stepnogorsk (Videos)\nOn December 3, the Russian military captured another settlement close to the key city of Huliaipole and made additional gains near the settlement of Stepnogorsk to the west in Zaporozhye.\nThe capture of Chervonoye, also known as Vysoke, to the east of Huliaipole, was announced by the Russian Ministry of Defense, which said that the attack on the settlement was led by the the 38th Guards Motorized Rifle Brigade of the 35th Combined Arms Army, a part of the Vostok [East] Group of Forces.\nTo the west in Zaporozhye, the group is rapidly developing its operations around Stepnogorsk after breaking through Ukrainian defenses there.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494126Z"
    },
    {
      "original": "Military Situation In Ukraine On December 3, 2025 (Maps Update)",
      "timestamp": "2025-12-04T02:48:55.494130Z"
    },
    {
      "original": "Military Situation In Ukraine On December 3, 2025 (Maps Update)",
      "timestamp": "2025-12-04T02:48:55.494135Z"
    },
    {
      "original": "Kiev Forces Are Losing Two Key Towns Near Pokrovsk And Siversk (Videos)\nOn December 3, the Russian military advanced around the city of Pokrovsk, which is already under its control, and near the city of Sivers, where it is already engaged in a fierce battle with Kiev forces, in Donetsk.\nThe Tsentr [Center] Group of Forces expanded its control in the southern part of Grishino, also known as Hryshyne, approaching the center of the settlement, which is located to the northwest of Pokrovsk.\nTo the east in Donetsk, Ukraine is about to receive another defeat in Siversk, where the Yug [South] Group of Forces is advancing.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494143Z"
    },
    {
      "original": "Kiev Forces Are Losing Two Key Towns Near Pokrovsk And Siversk (Videos)\nOn December 3, the Russian military advanced around the city of Pokrovsk, which is already under its control, and near the city of Sivers, where it is already engaged in a fierce battle with Kiev forces, in Donetsk.\nThe Tsentr [Center] Group of Forces expanded its control in the southern part of Grishino, also known as Hryshyne, approaching the center of the settlement, which is located to the northwest of Pokrovsk.\nTo the east in Donetsk, Ukraine is about to receive another defeat in Siversk, where the Yug [South] Group of Forces is advancing.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494151Z"
    },
    {
      "original": "Syria Seized Weapons Bound For Hezbollah, Still Got Hit By Israeli Strikes (Video, Photos)\nMultiple Israeli drone strikes hit the governorate of Rif Dimashq in southern Syria on December 3, just a day after the country’s security forces announced the seizure of a weapon shipment allegedly bound to Hezbollah in neighboring Lebanon.\nThe Syrian Arab News Agency said that the strikes targeted Bat al-Ward hill and the road leading to it close to the town of Beit Jinn, which is located right on the front with the Israeli-occupied Golan Heights.\nOn December 2, The Syrian Ministry of Interior said that its forces seized a large shipment of landmines that was bound to Hezbollah in neighboring Lebanon. \nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494160Z"
    },
    {
      "original": "Syria Seized Weapons Bound For Hezbollah, Still Got Hit By Israeli Strikes (Video, Photos)\nMultiple Israeli drone strikes hit the governorate of Rif Dimashq in southern Syria on December 3, just a day after the country’s security forces announced the seizure of a weapon shipment allegedly bound to Hezbollah in neighboring Lebanon.\nThe Syrian Arab News Agency said that the strikes targeted Bat al-Ward hill and the road leading to it close to the town of Beit Jinn, which is located right on the front with the Israeli-occupied Golan Heights.\nOn December 2, The Syrian Ministry of Interior said that its forces seized a large shipment of landmines that was bound to Hezbollah in neighboring Lebanon. \nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494169Z"
    },
    {
      "original": "TALKS OF PEACE, REALITIES OF WAR: U.S. - RUSSIA DIALOGUE AMID UKRAINIAN SETBACKS",
      "timestamp": "2025-12-04T02:48:55.494172Z"
    },
    {
      "original": "A Shift in Narrative: Why Europe's Insistent Statements Are in Tune with Ukraine's Defeats on the Battlefield\nRussian assault groups are fighting for the control of the road to Rodinskoye within the Pokrovsk agglomeration. Russian units have crossed the Bakhmutka River and entered the Sviato-Pokrovske settlement. \nAmid Ukraine's crumbling defenses, European ministers warn of an imminent peace deal.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494183Z"
    },
    {
      "original": "A Shift in Narrative: Why Europe's Insistent Statements Are in Tune with Ukraine's Defeats on the Battlefield\nRussian assault groups are fighting for the control of the road to Rodinskoye within the Pokrovsk agglomeration. Russian units have crossed the Bakhmutka River and entered the Sviato-Pokrovske settlement. \nAmid Ukraine's crumbling defenses, European ministers warn of an imminent peace deal.\nRead more \nHERE",
      "timestamp": "2025-12-04T02:48:55.494191Z"
    }
  ],
  "script_run_time": "2025-12-04T02:48:55.495056Z"
}