{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-05T20:26:45.565572Z"
    },
    {
      "original": "🚀\nШвидкісна ціль в напрямку Харкова",
      "timestamp": "2026-01-05T20:26:45.565601Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА навколо Харкова, до закінчення повітряної тривоги перебувайте в укриттях.",
      "timestamp": "2026-01-05T20:26:45.565608Z"
    },
    {
      "original": "🛸\n Поблизу Херсона та на півночі Сумщини розвідувальний БпЛА противника, який може бути навідником  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2026-01-05T20:26:45.565613Z"
    },
    {
      "original": "🛵\n БпЛА  на заході Чернігівщини, курс на південь.",
      "timestamp": "2026-01-05T20:26:45.565617Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-05T20:26:45.565622Z"
    },
    {
      "original": "🛵\n БпЛА  в напрямку Сум та Чернігова.",
      "timestamp": "2026-01-05T20:26:45.565626Z"
    },
    {
      "original": "🛵\n БпЛА  на Запоріжжя з півдня.",
      "timestamp": "2026-01-05T20:26:45.565631Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з заходу.",
      "timestamp": "2026-01-05T20:26:45.565635Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Запоріжжя, на Харків та на Суми.",
      "timestamp": "2026-01-05T20:26:45.565644Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА \n➡️\n курсом на Дніпро.",
      "timestamp": "2026-01-05T20:26:45.565651Z"
    },
    {
      "original": "🚀\n Пуски КАБів на Харківщину та Сумщину",
      "timestamp": "2026-01-05T20:26:45.565656Z"
    },
    {
      "original": "🛩\nНа шляху до F-16: ексклюзивна історія від українського пілота\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nЕксклюзивна розповідь пілота F-16 про те, як Україна пройшла шлях від виснажливих дипломатичних перемовин – до першого переможного “Target destroyed.” \nЯк попри опір і скепсис буквально виборювала право на сучасну бойову авіацію.\nЧому F-16 стали не просто новим типом техніки, а стратегічним інструментом у захисті наших міст та об’єктів критичної інфраструктури.\nЦе історія про українців,  які довели усьому світу, що можуть і вміють перемагати на межі можливостей!\nДивіться за \nпосиланням",
      "timestamp": "2026-01-05T20:26:45.565674Z"
    },
    {
      "original": "🛵\n Харківщина: групи БпЛА \n➡️\n в районі Куп'янська.",
      "timestamp": "2026-01-05T20:26:45.565682Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n в напрямку Городні. \n🛵\n БпЛА \n➡️\n курсом на Харків.",
      "timestamp": "2026-01-05T20:26:45.565693Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n в напрямку Городні.  \n🛵\n БпЛА \n➡️\n курсом на Харків.",
      "timestamp": "2026-01-05T20:26:45.565701Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n в районі Семенівки.\n🛵\n Харківщина: БпЛА \n➡️\n у напрямку Балаклії.",
      "timestamp": "2026-01-05T20:26:45.565709Z"
    },
    {
      "original": "🚀\n Пуски КАБів на Донеччину",
      "timestamp": "2026-01-05T20:26:45.565715Z"
    },
    {
      "original": "🚀\nКАБ в напрямку Дніпропетровської обл",
      "timestamp": "2026-01-05T20:26:45.565719Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБів на Донеччину",
      "timestamp": "2026-01-05T20:26:45.565724Z"
    },
    {
      "original": "🚀\n Пуски КАБів на Сумщину",
      "timestamp": "2026-01-05T20:26:45.565728Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their assault operations northeast of Stepnohirsk and have made additional progress near Lukyanivske.\nRussian forces continued advancing east from the solar plant, capturing new positions in the treelines there and reaching Lukyanivske from the south. Infiltrations into the village continued from the west. \nAdditionally, the Russians continued infiltrating further east through the treelines and began attacking along the gulley in the direction of Novoyakovlivka.\n+ ~0.96 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385503Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued their assault operations, making new progress in two different areas.\nIn the northeast, Russian forces continued to advance south of Hulyaipole, where they captured new positions in the treelines and forest northwest of Dorozhnyanka.\nIn the southwest, after entering Bilohirya from the south and east, the Russians established control over most of the village, and began attacks to the north in the direction of the Ukrainian positions on the tactical heights. \n+ ~3.78 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385518Z"
    },
    {
      "original": "In the Pokrovs'ke direction, Ukrainian forces have consolidated numerous treelines east of the Haichur River following failed Russian operations.\nOver the last month, Ukrainian forces have been incrementally regaining solid control over positions east of the Haichur River. These operations have been conducted in areas where Russian forces did not properly entrench in and only moved through to their forward positions west of the river. \nDue to this lack of Russian consolidation, the Ukrainians were able to regain control over the village of Radisne which had previously been in a sort of zone of Russian influence with no permanent presence, and managed to link up with isolated pockets of soldiers in the treelines further east. As a result, a large grey-zone has formed stretching up to 4.5 km wide in some areas, where both sides have overlapping positions in an extremely fluid and dynamic situation. \nThe establishment of solid positions east of the river by Ukraine has allowed them to increase their overall presence in this grey-zone of mixed positions in recent weeks, significantly complicating Russian logistics to their own bridgeheads west of the Haichur river. Nevertheless, Russian forces continued their operations west of the river, with DRGs still infiltrating the village of Kosivtseve, and for the first time, entering the town of Ternuvate.\n+ ~13.70 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385526Z"
    },
    {
      "original": "In the Novopavlivka direction, both Russian and Ukrainian forces have advanced, each capturing positions in the village of Novopidhorodne.\nAt some point recently, Ukrainian forces launched counterattacks in northeastern Novopidhorodne, recapturing positions along two residential streets, shrinking the Russian incursion zone. \nSince then, the Russians have resumed their attacks through the southern part of the village, capturing new positions along Shevchenka Street. Additionally, under heavy artillery cover, assault operations are being carried out on the central part of the village, as well as along the railway line to the south. DRGs have also penetrated the western streets. \n+ ~0.66 km² in favour of Ukraine. \n+ ~0.09 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385533Z"
    },
    {
      "original": "Explosion in Kharkiv City. Likely a Tornado-S rocket.",
      "timestamp": "2026-01-05T20:26:46.385537Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T20:26:46.385540Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces resumed their assault operations north of Pokrovsk and recaptured previously lost positions there.\nRussian forces advanced northwest from the forested areas northwest of Myrnohrad, recapturing the highway intersection. Other forces attacked up the treelines on a wide front north of Pokrovsk, re-establishing control over a large section of the road to Hryshyne and one of the pig farms. \n+ ~6.04 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385546Z"
    },
    {
      "original": "Another explosion in Kharkiv",
      "timestamp": "2026-01-05T20:26:46.385550Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T20:26:46.385553Z"
    },
    {
      "original": "To all the geniuses who accuse me of reporting Tornado-S strikes to S-300 ground-to-ground strikes, notice how there is no ballistic threat this time?\nWhen there is a ballistic threat, a non-Iskander target is detected flying and an explosion is heard, that is almost always an S-300 ground-to-ground. Don't ask me why Russia does this, but it happens.",
      "timestamp": "2026-01-05T20:26:46.385557Z"
    },
    {
      "original": "Two more explosions were heard. A total of 4 Tornado-S strikes were carried out on the industrial zone of the Slobidskyi district in southern Kharkiv City.",
      "timestamp": "2026-01-05T20:26:46.385560Z"
    },
    {
      "original": "Repeated explosions in Kharkiv City",
      "timestamp": "2026-01-05T20:26:46.385563Z"
    },
    {
      "original": "Tornado-S strikes are also being carried out on Slovyansk, Donetsk Oblast simultaneously.",
      "timestamp": "2026-01-05T20:26:46.385566Z"
    },
    {
      "original": "Tornado-S strikes are now carried out on the area of Rohan, to the southeast of Kharkiv City.",
      "timestamp": "2026-01-05T20:26:46.385569Z"
    },
    {
      "original": "Repeated strikes on Kharkiv City.\nA Russian recon drone is operating just north of the city centre, adjusting the strikes.",
      "timestamp": "2026-01-05T20:26:46.385586Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-05T20:26:46.385590Z"
    },
    {
      "original": "Scenes from Kharkiv",
      "timestamp": "2026-01-05T20:26:46.385594Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-05T20:26:46.385598Z"
    },
    {
      "original": "More from Kharkiv. Additional strikes have been carried out.",
      "timestamp": "2026-01-05T20:26:46.385603Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the southeast, Russian forces resumed their assault operations towards eastern Yarova, recapturing positions in the forests there and reaching the edge of the town.\nTo the west, the Russians advanced south to the western part of Yarova, recapturing positions in the forests south of the railway line. They also began attacks to the southwest and west, improving their positions in the forests and reaching the outskirts of Sosnove.\nTo the north, Russian forces resumed their assault operations in the direction of Oleksandrivka, where they advanced northwest and captured new positions in the forests there.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385611Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress northeast of Lyman.\nIn the northeast, Russian forces resumed their assault operations northwest of Zarichne and captured new treeline positions north of the gulley. From there, they began attacking the Ukrainian positions east of Stavky. Other assault groups are attempting to attack these same positions via the treelines from the eastern part of Stavky. assault operations are also underway on the agricultural buildings on the western outskirts of Stavky.\nIn the southwest, Russian forces continued incrementally consolidating in the fields west of the Pynkov Yar Gulley, where they were able to capture new treeline positions in the direction of the first cluster of agricultural buildings. DRGs continue to infiltrate further west to the northern outskirts of Lyman.\n+ ~1.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385618Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced southeast of Lyman in the area of the Siverskyi Donets River.\nIn the southeast, Russian forces continued to slowly advance in and around Ozerne. They managed to capture the remaining positions in the northwestern houses and captured the last Ukrainian strongpoint in the forest to the north, allowing for them to establish control over almost all of the northern part of the village. \nTo the northwest, Russian forces improved their positions in the forests east of Dibrova, largely levelling the frontline in the direction of the Siverskyi Donets River.\nTo the west, Ukrainian forces launched a counterattack, recapturing the southern and southwestern streets of Dibrova and re-entering the central part of the village.\nIn the northwest, Russian forces continued advancing west through the forests northwest of Dibrova, capturing new positions in the direction of the Lyman - Raihorodok Road. \n+ ~1.97 km² in favour of Russia.\n+ ~1.16 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-05T20:26:46.385626Z"
    },
    {
      "original": "U.S. May Be About To Go All-In Against Iran \nPresident Donald Trump issued another warning to Iran on January 5, saying that the Islamic Republic would get “hit very hard” by the United States if more protesters die during demonstrations that have entered a second week.\n“We’re watching it very closely. If they start killing people like they have in the past, I think they’re going to get hit very hard by the United States,” Trump told reporters aboard Air Force One.\nAt least 20 people, including a member of law enforcement-security forces, have been killed in the protests, which broke out as a result of worsening economic conditions, according to human rights groups.\nTrump’s latest warning came just a day after Prime Minister Benjamin Netanyahu said that Israelis “identify with the struggle of the Iranian people.”\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186136Z"
    },
    {
      "original": "U.S. May Be About To Go All-In Against Iran \nPresident Donald Trump issued another warning to Iran on January 5, saying that the Islamic Republic would get “hit very hard” by the United States if more protesters die during demonstrations that have entered a second week.\n“We’re watching it very closely. If they start killing people like they have in the past, I think they’re going to get hit very hard by the United States,” Trump told reporters aboard Air Force One.\nAt least 20 people, including a member of law enforcement-security forces, have been killed in the protests, which broke out as a result of worsening economic conditions, according to human rights groups.\nTrump’s latest warning came just a day after Prime Minister Benjamin Netanyahu said that Israelis “identify with the struggle of the Iranian people.”\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186154Z"
    },
    {
      "original": "Military Situation In Gaza Strip On January 5, 2026 (Map Update)",
      "timestamp": "2026-01-05T20:26:47.186158Z"
    },
    {
      "original": "Turkey Enhances ‘Steel Dome’ With S-400 Replacement (Video)\nTurkey enhanced its multi-layered air and missile defense network, dubbed the \"Steel Dome,\" with the integration of an additional locally-made SİPER long-range air defense system, the Presidency of Defense Industries (SSB) announced on January 4.\nIn a statement, SSB President Haluk Görgün said that the SİPER Block 1 system entered active service following a live-fire test.\nThe system was originally planned as Hisar-U. However, after it was concluded that Hisar-U could not meet Turkey’s long-range air defense missile needs with its current structure, it was decided to transform Hisar-U into a new missile family. This missile family was named SİPER and the name of Hisar-U was changed to SİPER Block 1.\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186166Z"
    },
    {
      "original": "Military Situation In Ukraine On January 5, 2026 (Maps Update)",
      "timestamp": "2026-01-05T20:26:47.186170Z"
    },
    {
      "original": "Military Situation In Ukraine On January 5, 2026 (Maps Update)",
      "timestamp": "2026-01-05T20:26:47.186174Z"
    },
    {
      "original": "Russian Attacks Shock Ukrainian Forces In Sumy (Videos)\nOn January 5, the Russian military expanded its control in Sumy by capturing another settlement along the border from Kiev forces.\nThe settlement, Grabovskoye, was captured by the 34th Separate Motorized Rifle Brigade of the Sever [North] Group of Forces, according to the Russian Ministry of Defense, which revealed in a statement that Ukrainian troops took heavy losses during the battle there.\nGrabovskoye is located right to the south of Vysoke, which the Sever Group of Forces captured late last month in a lightning cross-border attack.\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186182Z"
    },
    {
      "original": "Russian Attacks Shock Ukrainian Forces In Sumy (Videos)\nOn January 5, the Russian military expanded its control in Sumy by capturing another settlement along the border from Kiev forces.\nThe settlement, Grabovskoye, was captured by the 34th Separate Motorized Rifle Brigade of the Sever [North] Group of Forces, according to the Russian Ministry of Defense, which revealed in a statement that Ukrainian troops took heavy losses during the battle there.\nGrabovskoye is located right to the south of Vysoke, which the Sever Group of Forces captured late last month in a lightning cross-border attack.\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186194Z"
    },
    {
      "original": "New Russian Geran Interceptor Spotted Armed With MANPADS (Video, Photos)\nThe interceptor version of Russian Geran-2 drone has been spotted armed with a modified man-portable air defense system (MANPADS).\nUkrainian media revealed the existence of the Geran-2 interceptor last month, sharing photos showing the wreckage of one such drone which was armed with a top-mounted Soviet-era R-60M short-range air-to-air missile. Footage showing the wreckage of the new MANPADS-armed variant of the interceptor appeared online on January 4.\nJust like the R-60M missile, the MANPAD was mounted on top to keep the belly of the drone clear for the take off, which usually consists of a rocket booster.\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186202Z"
    },
    {
      "original": "New Russian Geran Interceptor Spotted Armed With MANPADS (Video, Photos)\nThe interceptor version of Russian Geran-2 drone has been spotted armed with a modified man-portable air defense system (MANPADS).\nUkrainian media revealed the existence of the Geran-2 interceptor last month, sharing photos showing the wreckage of one such drone which was armed with a top-mounted Soviet-era R-60M short-range air-to-air missile. Footage showing the wreckage of the new MANPADS-armed variant of the interceptor appeared online on January 4.\nJust like the R-60M missile, the MANPAD was mounted on top to keep the belly of the drone clear for the take off, which usually consists of a rocket booster.\nRead more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186212Z"
    },
    {
      "original": "Russia and Ukraine Trade Strikes: Kyiv, Chernihiv, and Energy Grid Targeted\nOn the night of January 5, the Ukrainian Air Force reported a massive Russian attack involving 165 strike UAVs and 9 Iskander-M ballistic missiles , along with S-300 anti-aircraft missiles. According to their data, 137 drones were shot down or suppressed, but not a single missile was intercepted.\nThe main strike hit the Chernihiv region: up to eight Iskander missiles struck targets in Chernihiv, including six direct hits and two in the area of the 169th Land Forces Training Center in Desna. As a result, a local thermal power plant caught fire.\nDrones were active over Kyiv and adjacent areas. Monitoring channels recorded attempts to encircle the capital: targets in Fastiv, Vyshhorod, and Boryspil, including the Kyiv Hydroelectric Power Plant and the TEC-6 thermal power plant in Troieshchyna. Slavutych was completely de-energized after the arrival of Gerans — local resources confirmed the blackouts.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186222Z"
    },
    {
      "original": "Russia and Ukraine Trade Strikes: Kyiv, Chernihiv, and Energy Grid Targeted\nOn the night of January 5, the Ukrainian Air Force reported a massive Russian attack involving 165 strike UAVs and 9 Iskander-M ballistic missiles , along with S-300 anti-aircraft missiles. According to their data, 137 drones were shot down or suppressed, but not a single missile was intercepted.\nThe main strike hit the Chernihiv region: up to eight Iskander missiles struck targets in Chernihiv, including six direct hits and two in the area of the 169th Land Forces Training Center in Desna. As a result, a local thermal power plant caught fire.\nDrones were active over Kyiv and adjacent areas. Monitoring channels recorded attempts to encircle the capital: targets in Fastiv, Vyshhorod, and Boryspil, including the Kyiv Hydroelectric Power Plant and the TEC-6 thermal power plant in Troieshchyna. Slavutych was completely de-energized after the arrival of Gerans — local resources confirmed the blackouts.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-05T20:26:47.186233Z"
    },
    {
      "original": "A STRATEGIC TRAP FOR UKRAINE: THE IMPEDING ENCIRCLEMENT OF OREKHOV AND THE WIDENING WAR",
      "timestamp": "2026-01-05T20:26:47.186238Z"
    }
  ],
  "script_run_time": "2026-01-05T20:26:47.186995Z"
}