{
  "messages": [
    {
      "original": "🛵\n БпЛА на Павлоград з півдня.",
      "timestamp": "2025-12-09T07:50:32.365406Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпро з північно-східного напрямку.",
      "timestamp": "2025-12-09T07:50:32.365425Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-12-09T07:50:32.365437Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-09T07:50:32.365442Z"
    },
    {
      "original": "🛵\n БпЛА в Чернігівському  районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-12-09T07:50:32.365447Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, повз Ніжин південно-західним курсом.",
      "timestamp": "2025-12-09T07:50:32.365453Z"
    },
    {
      "original": "🛸\n На Запоріжжі розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття",
      "timestamp": "2025-12-09T07:50:32.365457Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині,напрямок Харків зі сходу.",
      "timestamp": "2025-12-09T07:50:32.365464Z"
    },
    {
      "original": "🛵\n БпЛА в Богодухівському районі Харківської області, курс на південь.",
      "timestamp": "2025-12-09T07:50:32.365469Z"
    },
    {
      "original": "🛵\n БпЛА на межі Полтавської та Харківської областей,курс на південь.",
      "timestamp": "2025-12-09T07:50:32.365474Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-12-09T07:50:32.365480Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-09T07:50:32.365485Z"
    },
    {
      "original": "🛵\n БпЛА в Лозівському районі Харківщини, напрямок н.п.Лозова.",
      "timestamp": "2025-12-09T07:50:32.365490Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, вектор Ніжин.",
      "timestamp": "2025-12-09T07:50:32.365494Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину.",
      "timestamp": "2025-12-09T07:50:32.365499Z"
    },
    {
      "original": "Дніпропетровська обл. - швидкісна ціль!",
      "timestamp": "2025-12-09T07:50:32.365503Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Київщині, західніше Обухова",
      "timestamp": "2025-12-09T07:50:32.365507Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА в центрі Чернігівської обл.",
      "timestamp": "2025-12-09T07:50:32.365511Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 84 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 9 грудня (з 18.00 08 грудня) противник атакував 110-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Курськ, Приморсько-Ахтарськ, Міллєрово– рф., Донецьк, Гвардійське - ТОТ АР Криму, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 84 ворожі БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 24 ударних БпЛА на 9 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-09T07:50:32.365531Z"
    },
    {
      "original": "🚀\n Пуски КАБ на  Донеччину та Сумщину.",
      "timestamp": "2025-12-09T07:50:32.365536Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces intensified their assault operations, making substantial progress over the last few days.\nIn the southeast, Russian forces broke through Ukrainian defences east of Kamyanske, advancing northeast up both banks of the river. Other forces cleared the western houses of Stepove, and levelled the frontline northwest of the village. \nFrom there, a general push north was carried out, with Russian forces advancing downhill to the gulleys, and consolidating further northwest in coordination with the push up the northern bank of the river. Russian soldiers then infiltrated from their newly captured positions, advancing uphill towards the gulley west of Pavlivka, while others pushed northwest across another gulley into the former Mining and Processing Plant. Additionally, some Russian soldiers infiltrated from eastern Stepnohirsk towards the Solar field in coordination with the push to the Mining and Processing Plant, threatening to encircle the remaining Ukrainian strongpoints in the fields to the south. \nTo the northwest, Russian forces continued their assault operations in Stepnohirsk. They were able to capture Molodizhna and Radianska Streets and consolidate in the first high-rise buildings of the town centre. They also consolidated in the residential areas northeast and northwest of the central high-rise buildings and are clearing the remaining areas of Stepnohirsk still in the grey zone. \n+ ~18.75 km² in favour of Russia.",
      "timestamp": "2025-12-09T07:50:33.070118Z"
    },
    {
      "original": "In the Orikhiv direction, some time over the last few weeks Ukrainian forces carried out a series of successful counterattacks in Mala Tokmachka, recapturing most of the village.\nFollowing the earlier Russian advances and the arrival of Ukrainian reinforcements from Orikhiv, Ukrainian forces managed to regain the initiative and begin pushing back through the settlement. After heavy fighting, they were able to clear the forward Russian positions in the western streets, and due to a lack of Russian manpower in the village, reached the centre, entering the prison and local school. Fighting is still ongoing for the central part of the village. \n+ ~10.10 km² in favour of Ukraine.",
      "timestamp": "2025-12-09T07:50:33.070134Z"
    },
    {
      "original": "Lot’s of reports on Russian assault operations and advances coming out of the front southwest of Siversk. \nIf Russia can get exploit these movements to make tactical gains, they could place FPV drone operators far enough forward to begin turning Kramatorsk into a “dead city” (like Dobropillya) and make logistics and accumulation there far more difficult for Ukraine. \nRemember, there are currently no anti-drone nets within Kramatorsk.",
      "timestamp": "2025-12-09T07:50:33.070142Z"
    },
    {
      "original": "Lot’s of reports on Russian assault operations and advances coming out of the front southwest of Siversk.   If Russia can get exploit these movements to make tactical gains, they could place FPV drone operators far enough forward to begin turning Kramatorsk…",
      "timestamp": "2025-12-09T07:50:33.070146Z"
    },
    {
      "original": "Keep in mind, this front has remained largely stagnant since the fall of Bakhmut in May 2023.",
      "timestamp": "2025-12-09T07:50:33.070149Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Large-scale fighting on the Thai–Cambodian border enters Day 2, with Thailand reporting Cambodian BM-21 rocket fire in Sisaket and continued gunfire and blasts in Surin and Buriram.\n@wfwitness",
      "timestamp": "2025-12-09T07:50:33.070158Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇷🇺\n Israeli Prime Minister Benjamin Netanyahu:\n 'I speak with President Putin regularly, and this decades-old personal relationship serves our vital interests.'\n@Middle_East_Spectator",
      "timestamp": "2025-12-09T07:50:33.070167Z"
    },
    {
      "original": "Yesterday, Russian KAB glide-bombs struck the Motor Sich Plant in Zaporizhzhia City, targeting workshops 6, 46, & 50.\nThis is evidenced by footage published by the Zaporizhzhia OVA showing minor damage to residential buildings just across the street.\nCoordinates: 47.820903, 35.192593",
      "timestamp": "2025-12-09T07:50:33.070173Z"
    },
    {
      "original": "Yesterday, Russian KAB glide-bombs struck the Motor Sich Plant in Zaporizhzhia City, targeting workshops 6, 46, & 50.\nThis is evidenced by footage published by the Zaporizhzhia OVA showing minor damage to residential buildings just across the street.\nCoordinates: 47.820903, 35.192593",
      "timestamp": "2025-12-09T07:50:33.070178Z"
    },
    {
      "original": "The Ukrainian Airforce announced that yesterday afternoon, a Ukrainian Su-27 pilot from the 39th Tactical Aviation Brigade was killed in the eastern direction.\nIt seems that the aircraft shot down northwest of Malotaranivka, Donetsk Oblast, after a Russian Su-35 launched an R-37 air-to-air missile as it was covering Su-34s launching KAB glide-bombs at the Dobropillya area.",
      "timestamp": "2025-12-09T07:50:33.070183Z"
    },
    {
      "original": "In the Pokrovs'ke direction, both Russian and Ukrainian forces have advanced.\nFollowing the fall of Tykhe, Ukrainian forces crossed back over the Vovcha River and recaptured the village. They also pushed south down the adjacent gulley from the nearby forest, recapturing the agricultural complex.\nTo the southwest, under the cover of fog, Russian forces were able to re-infiltrate Danylivka and quickly re-establish control over the village, aligning the front with the Hulyaipole - Pokrovs'ke Highway. \n+ ~8.27 km² in favour of Russia.\n+ ~4.95 km² in favour of Ukraine.",
      "timestamp": "2025-12-09T07:50:33.070189Z"
    },
    {
      "original": "🔥\n November 30th, 2025 to December 8th, 2025\n@RNN_Alerts\n timelapse tracking 474 bombing, drone, clashes, settler attacks, and shootings alerts across the region.\nThis visualization shows every alert documented from November 30 to December 8, 2025, across Gaza, West Bank, Lebanon, Syria, and overall.",
      "timestamp": "2025-12-09T07:50:33.070196Z"
    },
    {
      "original": "In the Novopavlivka direction, over the last few weeks Ukrainian forces have been carrying out a series of counterattacks aimed at recapturing Novopavlivka.\nAfter the earlier Russian breakthrough into the town and a large-scale FPV drone striking campaign on Russian positions, Ukrainian forces were able to contain the Russian advances and begin pushing back. They re-entered the northwestern streets, and in coordination with attacks from the northeast and southwest, pushed the Russians back beyond the Solena River. From there, the Ukrainians consolidated in the northern streets and began a general push back to the town centre, reaching and establishing control over it. \nAdditionally, despite earlier withdrawals, the Ukrainians were able to dig in east of Novopavlivka and begin pushing back towards its rear, advancing along several treelines and recapturing positions along the western face of the tactical heights. They are now trying to infiltrate even further south, entrenching south of Novopavlivka and reaching the gulley east of Filiya where they are attempting to clear the strongpoints there. \nAs a result of these attacks, and attempts to cross the Solena River from the west, the remaining Russian formations in Novopavlivka are operationally encircled and have no ground supply lines leading to their positions. \nMeanwhile, to the southwest, Russian forces resumed their assault operations northwest of Filiya and established control over the rest of the fortified forest there, pushing the Ukrainians back to the treelines further north.\n+ ~23.60 km² in favour of Ukraine.\n+ ~0.83 km² in favour of Russia.",
      "timestamp": "2025-12-09T07:50:33.070205Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance near Pokrovsk and in Myrnohrad, capturing new important positions in several different areas.\nIn the west, Russian forces continued advancing through Hryshyne where they captured new positions in the southeastern part of the village on both banks of the Hrishynka River.\nTo the east, Russian forces cleared the grey zone north of Pokrovsk, establishing control over the treelines there and widening the corridor separating the Myrnohrad pocket with the rest of the front. Infiltration attempts to the second pig farm complex westwards along the road were also resumed.\nIn the northwestern part of the Myrnohrad pocket, Russian forces managed to consolidate in the last part of Rivne in the northeast of the village, and building on their success, entered the neighbouring village of Svitle. They were able to quickly establish control over the western and central part of the settlement, pushing the Ukrainians back towards the northwestern edge of Myrnohrad.\nIn the southern part of the pocket, Russian forces continued incrementally advancing north towards Myrnohrad city centre, reaching Stusa Street and beginning infiltrations further towards the high-rise buildings of the 40th District. They also captured the remaining apartment buildings of the Zapadny District, including the local kindergarten.\nIn the north, Russian forces continued to slowly advance through Rodynske, and after heavy fighting managed to break through the Ukrainian defence in the three-story buildings near Myru Street, aligning the front with Shakhtarskoi Slavy Street. Heavy fighting continues for the remaining Ukrainian positions in the buildings between School No. 35 and Shakhtarskoi Slavy Street.\n+ ~7.30 km² in favour of Russia.",
      "timestamp": "2025-12-09T07:50:33.070213Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued their intensified assault operations and have made important progress in several different areas.\nIn the southwest, Russian forces recaptured the last parts of Nykanorivka and secured the nearby forests and treelines, levelling the frontline east of the railway line.\nTo the north, the Russians completed the capture of Dorozhnje and have begun advancing northwest up the railway line towards Novyi Donbas. Other forces infiltrated the village of Ivanivka, which is now in the grey zone.\nTo the northeast, Russian forces levelled the frontline along the Nove Shakhove - Shakhove Road, recapturing the remaining positions in the forest plantations there. Other forces captured the groves northeast of Nove Shakhove and began infiltrating further west past the village in the direction of Novyi Donbas.\nTo the east, the Russians captured the forest plantations on the northern bank of two reservoirs west of Shakhove and recaptured the positions north of Shakhove following the earlier Ukrainian counterattacks.\nIn the northeast, Russian forces continued advancing in and around Sofiivka and have consolidated in the agricultural buildings on the eastern outskirts of the village. They also crossed the Kazenyi Torets River, infiltrating the forest plantations on its western bank. The rest of Sofiivka is now in the grey zone. \n+ ~12.17 km² in favour of Russia.",
      "timestamp": "2025-12-09T07:50:33.070222Z"
    },
    {
      "original": "Thai F-16 fighters have launched airstrikes on the town of Samraong, northern Cambodia (around 17 km from the border).",
      "timestamp": "2025-12-09T07:50:33.070225Z"
    },
    {
      "original": "Footage showing the third Russian strike on the Pechenihy Dam in Kharkiv Oblast. This one was carried out with a Tornado-S rocket. \nThe road over the Pechenihy Dam is one of the main logistical routes for Ukrainian forces for the Vovchansk - Kupyansk sector of the frontline.\nCoordinates: 49.88225, 36.98039",
      "timestamp": "2025-12-09T07:50:33.070230Z"
    },
    {
      "original": "Coup Attempt Shakes France’s Grip On Benin\nA coup d’état was foiled in Benin on December 7, with signs of indirect intervention by France. The poor planning of the coup attempt suggests that it may have been a trap for dissatisfied officers. Still, the attempt highlighted the growing instability in the former French colony.\nThe coup attempt began in the early hours of December 7, with troops from the country’s National Guard attacking the residence of President Patrice Talon in the port city of Cotonou. The troops quickly seized the national broadcaster, and the home of Major General Abou Issa, the army chief of staff.\nEight of the troops declared on state television that Talon had been “removed from office as president of the republic”. They also announced the suspension of the constitution and state institutions, and identified themselves as the Military Committee for Refoundation [French: Comité Militaire pour la Refondation] (CMR) headed by Lieutenant Colonel Pascal Tigri.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703615Z"
    },
    {
      "original": "Coup Attempt Shakes France’s Grip On Benin\nA coup d’état was foiled in Benin on December 7, with signs of indirect intervention by France. The poor planning of the coup attempt suggests that it may have been a trap for dissatisfied officers. Still, the attempt highlighted the growing instability in the former French colony.\nThe coup attempt began in the early hours of December 7, with troops from the country’s National Guard attacking the residence of President Patrice Talon in the port city of Cotonou. The troops quickly seized the national broadcaster, and the home of Major General Abou Issa, the army chief of staff.\nEight of the troops declared on state television that Talon had been “removed from office as president of the republic”. They also announced the suspension of the constitution and state institutions, and identified themselves as the Military Committee for Refoundation [French: Comité Militaire pour la Refondation] (CMR) headed by Lieutenant Colonel Pascal Tigri.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703635Z"
    },
    {
      "original": "Military Situation In Yemen On December 8, 2025 (Map Update)",
      "timestamp": "2025-12-09T07:50:33.703639Z"
    },
    {
      "original": "Emboldened By Turkey, Damascus Is Gearing Up For Battle With Kurdish Forces\nThe deadline for the implementation of the integration agreement signed by the Islamist-led Syrian Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) in March is nearing the end of the year. No progress has been made yet, and both sides appear to be inching closer to a heated battle.\nDespite reports of advance in talks on implementing the agreement, which is meant to integrate the SDF into the government’s civilian and military institutions, Al-Monitor revealed late in November that the process, mediated by the United States, has reached a halt.\nAldar Khalil, a senior official in the political wing of the SDF, revealed to the news outlet that there has been no communication from the government since October, accusing them of creating an “illusion of process” ahead of President Ahmed al-Sharaa’s Washington visit earlier that month.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703666Z"
    },
    {
      "original": "Emboldened By Turkey, Damascus Is Gearing Up For Battle With Kurdish Forces\nThe deadline for the implementation of the integration agreement signed by the Islamist-led Syrian Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) in March is nearing the end of the year. No progress has been made yet, and both sides appear to be inching closer to a heated battle.\nDespite reports of advance in talks on implementing the agreement, which is meant to integrate the SDF into the government’s civilian and military institutions, Al-Monitor revealed late in November that the process, mediated by the United States, has reached a halt.\nAldar Khalil, a senior official in the political wing of the SDF, revealed to the news outlet that there has been no communication from the government since October, accusing them of creating an “illusion of process” ahead of President Ahmed al-Sharaa’s Washington visit earlier that month.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703680Z"
    },
    {
      "original": "'Unprovoked Invasion': How The West Won The Narrative War\nIn 2013, Ukraine found itself at a crossroads. The former Soviet Republic was in dire financial straits, and had been offered the opportunity to sign an association agreement with the European Union. This would have fostered political and economic ties between Kiev and Brussels, and been an incremental step towards Ukraine becoming a full-member of the bloc.\nUkraine’s Baltic neighbours Lithuania, Latvia, and Estonia had all become EU members in 2004, and had also joined NATO in the same year. Ukraine becoming an EU member would have resulted in a political, and potentially military, encirclement of Russia along its western border.\nAs well as the security risks posed by the association agreement, the ethnic makeup of Ukraine was also a factor. The east of the country was composed primarily of ethnic Russians. This included the Crimean Peninsula which was originally Russian territory, but ceded to Ukraine during the Soviet-era. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703691Z"
    },
    {
      "original": "'Unprovoked Invasion': How The West Won The Narrative War\nIn 2013, Ukraine found itself at a crossroads. The former Soviet Republic was in dire financial straits, and had been offered the opportunity to sign an association agreement with the European Union. This would have fostered political and economic ties between Kiev and Brussels, and been an incremental step towards Ukraine becoming a full-member of the bloc.\nUkraine’s Baltic neighbours Lithuania, Latvia, and Estonia had all become EU members in 2004, and had also joined NATO in the same year. Ukraine becoming an EU member would have resulted in a political, and potentially military, encirclement of Russia along its western border.\nAs well as the security risks posed by the association agreement, the ethnic makeup of Ukraine was also a factor. The east of the country was composed primarily of ethnic Russians. This included the Crimean Peninsula which was originally Russian territory, but ceded to Ukraine during the Soviet-era. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703701Z"
    },
    {
      "original": "Military Situation In Ukraine On December 8, 2025 (Maps Update)",
      "timestamp": "2025-12-09T07:50:33.703705Z"
    },
    {
      "original": "Military Situation In Ukraine On December 8, 2025 (Maps Update)",
      "timestamp": "2025-12-09T07:50:33.703709Z"
    },
    {
      "original": "The U.S. National Security Strategy: Signaling a Strategic Rift with Europe\nThe White House has officially approved its approach to the Ukrainian conflict. It presents a new vision of the current situation in Europe. The previously monolithic unity of the West is beginning to crack.\nIn November 2025, the U.S. government published a new National Security Strategy. This document significantly impacted the country's foreign policy. It outlines the primary issues in the realm of US national security and the planned solutions.\nThe strategy indicates the direction in which Americans will focus their political, economic, and military efforts in the coming years. The first edition of the strategy was released in 1987 during the Reagan administration. Since then, each administration has published at least one version of the strategy. The country's priorities have changed in line with the strategy.\n👉\n Read more \nHERE\n________________________\nU.S. National Security Strategy (November 2025) [PDF]",
      "timestamp": "2025-12-09T07:50:33.703722Z"
    },
    {
      "original": "THE COLLAPSE OF SEVERSK DEFENSE: UKRAINE'S SHRINKING RESERVES TAKE THEIR TOLL",
      "timestamp": "2025-12-09T07:50:33.703725Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703733Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-09T07:50:33.703741Z"
    }
  ],
  "script_run_time": "2025-12-09T07:50:33.704626Z"
}