{
  "messages": [
    {
      "original": "Ворожий БпЛА у напрямку Миргорода з півночі.",
      "timestamp": "2025-12-28T10:53:32.430365Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Миргорода зі сходу.",
      "timestamp": "2025-12-28T10:53:32.430382Z"
    },
    {
      "original": "🛵\n БпЛА на Миргород з північного сходу.",
      "timestamp": "2025-12-28T10:53:32.430388Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півдня.",
      "timestamp": "2025-12-28T10:53:32.430393Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-12-28T10:53:32.430401Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2025-12-28T10:53:32.430408Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 30 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 28 грудня (з 18.00 27 грудня) противник атакував 48-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Курськ, Приморсько-Ахтарськ – рф., Гвардійське, Чауда - ТОТ АР Криму, близько 30 із них – \"шахеди\".\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 30 ворожих БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 18 БпЛА на 9 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-28T10:53:32.430431Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Одеси з акваторії Чорного моря.",
      "timestamp": "2025-12-28T10:53:32.430443Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-28T10:53:32.430449Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-28T10:53:32.430456Z"
    },
    {
      "original": "🛵\n БпЛА на Одещину (Білгород-Дністровський район) з акваторії Чорного моря.",
      "timestamp": "2025-12-28T10:53:32.430461Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-12-28T10:53:32.430467Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-28T10:53:32.430472Z"
    },
    {
      "original": "🛵\n🛸\nВорожий БпЛА на Сумщині в напрямку на/повз н.п.Миколаївка/Степанівка на південь.",
      "timestamp": "2025-12-28T10:53:32.430477Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на сході Дніпропетровщини в напрямку на/повз н.п.Петропавлівка з південного сходу.",
      "timestamp": "2025-12-28T10:53:32.430482Z"
    },
    {
      "original": "🛵\n🛸\nВорожий БпЛА на Сумщині в напрямку на/повз н.п.Миколаївка/Степанівка на південь.",
      "timestamp": "2025-12-28T10:53:32.430488Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА курсом на н.п.Лебедин з півночі.",
      "timestamp": "2025-12-28T10:53:32.430493Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА курсом на н.п.Лебедин з півночі.",
      "timestamp": "2025-12-28T10:53:32.430498Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА з Сумщини курсом на Полтавщину (вектор - н.п.Гадяч).",
      "timestamp": "2025-12-28T10:53:32.430503Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-28T10:53:32.430508Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Одещину в напрямку н.п.Чорноморське/Південне.",
      "timestamp": "2025-12-28T10:53:32.430514Z"
    },
    {
      "original": "🛸\n🛸\nАктивність ворожих розвідувальних БпЛА на сході Харківщини.",
      "timestamp": "2025-12-28T10:53:32.430519Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance as the last Ukrainian defences in Hulyaipole collapse.\nRussian forces continued pushing west from the area of the administrative building and captured the rest of the city centre. This forced the remaining Ukrainian formations to withdraw from the rest of their strongholds in the high-rise buildings, which in turn allowed for the Russians to collapse their lines and capture large parts of the remaining low-rise residential areas.\nSince then, Russian forces have begun attacking the industrial zone on the western edge of Hulyaipole, and have captured most of the rest of the residential streets.\nThis collapse, like all the previous advances, has been caused primarily due to a complete breakdown in coordination between Ukrainian units, and terrible command decisions which has so far led to at least 20 soldiers being encircled (although this number is likely higher). Superior Russian manpower and firepower has resulted in Ukrainian forces suffering heavy casualties while attempting their chaotic withdrawal. \n+ ~2.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T10:53:33.182715Z"
    },
    {
      "original": "Over the past couple weeks, several channel owners have reached out to me asking for cross-promotions and advertising. \nI just want to put this out there now: I don't plan on ever cross-promoting or advertising for anyone, or get this channel advertised anywhere. Telegram already puts ads on channels, which is already more than enough. If anything, extra ads just make the viewing experience more disrupted and inconvenient. I also can't guarantee the reliability and ethics of most channels without actually knowing them and following them for some time, so I wouldn't want to promote someone who doesn't provide ethical and fair news. \nSo, if you're a channel owner looking to promote, please don't ask me. I'm more than happy to forward interesting posts from channels, but I don't want to get involved in the advertising space.",
      "timestamp": "2025-12-28T10:53:33.182730Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-28T10:53:33.182734Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-28T10:53:33.182737Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-28T10:53:33.182741Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-28T10:53:33.182744Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-28T10:53:33.182748Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-28T10:53:33.182755Z"
    },
    {
      "original": "Speed seemed similar to that of an S-400 air defence missile, but it was detected late.\nIt disappeared in western Poltava Oblast.",
      "timestamp": "2025-12-28T10:53:33.182760Z"
    },
    {
      "original": "Both Ukrainska Pravda and Deepstate report that the commander of the Ukrainian 54th Mechanised Brigade has been removed from his position due to the fall of Siversk and false reports made from his area.\nAdditionally, the commander of the 10th Separate Mountain Assault Brigade is expected to be removed from his position once he returns from ongoing medical treatment.",
      "timestamp": "2025-12-28T10:53:33.182764Z"
    },
    {
      "original": "Consequences of the Russian missile strikes on the Kyiv Hydroelectric Power Plant this morning. \n~3 Kh-101 cruise missiles impacted it.",
      "timestamp": "2025-12-28T10:53:33.182768Z"
    },
    {
      "original": "Powerline air defence in Kyiv",
      "timestamp": "2025-12-28T10:53:33.182771Z"
    },
    {
      "original": "Russian strategic aviation is on the move following yesterday's combined missile and drone attack on Ukraine:\n- 2 Tu-160 strategic bombers redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast. They will be equipped with Kh-101 cruise missiles in the far east.\n- 2 Tu-95MS strategic bombers redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, with the help of an IL-78M tanker for refueling. They have already been equipped with Kh-101 cruise missiles at Engels-2 Airbase.\n- 1 Tu-95MS strategic bomber redeployed from Engels-2 Airbase to Olenya Airbase. It has also likely already been equipped with missiles at Engels-2. \n- 1 Tu-22m3 strategic bomber redeployed from Engels-2 Airbase to Shaykovka Airbase, Kaluga Oblast. It's unclear if this is one of the bombers which carried out a combat sortie yesterday.\n- 1 IL-76MD cargo plane landed at Engels-2 Airbase to deliver Kh-101 cruise missiles to the 2 Tu-95MS redeploying to Ukrainka Airbase.\n- 2 IL-76MD cargo planes landed at Rostov-on-Don North airbase over the last 2 days. The cargo likely consists of Iskander-M ballistic missiles for OTRK installations near Taganrog, Rostov Oblast.",
      "timestamp": "2025-12-28T10:53:33.182779Z"
    },
    {
      "original": "Russian forces have captured the city of Myrnohrad, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~49,600.\nTotal land area: ~23.50 km².\nThe fighting for Myrnohrad lasted approximately 2 months, 7 days.",
      "timestamp": "2025-12-28T10:53:33.182785Z"
    },
    {
      "original": "Overnight, Odesa Oblast once again came under attack from Russian Geran-2 drones.\nFour drones attacked Odesa City. One drone impacted the roof of a two-story residential building, and another impacted an unknown target nearby. The other two were shot down.  \nAdditionally, approximately 6 drones attacked the city of Vylkove on the border with Romania. \nBoth videos are from Odesa City.",
      "timestamp": "2025-12-28T10:53:33.182791Z"
    },
    {
      "original": "Overnight, Odesa Oblast once again came under attack from Russian Geran-2 drones.\nFour drones attacked Odesa City. One drone impacted the roof of a two-story residential building, and another impacted an unknown target nearby. The other two were shot down.  \nAdditionally, approximately 6 drones attacked the city of Vylkove on the border with Romania. \nBoth videos are from Odesa City.",
      "timestamp": "2025-12-28T10:53:33.182797Z"
    },
    {
      "original": "Last night, around 20 Ukrainian UAVs attacked the city of Syzran, Samara Oblast. \nAt least 3 Impacts were recorded to the Syzran Oil Refinery and an electrical substation. Power outages are reported in parts of the city.\nSyzran is around 810 km away from the nearest Ukrainian-controlled territory.",
      "timestamp": "2025-12-28T10:53:33.182804Z"
    },
    {
      "original": "Last night, around 20 Ukrainian UAVs attacked the city of Syzran, Samara Oblast. \nAt least 3 Impacts were recorded to the Syzran Oil Refinery and an electrical substation. Power outages are reported in parts of the city.\nSyzran is around 810 km away from the nearest Ukrainian-controlled territory.",
      "timestamp": "2025-12-28T10:53:33.182809Z"
    },
    {
      "original": "Russian forces have captured the city of Hulyaipole, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~14,600.\nTotal land area: ~25.10 km².\nThe fighting for Hulyaipole lasted approximately 32 days.",
      "timestamp": "2025-12-28T10:53:33.182814Z"
    },
    {
      "original": "Russian forces have captured the city of Hulyaipole, Hulyaipole direction, Zaporizhzhia Oblast.  Pre-war population: ~14,600. Total land area: ~25.10 km².  The fighting for Hulyaipole lasted approximately 32 days.",
      "timestamp": "2025-12-28T10:53:33.182818Z"
    },
    {
      "original": "Hulyaipole direction \n➡️\n Omelnyk direction",
      "timestamp": "2025-12-28T10:53:33.182823Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations and have made significant progress over the last week.\nIn the west, Russian forces resumed their assault operations south of Kostyantynivka, recapturing positions in the gulleys east of the road to Khotin. Attacks are now underway towards the northern outskirts of Kindrativka. \nTo the southeast, Russian forces continued to advance in Andriivka, where they consolidated in the northern part of the village. Fighting is ongoing for its southwestern houses. \nTo the east, Russian forces managed to consolidate in the last parts of Varachyne and continued advancing southeast through the treelines from Oleksiivka. They also secured new positions in the fortified forests southwest of Yablunivka and improved their positions in the treelines south of Varachyne. Ukrainian forces carried out unsuccessful counterattacks in the direction of Varachyne. \nTo the southeast, Russian forces managed to break through Ukrainian defences in the vicinity of the highway west of Yunakivka, capturing new positions in the direction of Khrapivshchyna. Additionally, following earlier attacks, Russian forces managed to consolidate in a number of positions in the two treelines southwest of Yunakivka. Fighting is ongoing for areas further southwest.\nIn the east, Russian forces restarted their assault operations in the direction of Sadky. They managed to re-enter a forest west of the international border, capturing part of it, and consolidated in additional forested positions along the international border. \n+ ~20.59 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T10:53:33.182832Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued to advance and have captured new positions in two different areas.\nIn the west, Russian forces restarted their assault operations in the village of Starytsya. They advanced west from their positions in the eastern part of the village and recaptured positions in the area of the agricultural buildings.\nIn the east, Russian forces continued incrementally advancing through Vovchanski-Khutory, bypassing the centre of the village from the south and capturing new positions in the residential streets there.\n+ ~1.06 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T10:53:33.182839Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to advance, making new progress in the direction of Kolodyazne.\nBuilding on their earlier success, Russian forces continued to shrink the Ukrainian salient south of Dvorichanske. They captured the rest of the forest west of Kamyanka and entrenched along the Bolohivka - Krasne Pershe Road. \nOther assault groups attacked from the north, capturing new treeline positions and establishing control over part of a nearby forest. \n+ ~3.47 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T10:53:33.182846Z"
    },
    {
      "original": "Military Situation In Ukraine On December 27, 2025 (Maps Update)",
      "timestamp": "2025-12-28T10:53:33.985428Z"
    },
    {
      "original": "Military Situation In Ukraine On December 27, 2025 (Maps Update)",
      "timestamp": "2025-12-28T10:53:33.985441Z"
    },
    {
      "original": "Russia Captures Huliaipole And Myrnohrad, Dealing Double Blow To Ukraine (Videos)\nOn December 27, Russian President Vladimir Putin was informed during a high-level meeting that the Russian military had captured Myrnohrad in Donetsk and Huliaipole in Zaporozhye. The loss of these two key cities before the end of the year represents a double blow to Ukraine.\n“The Supreme Commander-in-Chief received a report by Chief of the General Staff of Russia's Armed Forces Valery Gerasimov,” the Russian Ministry of Defense said in a statement.\n“In addition, the commanders of the Tsentr [Centre] and Vosotok [East] forces, as well as unit commanders reported on the progress of their missions, announcing in particular the liberation of the towns of Dimitrov, Donetsk People's Republic and Gulyaipole, Zaporozhye Region,” it added, referring to the two cities by their Russian names.\nThe capture of both Myrnohrad and Huliaipole was confirmed via videos released by the Russian MoD and other media sources.\nRead more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985452Z"
    },
    {
      "original": "Russia Captures Huliaipole And Myrnohrad, Dealing Double Blow To Ukraine (Videos)\nOn December 27, Russian President Vladimir Putin was informed during a high-level meeting that the Russian military had captured Myrnohrad in Donetsk and Huliaipole in Zaporozhye. The loss of these two key cities before the end of the year represents a double blow to Ukraine.\n“The Supreme Commander-in-Chief received a report by Chief of the General Staff of Russia's Armed Forces Valery Gerasimov,” the Russian Ministry of Defense said in a statement.\n“In addition, the commanders of the Tsentr [Centre] and Vosotok [East] forces, as well as unit commanders reported on the progress of their missions, announcing in particular the liberation of the towns of Dimitrov, Donetsk People's Republic and Gulyaipole, Zaporozhye Region,” it added, referring to the two cities by their Russian names.\nThe capture of both Myrnohrad and Huliaipole was confirmed via videos released by the Russian MoD and other media sources.\nRead more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985462Z"
    },
    {
      "original": "Kyiv Plunged Into Darkness: Russia Launches New Massive Strike On Ukrainian Capital's Energy Infrastructure\nOn the night of December 27, the Russian armed forces launched a new large-scale combined strike on targets in Ukraine. This occurred just four days after the previous massive attack. According to the Ukrainian Air Force, the attack involved up to 550 units, including cruise missiles, ballistic missiles, and unmanned aerial vehicles.\nThe primary target of the strike was Kyiv and its energy system. It is reported that the Russian strikes targeted:\n▪️\nDarnytska Power Substation (CHPP-4).\n▪️\nKyivska (CHPP-5) and CHPP-6 thermal power plants.\n▪️\nKyiv Hydroelectric Pumped Storage Power Plant in Vyshhorod.\n▪️\nBrovarska Power Substation in the city of Brovary.\n▪️\nTrypilska Thermal Power Plant in the town of Tripillya, the most powerful power station in the region.\n▪️\nKyiv Hydroelectric Power Station, located north of the capital.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985480Z"
    },
    {
      "original": "Kyiv Plunged Into Darkness: Russia Launches New Massive Strike On Ukrainian Capital's Energy Infrastructure\nOn the night of December 27, the Russian armed forces launched a new large-scale combined strike on targets in Ukraine. This occurred just four days after the previous massive attack. According to the Ukrainian Air Force, the attack involved up to 550 units, including cruise missiles, ballistic missiles, and unmanned aerial vehicles.\nThe primary target of the strike was Kyiv and its energy system. It is reported that the Russian strikes targeted:\n▪️\nDarnytska Power Substation (CHPP-4).\n▪️\nKyivska (CHPP-5) and CHPP-6 thermal power plants.\n▪️\nKyiv Hydroelectric Pumped Storage Power Plant in Vyshhorod.\n▪️\nBrovarska Power Substation in the city of Brovary.\n▪️\nTrypilska Thermal Power Plant in the town of Tripillya, the most powerful power station in the region.\n▪️\nKyiv Hydroelectric Power Station, located north of the capital.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985496Z"
    },
    {
      "original": "Kupyansk In Focus: Fierce Street Fighting As Russia And Ukraine Battle For Control Over The City \nIn the Kupyansk sector, intense fighting continues. Russian units have repelled several attacks on the approaches to the city. The situation remains very difficult, however, as the Ukrainian command is using most of its resources and reserves to drive out Russian troops. After losing several key cities over the past couple of months, the Ukrainian government needs at least one victory to justify the money invested by the European Union in Ukraine. \nMeanwhile, Florian Philippot, the leader of the \"Patriots\" party, directly accused retired General Jean-Paul Paloméros, former military advisor to President Macron, of inciting war with Russia.\nRead more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985504Z"
    },
    {
      "original": "Kupyansk In Focus: Fierce Street Fighting As Russia And Ukraine Battle For Control Over The City \nIn the Kupyansk sector, intense fighting continues. Russian units have repelled several attacks on the approaches to the city. The situation remains very difficult, however, as the Ukrainian command is using most of its resources and reserves to drive out Russian troops. After losing several key cities over the past couple of months, the Ukrainian government needs at least one victory to justify the money invested by the European Union in Ukraine. \nMeanwhile, Florian Philippot, the leader of the \"Patriots\" party, directly accused retired General Jean-Paul Paloméros, former military advisor to President Macron, of inciting war with Russia.\nRead more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985512Z"
    },
    {
      "original": "Tornado-S Strike: Summary Of Russian Combat Footage From December 27, 2025\nOn December 27, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-28T10:53:33.985519Z"
    },
    {
      "original": "Tornado-S Strike: Summary Of Russian Combat Footage From December 27, 2025\nOn December 27, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-28T10:53:33.985526Z"
    },
    {
      "original": "Ukraine Intelligence Chief Admits: Russia Is Exceeding Military Production Plans On Its Own \nKyrylo Budanov, head of Ukraine’s Main Directorate of Intelligence, acknowledged on December 27 that the Russian military-industrial complex was fulfilling production plans.\nIn an interview with Suspilne, Budanov said that was a period when missile strikes were rare, but the Russian military-industrial complex then reached its peak capabilities and has since maintained them.\nRussian production plans are fulfilled and often exceeded, the intelligence chief added, noting that neither Iran nor North Korea were involved in the production of drones and missiles in Russia.\nThe remarks represent a stark departure from the narrative that has been adopted by Ukraine since the start of the special military operation, which was mainly centered around portraying the Russian military-industrial complex as being ineffective, and heavily reliant on foreigner assistance, especially from Iran and North Korea.\nRead more \nHERE",
      "timestamp": "2025-12-28T10:53:33.985536Z"
    }
  ],
  "script_run_time": "2025-12-28T10:53:33.986414Z"
}