{
  "messages": [
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 135 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 12 січня (з 18:00 11 січня) противник атакував 156 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Курськ, Орел, Брянськ, Приморсько-Ахтарськ – рф., Чауда – ТОТ АР Крим, близько 110 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено 135 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та центрі країни.\nЗафіксовано влучання 16 ударних БпЛА на 11 локаціях, а також падіння збитих (уламки) на двох локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-12T10:00:01.629189Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА \n➡️\n на сході від Білої Церкви, курс на північ.\n🛵\n Сумщина: БпЛА \n➡️\n в напрямку Сум з півночі.",
      "timestamp": "2026-01-12T10:00:01.629209Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину",
      "timestamp": "2026-01-12T10:00:01.629215Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n на півночі.",
      "timestamp": "2026-01-12T10:00:01.629221Z"
    },
    {
      "original": "🛵\n БпЛА на заході Чернігівщини, курс на Київщину.",
      "timestamp": "2026-01-12T10:00:01.629225Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Одещину.",
      "timestamp": "2026-01-12T10:00:01.629230Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Київщини на північ Житомирщини.",
      "timestamp": "2026-01-12T10:00:01.629234Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Одещину.",
      "timestamp": "2026-01-12T10:00:01.629238Z"
    },
    {
      "original": "Курсом на н.п.Овідіополь",
      "timestamp": "2026-01-12T10:00:01.629242Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-12T10:00:01.629247Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-12T10:00:01.629254Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2026-01-12T10:00:01.629259Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-12T10:00:01.629264Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-12T10:00:01.629268Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу.",
      "timestamp": "2026-01-12T10:00:01.629272Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2026-01-12T10:00:01.629277Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Запоріжжя, курс на захід та на схід.",
      "timestamp": "2026-01-12T10:00:01.629281Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Київщини, курс на північ Житомирщини.",
      "timestamp": "2026-01-12T10:00:01.629286Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-12T10:00:01.629290Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2026-01-12T10:00:01.629294Z"
    },
    {
      "original": "Повітряна тривога на Миколаївщині, через роботу ворожого БпЛА.",
      "timestamp": "2026-01-12T10:00:01.629297Z"
    },
    {
      "original": "Russia has used a Geran-5 jet-drone in combat for the first time.   The Geran-5 has a maximum flight speed of 400-600 km/h, a range of around 1,000 km, a maximum altitude of around 2,000 metres, and a warhead size of 90 kg (same as Geran-2).   According to…",
      "timestamp": "2026-01-12T10:00:02.274556Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T10:00:02.274566Z"
    },
    {
      "original": "It seems that the Geran-5 drone was shot down in western Dnipropetrovsk Oblast during its first combat flight. Photos of the debris have been released.",
      "timestamp": "2026-01-12T10:00:02.274570Z"
    },
    {
      "original": "Russian forces have captured the village of Zelene, Omelnyk direction, Zaporizhzhia Oblast.\nPre-war population: ~50.\nTotal land area: ~0.95 km².\nThe fighting for Zelene lasted <5 days.",
      "timestamp": "2026-01-12T10:00:02.274580Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Ridkodub, Borova direction, Donetsk Oblast.\nPre-war population: ~531.\nTotal land area: ~2.73 km².\nThe second battle for Ridkodub lasted approximately 200 days.",
      "timestamp": "2026-01-12T10:00:02.274587Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.\nPre-war population: ~4,294.\nTotal land area: ~5.10 km².\nThe fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T10:00:02.274593Z"
    },
    {
      "original": "Russian forces have captured the town of Stepnohirsk, Stepnohirsk direction, Zaporizhzhia Oblast.  Pre-war population: ~4,294. Total land area: ~5.10 km².  The fighting for Stepnohirsk lasted approximately 168 days.",
      "timestamp": "2026-01-12T10:00:02.274596Z"
    },
    {
      "original": "Stepnohirsk direction \n➡️\n Komyshuvakha direction",
      "timestamp": "2026-01-12T10:00:02.274601Z"
    },
    {
      "original": "Over the last few days, Russia has significantly intensified their artillery and MLRS shelling of frontline areas in western Zaporizhzhia Oblast.\nThis is being done in coordination with intensified assault operations, which have resulted in the town of Stepnohirsk being captured, and the large village of Prymorske being almost fully captured. \nAdditionally, Russian reconnaissance drones have been very active both in frontline settlements and in Zaporizhzhia City itself, scouting out targets and adjusting strikes.",
      "timestamp": "2026-01-12T10:00:02.274606Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing a number of FP-1 drone strikes carried out on Russian oil drilling platforms in the Caspian Sea.\nThe following was hit:\nLSP-1 platform by 2 drones. LSP-1 is situated on the Filanovsky oil field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged. \nLSP-R platform by 3 drones. LSP-R is situated on the Graifer Oil Field. As a result of the strikes, the power module was damaged, which reportedly forced the platform to temporarily shut down.\nLSP platform by 1 drone. LSP is situated o the Kochagin Oil Field. As a result of the strikes, the exhaust and ventilation for gas turbine units was damaged.\nLSP-1 coordinates: 45.002180,48.479140\nLSP-R coordinates: 45.0628000,48.6108000\nLSP coordinates: 44.914090,48.958680\nThe distance from the nearest Ukrainian-controlled territory is approximately 940 km.",
      "timestamp": "2026-01-12T10:00:02.274616Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T10:00:02.274622Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".\nThe drones attacked in 3 waves, flying at low altitude before all impacting the same target. As a result, a large fire broke out at the impact site and secondary detonations were reported.",
      "timestamp": "2026-01-12T10:00:02.274626Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T10:00:02.274633Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on Odesa Oblast. \nApproximately 18 drones were used. \n~11 drones targeted the \"Usatove\" 300 kV electrical substation on the northern outskirts of Odesa City (46.51217, 30.65795). Of these, 8 impacted and around 3 were shot down.\n~4 drones impacted an unknown target northwest of Odesa, closer to the border with Moldova.\n~3 drones targeted something north of Chornomorsk.\nPhotos and videos are both from the Usatove substation.",
      "timestamp": "2026-01-12T10:00:02.274640Z"
    },
    {
      "original": "Overnight, Russia carried out another Geran-2 drone attack on Kharkiv Oblast with at least 12 drones. \n- At least 6 Geran-2 drones attacked unknown targets near the town of Pechenihy and the city of Chuhuiv.\n- Multiple Gerans attacked an agricultural complex in the town of Zolochiv.\n- Multiple Gerans attacked the railway station in the village of Mayak (50.16481, 35.95208).\n- At least 2 Gerans attacked the town of Velykyi Burluk. A fire broke out and secondary detonations could be heard (as seen in the attached video).",
      "timestamp": "2026-01-12T10:00:02.274646Z"
    },
    {
      "original": "The Ukrainian GUR reports that Russia has added a new anti-air modification to their Geran-2 drones. \nThese Geran-2 drones can be equipped with a \"Verba\" anti-aircraft missile. All drones equipped with Verba missiles are directly controlled by drone operators in real time, using an optical camera in the nose of the drone. \nThis allows the drone operator to remotely launch the \"Verba\" missile in the event of a Ukrainian aircraft being detected. \nGeran-2 drones recently gained the ability to be equipped with R-60 anti-aircraft missiles, however the main difference with this new drone is that they still have their usual 90 kg warhead. This means that even after firing its missile, the drone can still carry out its primary task of striking a target. This action can also be controlled by the drone operator.",
      "timestamp": "2026-01-12T10:00:02.274651Z"
    },
    {
      "original": "This morning, a large scale attack was carried out by tribal fighters on the SMC (Druze) controlled town of Al-Majdal in southern Syria.\nThe attacks were launched from STG (government) controlled territory in the town of Al-Mazraa and supported by STG drone and artillery fire. After more than 9 hours of intense fighting, the attacks were ultimately repelled by the SMC, and the frontline remains unchanged.",
      "timestamp": "2026-01-12T10:00:02.274655Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the Novocherkasskaya Thermal Power Plant in Rostov Oblast. A fire broke out after the strike(s).\nCoordinates: 47.4001, 40.23248",
      "timestamp": "2026-01-12T10:00:02.274660Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the Novocherkasskaya Thermal Power Plant in Rostov Oblast. A fire broke out after the strike(s).\nCoordinates: 47.4001, 40.23248",
      "timestamp": "2026-01-12T10:00:02.274664Z"
    },
    {
      "original": "Last night, several Russian Geran-2 drones struck a target in the Solomyanskyi District of Kyiv. According to official reports, the target was a \"non-residential building\".  The drones attacked in 3 waves, flying at low altitude before all impacting the same…",
      "timestamp": "2026-01-12T10:00:02.274667Z"
    },
    {
      "original": "The target of the Geran-2 drone strikes on Kyiv today was the \"Veda\" enterprise.\nCoordinates: 50.450036, 30.445657\nCredit to \n@geran_gerbera\n for the geolocation.",
      "timestamp": "2026-01-12T10:00:02.274672Z"
    },
    {
      "original": "After the fall of Redkodub to Russia, Lyman direction seems to be an area of significant Ukrainian manpower shortage currently. Recently, Russian forces have taken Novoselovka, Dibrova, Redkodub, and advanced around Korovyy Yar, Syatogorsk, and Lyman city. Again, it seems the Russian goal is to anchor the front along the Severskyy Donets river before crossing it, coordinated with a frontal assault from Seversk to Slavyansk.",
      "timestamp": "2026-01-12T10:00:02.274676Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-12T10:00:02.879123Z"
    },
    {
      "original": "January FAB-3000 Strike: Summary Of Russian Combat Footage From January 10, 2026  \nOn January 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click HERE",
      "timestamp": "2026-01-12T10:00:02.879134Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879145Z"
    },
    {
      "original": "Russia Deploys New \"Geran-5\" Drone, Ukraine Strikes Voronezh \nOn the night of January 11, according to Ukrainian monitoring, Russian forces launched 154 UAVs, 125 of which were reportedly intercepted. Strikes on energy facilities, railway infrastructure, and airfields were reported. Over Russian territory, air defense systems downed 33 drones. A massive attack on Voronezh damaged civilian infrastructure and caused civilian casualties.\nUkraine's Main Intelligence Directorate (GUR) recorded the first combat use of the \"Geran-5\" kamikaze drone by Russia during a recent massive raid. This UAV is built according to a classic aerodynamic design with a fuselage length of about 6 meters and a wingspan of up to 5.5 meters. It carries a 90 kg warhead and can strike targets at a distance of up to 1000 km, making it suitable for attacks on remote objects.\nAccording to Ukrainian experts, the \"Geran-5\" is based on the Iranian Karrar prototype and is unified with other models of the \"Geran\" family. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879154Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879164Z"
    },
    {
      "original": "Aleppo Battle Highlights Growing Ethnic, Sectarian Violence In Syria \nThe Syrian government attack on Kurdish forces in the northern city of Aleppo has shown that even more than a year after the fall of the regime of former president Bashar al-Assad, ethnic and sectarian violence is still raging in Syria.\nSyrian state media was keen on presenting the attack as a “limited law enforcement operation” and promoting the discipline of government troops, who in March committed a series of massacres against the Alawite community on the coast, and later in July did the exact same against the Druze community in al-Suwayda.\nDespite these efforts, as the result of the battle became clear on January 10, evidence of gross human violations began to emerge online.\nThe battle against the SDF in Aleppo city didn't mark some transition from sectarian violence to ethnic violence against the Kurds, as the first form of violence persisted during the battle.\nRead more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879173Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879182Z"
    },
    {
      "original": "Ukraine Purges Recruiters Amid Army Mobilization Crisis\nFollowing Kyrylo Budanov's appointment as head of the Office of the President, Ukraine launched a so-called campaign to combat corruption and mass desertion in the army. These measures aim to address a fundamental problem—a severe shortage of manpower, particularly infantry, which threatens the Armed Forces of Ukraine's ability to hold the front line. Many view the initiated inspections as a politically motivated purge intended to quell internal chaos amid potential peace talks and upcoming elections.\nKyrylo Budanov held an expanded meeting with security sector leaders, the main topics of which were abuses in recruitment centers (TRCs) and unauthorized abandonment of units. By officially acknowledging that the country's defense capability is undermined not only by enemy strikes but also by internal problems, the authorities have for the first time publicly outlined the scale of the problem.\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879191Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879201Z"
    },
    {
      "original": "Breakthrough of Ukrainian Defenses West Of Pokrovsk: Russian Forces Rapidly Advance Toward Serhiivka\nUnits of the Russian \"Center\" grouping have broken through Ukrainian defenses west of Pokrovsk, reaching the outskirts of Serhiivka. The advance has cut off the Ukrainian garrison in Novopavlivka, with fierce fighting ongoing for control of key heights in the area. \nMeanwhile, Russian troops advanced in the Kharkiv region's Staritsa area and forests southwest of Liman, capturing positions and consolidating their hold on Volchanskie Khutora. \nHeavy fighting continues in the Kupiansk sector for Kondrashivka, Tyshchenkivka, and within Kupiansk city limits, while the front near Konstantynivka remains complex around Chasiv Yar and the Kleban-Byk Reservoir.\nIn the Sumy sector, Russian forces are advancing rapidly across the Sumy and Krasnopillia districts. The bridgehead on the left bank of the Haichur River in the Dobropillia sector is expanding successfully...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-12T10:00:02.879210Z"
    }
  ],
  "script_run_time": "2026-01-12T10:00:02.879667Z"
}