{
  "messages": [
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, в напрямку Кривого Рогу.",
      "timestamp": "2025-12-20T22:00:24.645957Z"
    },
    {
      "original": "🛵\n Безпілотник на Херсонщині, курс на обласний центр.",
      "timestamp": "2025-12-20T22:00:24.645974Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини.",
      "timestamp": "2025-12-20T22:00:24.645979Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини.\n🛵\n БпЛА з Херсонщини, курсом на  Чорне моря.",
      "timestamp": "2025-12-20T22:00:24.645985Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на н.п. Південне та Чорноморське на Одещині.",
      "timestamp": "2025-12-20T22:00:24.645990Z"
    },
    {
      "original": "🛵\n Нові БпЛА на півночі Сумщини, курс на південь.",
      "timestamp": "2025-12-20T22:00:24.645995Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північному та східному напрямках!",
      "timestamp": "2025-12-20T22:00:24.646001Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину та Харківщину зі сходу.",
      "timestamp": "2025-12-20T22:00:24.646005Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині, в напрямку Миколаївщини.\n🛵\n БпЛА на Чернігівщині, на схід від н.п. Ічня, курс на  Київщину.",
      "timestamp": "2025-12-20T22:00:24.646013Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п. Сергіївка та Одеса.",
      "timestamp": "2025-12-20T22:00:24.646018Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Миколаївщини на Кіровоградщину.",
      "timestamp": "2025-12-20T22:00:24.646024Z"
    },
    {
      "original": "⚠\n Увага!\nПовітряна тривога у районах Київщини через роботу ворожого БпЛА.",
      "timestamp": "2025-12-20T22:00:24.646030Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на півдні Кіровоградщини, курс на н.п. Бобринець.",
      "timestamp": "2025-12-20T22:00:24.646034Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини.",
      "timestamp": "2025-12-20T22:00:24.646038Z"
    },
    {
      "original": "🚨\nОновлення щодо \"шахедів\":\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на захід.\n🛵\n БпЛА на півночі Київщини \n➡️\n курс на Житомирщину.\n🛵\n Група БпЛА в акваторії Чорного моря \n➡️\n курсом на Одещину(Овідіополь, Чорноморськ, Південне).\n🛵\n БпЛА на півдні Кіровоградщини \n➡️\n курс на н.п. Рівне та Бобринець.",
      "timestamp": "2025-12-20T22:00:24.646054Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини \n➡️\n в напрямку Харкова.\n🛵\n БпЛА на заході Донеччини \n➡️\n курсом на Дніпропетровщину та Харківщину.",
      "timestamp": "2025-12-20T22:00:24.646062Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Донеччини на Запорізьку область.",
      "timestamp": "2025-12-20T22:00:24.646067Z"
    },
    {
      "original": "⚠\n Увага!\nЗагроза застосування ударних БпЛА на Одещині: Чорноморськ, Овідіополь, Маяки та Південне.",
      "timestamp": "2025-12-20T22:00:24.646072Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Запоріжжя зі сходу.\n🛵\n БпЛА на Одещині в повітряному просторі поблизу Доброолександрівки, Надлиманського та Йосипівки, деякі в напрямку н.п. Маяки.",
      "timestamp": "2025-12-20T22:00:24.646078Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Запоріжжя з півдня.\n🛵\n БпЛА на Одещині в напрямку н.п. Біляївка.",
      "timestamp": "2025-12-20T22:00:24.646084Z"
    },
    {
      "original": "Explosions in Dobroslav, Odesa Oblast",
      "timestamp": "2025-12-20T22:00:25.190254Z"
    },
    {
      "original": "So far today, 6 Iskander-M ballistic missiles have been used against Odesa Oblast. \n4 have targeted the Dobroslav area.\n2 have targeted the Mayaky Bridge.\nThis is in addition to numerous Geran-2 drone strikes.",
      "timestamp": "2025-12-20T22:00:25.190267Z"
    },
    {
      "original": "Trump is expected to issue his statement shortly.",
      "timestamp": "2025-12-20T22:00:25.190271Z"
    },
    {
      "original": "Trump has begun speaking now.",
      "timestamp": "2025-12-20T22:00:25.190275Z"
    },
    {
      "original": "Trump has begun speaking now.",
      "timestamp": "2025-12-20T22:00:25.190278Z"
    },
    {
      "original": "Nothing interesting. The speech is unrelated to Venezuela.",
      "timestamp": "2025-12-20T22:00:25.190281Z"
    },
    {
      "original": "🇺🇦\n \nDeep State on the dire situation of Gulyaypole:\nThe Ukrainian military resource Deep State reports on the risk of losing Gulyaypole due to management problems and internal sabotage in the 102nd Territorial Defense Brigade. According to DS, some officers are persuading fighters to abandon their positions without authorization, while the units are not aware of the current situation of their neighbors, which leads to disorientation and additional losses.",
      "timestamp": "2025-12-20T22:00:25.190288Z"
    },
    {
      "original": "🇺🇦\n Deep State on the dire situation of Gulyaypole:  The Ukrainian military resource Deep State reports on the risk of losing Gulyaypole due to management problems and internal sabotage in the 102nd Territorial Defense Brigade. According to DS, some officers…",
      "timestamp": "2025-12-20T22:00:25.190293Z"
    },
    {
      "original": "The 102nd brigade has mostly been withdrawn to the rear now due to heavy losses from the encirclements east of Hulyaipole, lack of coordination, constant Russian bombardment, and low-quality fortifications. \nThe issues in this unit have been known for some time, and the casualties they suffered prior to the Russian entry into Hulyaipole had meant they couldn't perform properly. This is the main reason why defences are collapsing there right now. The higher command is blame.",
      "timestamp": "2025-12-20T22:00:25.190298Z"
    },
    {
      "original": "Deepstate published satellite imagery showing the ruins of eastern Siversk. Around 300-400 civilians remained in the city for the nearly 4 years of fighting.",
      "timestamp": "2025-12-20T22:00:25.190301Z"
    },
    {
      "original": "4 have targeted the Dobroslav area.",
      "timestamp": "2025-12-20T22:00:25.190304Z"
    },
    {
      "original": "2 of the Iskanders which I previously thought targeted Dobroslav, Odesa Oblast, actually hit port infrastructure near Pivdenne.\nAt least 7 civilians were killed and 15 others injured.",
      "timestamp": "2025-12-20T22:00:25.190308Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-20T22:00:25.190313Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-20T22:00:25.190318Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-20T22:00:25.190323Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-20T22:00:25.190328Z"
    },
    {
      "original": "What will the mental gymnastics be this time?",
      "timestamp": "2025-12-20T22:00:25.190332Z"
    },
    {
      "original": "It seems that Russia’s next large-scale, combined missile attack on Ukraine has been delayed, as no significant strategic bomber movement has been recorded for the last two days.\nIn my opinion, this is due to the prioritisation of smaller, more targeted attacks on Odesa Oblast with Geran-2 drones, Grom-E1 rocket glide-bombs, and Iskander-M ballistic missiles. \nAdditionally, the preparation of a number of Tu-22m3 strategic bombers is underway. Two of them, each equipped with 2 Kh-32 cruise missiles, redeployed from Belaya Airbase, Irkutsk Oblast, to Engels-2 Airbase, Saratov Oblast. 2 other Tu-22m3 bombers stationed at Engels-2 Airbase are also equipped with 1 Kh-32 missile each. \nIt’s also likely that two Buyan-M corvettes were equipped with Kalibr cruise missiles at Kaspiysk Naval Base, Republic of Dagestan, in the Caspian Sea. They can launch a maximum of 16 Kalibrs. \nHowever, 2 days ago, 1 Tu-160 and 1 Tu-95MS strategic bomber redeployed from Engels-2 Airbase to Ukrainka Airbase, Amur Oblast. There, they will likely be equipped with Kh-101 cruise missiles.\nRemember, another 4 Tu-95MS are already equipped with missiles at Olenya Airbase, Murmansk Oblast, ready for use. \nAs for Iskanders, deliveries of Iskander-M ballistic missiles and possibly Iskander-K cruise missiles were carried out to OTRK installations in Voronezh and Rostov Oblast.\nMass accumulation of Geran-2 and Gerbera drones continues at all major launch sites surrounding Ukraine.",
      "timestamp": "2025-12-20T22:00:25.190341Z"
    },
    {
      "original": "Russian forces have launched a new incursion across the international border into Sumy Oblast, quickly capturing the villages of Hrabovske and Vysoke. Attacks are now underway, with the Russians attempting to penetrate deeper into the region.\nAs usual with these sorts of incursions, the goal is not to take large swaths of territory. The goal is to stretch Ukrainian forces even thinner, worsening the issues coming from their manpower shortages.\nIf Ukraine decides to redeploy units away from one direction to this new area in order to reinforce the lines, halt, and possibly even push back Russian forces, the area which they are redeployed from will be significantly weakened, making it easier for the Russians to make progress in.\nThis is all part of what I like to call Russia's \"Whack-a-mole\" tactic, which softens up the lines, and exploits the successful attrition being dealt to Ukraine right now. It puts Ukraine in a difficult spot, as if they choose not to redeploy here, the incursion zone could continue to expand and become even more difficult and costly to deal with later on. \nEssentially, they are trying to put out more fires than they can possibly deal with - and Russia keeps setting new ones. The main reason why they can't deal with all of the fires at once is because of manpower shortages, which are only continuing to get worse.\nExpect more maneuvers like this in different places from Russian forces in the future.",
      "timestamp": "2025-12-20T22:00:25.190348Z"
    },
    {
      "original": "Russian forces have captured the village of Hrabovske, Krasnopillya Direction, Sumy Oblast.\nPre-war population: ~724.\nTotal land area: ~3.12 km².\nThe fighting for Hrabovske lasted <1 day.",
      "timestamp": "2025-12-20T22:00:25.190353Z"
    },
    {
      "original": "Russian forces have captured the village Vysoke, Krasnopillya direction, Sumy Oblast.\nPre-war population: ~28.\nTotal land area: ~0.37 km²",
      "timestamp": "2025-12-20T22:00:25.190357Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the northeast, Russian forces continued advancing beyond Vovchansk, establishing a buffer-zone around the city where they captured positions in six different treelines to the southeast. They also continued advancing in Vovchanski-Khutory, where they established control over the rest of the eastern part of the village, including the industrial zone.\nIn the southwest, Russian forces continued their assault operations in Vilcha. They managed to reach the southeastern edge of the town and secured the rest of its western streets. Fighting is ongoing for the last Ukrainian positions in the southern streets.\n+ ~6.80 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-20T22:00:25.190364Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued their assault operations and are making incremental progress in two main areas.\nIn the northeast, Russian forces advanced south from the village of Dvorichanske to the nearby forest plantations, establishing control over them after heavy fighting, further shrinking the Ukrainian salient. Ukrainian forces are responding by heavily striking Russian temporary deployment points in Dvorichanske. The Russians also resumed attacks from the east, securing two forest plantations northwest of Kamyanka and pressuring the eastern part of the Ukrainian salient. \nIn the southwest, Russian forces have been carrying out assault operations towards Putnykove for the last few weeks. So far, despite the length of the battles, they have not achieved significant success, only securing a section of the highway and adjacent treeline positions. Additionally, more recently, attacks were carried out in the direction of the Dovhenke tract. As a result, they were able to capture two treelines and reach the eastern edge of the forested areas there.\n+ ~3.03 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-20T22:00:25.190371Z"
    },
    {
      "original": "In the Kupyansk direction, over the last week Ukrainian forces continued to advance and have cleared additional parts of western Kupyansk.\nIn the north, following the withdrawal of most Russian soldiers from northwestern Kupyansk, Ukrainian forces managed to cut off the salient by advancing south through the city centre, linking up with other assault groups who captured the City Central Hospital. From there, they managed to clear large parts of this newly formed pocket, including the rest of the enterprises in the northwest, as well as most of the rest of the low-rise residential streets. The \"Comb\" stronghold in the high-rise blocks remains in the grey-zone. \nIn the south, Ukrainian forces began advancing southeast from the area of the grain elevators, reaching the police station. They then infiltrated east to the administrative building, effectively cutting off Russian formations in the area of the central market from the rest of the operationally encircled units. The Ukrainians also captured the furniture factory and School no. 1 to the west, while other forces began a series of assaults in the low-rise residential areas which effectively cut off Russian formations in the southwestern part of the city too.\n+ ~1.13 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-20T22:00:25.190377Z"
    },
    {
      "original": "In the Rai-Oleksandrivka and Lyman directions, Russian forces continued to advance and have captured new positions in four different areas.\nIn the southeast, Russian forces continued their assault operations in Zakitne and have captured the remaining positions in its southeastern streets. They also entered its northeastern streets and are attempting to push further west towards the centre. \nTo the west, Russian forces continued their assault operations in Ozerne where they are incrementally advancing. They were able to secure new positions in the eastern streets of the village. Other forces cleared large parts of the forest to the northwest and made further progress through the northwestern houses, slowly beginning to squeeze the Ukrainians out of the northern part of Ozerne.\nIn the northwest, Russian forces continued attacking north of Dibrova, supporting assault operations within the village. They advanced further west and captured additional positions in the forests there.\n+ ~2.49 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-20T22:00:25.190385Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-20T22:00:25.730561Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-20T22:00:25.730572Z"
    },
    {
      "original": "Ukraine Is Close To Two Defeats In Myrnohrad And Huliaipole (Videos)\nOn December 20, the Russian military secured a settlement close to the city of Myrnohrad in Donetsk, squeezing the remaining Ukrainian pockets of resistance there, all while securing a new part of the city of Huliaipole in Zaporozhye.\nThe Tsentr [Center] Group of Forces captured Svetloye, which is located right to the northwest of Myrnohrad. The capture of the settlement caused more pressure on Ukrainian troops besieged in the northern part of the city.\nMeanwhile in Huliaipole, the Vostok [East] Group of Forces continue to expand its control in the city amid a collapse in Ukrainian defenses.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730582Z"
    },
    {
      "original": "Ukraine Is Close To Two Defeats In Myrnohrad And Huliaipole (Videos)\nOn December 20, the Russian military secured a settlement close to the city of Myrnohrad in Donetsk, squeezing the remaining Ukrainian pockets of resistance there, all while securing a new part of the city of Huliaipole in Zaporozhye.\nThe Tsentr [Center] Group of Forces captured Svetloye, which is located right to the northwest of Myrnohrad. The capture of the settlement caused more pressure on Ukrainian troops besieged in the northern part of the city.\nMeanwhile in Huliaipole, the Vostok [East] Group of Forces continue to expand its control in the city amid a collapse in Ukrainian defenses.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730590Z"
    },
    {
      "original": "Road Cut: Summary Of Russian Combat Footage From December 20, 2025\nOn December 20 several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730597Z"
    },
    {
      "original": "Road Cut: Summary Of Russian Combat Footage From December 20, 2025\nOn December 20 several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730604Z"
    },
    {
      "original": "Zaporizhzhia Sector: Russian Army Clears Stepnohirsk And Assaults Ukrainian Forces In Prymorske\nThe offensive in the Zaporizhzhia sector spans a front over 30 kilometers long. In the Pokrovsk Sector, Rodynske has been cleared, creating a threat of an advance towards Dobropillia. In the Sumy sector, Russian forces have broken through the defenses and seized control of Vysoke. \nMeanwhile, the European Union has agreed to provide a 90 billion euro loan secured by the bloc's common budget.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730611Z"
    },
    {
      "original": "Zaporizhzhia Sector: Russian Army Clears Stepnohirsk And Assaults Ukrainian Forces In Prymorske\nThe offensive in the Zaporizhzhia sector spans a front over 30 kilometers long. In the Pokrovsk Sector, Rodynske has been cleared, creating a threat of an advance towards Dobropillia. In the Sumy sector, Russian forces have broken through the defenses and seized control of Vysoke. \nMeanwhile, the European Union has agreed to provide a 90 billion euro loan secured by the bloc's common budget.\nRead more \nHERE",
      "timestamp": "2025-12-20T22:00:25.730618Z"
    }
  ],
  "script_run_time": "2025-12-20T22:00:25.731370Z"
}