{
  "messages": [
    {
      "original": "Дніпропетровська обл. - швидкісна ціль!",
      "timestamp": "2025-12-09T18:44:01.161787Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Київщині, західніше Обухова",
      "timestamp": "2025-12-09T18:44:01.161804Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА в центрі Чернігівської обл.",
      "timestamp": "2025-12-09T18:44:01.161810Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 84 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 9 грудня (з 18.00 08 грудня) противник атакував 110-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Курськ, Приморсько-Ахтарськ, Міллєрово– рф., Донецьк, Гвардійське - ТОТ АР Криму, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 84 ворожі БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 24 ударних БпЛА на 9 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-09T18:44:01.161830Z"
    },
    {
      "original": "🚀\n Пуски КАБ на  Донеччину та Сумщину.",
      "timestamp": "2025-12-09T18:44:01.161835Z"
    },
    {
      "original": "🚀\n Пуски КАБ \n➡️\n на Сумщину.",
      "timestamp": "2025-12-09T18:44:01.161841Z"
    },
    {
      "original": "🛸\n Поблизу узбережжя Одещини -  ворожий розвідувальний БпЛА.\nЗалучено засоби для збиття.",
      "timestamp": "2025-12-09T18:44:01.161846Z"
    },
    {
      "original": "🚀\n Пуски КАБ \n➡️\n на Запорізьку область.",
      "timestamp": "2025-12-09T18:44:01.161852Z"
    },
    {
      "original": "🛵\n БпЛА над н.п. Борозна на Чернігівщині, курс на н.п. Бахмач.",
      "timestamp": "2025-12-09T18:44:01.161856Z"
    },
    {
      "original": "🛵\n БпЛА над н.п. Борозна на Чернігівщині, курс на н.п. Бахмач.",
      "timestamp": "2025-12-09T18:44:01.161860Z"
    },
    {
      "original": "БпЛА продовжує рух \n➡️\n повз Ромни(Сумщина).",
      "timestamp": "2025-12-09T18:44:01.161865Z"
    },
    {
      "original": "🛵\n Донеччина: БпЛА \n➡️\n в районі Покровська.",
      "timestamp": "2025-12-09T18:44:01.161871Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі східного напрямку!",
      "timestamp": "2025-12-09T18:44:01.161875Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі східного напрямку!",
      "timestamp": "2025-12-09T18:44:01.161880Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-09T18:44:01.161884Z"
    },
    {
      "original": "🚀\n Пуски КАБ \n➡️\n на Сумщину.",
      "timestamp": "2025-12-09T18:44:01.161889Z"
    },
    {
      "original": "🚀\n Пуски КАБ \n➡️\n на Харківщину.",
      "timestamp": "2025-12-09T18:44:01.161895Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n в районі Краснопілля, курс на захід.",
      "timestamp": "2025-12-09T18:44:01.161900Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n в районі Краснопілля, курс на захід.",
      "timestamp": "2025-12-09T18:44:01.161906Z"
    },
    {
      "original": "🛵\n Сумщина: група БпЛА \n➡️\n у напрямку Лебедина.",
      "timestamp": "2025-12-09T18:44:01.161915Z"
    },
    {
      "original": "🛵\n Сумщина: група БпЛА \n➡️\n у напрямку Лебедина.",
      "timestamp": "2025-12-09T18:44:01.161921Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини.\n🛵\n Харківщина: БпЛА \n➡️\n в районі Краснокутська.",
      "timestamp": "2025-12-09T18:44:01.161931Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА із Сумщини \n➡️\n у напрямку Полтавщини. \n🛵\n Харківщина: БпЛА \n➡️\n в районі Краснокутська.",
      "timestamp": "2025-12-09T18:44:01.161939Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Охтирку.\n🛵\n Харківщина: БпЛА \n➡️\n у бік Берестина/ Слобожанського.",
      "timestamp": "2025-12-09T18:44:01.161947Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Охтирку. \n🛵\n Харківщина: БпЛА \n➡️\n у бік Берестина/ Слобожанського.",
      "timestamp": "2025-12-09T18:44:01.161955Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в районі Слобожанського, Балаклії, Шевченкового.",
      "timestamp": "2025-12-09T18:44:01.161961Z"
    },
    {
      "original": "Footage showing the third Russian strike on the Pechenihy Dam in Kharkiv Oblast. This one was carried out with a Tornado-S rocket. \nThe road over the Pechenihy Dam is one of the main logistical routes for Ukrainian forces for the Vovchansk - Kupyansk sector of the frontline.\nCoordinates: 49.88225, 36.98039",
      "timestamp": "2025-12-09T18:44:01.755705Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Footage of Cambodian forces firing BM-21 rockets toward the Surin-Oddar Meanchey border area.\n@wfwitness",
      "timestamp": "2025-12-09T18:44:01.755718Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault operations in and around Kostyantynivka and have made new progress in four different areas.\nIn the northeast, following the capture of the tram depot on the northern edge of the Santurinivka District, Russian forces broke into the forest to the northeast, capturing positions there and in the trench fortifications in the adjacent fields. After accumulating, they pushed further northeast up the highway and forests, capturing the remaining positions south of the Dovhenka Arroyo Gulley, while other forces captured the remaining field fortifications near Predtechyne and the cafe on the eastern edge of the forest.\nFrom there, Russian forces crossed the Dovhenka Arroyo Gulley and entered the northern part of the forests, infiltrating the Metallurg Dachas, the Khimik Dachas, the electrical substation, and the cemetary. DRGs moved even further north, entering the treelines northeast of Kostyantynivka. DRGs are also continuing to operate in the western forests and in the eastern streets of the Hora District.\nTo the southwest, Russian forces continued taking new positions in the Santurinivka District and consolidated in six more low-rise residential blocks southwest of the tram depot. They also managed to push the Ukrainians back out of the Michurina Dachas in southeastern Kostyantynivka. \nTo the south, Russian forces continued slowly advancing north of the Kleban-Bykske Reservoir. They captured additional positions in the forests of the Kleban-Byk Landscape Park and expanded their zone of control in the trench fortifications west of Pleshchiivka.\n+ ~9.53 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755726Z"
    },
    {
      "original": "Overnight, in southern Syria, violent clashes took place between STG government forces and the Suweida Military Council (SMC) on the frontline west of Suweida City and in the area of Al Majdal. \nNo casualties were reported, but power outages occurred in some settlements north of Suweida due to a stray bullet hitting a powerline.",
      "timestamp": "2025-12-09T18:44:01.755731Z"
    },
    {
      "original": "Overnight, in southern Syria, violent clashes took place between STG government forces and the Suweida Military Council (SMC) on the frontline west of Suweida City and in the area of Al Majdal. \nNo casualties were reported, but power outages occurred in some settlements north of Suweida due to a stray bullet hitting a powerline.",
      "timestamp": "2025-12-09T18:44:01.755736Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Thai forces have captured Prey Chan - Poi Pet direction, Cambodia. \nNote, Thai forces had already \ncaptured a military position\n just north of the village in July. Media \nposted by TabZ\n was geolocated by Rerum Novarum to \n13.81737, 102.73763\n, confirming the capture.",
      "timestamp": "2025-12-09T18:44:01.755746Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Thai forces have captured Prey Chan - Poi Pet direction, Cambodia. \nNote, Thai forces had already \ncaptured a military position\n just north of the village in July. Media \nposted by TabZ\n was geolocated by Rerum Novarum to \n13.81737, 102.73763\n, confirming the capture.",
      "timestamp": "2025-12-09T18:44:01.755754Z"
    },
    {
      "original": "On the northwestern flank of Kostyantynivka, Russian forces continued their intensified assault operations and have advanced in two different areas.\nIn the northwest, Russian forces continued pushing west from the area of Maiske. They advanced west along a treeline, and west from the Maiske - Virolybuivka Road, capturing new positions on the tactical heights northeast of Virolybuivka. From there, Russian soldiers managed to enter the northern part of Virolybuivka, while DRGs infiltrated even further west and across the Novyi Reservoir in the direction of Klynove.\nIn the southeast, Russian forces began counterattacking in the southern suburbs of Chasiv Yar. They were able to recapture the Levanevskoho District, pushing the Ukrainians back to the southwestern Pivdennyi District.\n+ ~4.50 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755760Z"
    },
    {
      "original": "Russia is currently carrying out large-scale military exercises in the Far East.\nAt least 5 Tu-95MS strategic bombers from Ukrainka Airbase, ships from the pacific fleet stationed in Vladivostok, and an A-50U AWACS aircraft are taking part. \nThe strategic bombers are carrying out simulated launches of Kh-101 cruise missiles with electronic warfare in the Sea of Japan. They are communicating ground controllers \"Tainy, Bocheka, Rangut, Senokos, Vyazanka,\" and carrying out launch maneuvers with the launch code \"333\". \nThese exercises will undoubtably delay the next large-scale, combined missile and drone attack on Ukraine involving strategic aviation, however there is still a possibility for large-scale missile attacks to take place without bombers due to a large number of Geran-2 drones still accumulated at launch sites, as well as recent Iskander-M deliveries to OTRK installations.",
      "timestamp": "2025-12-09T18:44:01.755770Z"
    },
    {
      "original": "Russian media report that a Russian An-22 military transport aircraft crashed in Ivanovo Oblast. \nThe plane reportedly had 7 crewmembers onboard at the time. Search and rescue operations are underway.",
      "timestamp": "2025-12-09T18:44:01.755774Z"
    },
    {
      "original": "On the southwestern flank of Siversk, Russian forces continued to advance and have made significant progress across three different areas.\nIn the southwest, Russian forces managed to break through Ukrainian positions in the eastern part of Orikhovo-Vasylivka, quickly capturing the rest of this village which had held for over a year. Additionally, they were able to secure the treelines to the southwest and northeast, as well as the rest of the gulley to the east. From there, Russian forces pushed north to the forest along the E-40 Highway, capturing the southern part of it. In response to these somewhat sudden Russian advances, Ukraine blew up the Pryvillya Dam in an attempt to slow them down. \nTo the northeast, Russian forces continued pushing west from the Bakhmutovka River. They consolidated in positions directly east of Pazeno, before entering the village, which is now in the grey-zone. They also managed to secure a number of the trenches north and northwest of Sakko i Vansetti which have held since March 2023. \n+ ~9.32 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755782Z"
    },
    {
      "original": "In the Siversk and Lyman directions, Russian forces continued their assault operations and have made significant progress over the last week. \nIn the southeast, Russian forces managed to consolidate in most of the high-rise buildings of northeastern Siversk. From there, they advanced southwest and captured the railway station, while other forces advanced west to the city centre. \nAdditionally, Russian forces eliminated the pocket to the southeast of Siversk, and in coordination with attacks from the southern outskirts, established control over the southeastern part of the city, largely levelling the frontline along the railway line. Ukrainian forces have mostly withdrawn from the main part of Siversk east of the Bakhmutovka River, while Russian forces are attempting to infiltrate the western suburbs. They also managed to capture the terykon north of the city.\nTo the northwest, the Russians continued advancing beyond Platonivka and captured the forested gulley south of the village. They also advanced through the forest plantations to the southwest and captured the southeastern streets of Zakitne. \nFurther northwest, Russian forces captured the remaining part of the forests north of Zakitne and cleared the positions in the forested area on the northern bank of the Siverskyi Donets River. \nTo the west, the Russians captured the crossroads north of Ozerne and continue attempts to enter the northern part of the village amid fierce fighting. Additionally, Russian forces managed to capture the northern and eastern parts of Dibrova, as well as the forests to the east and southeast. Marginal advances also took place west of the two reservoirs in the direction of the highway.\n+ ~29.57 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755792Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their assault operations and have made new progress in three different areas.\nIn the southeast, Russian forces continued to incrementally advance through the fields east of Lyman, amid heavy fighting. They were able to establish control over additional positions in the treelines south of the Zarichne - Lyman Road, and are attempting to advance further west.\nTo the north, Russian forces resumed their assault operations northeast of Lyman and have captured additional positions in the western part of the Pen'kovyy yar Gulley. \nIn the northwest, after an earlier withdrawal, Russian forces re-entered the agricultural complex on the northeastern outskirts of Dobrysheve and established full control over it. \n+ ~2.20 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755798Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations in the western part of Luhansk Oblast and have made new progress in the direction of the Luhansk - Kharkiv regional border.\nRussian forces advanced northwest up both banks of a tributary of the Zherebets River, capturing new positions in 7 different treelines. They also managed to gain a foothold in the eastern part of the Lomovaty Forest and advanced further northwest in the direction of the Borovy Forest.\n+ ~4.31 km² in favour of Russia.",
      "timestamp": "2025-12-09T18:44:01.755803Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, each focusing on a different side of the Oskil River.\nIn the west, Ukrainian forces recaptured the forests southwest of Kupyansk and made additional progress in the southern streets of the city. They also advanced from the village of Moskovka into the northwestern streets, as well as from the western suburbs towards the city centre, where they are now fighting for the area of the train station - bypassing Russian strongpoints in the northwestern suburbs from the south. Meanwhile, Russian forces repelled the Ukrainian attacks in the Yuvileynyi high-rise micro-district, and regained control over its western apartment buildings.\nSince then, after heavy fighting, Ukrainian forces managed to establish control over a number of enterprises along the R-79 highway and infiltrated the northern streets of Kupyansk, therefore blocking Russian logistics and operationally encircling their garrison in the part of the city west of the Oskil River.\nIn the east, over the last week Russian forces have made significant progress east of the Oskil River. They advanced for over 2.6 km down the road across open ground to the northern outskirts of Petropavlivka and entrenched in its northern street. From there, after bringing in reinforcements, the Russians pushed southwest to the eastern bank of the Hnylytsya River and south to the centre of Petropavlivka, establishing control over the forest plantations north of a tributary of the Hnylytsya River. Attacks are now underway towards the eastern part of the village; however the situation in the centre of the settlement and nearby areas remains somewhat fluid and dynamic. \nTo the southeast, Russian forces resumed their assault operations on the southeastern part of Petropavlivka and gained a foothold in the first houses of the village. Other assault groups managed to capture positions in the forested area to the south. \n+ ~8.53 km² in favour of Russia. \n+ ~5.80 km² in favour of Ukraine.",
      "timestamp": "2025-12-09T18:44:01.755811Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces are advancing, each focusing on a different side of the Oskil River.  In the west, Ukrainian forces recaptured the forests southwest of Kupyansk and made additional progress in the southern streets…",
      "timestamp": "2025-12-09T18:44:01.755814Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:\nThe yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian soldiers there, who managed to reach the western bank of the Oskil River. This has been achieved after weeks of Ukrainian counterattacks. There is currently no evidence of consolidation there, however.\nThe red shows the main Russian strongholds in western Kupyansk, which the Ukrainians are either bypassing or directly assaulting. \nThe situation has reached this point due to a severe lack of Russian manpower within Kupynask. This is due to a lack of Russian consolidation north of the city, making logistics (which already have to go over the river further north which is monitored 24/7 by Ukrainian drones) incredible difficult. For this reason, Russian soldiers in western Kupyansk likely number between just 200 and 400.\nThe fact that Russian forces managed to break into Kupyansk and quickly capture large parts of the city is evidence of how poorly the Ukrainian defence was initially conducted here, and how critical their manpower shortages were. \nHowever, due to reinforcements being brought in, Ukraine achieved a localised numerical superiority in this area, which is allowing for them to carry out these successful counterattacks. \nThis is why I warned about this sector a week ago, and how it could become critical for Russian forces. Since then, the situation has absolutely reached a critical level.",
      "timestamp": "2025-12-09T18:44:01.755822Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-09T18:44:01.755827Z"
    },
    {
      "original": "Ratio'ing these low-IQ Nafoids on their childish posts will never not be funny \n🤣\n🤣",
      "timestamp": "2025-12-09T18:44:01.755832Z"
    },
    {
      "original": "123:0 is absolutely brutal \n😁",
      "timestamp": "2025-12-09T18:44:01.755836Z"
    },
    {
      "original": "I keep seeing people ask me how to access my interactive Ukraine map, so I might start linking it under each map update like Suriyak. Remember, all updates are posted there first, although some changes may be clarified and adjusted before I make a written report.\nI will only do that on Telegram though, as posting links to other sites on Twitter kills your reach. \nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=49.55942754881313%2C37.24161958921334&z=8",
      "timestamp": "2025-12-09T18:44:01.755841Z"
    },
    {
      "original": "Iskander-M ballistic missiles continue to be delivered to OTRK installations near Ukraine.\nRecently, IL-76MD military transport aircraft have landed at Baltimore Airbase, Voronezh Oblast, and at Rostov-on-Don-Central Airbase, Rostov Oblast. Iskanders will be delivered by road to OTRK installations near Liski, Voronezh Oblast, and near Taganrog, Rostov Oblast. The cargo likely also consisted of Geran-2 drones which will be transported by rail to launch sites.\nAdditionally, an IL-76MD landed at Engels-2 Airbase, carrying Kh-101 cruise missiles in preparation for the next large-scale, combined missile and drone attack on Ukraine. These missiles will be equipped to Tu-95MS/Tu-160M strategic bombers once they return from their large-scale training missions in the Far East.",
      "timestamp": "2025-12-09T18:44:01.755846Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344221Z"
    },
    {
      "original": "Fighting Near Kupyansk: Ukraine Struggles To Keep Russian Army Away From Logistic Routes\nUkrainian forces made several attempts to attack the northern part of the Kupyansk encirclement. Russian units have established full control over the residential part of Sofiivka. \nEuropean Commission President Ursula von der Leyen is pushing for the use of frozen Russian assets.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344235Z"
    },
    {
      "original": "Deadly Border Clashes Renew Threat Of Open War Between Thailand And Cambodia (Videos)\nA new round of clashes broke out along the disputed borders between Thailand and Cambodia on December 9, causing casualties and bringing the two countries closer to an all-out war.\nThe clashes started with both sides accusing the other of firing across the border.\nBy December 9, the clashes had expanded to Thailand's Surin, Buri Ram, Sa Kaeo and Trat provinces, and Cambodia's Banteay Meanchey and Pursat provinces.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344244Z"
    },
    {
      "original": "Deadly Border Clashes Renew Threat Of Open War Between Thailand And Cambodia (Videos)\nA new round of clashes broke out along the disputed borders between Thailand and Cambodia on December 9, causing casualties and bringing the two countries closer to an all-out war.\nThe clashes started with both sides accusing the other of firing across the border.\nBy December 9, the clashes had expanded to Thailand's Surin, Buri Ram, Sa Kaeo and Trat provinces, and Cambodia's Banteay Meanchey and Pursat provinces.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344252Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – December 9, 2025",
      "timestamp": "2025-12-09T18:44:02.344256Z"
    },
    {
      "original": "Sahel States Threaten Nigeria Over Airspace Violations After C-130 Emergency Landing \nThe Confederation of Sahel States (AES), which includes Mali, Burkina Faso, and Niger, announced on December 8 that it will neutralize all aircraft violating its airspace, following reports of violation by Nigeria.\nIn an official statement, the alliance explained that a Nigerian Air Force C-130 aircraft made an emergency landing in Burkina Faso, and an investigation by Burkinabe authorities revealed that the landing was unauthorized.\nThe AES condemned “in the strongest terms” the violation of its airspace, and stressed that the air defenses of the alliance are authorized to “neutralize all aircraft that would violate the confederal airspace.”\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344265Z"
    },
    {
      "original": "Israeli Army Storms Southern Syria Town And Clashes With Local Causing Casualties (Videos)\nA unit of the Israeli Defense Forces (IDF) stormed on December 9 the town of Khan Arnabeh in the southern Syrian governorate of Quneitra and clashed with the locals, causing casualties.\nThe unit set up checkpoints all around Khan Arnabeh, restricting the movement from and to the town. When a group of locals gathered near one of the checkpoints to protest, Israeli troops opened fire. Syrian state TV said that three people were wounded as a result.\nSpeaking on the sideline of the annual Doha Forum in Qatar on December 6, Syrian President Ahmad al-Sharaa made some of his sharpest comments against Israel to date.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344274Z"
    },
    {
      "original": "Israeli Army Storms Southern Syria Town And Clashes With Local Causing Casualties (Videos)\nA unit of the Israeli Defense Forces (IDF) stormed on December 9 the town of Khan Arnabeh in the southern Syrian governorate of Quneitra and clashed with the locals, causing casualties.\nThe unit set up checkpoints all around Khan Arnabeh, restricting the movement from and to the town. When a group of locals gathered near one of the checkpoints to protest, Israeli troops opened fire. Syrian state TV said that three people were wounded as a result.\nSpeaking on the sideline of the annual Doha Forum in Qatar on December 6, Syrian President Ahmad al-Sharaa made some of his sharpest comments against Israel to date.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344282Z"
    },
    {
      "original": "Military Situation In Ukraine On December 9, 2025 (Maps Update)",
      "timestamp": "2025-12-09T18:44:02.344286Z"
    },
    {
      "original": "Military Situation In Ukraine On December 9, 2025 (Maps Update)",
      "timestamp": "2025-12-09T18:44:02.344290Z"
    },
    {
      "original": "Russian Army Now Controls Most Of Siversk (Videos)\nOn December 9, the Russian military expanded its control inside Siversk, capturing more than 60-70% of the city, one of the largest in Donetsk, according to varying sources.\nThe Yug [South] Group of Forces first advanced in the center of Siversk, along the railway, from south to north, capturing most of this part of the city. Russian troops then broke through Ukrainian defenses in the southwestern part of the city, and began advancing from there into the urban areas in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344298Z"
    },
    {
      "original": "Russian Army Now Controls Most Of Siversk (Videos)\nOn December 9, the Russian military expanded its control inside Siversk, capturing more than 60-70% of the city, one of the largest in Donetsk, according to varying sources.\nThe Yug [South] Group of Forces first advanced in the center of Siversk, along the railway, from south to north, capturing most of this part of the city. Russian troops then broke through Ukrainian defenses in the southwestern part of the city, and began advancing from there into the urban areas in the western part.\nRead more \nHERE",
      "timestamp": "2025-12-09T18:44:02.344305Z"
    },
    {
      "original": "Military Situation In Syria On December 9, 2025 (Map Update)",
      "timestamp": "2025-12-09T18:44:02.344309Z"
    }
  ],
  "script_run_time": "2025-12-09T18:44:02.345052Z"
}