{
  "messages": [
    {
      "original": "🛵\n БпЛА на сході Сумщини (Сумський район), курс на  схід.",
      "timestamp": "2025-11-08T11:59:52.498842Z"
    },
    {
      "original": "🛵\n БпЛА в Новгород-Сіверському районі Чернігівщини, курс південний.",
      "timestamp": "2025-11-08T11:59:52.498862Z"
    },
    {
      "original": "🛵\n БпЛА в Богодухівському районі Харківської області, курс південно-західний.",
      "timestamp": "2025-11-08T11:59:52.498868Z"
    },
    {
      "original": "🛵\nБпЛА на Сумщині в районі н.п.Краснопілля, курс південний",
      "timestamp": "2025-11-08T11:59:52.498873Z"
    },
    {
      "original": "🛵\n БпЛА в Конотопському районі Сумської області, курс південно-східний.",
      "timestamp": "2025-11-08T11:59:52.498878Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 415 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 08 листопада (з 18.30 07 листопада) противник завдав комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного, наземного та морського базування. \nЗагалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 503 засобів повітряного нападу – 45 ракет (із них – 32 «балістика») та  458 БпЛА різних типів (близько 300 – «шахеди»):\n- 458 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Міллерово, Орел, Приморсько-Ахтарськ – рф, Гвардійське – ТОТ АР Крим);\n-  25 балістичних ракет Іскандер-М/KN-23 (із Курської, Воронезької, Ростовської обл. – рф);\n-  10 крилатих ракет Іскандер-К (із Курської, Воронезької обл. – рф);\n-  7 аеробалістичних ракет Х-47М2 \"Кинджал\" (із Тамбовської обл. – рф);\n-  3 крилатих ракети \"Калібр\" (із акваторії Чорного моря).\n❗️\n Основні напрямки удару – Київщина, Дніпропетровщина та Полтавщина.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\nЗа попередніми даними, станом на 10.00, протиповітряною обороною збито/подавлено 415 повітряних цілей:\n- 406 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів);\n- 9 ракет різних типів.\nНаразі зафіксовано влучання 26 ракет та 52 ударних БпЛА на 25 локаціях та падіння збитих (уламки) на 4 локаціях в різних регіонах України.\nКрім того, станом на 10.00, інформація щодо падіння/влучання 10 ворожих ракет уточнюється.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-08T11:59:52.498907Z"
    },
    {
      "original": "🛵\n БпЛА в Берестинському районі Харківської області, курс південно-східний.",
      "timestamp": "2025-11-08T11:59:52.498912Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-08T11:59:52.498917Z"
    },
    {
      "original": "🛵\n БпЛА  в Лозівському районі Харківської області, курс на Лозову.",
      "timestamp": "2025-11-08T11:59:52.498921Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-08T11:59:52.498929Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-08T11:59:52.498934Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Павлоградський район), курс південно-західний.",
      "timestamp": "2025-11-08T11:59:52.498938Z"
    },
    {
      "original": "🛵\n БпЛА в Конотопському районі Сумської області, курс південний.",
      "timestamp": "2025-11-08T11:59:52.498942Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-08T11:59:52.498947Z"
    },
    {
      "original": "🚀\nПуски КАБ на Дніпропетровщину.",
      "timestamp": "2025-11-08T11:59:52.498951Z"
    },
    {
      "original": "🛵\n БпЛА в Богодухівському районі Харківщини, курс на південь.",
      "timestamp": "2025-11-08T11:59:52.498956Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Берестинський, Лозівський райони), курс на південь.",
      "timestamp": "2025-11-08T11:59:52.498960Z"
    },
    {
      "original": "🛵\n БпЛА в Конотопському районі Сумської області, курс південно-західний.",
      "timestamp": "2025-11-08T11:59:52.498964Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини курсом на Чернігівщину (Ніжинський район).",
      "timestamp": "2025-11-08T11:59:52.498969Z"
    },
    {
      "original": "🛵\n БпЛА в Новгород-Сіверському та Корюківському районах Чернігівщини, курс західний.\n🛵\n БпЛА з Харківщини, курсом на Дніпропетровщину.\n🛵\n БпЛА в Запорізькому районі, курсом на Дніпропетровщину.",
      "timestamp": "2025-11-08T11:59:52.498976Z"
    },
    {
      "original": "A massive attack is ongoing on the cities of Svitlodovsk and Kremenchuk, Poltava Oblast. More than 40 Geran-2 drones are attacking energy infrastructure there. Power outages are reported.",
      "timestamp": "2025-11-08T11:59:53.132039Z"
    },
    {
      "original": "Still more than 15 Gerans over Kremenchuk. Air defence isn't being effective, over 20 drones have hit the area",
      "timestamp": "2025-11-08T11:59:53.132054Z"
    },
    {
      "original": "Pavlohrad, Dnipropetrovsk Oblast is under attack from Geran-2 drones again.",
      "timestamp": "2025-11-08T11:59:53.132058Z"
    },
    {
      "original": "Last night, another large-scale, combined missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~7 Iskander-M ballistic missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~4 Iskander-M ballistic missiles launched from OTRK installations near Kursk City, Kursk Oblast.\n~3 Iskander-M ballistic missiles launched from OTRK installations northeast of Simferopol, Crimea.\n~3 Iskander-M ballistic missiles launched from OTRK installations near Hvardiiske Training Ground, Crimea. \n~2 Iskander-M ballistic missiles launched from OTRK installation(s) northwest of Kliintsy, Bryansk Oblast.\n~1 Iskander-M ballistic missile launched from an OTRK installation near Yeysk, Krasnodar Krai.\n~1 Iskander-M ballistic missiles launched from an OTRK installation near Taganrog, Rostov Oblast. \n~10 Kinzhal hypersonic aeroballistic missiles launched from 10 MiG-31Ks at their launch lines in Rasskazovsky District, Tambov Oblast.\n~9 Iskander-K cruise missiles launched from OTRK installations near Liski, Voronezh Oblast.\n~4 Iskander-K cruise missiles launched from OTRK installations near Khalino Airbase, Kursk Oblast.\n~3 Kalibr cruise missiles launched from a frigate of the \"Admiral Makarov\" type off the coast of Cape Myskhako, Krasnodar Krai. \nInterceptions rates are currently unknown but are very low due to the number of ballistic missiles used. \n-----------------------\nThe main targets for this strike were Ukrainian gas and energy infrastructure. The following was hit:\nBelsk integrated oil and gas processing plant, Poltava Oblast (50.10915, 34.57816) by ~2 Iskander-Ms.\nOil and gas extraction workshop No. 4, Chernihiv Oblast (50.8025, 33.1349) by ~4 Iskander-Ms.\nUKPG Gas treatment plant, Kharkiv Oblast (49.85486, 35.97214) by ~3 Iskander-Ms.\nKharkiv TEC-5 Combined Heat and Power Plant, Kharkiv Oblast (49.97057, 36.11147) by ~3 Iskander-Ms\nSlobozhanske Power Plant, Kharkiv Oblast (49.58516, 36.52387) by ~2 Iskander-Ms\nPrydniprovska Thermal Power Plant, Dnipropetrovsk Oblast (48.40496, 35.11253) by ~6 Iskander-Ms.\nPavlohrad Chermical Plant, Dnipropetrovsk Oblast (48.56746, 35.82358) by ~2 Iskander-Ms.\nUnknown target near Kotelva, Poltava Oblast (likely gas-related) by ~5 Kinzhals and ~9 Iskander-Ks.\nUnknown target near Bucha, Kyiv Oblast by ~3 Kalibrs, ~2 Kinzhals, and ~2 Iskander-Ks.\nUnknown target near Obukhiv, Kyiv Oblast by ~2 Iskander-Ks.\nUnknown target near Fastiv, Kyiv Oblast by ~3 Kinzhals.\n-----------------------\nAdditional places targeted by Geran-2 drones, but not by missiles, include:\nKyiv City, Kyiv Oblast.\nBoryspil, Kyiv Oblast.\nKremenchuk, Poltava Oblast.\nSvitlodovsk, Poltava Oblast.\nPoltava City area, Poltava Oblast.\nLubny area, Poltava Oblast.\nHrebinka area, Poltava Oblast.\nSumy City, Sumy Oblast.\nZlatopil area, Kharkiv Oblast,\nBalakliya area, Kharkiv Oblast.\nZaporizhzhia City, Zaporizhzhia Oblast.\nMykolaiv City, Mykolaiv Oblast.\nPryluky area, Chernihiv Oblast.\nMykolaivka area, Donetsk Oblast.\nAdditionally, MLRS targeted energy infrastructure near Zaporizhzhia City and Kherson City. \nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2025-11-08T11:59:53.132103Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n Israeli drone strikes reported in Bint Jbeil, southern Lebanon.\n@wfwitness",
      "timestamp": "2025-11-08T11:59:53.132113Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n Israeli drone strikes reported in Bint Jbeil, southern Lebanon.\n@wfwitness",
      "timestamp": "2025-11-08T11:59:53.132120Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have captured positions within Kostyantynivka's city limits.\nAfter weeks of DRG infiltrations, Russian assault groups were able to consolidate in the eastern-most houses of the city, capturing at least 13 low-rise residential blocks as well as the nearby trench lines. DRGs continue their infiltrations towards the railway station, significantly disrupting Ukraine's defence.\nTo the south, Russian forces advanced further up the railway line and captured new treeline positions. They also consolidated in the agricultural buildings on the northern outskirts of Ivanopillya, before entering and capturing part of the village.\nIn the southwest, Russian forces continued to expand their zone of control east of the highway, capturing new trenches in the forests, as well as an underground bunker. Attacks are now being carried out further east to the rear of the Kleban-Bykske Reservoir.\n+ ~4.60 km² in favour of Russia.",
      "timestamp": "2025-11-08T11:59:53.132128Z"
    },
    {
      "original": "Large fires are burning in the cities of Kremenchuk and Svitlodovsk, Poltava Oblast, after more than 40 Russian Geran-2 drones attacked energy infrastructure in the region.",
      "timestamp": "2025-11-08T11:59:53.132131Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Dnipro. The main target was the Prydniprovska Thermal Power Plant. Patriot systems were unable to intercept any of the missiles.",
      "timestamp": "2025-11-08T11:59:53.132135Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Dnipro. The main target was the Prydniprovska Thermal Power Plant. Patriot systems were unable to intercept any of the missiles.",
      "timestamp": "2025-11-08T11:59:53.132139Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones attacked a target in the western part of Mykolaiv City last night. A fire was seen burning afterwards.",
      "timestamp": "2025-11-08T11:59:53.132144Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones attacked a target in the western part of Mykolaiv City last night. A fire was seen burning afterwards.",
      "timestamp": "2025-11-08T11:59:53.132148Z"
    },
    {
      "original": "Scenes from last night's combined Russian missile and drone attack on Pavlohrad, Dnipropetrovsk Oblast. \nThe target was the city's chemical plant, as well as energy infrastructure. Power outages lasted a couple of hours, and the fire at the chemical plant has since burned out.",
      "timestamp": "2025-11-08T11:59:53.132153Z"
    },
    {
      "original": "Scenes from last night's combined Russian missile and drone attack on Pavlohrad, Dnipropetrovsk Oblast. \nThe target was the city's chemical plant, as well as energy infrastructure. Power outages lasted a couple of hours, and the fire at the chemical plant has since burned out.",
      "timestamp": "2025-11-08T11:59:53.132157Z"
    },
    {
      "original": "A large fire is burning at the TEC-5 combined heat and power plant in Kharkiv City after it was hit by multiple Iskander-M ballistic missiles and Geran-2 drones.",
      "timestamp": "2025-11-08T11:59:53.132160Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced over the past 10 days, with Ukrainian forces eliminating most of the rest of the former Russian Kucheriv Yar salient.\nIn the north, Ukrainian forces advanced from positions south and east of Kucheriv Yar and recaptured positions in the treelines on the tactical heights and in the clay quarries. They reached the forests leading to western Shakhove where fighting is now ongoing.\nTo the south, Ukrainian forces advanced further east from positions east of Nove Shakhove. They pushed along two parallel gulleys and some treelines, capturing new positions in the direction of Pankivka, and threatening to cut off Russian formations entrenched in western Shakhove.\nTo the southwest, despite Russian FAB bombings, Ukrainian assault groups made additional progress towards the Kazenyi Torets River. They advanced southeast and captured new treeline positions on the tactical heights northwest of Mayak, while other forces entered the Hektova Gulley where they established control over most of the forested areas and began pushing towards the rear of Nykanorivka. Additionally, the Ukrainians advanced east from Dorozhnje, recapturing new positions in the forests west of Nykanorivka. \nOn the other hand, after their withdrawal from northern Pankivka, Russian forces re-entered the forests in the grey-zone northwest of the village, and consolidated in the positions there.\n+ ~24.45 km² in favour of Ukraine.\n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-08T11:59:53.132168Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nOver the last 24 hours, any remaining Ukrainian soldiers in the Dinas District of northeastern Pokrovsk surrendered after being physically encircled earlier. After combing operations, the rest of the district was brought under full Russian control.\nAttacks are now being carried out further east through Rivne. Russian forces were able to capture additional positions in the southern houses of the village as they attempt to advance east along the highway towards the northwestern outskirts of Myrnohrad.\nNorthwest of Myrnohrad, Russian forces levelled the frontline east of the northern pincer. After earlier infiltrations they were able to consolidate in the pig farm complex northwest of Svitle, as well as the treelines to the north. Additionally, Russian forces captured the pig farm complex south of Chervonyi Lyman, as well as the rest of the railway windbreaks further south.\nFierce fighting continues in western Rodynske, with no new confirmed changes. \nWith these new changes, for the first time, not a single part of Pokrovsk City is under Ukrainian control. More than 95% is under Russian control, with the rest in a fluid grey zone.",
      "timestamp": "2025-11-08T11:59:53.132175Z"
    },
    {
      "original": "In the Novopavlivka direction, over the past ten days, Russian forces have made significant progress on both banks of the Solena river.\nIn the northeast, Russian forces advanced further west from their positions west of Kotlyarivka. They established control over the remaining treelines in western Donetsk Oblast, crossing into Dnipropetrovsk Oblast, where they captured more positions on the tactical heights.\nTo the south, Russian forces widened their spearhead to the rear of Dachne by improving their positions in the treelines further north of the nearby gulley. They were able to capture positions in four separate treelines here.\nTo the southwest, following the Ukrainian withdrawal from the salient north of the Vovcha River, Russian forces levelled the frontline south of the gulley, establishing control over the remaining treeline positions there.\nTo the northwest, Russian forces broke through Ukrainian defences south of Novopavlivka and advanced up a treeline to the southeastern outskirts of the town. They then entered the town, capturing the southern streets. Once reinforcements were brought in, and positions were captured on the eastern and western flanks of the breach, the Russians advanced further north through the Novopavlivka, capturing additional residential streets. They also improved their positions further in the fortified forest, capturing additional positions north of Filiya.\nTo the west, Russian forces advanced east from Ivanivka to the forests on the northern bank of the Vovcha River. They established control over the positions there, linking up the Ivanivka bridgehead to the rest of the Novopavlivka direction. \n+ ~31.91 km² in favour of Russia.",
      "timestamp": "2025-11-08T11:59:53.132183Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, over the past five days Russian forces have continued their offensive operations, capturing new positions in several different areas. \nIn the north, Russian forces advanced from positions east of Oleksivika towards Orestopil, establishing control over two separate treelines and some nearby forest plantations. DRGs were able to enter the residential part of Orestopil. \nTo the southwest, the Russians continued expanding their zone of control around Zlahoda. They advanced down two perpendicular treelines south and southwest of the village, capturing new positions there. \nTo the south, after securing the central part of Uspenivka, Russian forces managed to capture the rest of the village, along with the agricultural buildings on its southern outskirts. They then crossed the Yanchur River at a new point from Pryvilne, and began advancing down a gulley and adjacent treelines towards Solodke. Russian soldiers quickly captured Solodke due to a lack of Ukrainian manpower in the area and consolidated in the treelines to the east.\nTo the southeast, the Russians advanced south and downhill from Uspenivka towards Nove, capturing positions in several different treelines and entering the village. Other forces advanced towards Novouspenivske from the southeast, crossing a gulley and capturing a forest along with nearby treeline positions to the north, northeast and south. As a result, any remaining Ukrainian soldiers still stationed west of Okhotnyche withdrew further west, allowing for the Russians to establish control over the treelines west of the Yanchur River there.\nFurther south, Russian forces continued to slowly advance west of Malynivka. They captured the rest of the gulley leading west from the village and secured new positions in two separate treelines, therefore reaching the eastern outskirts of Zelenyi Hai.\n+ ~30.98 km² in favour of Russia.",
      "timestamp": "2025-11-08T11:59:53.132191Z"
    },
    {
      "original": "Fun fact that a lot of people need to hear: both sides advance in Ukraine. \nJust because the side you don't support makes progress, it doesn't automatically mean its fake or cope, even though one country obviously advances more than the other.",
      "timestamp": "2025-11-08T11:59:53.132195Z"
    },
    {
      "original": "Energy Under Attack: Russia's Systematic Strikes and Their Impact on Ukraine\nOn the night of November 7, Russia and Ukraine continued mutual strikes. According to data from the Russian Federation Ministry of Defence, air defence systems destroyed 11 UAVs over several regions. For its part, the Ukrainian Air Force reported an attack by Russia using 128 strike UAVs, of which, it claimed, 94 were destroyed or suppressed.\nThe Ukrainian side published maps of Russian strikes on energy facilities, gas infrastructure, and generating capacity over the past three months. Among the key targets are nodal substations in major cities of frontline regions such as Chernihiv, Sumy, Nikopol, and Kherson. Furthermore, active strikes are being carried out against hydroelectric and thermal power plants, including in western Ukraine. The loss of key coal deposits near Pokrovsk and Rodynske, as well as strikes on mines in Dobropillia and Pavlohrad, are also having a negative impact.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731167Z"
    },
    {
      "original": "Energy Under Attack: Russia's Systematic Strikes and Their Impact on Ukraine\nOn the night of November 7, Russia and Ukraine continued mutual strikes. According to data from the Russian Federation Ministry of Defence, air defence systems destroyed 11 UAVs over several regions. For its part, the Ukrainian Air Force reported an attack by Russia using 128 strike UAVs, of which, it claimed, 94 were destroyed or suppressed.\nThe Ukrainian side published maps of Russian strikes on energy facilities, gas infrastructure, and generating capacity over the past three months. Among the key targets are nodal substations in major cities of frontline regions such as Chernihiv, Sumy, Nikopol, and Kherson. Furthermore, active strikes are being carried out against hydroelectric and thermal power plants, including in western Ukraine. The loss of key coal deposits near Pokrovsk and Rodynske, as well as strikes on mines in Dobropillia and Pavlohrad, are also having a negative impact.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731185Z"
    },
    {
      "original": "CONSOLIDATING GAINS: RUSSIAN FORCES PRESS ADVANTAGES IN THE DONBASS",
      "timestamp": "2025-11-08T11:59:53.731190Z"
    },
    {
      "original": "The Fall of Uspenivka: Ukraine Loses Key Stronghold On Yonchur River\nThe Russian «East» group completed operations in Uspenivka in the Zaporizhzhia sector. Units of the Russian «Centre» group have completed the encirclement of Myrnohrad.\nThe head of the EU Military Committee has stated that the deployment of part of the EUMAM UA mission on Ukrainian territory is only possible once the conflict has ended.\nRead more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731198Z"
    },
    {
      "original": "The Fall of Uspenivka: Ukraine Loses Key Stronghold On Yonchur River\nThe Russian «East» group completed operations in Uspenivka in the Zaporizhzhia sector. Units of the Russian «Centre» group have completed the encirclement of Myrnohrad.\nThe head of the EU Military Committee has stated that the deployment of part of the EUMAM UA mission on Ukrainian territory is only possible once the conflict has ended.\nRead more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731205Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 7, 2025\nOn November 7, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-08T11:59:53.731216Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 7, 2025\nOn November 7, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-08T11:59:53.731224Z"
    },
    {
      "original": "Iran Says Its Missile Program Is Red Line Amid Rumors Of ICBM Development \nIranian President Masoud Pezeshkian said on November 7 that the Islamic Republic is open to talks, but would not coerced into abandoning its nuclear and missile programs.\nPezeshkian’s latest remarks came right after President Donald Trump claimed Iran had asked if the U.S. could lift its sanctions.\nThe recent developments came amid reports suggesting that Iran is developing an intercontinental ballistic missile with a range of 10,000 kilometers.\nRead more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731232Z"
    },
    {
      "original": "Massive Russian Strike With Hundreds Of Drones Wrecks Ukrainian Defense, Energy Facilities (Videos)\nOver the night of November 7 and 8, Russia carried out a massive group strike against Ukraine, launching hundreds of suicide drones in addition to dozens of ballistic and cruise missile at targets across the country, including defense facilities and related energy infrastructure.\nUkrainian President Volodymyr Zelenskyy claimed that more than 450 drones and 45 missiles of various types were launched by Russia.\nAs usual, the Ukrainian Air Force claimed that most of the drones and missiles were intercepted. However, Ukrainian and Russian media reported many hits.\nIn a statement released later, the Russian Ministry of Defense said that the group strike was carried out “in response to terrorist attacks launched by Ukraine against civilian objects on the territory of Russia.”\nRead more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731241Z"
    },
    {
      "original": "Massive Russian Strike With Hundreds Of Drones Wrecks Ukrainian Defense, Energy Facilities (Videos)\nOver the night of November 7 and 8, Russia carried out a massive group strike against Ukraine, launching hundreds of suicide drones in addition to dozens of ballistic and cruise missile at targets across the country, including defense facilities and related energy infrastructure.\nUkrainian President Volodymyr Zelenskyy claimed that more than 450 drones and 45 missiles of various types were launched by Russia.\nAs usual, the Ukrainian Air Force claimed that most of the drones and missiles were intercepted. However, Ukrainian and Russian media reported many hits.\nIn a statement released later, the Russian Ministry of Defense said that the group strike was carried out “in response to terrorist attacks launched by Ukraine against civilian objects on the territory of Russia.”\nRead more \nHERE",
      "timestamp": "2025-11-08T11:59:53.731250Z"
    }
  ],
  "script_run_time": "2025-11-08T11:59:53.732148Z"
}