{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-11T04:56:30.940792Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-11T04:56:30.940812Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-11-11T04:56:30.940818Z"
    },
    {
      "original": "🛵\n БпЛА у бік Чернігова з північного заходу! Перебувайте в укриттях!",
      "timestamp": "2025-11-11T04:56:30.940822Z"
    },
    {
      "original": "🛵\n Загроза БпЛА для Ніжинського району Чернігівщини.\n🛵\n БпЛА на сході Дніпропетровщини, курсом на північний захід.",
      "timestamp": "2025-11-11T04:56:30.940829Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Одесу з акваторії Чорного моря.",
      "timestamp": "2025-11-11T04:56:30.940835Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Сумщини рухаються у бік Богодухівського району Харківщини.",
      "timestamp": "2025-11-11T04:56:30.940840Z"
    },
    {
      "original": "🛵\n Одеська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-11-11T04:56:30.940844Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Ізмаїльського району Одеської області.",
      "timestamp": "2025-11-11T04:56:30.940849Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА \n➡️\n курсом на/повз Татарбунари.",
      "timestamp": "2025-11-11T04:56:30.940854Z"
    },
    {
      "original": "🛵\n Групи БпЛА з акваторії Чорного моря в напрямку Ізмаїльського району Одеської області.",
      "timestamp": "2025-11-11T04:56:30.940859Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА на Одещині – у напрямку Рені.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-11T04:56:30.940865Z"
    },
    {
      "original": "🛵\n БпЛА на межі Сумської та Харківської областей рухаються у напрямку Полтавського району Полтавської області.",
      "timestamp": "2025-11-11T04:56:30.940870Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА на межі Сумської та Харківської областей. Курс - південно-західний.",
      "timestamp": "2025-11-11T04:56:30.940874Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n курсом на/повз Запоріжжя.",
      "timestamp": "2025-11-11T04:56:30.940880Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині в районі н.п. Слобожанське та Краснопавлівка, в південно-східному напрямку.",
      "timestamp": "2025-11-11T04:56:30.940884Z"
    },
    {
      "original": "🛵\n БпЛА на Нікополь зі сходу.",
      "timestamp": "2025-11-11T04:56:30.940888Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня!",
      "timestamp": "2025-11-11T04:56:30.940893Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу з акваторії Чорного моря.",
      "timestamp": "2025-11-11T04:56:30.940897Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу з акваторії Чорного моря.",
      "timestamp": "2025-11-11T04:56:30.940901Z"
    },
    {
      "original": "A short time ago, two Russian MiG-31Ks departed from Savasleika Airbase, Nizhny Novgorod Oblast, and launched two Kinzhal hypersonic aeroballistic missiles at Starokostyantyniv Airbase in Khmelnytskyi Oblast.\nBoth missiles impacted the airbase. Starkostyantyniv is known to house Su-24 tactical bombers which are used for glide-bomb strikes on frontline areas as well as storm shadow cruise missiles strikes, and has the capability to house F-16s and Mirage-2000 fighters.  \nInterestingly, the MiG-31Ks used the new launch lines in southwestern Ryazan Oblast again. This is the second recorded instance of this taking place, with the first happening during the attacks on Ozerne Airbase, Zhytomyr Oblast a week ago on November 3.",
      "timestamp": "2025-11-11T04:56:31.865099Z"
    },
    {
      "original": "Ukrainian sea drones are once again attacking the Tuapse Port in Krasnodar Krai. One impact has been recorded at Pier 167.\nCoordinates: 44.100401, 39.058302",
      "timestamp": "2025-11-11T04:56:31.865113Z"
    },
    {
      "original": "Ukrainian sea drones are once again attacking the Tuapse Port in Krasnodar Krai. One impact has been recorded at Pier 167.\nCoordinates: 44.100401, 39.058302",
      "timestamp": "2025-11-11T04:56:31.865118Z"
    },
    {
      "original": "It turns out that the target of the Ukrainian HIMARS attack on Donetsk yesterday was a complex of storage warehouses for Russian Geran-2 drones at Donetsk International Airport. FP-2 drones were also used, which are seen striking the warehouses in this video.…",
      "timestamp": "2025-11-11T04:56:31.865122Z"
    },
    {
      "original": "Satellite imagery shows that as a result of the combined Ukrainian FP-2 drone and HIMARS GMLRS strike on Donetsk International Airport, only two smaller warehouses storing Geran-2 drones were hit. \nOne warehouse was completely destroyed, while the other received significant damage. The number of drones destroyed is probably less than 100. It's likely that the FP-2 drones only targeted these two warehouses, while the HIMARS mainly targeted the other warehouses and were mostly shot down.\nImage credit",
      "timestamp": "2025-11-11T04:56:31.865127Z"
    },
    {
      "original": "The first snow has begun falling in Slovyansk, Donetsk Oblast.",
      "timestamp": "2025-11-11T04:56:31.865131Z"
    },
    {
      "original": "Around six Russian Geran-2 drones impacted the town of Orilka, Kharkiv Oblast, this evening. \nThey were likely targeting the railway station as it is placed along the railway line to the major logistical hub of Barvinkove, Kharkiv Oblast. Barvinkove is used to resupply practically all of Ukrainian-controlled Donetsk Oblast, as well as parts of frontline Kharkiv Oblast.",
      "timestamp": "2025-11-11T04:56:31.865135Z"
    },
    {
      "original": "Around six Russian Geran-2 drones impacted the town of Orilka, Kharkiv Oblast, this evening. \nThey were likely targeting the railway station as it is placed along the railway line to the major logistical hub of Barvinkove, Kharkiv Oblast. Barvinkove is used to resupply practically all of Ukrainian-controlled Donetsk Oblast, as well as parts of frontline Kharkiv Oblast.",
      "timestamp": "2025-11-11T04:56:31.865139Z"
    },
    {
      "original": "Russian forces have captured the village of Nove, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~80.\nTotal land area: ~0.50 km².",
      "timestamp": "2025-11-11T04:56:31.865144Z"
    },
    {
      "original": "Russian forces have captured the village of Novouspenivske, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~55.\nTotal land area: ~0.10 km².",
      "timestamp": "2025-11-11T04:56:31.865148Z"
    },
    {
      "original": "🇸🇾\nSYRIA:  — Footage has surfaced online of Russian military vehicles moving across the Rastan Bridge toward Homs for the first time since the overthrow of Bashar al-Assad.\nEarlier, the new authorities in Damascus announced they are ready to sign a security agreement with Moscow.",
      "timestamp": "2025-11-11T04:56:31.865154Z"
    },
    {
      "original": "The first footage has been published showing the British-developed \"Raven\" air defence system being used by Ukraine. The video shows it intercepting a Russian Kh-59 cruise missile, as well as a Kh-101 cruise missile.\nThe \"Raven\" system integrates AIM-132 advanced short-range air-to-air missiles with a 6x6 high-mobility armoured truck, allowing for more rapid deployments and effective interception rates, especially during larger-scale attacks.",
      "timestamp": "2025-11-11T04:56:31.865158Z"
    },
    {
      "original": "Footage showing a Russian FAB-3000 glide-bomb strike on a concentration of Ukrainian infantry in the besieged city of Myrnohrad. \nRussia launches hundreds of glide-bombs per day. Many killed from the strikes will only ever be counted as MIA.",
      "timestamp": "2025-11-11T04:56:31.865162Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\nIsrael struck a vehicle a vehicle in Basiyariya, southern Lebanon. \nGeolocation (for nerds): \n33.4547676, 35.3156986\n@wfwitness",
      "timestamp": "2025-11-11T04:56:31.865175Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\nIsrael struck a vehicle a vehicle in Basiyariya, southern Lebanon. \nGeolocation (for nerds): \n33.4547676, 35.3156986\n@wfwitness",
      "timestamp": "2025-11-11T04:56:31.865184Z"
    },
    {
      "original": "⚡️\n🇱🇧\n🇮🇱\nIsrael has launched strikes against the Al-Khanouq neighborhood of Aytaroun. \n@wfwitness",
      "timestamp": "2025-11-11T04:56:31.865190Z"
    },
    {
      "original": "I'm seeing a lot of people post a video of a Ukrainian tank firing at Russian positions in the high-rise buildings in southeastern Rodynske, claiming it to be new footage and proof that Ukraine controls most of the city. \nThis is not the case. Judging by sentinel satellite imagery and weather conditions at the time, the video was recorded on either Septmber 30 or October 1, nearly a month and a half ago. At this time, Ukraine was in full control of at least 95% of Rodynske, and Russian advances back into the city came later in October. \nThe sentinel imagery shows that the high-rise building which the Ukrainian tank was firing at was partially collapsed at its southern end as of October 7. This section of building also happens to be the exact area being targeted by the tank, which is likely at least indirectly related to its later collapse. \nCoordinates: 48.34554, 37.21500",
      "timestamp": "2025-11-11T04:56:31.865196Z"
    },
    {
      "original": "I'm seeing a lot of people post a video of a Ukrainian tank firing at Russian positions in the high-rise buildings in southeastern Rodynske, claiming it to be new footage and proof that Ukraine controls most of the city. \nThis is not the case. Judging by sentinel satellite imagery and weather conditions at the time, the video was recorded on either Septmber 30 or October 1, nearly a month and a half ago. At this time, Ukraine was in full control of at least 95% of Rodynske, and Russian advances back into the city came later in October. \nThe sentinel imagery shows that the high-rise building which the Ukrainian tank was firing at was partially collapsed at its southern end as of October 7. This section of building also happens to be the exact area being targeted by the tank, which is likely at least indirectly related to its later collapse. \nCoordinates: 48.34554, 37.21500",
      "timestamp": "2025-11-11T04:56:31.865202Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on Odesa Oblast, which is still ongoing. Approximately 50 drones have been used, with around 40 attacking the port city of Reni on the border with Romania.\nIn Reni, the main target was the port and energy infrastructure. Air defence shot down little to no drones due to the rain and fog, while planes and helicopters were unable to fly in these weather conditions. Large fires are now burning at the port and the Limanskaya Solar Station. \nThe southern suburbs of Odesa city were targeted by around 9 drones. Air defence was far more successful here, shooting down at least 6 of them. Right now, the last two drones are flying to the Odesa port from the Black Sea.\n[Videos are both from Reni]",
      "timestamp": "2025-11-11T04:56:31.865209Z"
    },
    {
      "original": "Overnight, a massive Russian Geran-2 drone attack was carried out on Odesa Oblast, which is still ongoing. Approximately 50 drones have been used, with around 40 attacking the port city of Reni on the border with Romania.\nIn Reni, the main target was the port and energy infrastructure. Air defence shot down little to no drones due to the rain and fog, while planes and helicopters were unable to fly in these weather conditions. Large fires are now burning at the port and the Limanskaya Solar Station. \nThe southern suburbs of Odesa city were targeted by around 9 drones. Air defence was far more successful here, shooting down at least 6 of them. Right now, the last two drones are flying to the Odesa port from the Black Sea.\n[Videos are both from Reni]",
      "timestamp": "2025-11-11T04:56:31.865215Z"
    },
    {
      "original": "Russian Army Captures Hnativka After Neutralizing 200 Ukrainian Troops In Pokrovsk \nOn November 10, the Russian military captured a small settlement adjacent to the key city of Pokrovsk in Donetsk after inflicting heavy losses on Ukrainian troops trapped there.\nIn a statement, the Russian Ministry of Defense said that the 2nd Combined Arms Army of the Tsentr [Center] Group of Forces captured Hnativka, located right to the east of Pokrovsk.\nIt added, that Russian troops expanded their control in the city itself, advancing in the “Dinas” neighborhood, in the northwestern and eastern quarters of the Central district, as well as in the western industrial zone, and liberated 244 buildings within a day.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671484Z"
    },
    {
      "original": "Russian Army Captures Hnativka After Neutralizing 200 Ukrainian Troops In Pokrovsk \nOn November 10, the Russian military captured a small settlement adjacent to the key city of Pokrovsk in Donetsk after inflicting heavy losses on Ukrainian troops trapped there.\nIn a statement, the Russian Ministry of Defense said that the 2nd Combined Arms Army of the Tsentr [Center] Group of Forces captured Hnativka, located right to the east of Pokrovsk.\nIt added, that Russian troops expanded their control in the city itself, advancing in the “Dinas” neighborhood, in the northwestern and eastern quarters of the Central district, as well as in the western industrial zone, and liberated 244 buildings within a day.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671501Z"
    },
    {
      "original": "Syria Under Israeli Rule\nThe beginning of November 2025 marked a significant event in Syria: Trump decided to lift sanctions \"at the request of Turkey and Israel.\" Thus, all the conclusions and analyses of experts who claimed that Assad's overthrow was in the interests of the Zionists were once again confirmed.\nBut of course, no one will talk about this. Moreover, a PR campaign has been launched in the global media to whitewash the Tahrir al-Sham regime, which is now being presented as a \"fighter against ISIS.\" The jihadists in Damascus took the signal and staged a show of allegedly arresting ISIS supporters in areas of Syria under their control.\nThis entire absurdity is designed to improve the image of the \"former\" branch of Syrian al-Qaeda in the eyes of the international community, which is alarming moderate Ash'ari Sunnis, Druze, and Alawites. Because they are the ones targeted by the Damascus jihadists under the guise of \"fighting terrorism.\" \n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671511Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 10, 2025 (Map Update)",
      "timestamp": "2025-11-11T04:56:32.671515Z"
    },
    {
      "original": "Israel Is Pushing Lebanese Army Into Confrontation With Hezbollah\nAnother wave of deadly strikes targeted Lebanon on November 10 amid reports suggesting that Israel was pushing the Lebanese military into a confrontation with Hezbollah.\nMost of the strikes targeted southern Lebanon and the Beqaa Valley, with the Israeli Defense Forces (IDF) later announcing that its struck sites used by Hezbollah for rocket launches and the production and storage of strategic weapons.\nIn a statement, the IDF said that the strikes, guided by the Military Intelligence Directorate and carried out with the air force under the Northern Command, were aimed at neutralizing weapons directed at Israel and preventing Hezbollah from rebuilding its “terror infrastructure.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671525Z"
    },
    {
      "original": "Israel Is Pushing Lebanese Army Into Confrontation With Hezbollah\nAnother wave of deadly strikes targeted Lebanon on November 10 amid reports suggesting that Israel was pushing the Lebanese military into a confrontation with Hezbollah.\nMost of the strikes targeted southern Lebanon and the Beqaa Valley, with the Israeli Defense Forces (IDF) later announcing that its struck sites used by Hezbollah for rocket launches and the production and storage of strategic weapons.\nIn a statement, the IDF said that the strikes, guided by the Military Intelligence Directorate and carried out with the air force under the Northern Command, were aimed at neutralizing weapons directed at Israel and preventing Hezbollah from rebuilding its “terror infrastructure.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671534Z"
    },
    {
      "original": "Military Situation In Ukraine On November 10, 2025 (Maps Update)",
      "timestamp": "2025-11-11T04:56:32.671537Z"
    },
    {
      "original": "Military Situation In Ukraine On November 10, 2025 (Maps Update)",
      "timestamp": "2025-11-11T04:56:32.671541Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Kyiv Braces For Its Toughest Winter\nOn November 9-10, Russia and Ukraine continued their mutual strikes. According to the Russian Ministry of Defense, Russian air defense systems destroyed 71 Ukrainian unmanned aerial vehicles. The Ukrainian Air Force reported that overnight Russia used two Kinzhal hypersonic missile systems, five S-300/400 missiles, and 67 attack UAVs against Ukrainian territory, of which 52 drones were shot down.\nPower outages in Ukraine this winter will be more extensive than in previous winter seasons, Ukrainian media report, citing a representative from a state-owned energy sector company.\n\"There is no frost yet, and there is already a shortage of power generation. In the future, it will only become more difficult. If we survive the winter with only two stages of blackouts, it will be a huge success. The energy system lost at least 1 gigawatt of generating capacity just from the latest attack,\" the message states.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671550Z"
    },
    {
      "original": "Russian-Ukrainian Exchange Of Strikes: Kyiv Braces For Its Toughest Winter\nOn November 9-10, Russia and Ukraine continued their mutual strikes. According to the Russian Ministry of Defense, Russian air defense systems destroyed 71 Ukrainian unmanned aerial vehicles. The Ukrainian Air Force reported that overnight Russia used two Kinzhal hypersonic missile systems, five S-300/400 missiles, and 67 attack UAVs against Ukrainian territory, of which 52 drones were shot down.\nPower outages in Ukraine this winter will be more extensive than in previous winter seasons, Ukrainian media report, citing a representative from a state-owned energy sector company.\n\"There is no frost yet, and there is already a shortage of power generation. In the future, it will only become more difficult. If we survive the winter with only two stages of blackouts, it will be a huge success. The energy system lost at least 1 gigawatt of generating capacity just from the latest attack,\" the message states.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671559Z"
    },
    {
      "original": "KYIV BLACKOUT OBSCURES DEEPENING OPERATIONAL CRISES IN UKRAINE'S VOLCHANSK AND KUPYANSK",
      "timestamp": "2025-11-11T04:56:32.671563Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671570Z"
    },
    {
      "original": "Hnativka Under Russian Army Control: Ukraine’s Attempts To Counterattack In Pokrovsk Failed \nIn the Zaporizhzhia region, Russian units have taken control of the Sladke and Novoye settlements. Russian forces repelled seven attacks by Ukrainian army units from the Hrishyne area. \nStatements from Ukrainian authorities regarding Russian energy infrastructure have been interpreted as an attempt to pressure Hungary.\nRead more \nHERE",
      "timestamp": "2025-11-11T04:56:32.671578Z"
    }
  ],
  "script_run_time": "2025-11-11T04:56:32.672433Z"
}