{
  "messages": [
    {
      "original": "🛵\nВорожі БпЛА в північній частині  Полтавщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-09T04:52:48.346356Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-09T04:52:48.346369Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на захід.",
      "timestamp": "2025-10-09T04:52:48.346375Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-09T04:52:48.346380Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-10-09T04:52:48.346385Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Херсонщину.",
      "timestamp": "2025-10-09T04:52:48.346389Z"
    },
    {
      "original": "🛵\n БпЛА на сході Миколаївщини \n➡️\n курсом на захід.",
      "timestamp": "2025-10-09T04:52:48.346394Z"
    },
    {
      "original": "Швидкісна ціль на  Запоріжжя.",
      "timestamp": "2025-10-09T04:52:48.346398Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2025-10-09T04:52:48.346403Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nОдеса - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-10-09T04:52:48.346410Z"
    },
    {
      "original": "🛵\nВорожі БпЛА на  Чернігівщині \n➡️\n курсом на захід.",
      "timestamp": "2025-10-09T04:52:48.346418Z"
    },
    {
      "original": "🛵\nВорожий БпЛА на півдні  Вінниччини \n➡️\n курсом на північ.",
      "timestamp": "2025-10-09T04:52:48.346424Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-09T04:52:48.346429Z"
    },
    {
      "original": "🛵\nГрупа ворожих БпЛА на  Херсонщині \n➡️\n курсом на захід.",
      "timestamp": "2025-10-09T04:52:48.346434Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\nГрупа ворожих БпЛА з акваторії Чорного моря в напрямку Одещини.",
      "timestamp": "2025-10-09T04:52:48.346440Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину та Донеччину.",
      "timestamp": "2025-10-09T04:52:48.346446Z"
    },
    {
      "original": "🛵\nВорожий БпЛА на межі Київської та Чернігівської областей \n➡️\n курсом на схід.",
      "timestamp": "2025-10-09T04:52:48.346452Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-09T04:52:48.346456Z"
    },
    {
      "original": "🛵\nВорожі БпЛА на  Чернігівщині \n➡️\n курсом на захід.",
      "timestamp": "2025-10-09T04:52:48.346462Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-09T04:52:48.346466Z"
    },
    {
      "original": "KABs are flying towards Kusuhum. The recon drone operating there has gained altitude as the KABs approach the town.",
      "timestamp": "2025-10-09T04:52:48.922916Z"
    },
    {
      "original": "Impacted somewhere around here. Echoing explosions can be heard from Zaporizhzhia City.",
      "timestamp": "2025-10-09T04:52:48.922924Z"
    },
    {
      "original": "At least 9 more KABs have since impacted areas south of Zaporizhzhia City.",
      "timestamp": "2025-10-09T04:52:48.922928Z"
    },
    {
      "original": "The Russian Geran-2 drone strikes on the Yuzhkabel Electrical Substation in Kharkiv City on October 7 damaged/destroyed 1 TDTN-25000/110 transformer, 2 TMN-6300/110 transformers, the OPU General Control Point, and the enclosed switchgears. \nCoordinates: 49.964025, 36.362139",
      "timestamp": "2025-10-09T04:52:48.922933Z"
    },
    {
      "original": "The Russian Geran-2 drone strikes on the Yuzhkabel Electrical Substation in Kharkiv City on October 7 damaged/destroyed 1 TDTN-25000/110 transformer, 2 TMN-6300/110 transformers, the OPU General Control Point, and the enclosed switchgears. \nCoordinates: 49.964025, 36.362139",
      "timestamp": "2025-10-09T04:52:48.922937Z"
    },
    {
      "original": "Start the countdown!\nAnyway, Pekka the pedo doxxing another pedo was always the funniest Vatnik soup he did.",
      "timestamp": "2025-10-09T04:52:48.922942Z"
    },
    {
      "original": "Hamas has announced that they, alongside their allied factions, have reached an agreement with Israel to end the war in Gaza. U.S. President Donlad Trump also confirmed that a ceasefire deal was reached.\nThis agreement will involve Israel beginning their staged withdrawal from the Gaza Strip, the entry of aid into the strip, and a prisoner exchange.\nThe ceasefire will reportedly take effect at noon today (8 and half hours from now).",
      "timestamp": "2025-10-09T04:52:48.922947Z"
    },
    {
      "original": "Hamas has announced that they, alongside their allied factions, have reached an agreement with Israel to end the war in Gaza. U.S. President Donlad Trump also confirmed that a ceasefire deal was reached.  This agreement will involve Israel beginning their…",
      "timestamp": "2025-10-09T04:52:48.922951Z"
    },
    {
      "original": "Celebrations at the Al-Aqsa Hospital in Deir al-Balah, Central Gaza, after the ceasefire deal was agreed upon.",
      "timestamp": "2025-10-09T04:52:48.922954Z"
    },
    {
      "original": "Initial reports of an Israeli airstrike on Gaza City.",
      "timestamp": "2025-10-09T04:52:48.922957Z"
    },
    {
      "original": "U.S. President Donald Trump is expected to make a visit to Israel in the coming days, where he will speak at the Knesset, following an invitation by Israeli Prime Minister Benjamin Netanyahu.",
      "timestamp": "2025-10-09T04:52:48.922960Z"
    },
    {
      "original": "Initial reports of an Israeli airstrike on Gaza City.",
      "timestamp": "2025-10-09T04:52:48.922963Z"
    },
    {
      "original": "No follow-up reports were received regarding the alleged Israeli airstrike on Gaza City. The explosions heard were likely related to ongoing Israeli demolition operations in the Al-Rimal Neighbourhood of Gaza City.",
      "timestamp": "2025-10-09T04:52:48.922967Z"
    },
    {
      "original": "AFP, citing a source in Hamas, states that the prisoner exchange deal (which will be 2,000 Palestinian prisoners for 20 Israeli hostages) will take place within 72 hours of the ceasefire being implemented.",
      "timestamp": "2025-10-09T04:52:48.922973Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovske directions, over the past week, Ukraine's defence east of the Yanchur River has collapsed, allowing for substantial Russian progress to be made. \nIn the north, Russian forces were able to break through from the positions west of Novoivanivka, where they began pushing west and northwest up a line of small, separated trenches, which were left largely undefended by the AFU due to their severe lack of manpower in this direction. The trenches were mostly covered by FPV drones, but a lack of drone operators allowed for the Russians to advance even quicker, rapidly approaching the village of Pryvilne, and bypassing Novohryhorivka.\nWith Novohryhorivka in a dangerous salient, any remaining Ukrainian soldiers withdrew, allowing for the Russians to infiltrate the village and establish control over it, as well as the positions to the north, west, and south. At the same time, assault operations were carried out towards Pavlivka from the north, which is now in a grey zone and covered by drones.\nTo the southeast, Russian forces closed the distance to the Yanchur River, pushing along the treelines, and downhill from the tactical heights into the village of Novovasylivkse, which was quickly brought under control following a Ukrainian withdrawal over the river. The Russians were also able to establish control over the part of Novomykolaivka situated east of the river, as well as the treelines to the southeast, leading to a tributary of the river. \nIn the south, Russian forces broke through from positions west of Olhivske to the hamlet of Okhotnyche, which was quickly captured, alongside the treelines on the tactical heights to the south. Additionally, Russian forces secured the rest of the houses of Poltavka east of the river, and improved their positions in the direction of the village from the southeast, as well as north of Malynivka. \n+ ~38.37 km² in favour of Russia.",
      "timestamp": "2025-10-09T04:52:48.922981Z"
    },
    {
      "original": "In the Pokrovske direction, over the past 10 days, Ukrainian forces have carried out a series of counterattacks, recapturing positions east of the Vovcha River.\nIn the east, Ukrainian forces advanced into Novoselivka, recapturing the northern half of the village, before beginning their attacks south down the treelines to the east. They then entered Sichneve from the north, and established control over the northern part of the village, as well as the nearby treelines on the tactical heights. Since then, a series of Russian counterattacks forced the Ukrainians to withdraw from both Sichneve and Novoselivka, with both villages now being situated in the grey zone. \nIn the west, Ukrainian forces began attacking towards Sosnivka, and established control over the northwestern-most street of the village. They entered the main part of the village shortly afterwards, although there is no evidence of consolidation at this moment. Positions were also recaptured in the adjacent treelines. \nMeanwhile, Russian forces infiltrated through the grey zone of mixed positions for around 4.5 km to the eastern edge of Oleksiivka, which they were able to infiltrate. It doesn't appear that they were able to consolidate, however, and were probably picked off by Ukrainian FPV drones. \n+ ~10.82 km² in favour of Ukraine.",
      "timestamp": "2025-10-09T04:52:48.922987Z"
    },
    {
      "original": "On the western flank of Pokrovsk, and in the Novopavlivka direction, both Russian and Ukrainian forces have advanced, capturing key positions.\nRussian forces advanced north from the town of Udachne, up two treelines, to the Pokrovsk Coal Mine, where they have been successful in establishing a foothold in its easternmost buildings. Fighting is ongoing for additional parts of the mine. \nTo southwest, Ukrainian forces were able to expand their bridgehead on the southern bank of the Solona River, and recaptured the rest of Novomykolaivka, advancing to the agricultural buildings on its outskirts. From there, they have been attempting to attack into eastern Muravka, but so far have been unable to gain a foothold. \n+ ~1.85 km² in favour of Russia.\n+ ~1.29 km² in favour of Ukraine.",
      "timestamp": "2025-10-09T04:52:48.922993Z"
    },
    {
      "original": "In the Pokrovsk direction, both Russian and Ukrainian forces have advanced, with Russian forces making important progress inside Pokrovsk City.\nRussian assault groups were able to secure the eastern part of the Kalynivka District, where they used the low-rise residential area to enter the Lazurnyi District of Pokrovsk. They were able to capture most of the high-rise buildings here, and infiltrated further into the Pivdennyi, Shakhtarskyi, and Soniachnyi Districts, where a large grey-zone has formed. Most of the fighting is centred on the Shakhtarskyi District, where the Russians are attempting to advance beyond the E-50 Highway. \nTo the west, Russian forces broke through Ukrainian positions west of Pokrovsk, and captured three parallel treelines leading up the railway line. Meanwhile, in the western suburbs of Pokrovsk, their zone of control shrunk after they failed to consolidate in the Durniak District, however, infiltration attempts continue in the Durniak and Pervomaika Districts, where Ukrainian forces are increasingly using FPV drones to contain their advance. \nOn the other hand, Russian forces withdrew from the Market District of Pokrovsk, allowing for the Ukrainians to regain control over the eastern market and surrounding residential areas. \n+ ~3.89 km² in favour of Russia.\n+ ~0.39 km² in favour of Ukraine.",
      "timestamp": "2025-10-09T04:52:48.923002Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continue to advance, and have made additional progress southeast of Kostyantynivka City.\nAfter capturing the village of Kleban-Byk, Russian forces advanced into the trench fortifications east of the Kleban-Bykske Reservoir, capturing them. Other forces secured a fortified section of the railway line, and entered the southern part of Pleshchiivka, where a grey-zone has formed. \nTo the northeast, Russian forces improved their positions along the railway line south of Oleksandro-Shultyne, and began pushing downhill through the treelines towards Ivanopillya, where positions were captured on its southeastern approaches. \nIn the north, Russian forces resumed assault operations in Predtechyne, and captured the eastern part of the village. Russian soldiers also attempted to infiltrate the western houses of the village from the positions west of Stupochky, but were picked off by FPV drones. \nMeanwhile, in the southwest, Russian forces resumed attempts at reaching positions behind the Kleban-Bykske Reservoir. Ukrainian forces have withdrawn from some of the trenches here to the hill behind them, forming a kill-zone in the area of the highway. So far, Russian forces have been unsuccessful at securing any positions here.\n+ ~7.27 km² in favour of Russia.",
      "timestamp": "2025-10-09T04:52:48.923009Z"
    },
    {
      "original": "In the Kupyansk direction, over the past two weeks, Russian forces have made significant advances in Kupyansk City, and are now threatening to encircle the remaining Ukrainian formations in the northern suburbs.\nIn the west, Russian forces consolidated control over their positions in the southwest of the city, and expanded their zone of control into the neighbouring residential streets. They also began attacking to the southeast, bypassing the Yuvileynyi District from the east, approaching the southern outskirts of the city. Additionally, they were able to capture further residential areas in the area of the highway, towards the railway line, threatening to cut off the Ukrainian groupings further north.\nIn the east, Russian forces broke through Ukrainian positions in the city centre, and quickly advanced south to the bridge over the Oskil River. They were able to capture the Kupyansk Administrative Building, as well as most of the rest of the buildings that make up the city centre. The Russians were also able to infiltrate into the market, just south of the highway, but it's unclear if any consolidation has taken place.\n+ ~1.91 km² in favour of Russia.",
      "timestamp": "2025-10-09T04:52:48.923015Z"
    },
    {
      "original": "A large-scale Russian Geran-2 drone attack was carried out on the Chornomorsk Port in Odea Oblast, last night. Approximately 21 impacts were recorded, with very few interceptions. \nA large fire is now burning at the impact sites.",
      "timestamp": "2025-10-09T04:52:48.923019Z"
    },
    {
      "original": "A large-scale Russian Geran-2 drone attack was carried out on the Chornomorsk Port in Odea Oblast, last night. Approximately 21 impacts were recorded, with very few interceptions. \nA large fire is now burning at the impact sites.",
      "timestamp": "2025-10-09T04:52:48.923023Z"
    },
    {
      "original": "Russian Troops Cleared Ukrainian Pocket Near Kostiantynivka, Advanced In Other Areas (Videos)\nThe Russian military has cleared a Ukrainian pocket near the city of Kostiantynivka, and made more gains in the Dobropillia salient and around the city of Pokrovsk in the Donetsk direction.\nOn October 8, the Russian Ministry of Defense announced that the Yug [South] Group of Forces completed the “neutralisation” of Ukrainian troops who were besieged in a fairly large pocket south of Kleban-Byk Reservoir to the south of Kostiantynivka.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492661Z"
    },
    {
      "original": "Russian Troops Cleared Ukrainian Pocket Near Kostiantynivka, Advanced In Other Areas (Videos)\nThe Russian military has cleared a Ukrainian pocket near the city of Kostiantynivka, and made more gains in the Dobropillia salient and around the city of Pokrovsk in the Donetsk direction.\nOn October 8, the Russian Ministry of Defense announced that the Yug [South] Group of Forces completed the “neutralisation” of Ukrainian troops who were besieged in a fairly large pocket south of Kleban-Byk Reservoir to the south of Kostiantynivka.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492676Z"
    },
    {
      "original": "Military Situation In Syria On October 8, 2025 (Map Update)",
      "timestamp": "2025-10-09T04:52:49.492681Z"
    },
    {
      "original": "Hamas Attempted To Capture Israeli Soldiers In Gaza Amid Peace Talks In Egypt (Photos)\nHamas attacked on October 8 a post of the Israeli Defense Forces (IDF) in the Netzarim Corridor in the center of the Gaza Strip, in what was likely an attempt to capture soldiers.\nAt least five fighters of the group emerged from a tunnel and attacked the post where troops from the Golani Brigade’s reconnaissance unit were deployed, the IDF said in a statement, adding that the troops, with air support from the Israeli Air Force, struck and killed at least three of the fighters.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492688Z"
    },
    {
      "original": "Hamas Attempted To Capture Israeli Soldiers In Gaza Amid Peace Talks In Egypt (Photos)\nHamas attacked on October 8 a post of the Israeli Defense Forces (IDF) in the Netzarim Corridor in the center of the Gaza Strip, in what was likely an attempt to capture soldiers.\nAt least five fighters of the group emerged from a tunnel and attacked the post where troops from the Golani Brigade’s reconnaissance unit were deployed, the IDF said in a statement, adding that the troops, with air support from the Israeli Air Force, struck and killed at least three of the fighters.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492696Z"
    },
    {
      "original": "Military Situation In Ukraine On October 8, 2025 (Maps Update)",
      "timestamp": "2025-10-09T04:52:49.492700Z"
    },
    {
      "original": "Military Situation In Ukraine On October 8, 2025 (Maps Update)",
      "timestamp": "2025-10-09T04:52:49.492704Z"
    },
    {
      "original": "When Duty to the Homeland Became a Punishment: Forced Mobilization and Total Control in Ukraine\nThe \"voluntary\" mobilization in Ukraine continues. Against the backdrop of the depletion of mobilization resources, military enlistment officials, dubbed \"man-catchers\" by the public, are actively searching for conscripts, which at times takes on the characteristics of a disposal of the population. According to various estimates, instances of lawlessness and crimes related to Territorial Recruitment Centers (TRCs) number in the tens, if not hundreds, of thousands, even taking into account understated official statistics. \nAmid an acute need to replenish the ranks of the armed forces, the Ukrainian authorities have adopted a number of legislative measures that radically change the military registration system. A Cabinet of Ministers resolution on the automatic registration of men aged 25 to 60, as well as women, has granted TRCs unprecedented access to personal data. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492712Z"
    },
    {
      "original": "When Duty to the Homeland Became a Punishment: Forced Mobilization and Total Control in Ukraine\nThe \"voluntary\" mobilization in Ukraine continues. Against the backdrop of the depletion of mobilization resources, military enlistment officials, dubbed \"man-catchers\" by the public, are actively searching for conscripts, which at times takes on the characteristics of a disposal of the population. According to various estimates, instances of lawlessness and crimes related to Territorial Recruitment Centers (TRCs) number in the tens, if not hundreds, of thousands, even taking into account understated official statistics. \nAmid an acute need to replenish the ranks of the armed forces, the Ukrainian authorities have adopted a number of legislative measures that radically change the military registration system. A Cabinet of Ministers resolution on the automatic registration of men aged 25 to 60, as well as women, has granted TRCs unprecedented access to personal data. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492722Z"
    },
    {
      "original": "KYIV'S STRATEGIC RETREAT: THE FALL O KUPYANSK AND POKROVSK RESHAPES THE EASTERN FRONT",
      "timestamp": "2025-10-09T04:52:49.492726Z"
    },
    {
      "original": "Step by Step, Expanding The Bridgehead: Control Over Novohryhorivka Opens Path To Huliaipole\nThe capture of Novohryhorivka, the second settlement on the right bank of the Yanchul River, opens the path to Huliaipole. The bridgehead on the western bank of the Zherebets River is being expanded in the direction of Krasnolymansk.\nSlovakia is preparing a 14th aid package for Ukraine after a long pause.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492744Z"
    },
    {
      "original": "Step by Step, Expanding The Bridgehead: Control Over Novohryhorivka Opens Path To Huliaipole\nThe capture of Novohryhorivka, the second settlement on the right bank of the Yanchul River, opens the path to Huliaipole. The bridgehead on the western bank of the Zherebets River is being expanded in the direction of Krasnolymansk.\nSlovakia is preparing a 14th aid package for Ukraine after a long pause.\nRead more \nHERE",
      "timestamp": "2025-10-09T04:52:49.492752Z"
    }
  ],
  "script_run_time": "2025-10-09T04:52:49.493194Z"
}