{
  "messages": [
    {
      "original": "🛸\n🛵\n БпЛА на схід від Сум, курсом на північ.",
      "timestamp": "2025-10-12T13:44:40.086305Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини та заході Сумщини, курсом на південь.",
      "timestamp": "2025-10-12T13:44:40.086322Z"
    },
    {
      "original": "🛵\n БпЛА західніше Харкова, курсом на південь.",
      "timestamp": "2025-10-12T13:44:40.086327Z"
    },
    {
      "original": "🛵\n БпЛА на схід від Харкова, курсом на південно-західний напрямок.",
      "timestamp": "2025-10-12T13:44:40.086335Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T13:44:40.086340Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з сходу та заходу!",
      "timestamp": "2025-10-12T13:44:40.086345Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-10-12T13:44:40.086351Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини, курсом на Донеччину.",
      "timestamp": "2025-10-12T13:44:40.086355Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-12T13:44:40.086360Z"
    },
    {
      "original": "💥\n Працюють розрахунки МВГ!\n📹\nНа відео бойова робота у зоні відповідальності \nПовітряне командування \"Схід\"\n .",
      "timestamp": "2025-10-12T13:44:40.086369Z"
    },
    {
      "original": "🛵\n БпЛА у Павлоградському районі на Дніпропетровщині.",
      "timestamp": "2025-10-12T13:44:40.086374Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на Вишгородський район Київської області.",
      "timestamp": "2025-10-12T13:44:40.086378Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T13:44:40.086382Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини, курсом у Запорізьку область.",
      "timestamp": "2025-10-12T13:44:40.086386Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T13:44:40.086390Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T13:44:40.086396Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на півночі Сумщини, курсом на південь.",
      "timestamp": "2025-10-12T13:44:40.086400Z"
    },
    {
      "original": "🛵\n БпЛА на Бориспільський район.",
      "timestamp": "2025-10-12T13:44:40.086404Z"
    },
    {
      "original": "🛵\n БпЛА на заході Харківщини, курсом на Харків.",
      "timestamp": "2025-10-12T13:44:40.086408Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-10-12T13:44:40.086413Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to advance, and have made significant progress in two areas.\nIn the southwest, Russian forces consolidated their positions in the treelines west of Stepove, and began infiltrating north towards the village of Oleksiivka. Despite Ukrainian FPV drone coverage, they were able to secure the southern part of the settlement as other forces began consolidating in the three parallel treelines to the south/southeast. \nIn the northeast, after the Ukrainian counterattacks last week, Russian forces began reversing the Ukrainian progress. They re-entered Sichneve from the east, securing the eastern houses, and began advancing through the treelines south and southwest of the village. They also pushed west through the gulley in the grey zone to Novoselivka, and branched off down two separate treelines to the north and south, reaching the orchards just outside Novoselivka, while approaching the southern bank of the Vovcha River. \nAs a result of these advances, any remaining Ukrainian forces in Sichneve have been operationally encircled (this is the second time this has happened in this village). Also, the situation was clarified north of Sichneve, with Russian forces retaining control over treeline positions there, despite my earlier reports stating that they were in the grey-zone/under Ukrainian control.\n+ ~19.28 km² in favour of Russia.",
      "timestamp": "2025-10-12T13:44:40.651473Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces resumed their assault operations and have completed the capture of the village of Filiya. \nAfter initially crossing the Vovcha River and entrenching in the southern part of the village in late August, the frontline stabilised here. However, over the past 5 days, Russian forces began attacking again, and have managed to push the Ukrainians out of the northern part of the village. \nThey also began advancing into the adjacent forests, approaching the main Ukrainian trench fortification to the north, and have secured new positions in the treelines east and northeast of Filiya.\n+ ~4.48 km² in favour of Russia.",
      "timestamp": "2025-10-12T13:44:40.651487Z"
    },
    {
      "original": "General update from the Pakistan-Afghanistan conflict:\nOver the past 24 hours, fighting erupted between Pakistani and Afghan Taliban forces along the Pakistan-Afghanistan international border following the Pakistani Airforce's strikes against Tehrik-i-Taliban Pakistan (TTP). The clashes involved light weapons, mortar shelling, artillery shelling, tanks, and ATGM strikes. Several Taliban army posts were destroyed, and at least two captured by Pakistani soldiers. \nThe Pakistani Airforce has also continued to strike targets within Afghanistan, primarily against border regions. Both sides entered negotiations after the Afghan Taliban requested a ceasefire, but Pakistan rejected and fighting continued. \nOver the past half hour, the Pakistani Airforce carried out a new round of strikes on Kandahar Province of Afghanistan, reportedly targeting a TTP training centre, as well as an Afghan Taliban HQ. Artillery shelling has also continued in the Nangrahar Province.",
      "timestamp": "2025-10-12T13:44:40.651493Z"
    },
    {
      "original": "Exclusive info from the Russian missile and drone strike on the Dnipro Hydroelectric Powerplant in Zaporizhzhia City on October 10:\nThe second machine hall was completely destroyed, while the first machine hall was undamaged. Additionally, one of the surge gates for the HPP has been opened, reducing the water level. \nAs a result of the damage to the plant, all power generation has been halted and is not yet restored. The images below show what the HPP looked like earlier today.",
      "timestamp": "2025-10-12T13:44:40.651498Z"
    },
    {
      "original": "Exclusive info from the Russian missile and drone strike on the Dnipro Hydroelectric Powerplant in Zaporizhzhia City on October 10:\nThe second machine hall was completely destroyed, while the first machine hall was undamaged. Additionally, one of the surge gates for the HPP has been opened, reducing the water level. \nAs a result of the damage to the plant, all power generation has been halted and is not yet restored. The images below show what the HPP looked like earlier today.",
      "timestamp": "2025-10-12T13:44:40.651503Z"
    },
    {
      "original": "Large and unusual movements of Russian Tu-160 strategic bombers is taking place. \n2 Tu-160Ms redeployed from Anadyr Airbase, Chukotka Autonomous Okrug, to Ukrainka Airbase, Amur Oblast.\n1 Tu-160 redeployed from Borisoglebskoye Airbase, Republic of Tatarstan, to Ukrainka Airbase, Amur Oblast.\n1 Tu-160 is airborne from Engels-2 Airbase, either training or redeploying.\nIt's unclear if the 3 Tu-160s that redeployed to Ukrainka Airbase will be equipped with Kh-101 cruise missiles.",
      "timestamp": "2025-10-12T13:44:40.651509Z"
    },
    {
      "original": "General update from the Pakistan-Afghanistan conflict:  Over the past 24 hours, fighting erupted between Pakistani and Afghan Taliban forces along the Pakistan-Afghanistan international border following the Pakistani Airforce's strikes against Tehrik-i-Taliban…",
      "timestamp": "2025-10-12T13:44:40.651512Z"
    },
    {
      "original": "The Pakistani Airforce published footage showing two of their recent airstrikes on the Afghan Taliban's \"Ismatullah Qarar\" Camp in the city of Spin Buldak, Kandahar Province, Afghanistan.\nCoordinates: 30.98492, 66.34785",
      "timestamp": "2025-10-12T13:44:40.651520Z"
    },
    {
      "original": "The Pakistani Airforce published footage showing two of their recent airstrikes on the Afghan Taliban's \"Ismatullah Qarar\" Camp in the city of Spin Buldak, Kandahar Province, Afghanistan.\nCoordinates: 30.98492, 66.34785",
      "timestamp": "2025-10-12T13:44:40.651526Z"
    },
    {
      "original": "In the Dobropillya direction, and on the northeastern flank of Pokrovsk, Russian forces intensified their assault operations and have made major progress over the past 10 days.\nIn the northeast, at the beginning of October, Russian forces began a concerted effort to regain control over the tactical heights southeast of Volodymyrivka which Ukrainian forces recaptured last month. They began advancing northwest up a gulley and towards the southern bank of the Staryy Reservoir, capturing the treelines between them. These advances, alongside the clearing of the northern street of Novotoretske, forced the AFU to fully withdraw back into Volodymyrivka. \nAt the same time, Russian forces were able to push the Ukrainians back from their forward positions on the western approaches to Poltavka, clearing the northernmost chalk quarry and surrounding positions. They then began attacks through the treelines and forest plantations to the eastern bank of the Staryy Reservoir. \nWith these attacks now complete, under the cover of the fog and rain, two large Russian mechanised columns involving tanks and armoured personnel carriers advanced on Volodymyrivka. The first moved in from the south, advancing up the road and reaching the southern edge of the village. A portion of the vehicles were hit and disabled by Ukrainian FPV drones, however more than 50 Russian soldiers were able to dismount and scatter among the southern part of Volodymyrivka. With the remaining vehicles being able to retreat, these Russian soldiers began clearing the rest of the settlement and captured its central part. The rest of the village is now either in the grey zone, or under Russian control. \nThe second mechanised column advanced down the road from Poltavka towards the rear of Volodymrivka. While more of the vehicles in this column were hit and disabled (with many being hit before reaching the frontline), a number of Russian soldiers were able to dismount and establish control over the forest plantations east of Volodymyrivka, effectively pushing the AFU back into the stronghold village of Shakhove.\nMeanwhile, west of the Kazenyi Torets River, Russian forces were able to consolidate in the southern and central parts of Pankivka, pushing the Ukrainians back into Shakhove. They also improved their positions along the forest plantations towards Shakhove from the west.\nTo the southwest, Russian forces were able to break out of northern Zatyshok, where they established control over the treelines north of the village which were previously in the grey zone. They also re-established control over the central part of Boikivka, as well as the forest plantations and trench fortifications to the west. Additionally, the Russians launched a series of counterattacks from eastern Nykanorivka, recapturing previously lost positions in the northwest of the village, before eventually fully pushing the AFU out of the settlement. With this, Russia was able to eliminate the salient to Boikivka, and have now secured their Kucheriv Yar salient against any Ukrainian encirclement attempts. \nIn the south, Russian forces continued their attacks towards the city of Myrnohrad from the east. They consolidated their positions in the southern part of Novoekonomichne, and began advancing through the forests and treelines towards the village of Balahan. Russian soldiers have entered Balahan, although no consolidation is confirmed yet. Russian infantry was also able to advance from positions west of Mykhailivka, infiltrating and capturing a trench strongpoint and mine shaft no. 2 of the Kapitalna Mine.\n+ ~59.23 km² in favour of Russia.",
      "timestamp": "2025-10-12T13:44:40.651536Z"
    },
    {
      "original": "In the Dobropillya direction, and on the northeastern flank of Pokrovsk, Russian forces intensified their assault operations and have made major progress over the past 10 days.  In the northeast, at the beginning of October, Russian forces began a concerted…",
      "timestamp": "2025-10-12T13:44:40.651539Z"
    },
    {
      "original": "But don't worry - most Pro-Ukrainian maps still have thousands of desperate Russian soldiers encircled in three massive pockets in this direction.",
      "timestamp": "2025-10-12T13:44:40.651543Z"
    },
    {
      "original": "Deepstate has just transferred most of Kupyansk City west of the Oskil River into their dreaded grey-zone.",
      "timestamp": "2025-10-12T13:44:40.651546Z"
    },
    {
      "original": "In the Lyman direction, and on the northern flank of Siversk, Russian forces continued to advance, making new progress in four different areas.\nIn the east, Russian forces were able to clear the remaining Ukrainian positions in the forests directly west of Dronivka, and have reached the railway bridge over the Siverskyi Donets River. They havs also begun pushing south through the forests, down the western bank of the river.\nFurther west, Russian forces continued to develop their attacks in Yampil. After entering Yampil from the north, they continued to push south and have captured part of the centre of the village, including the local church, and have entered the western residential areas. Ukrainian forces are counterattacking from the southwestern streets, slowing down the Russian advance. \nTo the north, Russian forces broke through Ukrainian positions west of the railway crossing and began pushing further west down the railway line through the Yampil Forest. They also secured positions in the forests to the north after separate attacks were carried out. \nFurther north, Russian forces began assault operations from their positions in the forests south of Zarichne. They were able to advance down the Zarichne - Yampil Road, and have cleared additional trenches to the west. Clearing operations are now underway on the Ukrainian salient in the area of the road. \n+ ~4.86 km² in favour of Russia.",
      "timestamp": "2025-10-12T13:44:40.651553Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive towards the city and have made progress in four different areas.\nIn the southeast, under heavy artillery and FPV drone cover, Russian forces continued to advance west through the forested gulley and have captured new trenches. They also established control over new positions in the forests to the north and are approaching the rear of the main Ukrainian strongpoint in the agricultural complex. Ukrainian forces are counterattacking in the forested gulley, slowing down the Russian advance. The Ukrainians are also continuing their attempts at recapturing the agricultural complex within the village limits of Zarichne, but have so far been unsuccessful. \nFurther north, Russian forces continued their assault operations south of Kolodyazi, and have completed the capture of two parallel treelines. From there, they entered the adjacent gulley, and secured positions in the forest plantations, further isolating the Ukrainian pocket in and around the village of Myrne. Additionally, the Russians were able to clear the trench strongpoint at the intersection of two treelines, which Ukrainian forces infiltrated earlier. \nTo the west, Russian forces advanced down two treelines towards the road northeast of Stavky. Additional forces have also managed to complete the capture of the Ukrainian strongpoints in the forested gulley northeast of Drobysheve, while other assault groups cleared the two treelines on the tactical heights to the northwest. From there, the Russians pushed southwest down a treeline and a nearby gulley and established control over positions on the Drobysheve - Zarichne Road. \n+ ~8.18 km² in favour of Russia.",
      "timestamp": "2025-10-12T13:44:40.651559Z"
    },
    {
      "original": "Pakistan confirms that 23 of its soldiers have been killed in the cross-border clashes between them and Afghan Taliban. They also claimed that 200 from the Afghan side (likely including militants from TTP) were killed. \nPakistan is currently confirmed to be in control of 6 Afghan Taliban border posts but claim control over 21. Fighting, including artillery shelling, is still ongoing.",
      "timestamp": "2025-10-12T13:44:40.651563Z"
    },
    {
      "original": "Pakistani soldiers captured an American-made Humvee vehicle used by Afghan Taliban forces after it was left behind at one of their border posts captured by Pakistan.",
      "timestamp": "2025-10-12T13:44:40.651566Z"
    },
    {
      "original": "More Afghan Taliban reinforcements, including Humvees, were seen moving through the Spin Boldak District, Kandahar Provinnce, towards the border with Pakistan.\nApproximate coordinates: 31.31666, 65.96416 (around 58 km from the international border).",
      "timestamp": "2025-10-12T13:44:40.651570Z"
    },
    {
      "original": "The Israeli Prime Minister's Office, along with Al-Arabi, and Israeli Channel 12 report that all Israeli hostages - dead and alive - will be released early tomorrow morning, in exchange for the release of 2,000 Palestinian prisoners.\nThe exact time is reportedly going to be 6am local time, which is just under 14 hours from now.",
      "timestamp": "2025-10-12T13:44:40.651574Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T13:44:40.651577Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T13:44:40.651580Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185157Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185172Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T13:44:41.185179Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T13:44:41.185189Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185198Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185207Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185216Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185225Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185234Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T13:44:41.185242Z"
    }
  ],
  "script_run_time": "2025-10-12T13:44:41.186039Z"
}