{
  "messages": [
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-20T17:56:38.457905Z"
    },
    {
      "original": "🚀\nКАБ з Харківщини на Полтавщину.",
      "timestamp": "2025-10-20T17:56:38.457921Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини курсом на Харківщину (Берестинський район).",
      "timestamp": "2025-10-20T17:56:38.457926Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К з ае \"Саваслейка\"",
      "timestamp": "2025-10-20T17:56:38.457935Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-20T17:56:38.457939Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К з ае \"Саваслейка\"",
      "timestamp": "2025-10-20T17:56:38.457946Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К",
      "timestamp": "2025-10-20T17:56:38.457951Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T17:56:38.457956Z"
    },
    {
      "original": "Суми - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-20T17:56:38.457959Z"
    },
    {
      "original": "БпЛА на Харківщині (Ізюмський район), курс північний.",
      "timestamp": "2025-10-20T17:56:38.457962Z"
    },
    {
      "original": "БпЛА в районі н.п. Мена на Чернігівщині, курс південно-східний.",
      "timestamp": "2025-10-20T17:56:38.457966Z"
    },
    {
      "original": "Ворожий БпЛА південніше Чернігова. Напрямок - північний.",
      "timestamp": "2025-10-20T17:56:38.457969Z"
    },
    {
      "original": "КАБ на Донеччину",
      "timestamp": "2025-10-20T17:56:38.457972Z"
    },
    {
      "original": "🚀\nПуски КАБів на Донеччину та Харківщину із Східного напрямку",
      "timestamp": "2025-10-20T17:56:38.457977Z"
    },
    {
      "original": "🚀\nПуски КАБів на Сумщину",
      "timestamp": "2025-10-20T17:56:38.457981Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курс південно-західний.",
      "timestamp": "2025-10-20T17:56:38.457988Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T17:56:38.457994Z"
    },
    {
      "original": "🚀\nПуски КАБів на Сумщину",
      "timestamp": "2025-10-20T17:56:38.457999Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-20T17:56:38.458005Z"
    },
    {
      "original": "🛵\n БпЛА в Павлоградському районі Дніпропетровщини, курс західний.\n🛵\n БпЛА в Лозівському районі Харківщини, курс південно-західний.\n🛵\n БпЛА в Ніжинському районі Чернігівщини, курс західний.\n🛵\n БпЛА в Корюківському районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-10-20T17:56:38.458016Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-10-20T17:56:38.458021Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-10-20T17:56:38.458027Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-10-20T17:56:38.458032Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини, постійно змінюють напрямок руху.\n🛵\n БпЛА на півдні Чернігівщини, курс південний.",
      "timestamp": "2025-10-20T17:56:38.458038Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n The IDF confirmed carrying out airstrikes in southern Lebanon a short while ago, targeting alleged Hezbollah infrastructure in the Nabatieh area.\nLebanese media earlier reported Israeli airstrikes near the village of Jarmaq in the Litani Basin.\n@wfwitness",
      "timestamp": "2025-10-20T17:56:39.103005Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n The IDF confirmed carrying out airstrikes in southern Lebanon a short while ago, targeting alleged Hezbollah infrastructure in the Nabatieh area.\nLebanese media earlier reported Israeli airstrikes near the village of Jarmaq in the Litani Basin.\n@wfwitness",
      "timestamp": "2025-10-20T17:56:39.103023Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces have made significant progress over the past 5 days and are close to eliminating the Ukrainian salient south of Novopavlivka.\nIn the west, Russian forces continued to expand around the village of Filiya, and were able to collapse the Ukrainian defence northwest of Dachne by securing the treelines and then forcing the AFU to withdraw from their fortified positions in the forest. They also improved their positions to the north, capturing new treeline positions and establishing control over a gulley from the south, now coming within 1.5 km of the southern outskirts of Novopavlivka.\nIn the east, Russian forces continued to clear areas near the Donetsk - Dnipropetrovsk Regional Border. They captured Ukrainian positions in the treelines on the tactical heights north of Novoukrainka, before crossing over the border into the treelines northeast of Dachne, further pressuring the Ukrainian formations in the area of the highway. \nTo the north, the Russians began retaking previously lost positions around Horikhove. They pushed west from the outskirts of Horikhove to the forested areas along the regional border and began clearing treelines on the tactical heights north of the village, crossing over into Dnipropetrovsk Oblast here too. \n+ ~23.68 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103031Z"
    },
    {
      "original": "On the western flank of Pokrovsk, Russian forces resumed their assault operations along the Donetsk - Dnipropetrovsk Regional Border in Molodetske, and have secured important positions south of the railway line.\nAfter accumulating infantry, Russian forces advanced from their foothold in the southern houses of Molodetske, moving north to the railway tracks. They established full control over the village and the parallel treeline to the west and were able to secure positions in the southern railway windbreak. Other forces attacked north up a treeline towards the eastern outskirts of Molodetske, where they too reached the railway line, capturing its southern windbreak. This linked them up with formations west of Udachne, forming a unified front against the western flank of the Pokrovsk Coal Mine on the highest point of the tactical heights. \n+ ~1.15 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103036Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued their offensive in Pokrovsk and have made additional progress south of the railway line.\nAfter securing positions in the Hospital District and the southern part of the Prospecta District, Russian forces began pushing further north. They were able to consolidate in at least 5 more blocks of the Prospecta District and continued to advance north and northwest through the Sobachivka District. \nMeanwhile, infiltrations continue towards the railway line. Russian soldiers and DRGs are operating in all parts of the city south of the tracks, including at the railway station in the city centre, and the highway overpass in the east suburbs. They are also infiltrating deeper into the northwestern industrial zone, where the grey zone now extends beyond the city limits in the direction of Hryshyne. No consolidation has occurred north of the railway line yet.\n+ ~0.61 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103042Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n — Israeli Prime Minister Benjamin Netanyahu:\nIn response to the ceasefire violation, we attacked Hamas yesterday with 153 tons of bombs. We also hit senior commanders. \nA ceasefire is not a license to harm us. \nAt the end of the process, Hamas will be eliminated politically and militarily.\n@TabZLIVE",
      "timestamp": "2025-10-20T17:56:39.103053Z"
    },
    {
      "original": "🇮🇱\n❌\n🇵🇸\n — Israeli Prime Minister Benjamin Netanyahu:\nThe government under my leadership did not accept any of Hamas's demands.\n@TabZLIVE",
      "timestamp": "2025-10-20T17:56:39.103062Z"
    },
    {
      "original": "Permanent ceasefire, am I right?",
      "timestamp": "2025-10-20T17:56:39.103066Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it. \nIt's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions and movements in Gaza).\nI honestly think the goal was to make a peace plan that was borderline acceptable for Hamas, but just slightly too far outside of what they could feasibly agree too, in order to portray them as unwilling to end the war and rebuild some justification for the IDF to continue their operations. \nHamas actually accepting the deal surprised the US and Israel, so now they are relying on ceasefire violations to slowly swing back to a fighting stance.",
      "timestamp": "2025-10-20T17:56:39.103072Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance towards Myrnohrad from the east and have made further progress inside the city limits. \nIn the north, after establishing control over the Kapitalna Mine, Russian forces advanced down the highway to the industrial zone on the outskirts of Myrnohrad, establishing control over it. Using this to accumulate additional infantry, Russian forces broke into the northeastern suburbs of Myrnohrad, establishing control over Travnya 1 Street. Ukrainian forces withdrew from the area and are now repeating their strategy employed with the other Russian breach into the city, with striking every occupied house in an attempt to prevent consolidation and further accumulation of soldiers. In addition to this advance, the Russians were able to establish full control over the wastewater treatment plant and the surrounding areas.\nTo the south, after entering southeastern Myrnohrad and widening the breach in Ukrainian defences, Russian forces began attacking north into the village of Balahan. They entered the southern dachas, and pushed up into the main residential area, linking up with their formations in the forests to the east.\nTo the southwest, despite extensive Ukrainian FPV drone strikes, the Russians were able to consolidate further in the first houses of Myrnohrad, accumulating additional infantry for further attacks. They pushed further west down Stritenska and Syerova Streets and entered the eastern houses of Razina Street. As a result of these attacks, Russia has now secured a 1.3 km-long residential stretch of Myrnohrad, and is within 500 metres of the first high-rise residential buildings. \n+ ~2.86 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103078Z"
    },
    {
      "original": "Zoomed-in maps showing the Russian breaches into northeastern and southeastern Myrnohrad.\nAs Ukrainian supply into the Pokrovsk salient gets worse and worse, the deepest sections of the salient will begin to collapse.",
      "timestamp": "2025-10-20T17:56:39.103083Z"
    },
    {
      "original": "Zoomed-in maps showing the Russian breaches into northeastern and southeastern Myrnohrad.\nAs Ukrainian supply into the Pokrovsk salient gets worse and worse, the deepest sections of the salient will begin to collapse.",
      "timestamp": "2025-10-20T17:56:39.103087Z"
    },
    {
      "original": "In Lviv, TCC mobilisation officers pulled a man out of an ambulance to be arrested and likely sent to the frontline.",
      "timestamp": "2025-10-20T17:56:39.103090Z"
    },
    {
      "original": "In Lviv, TCC mobilisation officers pulled a man out of an ambulance to be arrested and likely sent to the frontline.",
      "timestamp": "2025-10-20T17:56:39.103093Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces are advancing, each taking various positions amid intensified fighting.\nOn the western part of the Kucheriv Yar salient, Russian forces continued stabilisation measures following the Ukrainian counterattacks last month. They were able to once again regain the initiative in the Nove Shakhove area, entering the village from the east and establishing control over most of it. Fighting is ongoing for its western houses which are currently in the grey zone. \nRussian forces have also begun attacks on Vilne from the northeast with its newly accumulated infantry. Fighting is ongoing for the forested areas just outside the village. The Russians are also carrying out attacks on Ivanivka from the southeast in an attempt to bring the village back under their control and level the front southwest of Nove Skakhove. \nAdditional attacks are being carried out northwest of Zatyshok, where Russia is trying to consolidate in the forest plantations in the direction of the railway line in order to solidify their presence on the Zatyshok - Sukhetske line. Ukrainian forces resumed their assault operations towards the treelines south of Nykanorivka, attacking from their positions east of the railway line.\nIn the eastern part of the Kucheriv Yar salient, fierce fighting is ongoing for the Volodymyrivka - Shakhove area. After repelling Russian assaults on northern Volodymyrivka, and inflicting heavy casualties on the initial force dropped off by the earlier mechanised assault, Ukrainian forces began attacking south from the northern street with their newly accumulated infantry, and captured new residential areas in the northern part of the village. Other forces began attacking southeast, establishing control over part of the agricultural complex and advancing down the treeline south of the Novyy Reservoir. \nAt the same time, additional Russian reinforcements were brought into southern Volodymyrivka, which are now trying to counterattack in the centre of the village.  Russian forces are also trying to consolidate in the forest plantations north of Novyy Reservoir again, while the Ukrainians attack through the forest plantations on the southeastern approaches to Shakhove.\n+ ~2.57 km² in favour of Russia.\n+ ~0.55 km² in favour of Ukraine.",
      "timestamp": "2025-10-20T17:56:39.103106Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, as Russian forces penetrate deep into Pokrovsk City, a new series of attacks on Rodynske has begun.\nAfter their initial failed attempts at taking the city, Russia regrouped and refocused their efforts on other areas. Since stabilising the situation in the Kucheriv Yar salient and beginning attacks into Pokrovsk, Russian forces have managed to break into Rodynske and begin fighting for large parts of the city.\nThey advanced west from positions in the area of the mine and terykon, and broke into the high-rise microdistrict in western Rodynske, establishing control over most of it. Other forces expanded their foothold in the city to the low-rise residential areas to the north, where they are now trying to storm the Ukrainian defences in the four-story buildings further west. \nMeanwhile, the Russians were able to break into the northern part of the city - which had a smaller Ukrainian presence - and establish control over large parts of it. Assault operations are now underway towards the city centre from the east, northeast, and north, while intense FAB and artillery bombardment of Ukrainian positions there and in the western suburbs is ongoing.\n+ ~3.94 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103112Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault operations towards the rear of the Kleban-Bykske Reservoir and have managed to secure important positions here.\nDespite previous failed attacks here, Russian forces were able to advance out of Yablunivka to the east and enter the forests north of Oleksandro-Kalynove. With this southern sector secured, other soldiers advanced up the highway, establishing control over several strongpoints and approaching the rear of the reservoir. Attacks were also carried out on the first forests situated behind the reservoir, but they were repelled, mostly by Ukrainian FPV drones (which have been doing most of the work in this sector for some time). \n+ ~1.20 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103117Z"
    },
    {
      "original": "Zelensky accidentally reposted an 18+ Onlyfans model's post on Instagram instead of saving it to his favourites...\nIt was deleted shortly afterwards lol.",
      "timestamp": "2025-10-20T17:56:39.103124Z"
    },
    {
      "original": "Zelensky accidentally reposted an 18+ Onlyfans model's post on Instagram instead of saving it to his favourites...\nIt was deleted shortly afterwards lol.",
      "timestamp": "2025-10-20T17:56:39.103128Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, and have captured positions in three different areas.\nIn the east, Russian forces secured the treelines and forest plantations north of Bila Hora which were previously in the grey zone, levelling the frontline south of the fortified forests. Additional attacks are being carried out on the main forest, as well as on the central part of Predtechyne.\nTo the west, Russian forces advanced back into the Yahidka Dachas southeast of Kostyantynivka, consolidating in the eastern half of them. Russian soldiers are infiltrating further, reaching the Kostyantynivka city limits, as well as the areas behind Predtechyne. \nIn the south, after weeks of assault operations, Russian forces were finally able to consolidate in the southern part of Pleshchiivka, and began attacks to the northwest where they are attempting to entrench in the denser residential areas. \n+ ~4.93 km² in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103134Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive towards Lyman from the east and have made progress in two different areas.\nIn the north, Russian forces were able to eliminate the Ukrainian pocket in and around Myrne after an attack from the north and from the east over the Yampolivka Dam. Additional positions were captured to the south, thereby securing the route north of Zarichne to be used for future offensive actions. \nIn the south, Russian forces continued attacks through the Yampil forest. They advanced for at least 1 km to the west (north of the railway line), while DRGs began infiltrating even deeper towards the southeastern outskirts of Lyman itself. Additionally, as a result of the advances being made in the forests to the south and north, the Russians closed the salient southwest of Zarichne, establishing control over 6 treelines and the northern part of the Yampil Forest. \n+ ~19.56 in favour of Russia.",
      "timestamp": "2025-10-20T17:56:39.103142Z"
    },
    {
      "original": "HIMARS Destroyed: Summary Of Russian Combat Footage From October 19, 2025\nOn October 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-20T17:56:39.752535Z"
    },
    {
      "original": "HIMARS Destroyed: Summary Of Russian Combat Footage From October 19, 2025\nOn October 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-20T17:56:39.752551Z"
    },
    {
      "original": "Lebanese Court Orders Release Of Gaddafi Son Who Was Abducted From Syria\nA judge in Lebanon has ordered the release of Hannibal Gaddafi, the youngest son of the late Libyan leader Muammar Gaddafi, on a bail of $11 million and a travel ban.\nHannibal has been held for nearly a decade in pre-trial detention in a case related to the kidnapping and disappearance of revered Lebanese Shia leader Musa al-Sadr in Libya. The bail ruling was made by Judge Zaher Hamadeh, the judicial investigator in the case of al-Sadr’s disappearance, Lebanon’s official National News Agency reported on October 17.\nAl-Sadr is the founder of the Amal Movement, which is now an ally of Hezbollah. He went missing along with an aide and a journalist in 1978 when they went to meet with then-Libyan leader Muammar Gaddafi.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752561Z"
    },
    {
      "original": "Russian Army Is About To Trap Kiev Forces In Liman\nOn October 20, the Russian military advanced closer to the city of Krasny Liman in the Donetsk direction, threatening to trap Kiev forces behind the Siverskyi Donets River.\nTo the north of Krasny Liman, the Yug [South] Group of Forces broke through Ukrainian defenses north and west of Novoselivka, reaching the Yarova which was located right along the Siverskyi Donets. Kiev forces are almost besieged in the center and eastern parts of Novoselivka, and Russian troops are reportedly entering Yarova.\nThe capture of Yarova, which may be a few days away, could mark the start of the collapse of Ukrainian defenses along the river, all the way down to south of Krasny Liman, where the Yug Group of Force has also made gains.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752571Z"
    },
    {
      "original": "Russian Army Is About To Trap Kiev Forces In Liman\nOn October 20, the Russian military advanced closer to the city of Krasny Liman in the Donetsk direction, threatening to trap Kiev forces behind the Siverskyi Donets River.\nTo the north of Krasny Liman, the Yug [South] Group of Forces broke through Ukrainian defenses north and west of Novoselivka, reaching the Yarova which was located right along the Siverskyi Donets. Kiev forces are almost besieged in the center and eastern parts of Novoselivka, and Russian troops are reportedly entering Yarova.\nThe capture of Yarova, which may be a few days away, could mark the start of the collapse of Ukrainian defenses along the river, all the way down to south of Krasny Liman, where the Yug Group of Force has also made gains.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752579Z"
    },
    {
      "original": "Russian Troops Advance In Pokrovsk And Along Yanchur Line \nOn October 20, the Russian military advanced in several areas from the city of Pokrovsk in the Donetsk direction to the line along the Yanchur River in the Dnepropetrovsk direction.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces began storming the southern part of Myrnohrad from nearby Balahan, which was captured very recently. It’s worth noting that Russian troops are already attempting to advance in the eastern part of the large settlement, although Ukrainian troops are still showing resistance there.\nThe Tsentr Group of Forces made additional gains in Pokrovsk itself, capturing the railway station building in the heart of the city.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752589Z"
    },
    {
      "original": "Russian Troops Advance In Pokrovsk And Along Yanchur Line \nOn October 20, the Russian military advanced in several areas from the city of Pokrovsk in the Donetsk direction to the line along the Yanchur River in the Dnepropetrovsk direction.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces began storming the southern part of Myrnohrad from nearby Balahan, which was captured very recently. It’s worth noting that Russian troops are already attempting to advance in the eastern part of the large settlement, although Ukrainian troops are still showing resistance there.\nThe Tsentr Group of Forces made additional gains in Pokrovsk itself, capturing the railway station building in the heart of the city.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752598Z"
    },
    {
      "original": "Israel’s Secretive Surveillance Jet Spotted Over Syria On Possible Mission Against Iran \nOne of Israel’s secretive Gulfstream G550-based high-altitude surveillance aircraft was spotted flying over southern Syria on October 20, marking the first such sighting since the war with Iran in June.\nA video showing the aircraft over al-Suwayda was shared by a local news blog, with activists from the governorate reporting that the aircraft was escorted by fighter jets.\nThe Israeli Air Force (IAF) operates two special mission versions of the G550, both were locally developed by Israel Aerospace Industries and ELTA Systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752607Z"
    },
    {
      "original": "Israel’s Secretive Surveillance Jet Spotted Over Syria On Possible Mission Against Iran \nOne of Israel’s secretive Gulfstream G550-based high-altitude surveillance aircraft was spotted flying over southern Syria on October 20, marking the first such sighting since the war with Iran in June.\nA video showing the aircraft over al-Suwayda was shared by a local news blog, with activists from the governorate reporting that the aircraft was escorted by fighter jets.\nThe Israeli Air Force (IAF) operates two special mission versions of the G550, both were locally developed by Israel Aerospace Industries and ELTA Systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752615Z"
    },
    {
      "original": "Military Situation In Gaza Strip On October 20, 2025 (Map Update)",
      "timestamp": "2025-10-20T17:56:39.752619Z"
    },
    {
      "original": "U.S. Envoy Warns Israel Could Resume War On Lebanon As Strikes Hit Hezbollah Heartland \nUnited States special envoy for Syria Tom Barrack warned on October 20 that Israel could resume war on Lebanon if the country fails to disarm Hezbollah, all while another wave of strikes hit the heartland of the group in the south of the country.\nBarrack made the warning in a lengthy opinion piece on the prospect of peace in the Middle East that he published on his X account.\n“Should Beirut continue to hesitate, Israel may act unilaterally – and the consequences would be grave,” cautioned Barrack.\n“If Beirut fails to act, Hizballah’s military arm will inevitably face major confrontation with Israel at a moment of Israel’s strength and Iran backed Hizballah’s weakest point,” wrote Barrack, who is also the U.S. envoy to Turkey.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752629Z"
    },
    {
      "original": "U.S. Envoy Warns Israel Could Resume War On Lebanon As Strikes Hit Hezbollah Heartland \nUnited States special envoy for Syria Tom Barrack warned on October 20 that Israel could resume war on Lebanon if the country fails to disarm Hezbollah, all while another wave of strikes hit the heartland of the group in the south of the country.\nBarrack made the warning in a lengthy opinion piece on the prospect of peace in the Middle East that he published on his X account.\n“Should Beirut continue to hesitate, Israel may act unilaterally – and the consequences would be grave,” cautioned Barrack.\n“If Beirut fails to act, Hizballah’s military arm will inevitably face major confrontation with Israel at a moment of Israel’s strength and Iran backed Hizballah’s weakest point,” wrote Barrack, who is also the U.S. envoy to Turkey.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T17:56:39.752639Z"
    },
    {
      "original": "Military Situation In Ukraine On October 20, 2025 (Maps Update)",
      "timestamp": "2025-10-20T17:56:39.752643Z"
    },
    {
      "original": "Military Situation In Ukraine On October 20, 2025 (Maps Update)",
      "timestamp": "2025-10-20T17:56:39.752647Z"
    }
  ],
  "script_run_time": "2025-10-20T17:56:39.753444Z"
}