{
  "messages": [
    {
      "original": "🛵\n Фастів: БпЛА над містом.",
      "timestamp": "2026-01-18T04:04:01.428030Z"
    },
    {
      "original": "🛵\n Чернігів: БпЛА на місто з півдня.",
      "timestamp": "2026-01-18T04:04:01.428047Z"
    },
    {
      "original": "🛵\n БпЛА на Вінниччині,напрямок Немирів.",
      "timestamp": "2026-01-18T04:04:01.428052Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Новоград-Волинського з півночі.",
      "timestamp": "2026-01-18T04:04:01.428060Z"
    },
    {
      "original": "🛵\n БпЛА на Вінниччині,напрямок Гнівань/Жмеринка",
      "timestamp": "2026-01-18T04:04:01.428065Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині, напрямок Васильків.",
      "timestamp": "2026-01-18T04:04:01.428070Z"
    },
    {
      "original": "🛵\n БпЛА з Вінниччини курсом на Хмельниччину.",
      "timestamp": "2026-01-18T04:04:01.428074Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Шепетівку",
      "timestamp": "2026-01-18T04:04:01.428078Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині, повз Боярку курс північний.",
      "timestamp": "2026-01-18T04:04:01.428083Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, напрямок Шостка.",
      "timestamp": "2026-01-18T04:04:01.428087Z"
    },
    {
      "original": "🛵\n БпЛА на Вінниччині, курс північніше Вінниці напрямок Літин",
      "timestamp": "2026-01-18T04:04:01.428092Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-18T04:04:01.428098Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2026-01-18T04:04:01.428103Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2026-01-18T04:04:01.428109Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини в районі Шостки.\n🛵\n БпЛА на Хмельниччині курсом на Старокостянтинів.\n🛵\n БпЛА на межі Житомирщини та Вінниччини курсом на Хмільник.\n🛵\n БпЛА на Харківщині курсом на Валки.\n🛵\n БпЛА на сході Дніпропетровщини курсом на захід.",
      "timestamp": "2026-01-18T04:04:01.428120Z"
    },
    {
      "original": "🛵\n Хмельницький - БпЛА зі сходу у напрямку міста!",
      "timestamp": "2026-01-18T04:04:01.428126Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі східного напрямку.",
      "timestamp": "2026-01-18T04:04:01.428130Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград.",
      "timestamp": "2026-01-18T04:04:01.428135Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-18T04:04:01.428139Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині курсом на Конотоп з півночі.\n🛵\n БпЛА на Полтавщині курсом на Великі Сорочинці.\n🛵\n БпЛА на Дніпропетровщині курсом на Павлоград та Шахтарське.\n🛵\n БпЛА на Запоріжжі курсом на Вільнянськ зі сходу.",
      "timestamp": "2026-01-18T04:04:01.428148Z"
    },
    {
      "original": "Current trends suggest that another large-scale missile and drone attack on Ukraine involving strategic bombers will take place in the next 1-4 days.  Currently I'm trying to determine some additional info about movements, so I will make a follow up post with…",
      "timestamp": "2026-01-18T04:04:01.955878Z"
    },
    {
      "original": "There is information about the possibility of an attack tonight, but this seems highly unlikely to me.\nRussian strategic aviation doesn't seem to have completed it's preparations yet, and there isn't any activity on combat frequencies yet. I will continue to monitor and update if anything changes.",
      "timestamp": "2026-01-18T04:04:01.955891Z"
    },
    {
      "original": "On the northern flank of Kostyantynivka, both Russian and Ukrainian forces have advanced.\nIn the southwest, Ukrainian forces continued their attempts at counterattacking south of the tributary of the Bilenka River, and managed to recapture the western part of Virolyubivka. Fighting continues for the central and eastern parts of the village. Additionally, at some point recently, the Ukrainians cleared out the fields and forested areas to the northwest of Virolyubivka from Russian DRGs.\nIn the northeast, Russian forces continued to incrementally advance towards Markove and captured the agricultural buildings on its southern outskirts, as well as a nearby trench fortification. From there they entered the main part of Markove, where fighting is now ongoing.\n+ ~8.77 km² in favour of Ukraine.\n+ ~1.03 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955900Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance, making new progress on a wide front.\nIn the north, Russian forces pushed further west from the treelines west of Siversk, capturing additional positions there and entering the southern part of the gulley that stretches south from Zakitne. Other assault groups cleared the rest of the gulley from the north. From there, attacks were made on the forests to the west where fighting is now ongoing. \nAdditionally, Russian forces captured more treeline positions on the tactical heights north of Riznykivka and secured the neighbouring forested areas. From there, they advanced further west, reaching and capturing another fortified forest, and entering a larger adjacent forest. \nTo the south, the Russians continued improving their positions in Riznykivka and captured the rest of the eastern part of the village. They were also able to begin taking positions west of the gulley stretching south from Riznykivka, where they advanced southwest down a treeline from the southern outskirts of the village. Furthermore, Russian forces crossed the gulley at a second point further south and secured part of the forest plantations there, before infiltrating the eastern part of the nearby forests. \nIn the southwest, the Russians established control over the last parts of the forests northwest of Pazeno and captured additional forested areas in the gulleys to the south. To the south of the Vasyukivka River, they managed to complete the capture of the village of Bondarne, allowing for some soldiers to infiltrate across the river and enter the first houses of Nykyforivka. They also continued advancing southwest through the fields south of Bondarne where more treeline positions were seized.\n+ ~13.43 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955909Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance east and southeast of Lyman, making new progress in 6 different areas.\nIn the northwest, Russian forces resumed their assault operations in the fields east of Lyman, where they advanced north from the forests and captured a number of positions in the treelines there. \nTo the southwest, the Russians were able to clear out the salient that formed south of Lyman, and began their assaults on the southern outskirts of the city. Fierce fighting is now ongoing for the forested areas west of the highway, where a large grey-zone has formed.\nTo the south, following earlier Ukrainian counterattacks, Russian forces resumed their assault operations in Dibrova and recaptured all of their previously lost positions in the main part of the village. \nTo the southeast, Russian forces continued slowly advancing in Ozerne, and established a foothold in the central part of the village. Other assault groups entered its south-eastern houses, taking up new positions there too. \nTo the east. Russian forces managed to take up positions in the forested areas along the western bank of the Siverskyi Donets River opposite Zakitne, which were previously abandoned by the Ukrainians. They also made additional progress in Zakitne itself, capturing the central part of the village, and began the assault on the hills to the south where Ukraine holds their main presence. As a result of these assaults, Russian soldiers managed to gain a foothold in the strongpoints there, with heavy fighting now ongoing for additional areas. \n+ ~5.90 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955918Z"
    },
    {
      "original": "In the Svyatohirsk direction, Russian forces continued to advance in multiple areas, capturing important positions in the Sviati Hory National Park.\nIn in the northwest, Russian forces continued advancing in the vicinity of Oleksandrivka and captured new positions in the forests to the south in the direction of the Sosnove - Oleksandrivka Road.\nTo the southwest, the Russians advanced south from the railway east of Sosnove, breaking through Ukrainian positions for nearly 2 km and entering the northern outskirts of Svyatohirsk city. They also captured additional positions on the flanks of this spearhead. Meanwhile, Russian DRGs continued infiltrating the eastern part of Svyatohirsk, advancing along the northern bank of the Siverskyi Donets River.\nIn the southeast, Russian forces continued improving their positions in the forests east of Yarova and are approaching the eastern edge of the village.\n+ ~2.87 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955926Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced in Donetsk and Luhansk Oblasts.\nIn the southwest, after consolidating in the area of the school, Russian forces advanced further west and completed the capture of Ridkodub. \nIn the northeast, Russian forces continued to slowly advance in the area of Novojehorivka, and captured the remaining positions in the forest plantations north of the village. \nMeanwhile, Ukrainian forces continued their counterattacks in the Hrekivka area and advanced east of the village, recapturing positions in the treelines there.\n+ ~3.11 km² in favour of Russia.\n+ ~0.42 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955934Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations in the direction of Nova Kruhlyakivka, recapturing previously lost positions there.\nFollowing recent Ukrainian counterattacks, Russian forces began advancing back down three parallel treelines west of Lozova, recapturing two large trench fortifications in the direction of Nova Kruhlyakivka. \n+ ~4.87 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955940Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces continued their assault operations, with Russian forces making new advances in Kupyansk.\nIn the northwest, following repeated assaults, Russian forces managed to consolidate in the northern-most houses of the city, and began attacks to the south down Michurina Street. Other assault groups entered the enterprises in northwestern Kupyansk in the area of the highway, while attacks were also carried out in the direction of Radkivka.  \nTo the southeast, Russian forces managed to recapture most of the northwestern part of the industrial zone, including part of the milk factory. Ukrainian forces are now counterattacking again, attempting to push the Russians back north. Ukrainian clearing operations continued in the central part of Kupyansk. \nMeanwhile, following earlier infiltrations into eastern Podoly, Russian DRGs began infiltrating the southern part of the village, reaching the northeastern outskirts of Kupyansk-Vuzlovyi.\n+ ~0.82 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955948Z"
    },
    {
      "original": "In the Bilyi Kolodyaz and Ternova directions, Russian forces continued their assault operations and have advanced in five different areas. \nIn the east, following a series of unsuccessful Ukrainian counterattacks, Russian forces advanced south from Lyman, capturing positions in the forests outside the village. They also made additional incremental progress through the forests southwest of Lyman, and in the direction of eastern Hrafske.\nTo the northwest, Russian forces captured the western part of Prylipka, as well as the remaining positions in the forests to the south of the village. From there, they began pushing south and southwest in the direction of Hrafske, collapsing most of the remaining Ukrainian defences outside the village. \nIn the west, Russian forces continued incrementally advancing in eastern Startsya, and restarted their assault operations further west. As a result of these new attacks, they managed to gain a foothold in multiple forested areas in the gulleys west of the village.\n+ ~4.88 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955956Z"
    },
    {
      "original": "In the Khotin, Yunakivka, and Myropillya directions, Russian forces continued their assault operations and have advanced in two different areas.\nIn the west, Russsian forces continued advancing south from Andriivka, capturing new positions in the treelines there. Attacks were also carried out on the forest plantations northwest of Mala Morchakivka. \nTo the east, Russian forces restarted their assault operations in the direction of Sadky, and entered the forests north of the village. A grey-zone has formed and fighting is ongoing.\nFurther east, Russian forces restarted their assault operations in the direction of Oleksandriya. Despite an initial failed attack, they were able to recapture a number of positions in the forests just south of the international border. \n+ ~1.58 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955963Z"
    },
    {
      "original": "In the Hlukhiv direction, Russian forces crossed the international border into Sumy Oblast, capturing the village of Komarivka.\nAround three weeks ago, Russian soldiers crossed the Kleven River (which runs along the international border) at multiple points in the direction of Komarivka and Kharkivka. While the attacks on Kharkivka were ultimately repelled, the Russians were able to establish a small bridgehead in Komarivka.\nFrom there, they began to expand the bridgehead to include the rest of the village, and captured parts of the forests to the east and southwest.\n+ ~4.90 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T04:04:01.955970Z"
    },
    {
      "original": "Footage showing two strikes on a Ukrainian HIMARS launcher near the village of Svirok, Chernihiv Oblast, with Russian drones of an unknown type, after it carried out launches into Bryansk Oblast.\nCoordinates: 51.73405, 32.65498",
      "timestamp": "2026-01-18T04:04:01.955977Z"
    },
    {
      "original": "Zelensky has issued a statement claiming that Russia is preparing another large-scale, combined missile and drone attack on Ukraine.\nLast time he did this, there was an attack the same day, however there will be no attack tonight as Russian preparations are not complete yet. \n- 1 Tu-95MS redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast after being equipped with Kh-101 cruise missiles. 7 other Tu-95s (that are used for combat missions) are still stationed at Ukrainka Airbase. \n- 3 Buyan-M corvettes were deployed from Kaspiysk Naval Base, Republic of Dagestan, to the waters of the Caspian Sea. They can launch a maximum of 24 Kalibr cruise missiles.\n- Equipments of Kalibr carriers with missiles at Novorossiysk Naval Base, Kransodar Krai, may also be underway.\n- Additional deliveries of Iskander-M ballistic missiles and Iskander-K cruise missiles to OTRK installations near Ukraine have taken place. \n- Kinzhals launched from MiG-31Ks may also be used, but likely only in conjunction with Kh-101 cruise missiles from strategic bombers. \n- A minimum of 350 Geran-2 drones are expected to be used during this attack.\nIf Tu-95MS and Tu-160 strategic bombers are used, the highest threat is to the western regions of Ukraine, especially energy infrastructure in Lviv and Ivano-Frankivsk Oblasts. This would also increase the likelihood of MiG-31K fighters being involved and decrease the chances of Iskander-Ks being used.\nIf strategic bombers aren't used, the highest threat is to the central and northern regions of Ukraine, especially energy and gas infrastructure in Kyiv and Poltava Oblasts. This would decrease the likelihood of MiG-31Ks being involved and increase the chances of Iskander-Ks being used. \nAs for the claim of possible Oreshnik IRBM launches that have been floating around, there is no actual threat right now. Anyone claiming that is fear mongering or copy-pasting unreliable sources. Iskander-I (Iskander-M with 1,000 range) might be used, but this seems unlikely for the next few weeks.\nInformation continues to be clarified as there have been a lot of inaccurate and conflicting reports recently.",
      "timestamp": "2026-01-18T04:04:01.955989Z"
    },
    {
      "original": "Situation in northern Syria:\nFollowing negotiations between the U.S. and SDF, the SDF agreed to withdraw from most of the rest of their positions west of the Euphrates River in the Aleppo Governorate, including the towns of Dayr Hafir and Maskanah, leaving only their small bridgehead west of the Tishreen Dam. \nThe first withdrawals from frontline positions near Dayr Hafir have already begun, with the main movements expected closer to 7am local time (around 5 hours from the time of writing). The STG has agreed not to target the withdrawing SDF units, who will receive reinforcements to assist in this operation. \nMeanwhile, clashes between the SDF and SNA + STG formations continue in the direction of the Tishreen dam (red square), while both sides continue mutual shelling of other areas with artillery and MLRS.",
      "timestamp": "2026-01-18T04:04:01.955997Z"
    },
    {
      "original": "Russian forces have recaptured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.38 km².",
      "timestamp": "2026-01-18T04:04:01.956002Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast.   Explosions were heard and a large fire broke out at the production buildings.   Atlant Aero specialises in the production of of aircraft and spacecraft. It also produces…",
      "timestamp": "2026-01-18T04:04:01.956005Z"
    },
    {
      "original": "The Ukrainian Navy published high-resolution satellite imagery showing the damage the \"Atlant Aero\" plant sustained after it was hit by at least 1 Neptune cruise missile, and possibly UAVs, in Taganrog, Rostov Oblast.\nThe main damage is to production workshops for drones. This plant produces Molniya FPV drones, as components for Orion drones.",
      "timestamp": "2026-01-18T04:04:01.956009Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on the Kyiv Hydroelectric Power Plant in the city of Vyshhorod, Kyiv Oblast.\nAt least 7 impacts were recorded, with power outages and fluctuations reported.",
      "timestamp": "2026-01-18T04:04:01.956013Z"
    },
    {
      "original": "Kharkiv City is once again under attack from Russian Tornado-S rockets. \nAt least 8 impacts have been recorded so far, targeting the Kharkiv Tractor Plant. A large fire can be seen burning from the impact site.",
      "timestamp": "2026-01-18T04:04:01.956017Z"
    },
    {
      "original": "Kharkiv City is once again under attack from Russian Tornado-S rockets. \nAt least 8 impacts have been recorded so far, targeting the Kharkiv Tractor Plant. A large fire can be seen burning from the impact site.",
      "timestamp": "2026-01-18T04:04:01.956022Z"
    },
    {
      "original": "Update from northern Syria:\nFollowing the SDF withdrawal from most of the Aleppo Governorate west of the Euphrates River, STG government forces began advancing further, collapsing SDF lines south of the river. \n- They advanced east down the M-4 highway, quickly reaching the city of Al Taqbah from the west. \n- They advanced north down the road from the M-42 Highway, capturing the Safiya and Thawra Oil Fields, before entering and establishing control over the Taqbah Airbase. \n- They advanced north up the M-6 Highway from Resafa, capturing Al-Mansurah, before pushing west down the M-4 Highway, reaching Al-Taqbah from the east, while other forces secured the rest of the southern bank of the Euphrates River further east.\nFrom there, an assault on Al Taqbah was launched, with the STG capturing the southern part of the city, including the prison. Fierce street battles are ongoing with the SDF, who are expected to withdraw north over the Euphrates River soon. \nMeanwhile, fighting has begun in the Deir-Ezzor and Raqqah Governorates between tribal Arab groups and the SDF, resulting in the SDF bringing in reinforcements to those areas.",
      "timestamp": "2026-01-18T04:04:01.956030Z"
    },
    {
      "original": "Russian Army Advances Along Road To Slovyansk As Ukrainian Defenses Crumble (Videos) \nOn January 17, the Russian military advanced along the highway leading to the key city of Slovyansk in Donetsk amid signs of a near collapse of Ukrainian defenses there.\nThe Yug [South] Group of Forces captured Privolye, which is located some 20 kilometers to the south of Slovyansk along the E40 highway, according to the Russian Ministry of Defense. Russian troops stormed the settlement just a few days earlier. Kiev forces didn’t put up much resistance.\nAfter capturing the settlement, the troops advanced east towards Bondarne, which is already under control, clearing a pocket of 8,9 square kilometers from Kiev forces.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543634Z"
    },
    {
      "original": "Russian Army Advances Along Road To Slovyansk As Ukrainian Defenses Crumble (Videos) \nOn January 17, the Russian military advanced along the highway leading to the key city of Slovyansk in Donetsk amid signs of a near collapse of Ukrainian defenses there.\nThe Yug [South] Group of Forces captured Privolye, which is located some 20 kilometers to the south of Slovyansk along the E40 highway, according to the Russian Ministry of Defense. Russian troops stormed the settlement just a few days earlier. Kiev forces didn’t put up much resistance.\nAfter capturing the settlement, the troops advanced east towards Bondarne, which is already under control, clearing a pocket of 8,9 square kilometers from Kiev forces.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543651Z"
    },
    {
      "original": "More Ukrainian Troops Surrender In Zaporozhye As Russian Army Advance On Haichur (Videos)\nOn January 17, the Russian military expanded its control along the Haichur River, all while keeping pressure on Kiev forces around the key city of Huliaipole in Zaporozhye.\nPriluky on the western bank of the Haichur was captured by the Vostoke [East] Group of Forces, according to the Russian Ministry of Defense, which said in a statement that the attack on the settlement was led by the 394th Motor Rifle Regiment of the 127th Motor Rifle Division.\nThe ministry added that Kiev forces lost “a large number” of troops and equipment while attempting to hold onto the settlement.\nIn addition, Ukrainian defenses to the west of Huliapipole are about to collapse. Many Ukrainian troops surrendered to the Vostok Group of Forces in the last few days.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543662Z"
    },
    {
      "original": "More Ukrainian Troops Surrender In Zaporozhye As Russian Army Advance On Haichur (Videos)\nOn January 17, the Russian military expanded its control along the Haichur River, all while keeping pressure on Kiev forces around the key city of Huliaipole in Zaporozhye.\nPriluky on the western bank of the Haichur was captured by the Vostoke [East] Group of Forces, according to the Russian Ministry of Defense, which said in a statement that the attack on the settlement was led by the 394th Motor Rifle Regiment of the 127th Motor Rifle Division.\nThe ministry added that Kiev forces lost “a large number” of troops and equipment while attempting to hold onto the settlement.\nIn addition, Ukrainian defenses to the west of Huliapipole are about to collapse. Many Ukrainian troops surrendered to the Vostok Group of Forces in the last few days.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543671Z"
    },
    {
      "original": "U.S. Issues Warning As Syrian Government Forces Corner Kurdish Fighters In Raqqa (Videos)\nThe United States military’s Central Command (CENTCOM) on January 17 issued a warning to the forces of the Islamist-led Syrian Transitional Government (STG) over their ongoing large-scale offensive against the Kurdish-led Syrian Democratic Forces in the north of the country.\nThe battle began in the morning when the STG sent its forces to a wide area to the west of the Euphrates River in the eastern Aleppo countryside. A day earlier the SDF announced its intention to withdraw from the area under an agreement meant to de-escalate tensions with Damascus. However, the deployment of the government began faster than what was agreed on.\nThe government didn’t stop there. It escalated further, designating all areas to the west of the Euphrates as a “closed military zone,” including the city of Tabqa and its surroundings in the southern Raqqa countryside, which were not a part of the original agreement.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543684Z"
    },
    {
      "original": "U.S. Issues Warning As Syrian Government Forces Corner Kurdish Fighters In Raqqa (Videos)\nThe United States military’s Central Command (CENTCOM) on January 17 issued a warning to the forces of the Islamist-led Syrian Transitional Government (STG) over their ongoing large-scale offensive against the Kurdish-led Syrian Democratic Forces in the north of the country.\nThe battle began in the morning when the STG sent its forces to a wide area to the west of the Euphrates River in the eastern Aleppo countryside. A day earlier the SDF announced its intention to withdraw from the area under an agreement meant to de-escalate tensions with Damascus. However, the deployment of the government began faster than what was agreed on.\nThe government didn’t stop there. It escalated further, designating all areas to the west of the Euphrates as a “closed military zone,” including the city of Tabqa and its surroundings in the southern Raqqa countryside, which were not a part of the original agreement.\nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543693Z"
    },
    {
      "original": "Military Situation In Ukraine On January 17, 2026 (Maps Update)",
      "timestamp": "2026-01-18T04:04:02.543697Z"
    },
    {
      "original": "Military Situation In Ukraine On January 17, 2026 (Maps Update)",
      "timestamp": "2026-01-18T04:04:02.543701Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543710Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T04:04:02.543719Z"
    }
  ],
  "script_run_time": "2026-01-18T04:04:02.544503Z"
}