{
  "messages": [
    {
      "original": "🛵\n БпЛА на Чернігівщині повз Куликівку, курс південно-західний.\n🛵\n БпЛА в Павлоградському районі на Дніпропетровщині, постійно змінюють напрямок руху.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-02T19:35:34.498548Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-11-02T19:35:34.498564Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-11-02T19:35:34.498569Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на північ Харківщини!",
      "timestamp": "2025-11-02T19:35:34.498573Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півдні Миколаївщини! Залучено засоби для збиття.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-02T19:35:34.498580Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини, курсом на Київщину.",
      "timestamp": "2025-11-02T19:35:34.498586Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині, курсом на Димер.",
      "timestamp": "2025-11-02T19:35:34.498591Z"
    },
    {
      "original": "🛵\n БпЛА в Корюківському районі Чернігівщини, курс південно-західний.\n🛵\n БпЛА на сході Дніпропетровщини, постійно змінюють напрямок руху.",
      "timestamp": "2025-11-02T19:35:34.498597Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини, курсом на Лозівський район Харківщини.",
      "timestamp": "2025-11-02T19:35:34.498601Z"
    },
    {
      "original": "☄️\n Харківська область - загроза застосування балістичного озброєння!",
      "timestamp": "2025-11-02T19:35:34.498606Z"
    },
    {
      "original": "☄️\n Харківська область - загроза застосування балістичного озброєння!",
      "timestamp": "2025-11-02T19:35:34.498610Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-11-02T19:35:34.498614Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-11-02T19:35:34.498618Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-02T19:35:34.498623Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-02T19:35:34.498627Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини! Залучено засоби для його збиття.",
      "timestamp": "2025-11-02T19:35:34.498632Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-02T19:35:34.498636Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-02T19:35:34.498640Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на схід Харківщини!",
      "timestamp": "2025-11-02T19:35:34.498647Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині, курс південно-західний.",
      "timestamp": "2025-11-02T19:35:34.498651Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-11-02T19:35:34.498655Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-02T19:35:34.498659Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-11-02T19:35:34.498663Z"
    },
    {
      "original": "🛵\n БпЛА в Конотопському районі Сумщини, курс південний.",
      "timestamp": "2025-11-02T19:35:34.498667Z"
    },
    {
      "original": "Explosions in Zaporizhzhia City. MLRS strikes. Power surges are reported.",
      "timestamp": "2025-11-02T19:35:35.032467Z"
    },
    {
      "original": "A Russian reconnaissance drone is operating over Khortytsia Island, flying east towards the Oleksandrivskyi District of Zaporizhzhia City.",
      "timestamp": "2025-11-02T19:35:35.032478Z"
    },
    {
      "original": "Another rocket to Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032486Z"
    },
    {
      "original": "Another rocket to Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032489Z"
    },
    {
      "original": "Explosion in Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032492Z"
    },
    {
      "original": "Explosion in Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032495Z"
    },
    {
      "original": "3rd explosion in Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032498Z"
    },
    {
      "original": "These are Tornado-S rockets. They seem to be targeting this area in the south of the city.",
      "timestamp": "2025-11-02T19:35:35.032501Z"
    },
    {
      "original": "Another rocket to Zaporizhzhia",
      "timestamp": "2025-11-02T19:35:35.032504Z"
    },
    {
      "original": "Explosion in Zaporizhzhia. This time it struck further north.",
      "timestamp": "2025-11-02T19:35:35.032508Z"
    },
    {
      "original": "Footage showing the Tornado-S rocket strikes on Zaporizhzhia City. There are partial water and power outages in the Kosmichnyy and Pivdenny Districts in the southern part of the city. \n(Note: the time on the footage is incorrect).",
      "timestamp": "2025-11-02T19:35:35.032512Z"
    },
    {
      "original": "Russian forces have captured the village of Novooleksandrivka, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~263.\nTotal land area: ~1.06 km².",
      "timestamp": "2025-11-02T19:35:35.032517Z"
    },
    {
      "original": "🇺🇸\n❌\n🏴\n \n— President Trump and Secretary of War Hegseth have both threatened action against Islamic State West Africa Province and Boko Haram on social media today, warning if the Nigerian government doesn't protect Christians against \"Islamic Terrorists\", the Department of War will step in.",
      "timestamp": "2025-11-02T19:35:35.032526Z"
    },
    {
      "original": "Roughly 18 Russian Geran-2 drones attacked Izmail, Odesa Oblast, last night. Impacts were recorded at the  110 kV electrical substation (45.35406, 28.80398), where a large fire is now burning. \nAdditionally, strikes were recorded in the village of Safyany, possibly targeting the solar farm (45.39421, 28.87373).",
      "timestamp": "2025-11-02T19:35:35.032530Z"
    },
    {
      "original": "Last night, a combined attack was carried out on a target near Synyavka, Chernihiv Oblast. Two Iskander-M ballistic missiles and at least six Geran-2 drones were used, all striking the same area.\nOne Iskander-M was launched from an OTRK installation northwest of Klintsy, Bryansk Oblast, and another was launched from an OTRK installation in the vicinity of Khalino Airbase, Kursk Oblast. \nRed arrows: Missiles\nOrange arrows: Drones\nAdditionally, the city of Novhorod-Siverskyi came under attack once again, with explosions being reported.",
      "timestamp": "2025-11-02T19:35:35.032536Z"
    },
    {
      "original": "Changes on the frontline in Ukraine for October 2025:\nYellow = Russian advances\nLight blue = Ukrainian advances\nRussian advances:\nDonetsk Oblast: ~376.38 km²\nDnipropetrovsk Oblast: ~143.92 km²\nZaporizhzhia Oblast: ~103.66 km²\nKharkiv Oblast: ~62.06 km²\nSumy Oblast: ~13.98 km²\nKherson Oblast: ~12.70 km²\nBelgorod Oblast: ~3.98 km²\nTotal: ~716.68 km² (up by 42.05%)\nTotal (excluding Kursk & Belgorod): ~712.70 km²\nUkrainian advances:\nDonetsk Oblast: ~58.46 km²\nKharkiv Oblast: ~11.00 km²\nSumy Oblast: ~2.92 km²\nZaporizhzhia Oblast: ~0.49 km²\nTotal: ~72.87 km² (up by 0.89%).\nNote: This covers net gains for each side. Ukrainian advances that took place on territory Russia occupied within this month will simply be subtracted from the Russian total, and vice versa.",
      "timestamp": "2025-11-02T19:35:35.032554Z"
    },
    {
      "original": "Changes on the frontline in Ukraine for October 2025:\nYellow = Russian advances\nLight blue = Ukrainian advances\nRussian advances:\nDonetsk Oblast: ~376.38 km²\nDnipropetrovsk Oblast: ~143.92 km²\nZaporizhzhia Oblast: ~103.66 km²\nKharkiv Oblast: ~62.06 km²\nSumy Oblast: ~13.98 km²\nKherson Oblast: ~12.70 km²\nBelgorod Oblast: ~3.98 km²\nTotal: ~716.68 km² (up by 42.05%)\nTotal (excluding Kursk & Belgorod): ~712.70 km²\nUkrainian advances:\nDonetsk Oblast: ~58.46 km²\nKharkiv Oblast: ~11.00 km²\nSumy Oblast: ~2.92 km²\nZaporizhzhia Oblast: ~0.49 km²\nTotal: ~72.87 km² (up by 0.89%).\nNote: This covers net gains for each side. Ukrainian advances that took place on territory Russia occupied within this month will simply be subtracted from the Russian total, and vice versa.",
      "timestamp": "2025-11-02T19:35:35.032569Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continue to advance and have made new progress in two different areas.\nIn the south, Russian forces advanced downhill from the tactical heights and established control over the positions east of the gulley and south of the reservoir, with the Ukrainians withdrawing beyond it.\nTo the north, Russian forces advanced from northwestern Novomykolaivka, into the eastern part of Uspenivka. Other forces crossed the bridge over the Yanchur River into central Uspenivka, linking up with the assault groups to the southeast, and beginning a general push towards the western outskirts of the village.\n+ ~5.08 km² in favour of Russia.",
      "timestamp": "2025-11-02T19:35:35.032574Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to quickly advance and have made new progress on both banks of the Yanchur River.\nAfter entering and capturing most of Yehorivka, Russian forces consolidated in the western part of the village and began attacking the neighbouring village of Danylivka. They also advanced south of Yehorivka, capturing treelines on the tactical heights which previously saw significant DRG operations. Further south, they advanced to new treelines southwest of Pryvillya and expanded their zone of control west of Zlahoda.\nTo the northwest, Russian forces advanced further north of the tributary of the Yanchur River. They captured additional positions up the road in the direction of the village of Hai, and completed the capture of Novooleksandrivka after infiltrating the settlement from the south. \nTo the southeast, Russian forces advanced over the tributary and cleared the treelines north of Verbove, linking up the initial bridgehead with the rest of the frontline. \n+ ~23.11 km² in favour of Russia.",
      "timestamp": "2025-11-02T19:35:35.032581Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nRussian forces have continued to make significant advances, and as a result, most of Pokrovsk is now under Russian control.\nWest of Pokrovsk, Russian forces established full control over the railway line from Udachne, and began pushing beyond it to the treelines further north. Additionally, the Russians began advancing up the railway line to Pavlohrad, capturing a 2.2 km section of it, and reaching the small airstrip. They also entered the outskirts of Hryshyne and began fighting for the dachas there.\nIn northern Pokrovsk, Russian forces advanced to the northernmost residential areas and consolidated there. They also crossed the railway line from the city centre at a new point, establishing control over the rest of the fortified industrial zone and underground bunker system, before pushing into the remaining residential areas. \nIn northeastern Pokrovsk, Russian forces entered the high-rise district and established control over the rest of the low-rise residential streets. They also captured most of the rest of the industrial zone, breaking through to the factory on the eastern edge of the city, while other forces secured additional residential areas.\nEast of Pokrovsk, Russian forces completed the capture of the villages of Hnativka and Rih, as well as the adjacent railway line, before advancing to and capturing the treeline further east. They also seized the last part of Novopavlivka.\nSouth of Myrnohrad, Russian forces advanced from the city of Novohrodivka to Sukhyi Yar, capturing the eastern part of the village as well as the treelines to the south. \nIn northern Myrnohrad, Russian forces made additional progress in the low-rise residential areas, advancing in the direction of the city centre, and captured a few more high-rise buildings. They also captured additional areas in the industrial buildings on the northern edge of Myrnohrad.\nMeanwhile, north of Pokrovsk, over the last five days Ukrainian forces infiltrated into the northern part of Rodynske, establishing control over poorly consolidated Russian positions in and around the local school. Fighting is ongoing in this area, but the incursion zone is limited, and the Russians retain control over most of their positions in the city. \n+ ~18.14 km² in favour of Russia.\n+ ~0.73 km² in favour of Ukraine.",
      "timestamp": "2025-11-02T19:35:35.032591Z"
    },
    {
      "original": "During an overnight raid on the Askar Refugee Camp in the West Bank city of Nablus, at least two Israeli soldiers were injured after falling into an ambush from Palestinian fighters. \nPalestinian militants from the local armed group \"Nablus Battalion\" (part of the Palestinian Islamic Jihad) fired on the IDF soldiers with small-arms and detonated pre-prepared IEDs against military vehicles and infantry. The IDF did not comment on the incident, unlike usual. \nArmed groups affiliated with Hamas, the PIJ, and the Al-Aqsa Martyrs Brigades have ramped up their attacks against the IDF in the West Bank in recent weeks, coinciding with the ceasefire in the Gaza Strip. Recently, operations targeted Israeli forces in the cities of Qabatiya, Tubas, Nablus, Beit Ummar, and towns and villages surrounding Israeli-occupied Jenin, mainly involving IED detonations and small-arms attacks, as well as a reconnaissance drone interception.",
      "timestamp": "2025-11-02T19:35:35.032596Z"
    },
    {
      "original": "Pokrovsk Defenses Collapse: Ukraine’s Desperate Attempts To Hold Onto The City Are Failing \nAn attempt to land GUR special forces near Pokrovsk was unsuccessful. Meanwhile, the Russian command has announced a breakthrough in defensive positions to the northeast of Petropavlovka in the Kupyansk sector. The personnel crisis in the Ukrainian Armed Forces is becoming a political problem for the country's leadership.\nRead more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565642Z"
    },
    {
      "original": "Pokrovsk Defenses Collapse: Ukraine’s Desperate Attempts To Hold Onto The City Are Failing \nAn attempt to land GUR special forces near Pokrovsk was unsuccessful. Meanwhile, the Russian command has announced a breakthrough in defensive positions to the northeast of Petropavlovka in the Kupyansk sector. The personnel crisis in the Ukrainian Armed Forces is becoming a political problem for the country's leadership.\nRead more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565656Z"
    },
    {
      "original": "Robot Attacks: Summary Of Russian Combat Footage From November 1, 2025\nOn November 1, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-02T19:35:35.565664Z"
    },
    {
      "original": "Robot Attacks: Summary Of Russian Combat Footage From November 1, 2025\nOn November 1, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-02T19:35:35.565670Z"
    },
    {
      "original": "Japan’s First Female PM Expected To Favor Militarization And Tighten Immigration Policy\nSanae Takaichi of the Liberal Democratic Party became Japan’s first female prime minister with a discourse advocating a liberal economy and criticizing immigrants, at a time when the country is seeing its population age and face serious population decline.\nThis historic achievement is overshadowed by uncertainty regarding the future of Japan’s political stability, which is mired in an internal crisis, partly due to public debt of around $9 trillion — the largest among major global economies, corresponding to more than double the country’s GDP, which ended 2024 at $4 trillion.\nAmong the main factors that led to indebtedness are public spending during the COVID-19 pandemic, aid to struggling farmers, subsidies to help the population cope with inflation, and increased defense spending under the pretext of containing alleged Chinese aggression.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565680Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565688Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565696Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 2, 2025 (Map Update)",
      "timestamp": "2025-11-02T19:35:35.565700Z"
    },
    {
      "original": "The Situation in Kupyansk: The Dire Plight of Ukrainian Servicemen and Prisoner Testimonies\nA complex operational situation remains tense in the Kupyansk area on the Kharkiv direction, and under these conditions, Ukrainian servicemen continue to surrender. The testimonies of captured soldiers from the 14th Separate Mechanized Brigade of the Ukrainian Armed Forces, Yuriy Shapovalenko and Alexey Vinder, paint a picture of the critical situation facing the surrounded formations.\n\"We surrendered ourselves. About four days after we were brought here, we realized we were surrounded by the Russians. Resupply was gone – no ammunition, our water ran out, very little food was left. We ate one can of stew among three men per day. The route across the Oskol River was already cut off – it's all your FPV drones there. Because of that, there was no logistics left. A lot of your soldiers entered the city. So, we decided to come out with a white rag,\" recounted prisoner of war Shapovalenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-02T19:35:35.565708Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-02T19:35:35.565712Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-02T19:35:35.565716Z"
    }
  ],
  "script_run_time": "2025-11-02T19:35:35.566516Z"
}