{
  "messages": [
    {
      "original": "🚀\nКАБи на північ Сумщини!",
      "timestamp": "2025-12-11T11:59:41.713994Z"
    },
    {
      "original": "🛵\n БпЛА з Курської обл., рф \n➡️\n на Сумщину!",
      "timestamp": "2025-12-11T11:59:41.714010Z"
    },
    {
      "original": "🛵\n БпЛА на південному заході Київщини \n➡️\n курсом на північ Білу Церкву.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Городню.\n🛵\n БпЛА на сході Сумщини \n➡️\n курсом на південний захід.\n🛵\n БпЛА на півночі, сході Полтавщини \n➡️\n курсом на Ромни, Кременчук.",
      "timestamp": "2025-12-11T11:59:41.714026Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-12-11T11:59:41.714031Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Чернігів.\n🛵\n БпЛА на Полтавщині \n➡️\n курсом на Кременчук.\n🛵\n БпЛА на сході Харківщини \n➡️\n курсом на Чугуїв, Старий Салтів.\n🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Харківщину.",
      "timestamp": "2025-12-11T11:59:41.714058Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА з півдня \n➡️\n на Запоріжжя.\n🛵\n🛸\n БпЛА на півночі Донеччини.",
      "timestamp": "2025-12-11T11:59:41.714067Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-12-11T11:59:41.714074Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-12-11T11:59:41.714083Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-11T11:59:41.714087Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-11T11:59:41.714095Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 85 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 11 грудня (з 19:00 10 грудня) противник завдав комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА та ракет наземного базування.\nЗагалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 154 засобів повітряного нападу, серед яких:\n - 3 балістичні ракети Іскандер-М/KN-23 (райони пусків – Курська обл., рф);\n- 151 ударний БпЛА типу Shahed, Гербера (близько 120 із них – «шахеди») із напрямків Курськ, Орел, Шаталово, Приморсько-Ахтарськ – рф, Гвардійське, Чауда – ТОТ АР Крим.\nОсновний напрямок удару – Кременчук, на Полтавщині. Також були атаковані Одещина та прифронтові території.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 10.00, протиповітряною обороною збито/подавлено 85 повітряних цілей:\n- 83 ворожих БпЛА типу Shahed, Гербера (безпілотників інших типів);\n- 2 балістичні ракети Іскандер-М/KN-23.\nЗафіксовано влучання 69 ударних БпЛА та однієї балістичної ракети Іскандер-М/KN-23 на 34 локаціях. \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-11T11:59:41.714119Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-11T11:59:41.714123Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-11T11:59:41.714128Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння  зі сходу.",
      "timestamp": "2025-12-11T11:59:41.714132Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-11T11:59:41.714137Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-11T11:59:41.714141Z"
    },
    {
      "original": "🛸\n Повітряна тривога через ворожий БпЛА на півдні Миколаївщини! Залучено засоби для  збиття.",
      "timestamp": "2025-12-11T11:59:41.714148Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область та  на Харківщину зі сходу.",
      "timestamp": "2025-12-11T11:59:41.714152Z"
    },
    {
      "original": "🛸\nВорожий БпЛА поблизу Херсону! Залучено засоби для  збиття.",
      "timestamp": "2025-12-11T11:59:41.714156Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на н.п. Городня.",
      "timestamp": "2025-12-11T11:59:41.714162Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-11T11:59:42.409955Z"
    },
    {
      "original": "Yemen: \n🇾🇪\nOn 4 December, the STC entered the oil fields of Masila Oil Field in Hadramaut and reached positions in Shabwah, from where they attempted to enter the governorate of Marib via Areen Heights. Further north, South Yemeni forces reached Al-Abr, from where they withdrew a few hours after the arrival of YNA reinforcements from Saudi Arabia, with the aim of creating a buffer zone near the border. On 6 December, South Yemeni forces took control of key positions and cities in the governorate of Mahrah, awaiting the arrival of military forces, which began to enter on 8 December. In addition, the STC began to expel Yemeni government authorities and their allies from Aden, a city that aims to become the capital of a new South Yemen.\nMap: [ \nhttps://www.google.com/maps/d/viewer?mid=1k_5mC2oHM9Lj4I5irFA0pkXbqKQ&ll=15.82906164772039%2C47.54899267263452&z=7\n ]",
      "timestamp": "2025-12-11T11:59:42.409970Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:  The yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian…",
      "timestamp": "2025-12-11T11:59:42.409974Z"
    },
    {
      "original": "Update on the situation in Kupyansk:\nThe situation continues to deteriorate for the Russian garrison in the western part of the city, which remains operationally encircled. An information blackout has been imposed by the Russian command, with information sharing resulting in severe punishments. This makes it difficult to determine the exact situation, however based on satellite imagery, geolocations, and reports from various sources, we can draw up a somewhat accurate representation of how things are currently playing out. \nAs I wrote in my last post, Ukrainian forces have managed to block the last supply route for Russian forces in western Kupyansk, which runs along the western bank of the Oskil River. As a result, all supply to the garrison has to be conducted by drones, although this isn't a new phenomenon for this sector. Nevertheless, the Ukrainians failed to consolidate, and Russia has largely repelled the attacks on this area. \nThe Ukrainian command has brought up additional reserves to Kupyansk, including mercenaries, which are continuing the counterattacks, despite heavy losses. However, they are encountering increasing difficulties in securing key areas, despite many instances of poor Russian coordination. Russian FAB glide-bomb strikes have remained unusually low, but are currently focusing on striking the logistical routes into the city. As a result of this, and other Russian strikes, as well as the attack on the dam in Pechenihy, supply for Ukrainian assault groups is becoming increasingly difficult. \nMoreover, Russian forces have begun attempts at eliminating the Ukrainian presence to northeast and north of Radkivka, which has long been a \"thorn\" for Russia which decreased their logistical potential. The outcome of these attacks is unknown, but if successful, they will likely consolidate and reinforce the whole area and attempt to advance south and cut off the Ukrainian spearhead in the northern part of Kupyansk. \nMeanwhile, Ukrainian forces continued making incremental progress within Kupyansk. Control over a number of high-rise buildings and nearby houses in the north was confirmed, although this likely occurred more than two weeks ago. They also managed to recapture the grain elevators just west of the city centre (which the Russians subsequently dropped at least one FAB on) as well as the residential streets to the west. Additionally, despite recent Russian counterattacks in the southwestern Yuvileynyi high-rise micro-district which saw them recover control over the rest of the apartment buildings there, Ukrainian forces were able to consolidate in approximately half of the low-rise residential area to the west. \nThe situation in other parts of western Kupyansk remains very fluid and dynamic. Ukrainian and Russian soldiers continue to hold positions overlapping each other, leading to a complicated mess of small groups of soldiers from each side maneuvering through urban areas and constantly being targeted by drones and artillery. However, the initiative remains firmly with Ukraine, and the first cases of Russian soldiers attempting to cross the Oskil River via the area of the destroyed highway overpass into the eastern part of the city have been recorded. \nMeanwhile, east of the Oskil River, Russian forces continue their assault operations in Petropavlivka. Currently, it appears they are trying to \"save\" the situation in western Kupyansk by securing this key village, eliminating the Ukrainian control in the area of Synkivka, and swinging west to \"link up\" with the garrison via the southeastern suburbs of Kupyansk. However, the Ukrainian defence east of the river is very strong, and Russian advances and consolidation has proven difficult and costly.",
      "timestamp": "2025-12-11T11:59:42.409988Z"
    },
    {
      "original": "Cambodian T-55 tanks can be seen being transported to the frontline.",
      "timestamp": "2025-12-11T11:59:42.409991Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-11T11:59:42.409995Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-11T11:59:42.409998Z"
    },
    {
      "original": "I want to be clear with this now: I want nothing to do with betting or gambling on the war in Ukraine. \nRecently, following the ISW fraud controversy with Polymarket, I keep seeing people suggest that my maps and reports should be used as a deciding factor for determining the outcome of bets. One of those such posts got over 1.6 million views.\nI even had the \"Pentagon Pizza Watch\" account reach out to me asking if my map could be embedded in his external betting service. He proceeded to get angry at me when I pointed out how immoral and scummy it was, and how when he used Deepstate's API, it ultimately got their service temporarily taken down, leaving many people - including humanitarian aid workers - in the dark. \nBetting on a war where hundreds of thousands of people are dying and millions are suffering is immoral and disgusting, and I will never support it or take part in any of it. Your actions on the internet have real life consequences, even if they aren't immediately apparent and obvious to you.",
      "timestamp": "2025-12-11T11:59:42.410004Z"
    },
    {
      "original": "The Thai military reports that Cambodia has launched more than 3,160 BM-21 Grad rockets and carried out 125 drone strikes so far during the renewed conflict.",
      "timestamp": "2025-12-11T11:59:42.410007Z"
    },
    {
      "original": "Russian forces have captured the village of Pazeno, southwestern flank of Siversk, Donetsk Oblast.\nPre-war population: ~16.\nTotal land area: ~0.43 km².\nThe fighting for Pazeno lasted approximately 8 days.",
      "timestamp": "2025-12-11T11:59:42.410013Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-11T11:59:42.410018Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-11T11:59:42.410023Z"
    },
    {
      "original": "Another tanker of the Russian “Shadow fleet” has been hit in the Black Sea by Ukrainian surface drones.",
      "timestamp": "2025-12-11T11:59:42.410029Z"
    },
    {
      "original": "Last night, another combined missile and drone attack was carried out on the city of Kremenchuk, Poltava Oblast.\nAmong the targets hit were the main power plant and the oil refinery. NASA FIRMS picked up a large fire burning at the refinery, despite heavy cloud cover over the city.\n3 Iskander-M ballistic missiles were launched from the vicinity of Kursk City, Kursk Oblast - one of which was equipped with a cluster warhead. The Iskanders likely targeted the refinery.\nApproximately 50 Geran-2 drones were also used. They likely primarily targeted energy infrastructure. \n(Credit to \"\nIntel Cams | OSINT\n\" on YouTube for the first clip)",
      "timestamp": "2025-12-11T11:59:42.410047Z"
    },
    {
      "original": "Last night, another combined missile and drone attack was carried out on the city of Kremenchuk, Poltava Oblast.\nAmong the targets hit were the main power plant and the oil refinery. NASA FIRMS picked up a large fire burning at the refinery, despite heavy cloud cover over the city.\n3 Iskander-M ballistic missiles were launched from the vicinity of Kursk City, Kursk Oblast - one of which was equipped with a cluster warhead. The Iskanders likely targeted the refinery.\nApproximately 50 Geran-2 drones were also used. They likely primarily targeted energy infrastructure. \n(Credit to \"\nIntel Cams | OSINT\n\" on YouTube for the first clip)",
      "timestamp": "2025-12-11T11:59:42.410055Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-11T11:59:42.410059Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-11T11:59:42.410063Z"
    },
    {
      "original": "Over the last few days, the defence of Siversk has completely collapsed. \nA fortress city that the Russians couldn't reach for nearly 4 years is about to be captured after just a week of fighting.\nIf this isn't a sign of how bad Ukraine's manpower shortages have got, I don't know what is.",
      "timestamp": "2025-12-11T11:59:42.410069Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-11T11:59:42.410076Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-11T11:59:42.410083Z"
    },
    {
      "original": "The last Ukrainian defences in the besieged city of Myrnohrad are being breached by Russian forces, who have now entered the city centre. \nThe parts of the pocket still under firm Ukrainian control have decreased to around 2.8 km², compared to ~36 km² at the beginning of the siege. \nNevertheless, Russian FAB glide-bombs continue to strike the remaining blocks still under Ukrainian control. This video shows a FAB-1500 strike on a high-rise apartment building.",
      "timestamp": "2025-12-11T11:59:42.410088Z"
    },
    {
      "original": "Military Situation In Ukraine On December 10, 2025 (Maps Update)",
      "timestamp": "2025-12-11T11:59:43.007329Z"
    },
    {
      "original": "Military Situation In Ukraine On December 10, 2025 (Maps Update)",
      "timestamp": "2025-12-11T11:59:43.007345Z"
    },
    {
      "original": "Ukraine Practically Lost Battle In Siversk (Videos)\nOn December 10, the Russian military expanded its control in Siversk even further amid what appears to be a complete collapse of Ukrainian defenses inside the city.\nThe Yug [South] Group of Forces, which is reported to be in control of most of Siversk’s center and eastern part, is now about to clear the last Ukrainian pockets of resistance in the city’s western part. Russian troops have already crossed the Bakhmutka River, and they are currently battling Kiev forces in urban areas to the west.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007355Z"
    },
    {
      "original": "Ukraine Practically Lost Battle In Siversk (Videos)\nOn December 10, the Russian military expanded its control in Siversk even further amid what appears to be a complete collapse of Ukrainian defenses inside the city.\nThe Yug [South] Group of Forces, which is reported to be in control of most of Siversk’s center and eastern part, is now about to clear the last Ukrainian pockets of resistance in the city’s western part. Russian troops have already crossed the Bakhmutka River, and they are currently battling Kiev forces in urban areas to the west.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007363Z"
    },
    {
      "original": "Ukraine Attacked Another Tanker In Black Sea, British Spy Plane Was Flying Nearby (Video)\nA Ukrainian drone boat hit and disabled a tanker alleged to be a part of Russia’s “shadow fleet” on December 10, Reuters reported, citing Ukrainian officials.\nAccording to the officials, the tanker, identified as Dashan, came under attack as it sailed through Ukraine’s exclusive economic zone in the Black Sea on its way to the Russian port of Novorossiysk.\nThe tanker, which flies the flag of Comoros , was sailing at maximum speed with its transponders turned off and sustained critical damage during the attack, in which powerful explosions hit its stern, the official at the Security Service of Ukraine, more known by its acronym SBU, said.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007371Z"
    },
    {
      "original": "Ukraine Attacked Another Tanker In Black Sea, British Spy Plane Was Flying Nearby (Video)\nA Ukrainian drone boat hit and disabled a tanker alleged to be a part of Russia’s “shadow fleet” on December 10, Reuters reported, citing Ukrainian officials.\nAccording to the officials, the tanker, identified as Dashan, came under attack as it sailed through Ukraine’s exclusive economic zone in the Black Sea on its way to the Russian port of Novorossiysk.\nThe tanker, which flies the flag of Comoros , was sailing at maximum speed with its transponders turned off and sustained critical damage during the attack, in which powerful explosions hit its stern, the official at the Security Service of Ukraine, more known by its acronym SBU, said.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007379Z"
    },
    {
      "original": "CASCADING FAILURES: SEVERSK LOST AMID UKRAINE'S UNSUCCESSFUL SOUTHERN GAMBIT",
      "timestamp": "2025-12-11T11:59:43.007383Z"
    },
    {
      "original": "The Hidden Economy of War: How Ukrainian and EU Elites Cash In on Western Aid\nNew corruption schemes by Ukrainian authorities have been uncovered. Business ventures formed during the war have proven to be extremely profitable. Kyiv and Brussels are profiting handsomely from American and European taxpayers' money.\nThe defense sector has always been, and continues to be, a profitable business. Billion-dollar government contracts stimulate growth in military production. Owners earn substantial profits and increase their influence within the state. This explains why arms lobbies are so prevalent in countries with developed military industries.\nHigh-ranking military officials also rarely stay out of it. Large industrialists obtain defense contracts or government subsidies through them. The lobbying process is usually accompanied by large bribes or help advancing one's career. Everyone benefits from this: both generals and businessmen.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007393Z"
    },
    {
      "original": "Progress Near Siversk: Russia Is About To Capture Key City From Ukraine\nRussian units have taken control of most of Siversk. In the Shypuvate area of the Kharkiv sector, a deployment point for foreign mercenary units was hit by drone strikes. \nDuring their latest talks with Ukrainian President Volodymyr Zelenskyy, European leaders did not discuss the issue of territorial return.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007400Z"
    },
    {
      "original": "Progress Near Siversk: Russia Is About To Capture Key City From Ukraine\nRussian units have taken control of most of Siversk. In the Shypuvate area of the Kharkiv sector, a deployment point for foreign mercenary units was hit by drone strikes. \nDuring their latest talks with Ukrainian President Volodymyr Zelenskyy, European leaders did not discuss the issue of territorial return.\nRead more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007408Z"
    },
    {
      "original": "U.S. Deployed Electronic Attack Jets Near Venezuela, Seized Tanker In Caribbean (Video)\nPresident Donald Trump announced on December 10 that the United States had seized a sanctioned oil tanker off the coast of Venezuela.\n“We’ve just seized a tanker on the coast of Venezuela, large tanker, very large, largest one ever, actually, and other things are happening,” said Trump.\nWhen asked by reporters at the White House what would happen with the oil loaded in the tanker, Trump answered: “We keep it, I guess.”\nIn a post on X, U.S. Attorney General Pam Bondi said that the FBI, Homeland Security and Coast Guard, along with support from the U.S. military, carried out a seizure warrant for a crude tanker used to transport sanctioned oil from Venezuela and Iran.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007418Z"
    },
    {
      "original": "U.S. Deployed Electronic Attack Jets Near Venezuela, Seized Tanker In Caribbean (Video)\nPresident Donald Trump announced on December 10 that the United States had seized a sanctioned oil tanker off the coast of Venezuela.\n“We’ve just seized a tanker on the coast of Venezuela, large tanker, very large, largest one ever, actually, and other things are happening,” said Trump.\nWhen asked by reporters at the White House what would happen with the oil loaded in the tanker, Trump answered: “We keep it, I guess.”\nIn a post on X, U.S. Attorney General Pam Bondi said that the FBI, Homeland Security and Coast Guard, along with support from the U.S. military, carried out a seizure warrant for a crude tanker used to transport sanctioned oil from Venezuela and Iran.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T11:59:43.007428Z"
    }
  ],
  "script_run_time": "2025-12-11T11:59:43.008251Z"
}