{
  "messages": [
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-05T13:51:37.181455Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-11-05T13:51:37.181473Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-05T13:51:37.181479Z"
    },
    {
      "original": "🛵\n БпЛА в Запорізькому районі, курс північно-західний.\n \n🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-05T13:51:37.181485Z"
    },
    {
      "original": "🛵\n БпЛА західніше Запоріжжя, курс південний.",
      "timestamp": "2025-11-05T13:51:37.181490Z"
    },
    {
      "original": "🛵\n БпЛА північніше Нікополя, курс південно-західний.",
      "timestamp": "2025-11-05T13:51:37.181494Z"
    },
    {
      "original": "🛵\n БпЛА в Криворізькому районі Дніпропетровщини, курс західний.\n🛵\n БпЛА  в Синельниківському районі Дніпропетровщини, курс західний.",
      "timestamp": "2025-11-05T13:51:37.181501Z"
    },
    {
      "original": "🛵\n БпЛА в Сумському районі, курс південно-західний.",
      "timestamp": "2025-11-05T13:51:37.181507Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-11-05T13:51:37.181512Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини, курсом на Миколаївщину.",
      "timestamp": "2025-11-05T13:51:37.181516Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград зі східного напрямку.",
      "timestamp": "2025-11-05T13:51:37.181523Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Херсон з півночі.",
      "timestamp": "2025-11-05T13:51:37.181530Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Миколаївщини, курс західний.\n🛵\n БпЛА на Сумщині, курсом на Полтавщину.\n🛵\n БпЛА на межі Харківщини та Полтавщини, курс південний.\n🛵\n БпЛА в Лозівському районі Харківщини, курс південно-західний.",
      "timestamp": "2025-11-05T13:51:37.181539Z"
    },
    {
      "original": "🛵\n БпЛА над акваторією Чорного моря та на півдні Миколаївщини \n➡️\n курсом на Очаків, Коблеве.\n🛵\n БпЛА на південному заході Харківщини \n➡️\n курсом на Красноград, Сахновщину.\n🛵\n БпЛА на сході Полтавщини \n➡️\n курсом на захід.",
      "timestamp": "2025-11-05T13:51:37.181551Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-05T13:51:37.181558Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-05T13:51:37.181563Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-11-05T13:51:37.181567Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Харківщини \n➡️\n курсом на Чаплине.\n🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на Старий Салтів.\n🛵\n БпЛА на сході Сумщини \n➡️\n курсом на Суми.",
      "timestamp": "2025-11-05T13:51:37.181580Z"
    },
    {
      "original": "🛵\n Група БпЛА зі сходу \n➡️\n  на Суми, Хотінь, Степанівку.",
      "timestamp": "2025-11-05T13:51:37.181586Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину, південь  Харківщини!",
      "timestamp": "2025-11-05T13:51:37.181590Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-05T13:51:38.036251Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-05T13:51:38.036265Z"
    },
    {
      "original": "The Ukrainian GUR published footage of new FPV drone strikes on valuable Russian targets in Crimea. \nThe drones targeted:\nA command post of a Russian S-400 air defence system in a combat position.\nA 92N6E multifunctional radar + the autonomous power supply for the S-400 command post. \nAn AORL-1AS airfield surveillance radar.\nP-18 “Terek” general-purpose early warning radar.",
      "timestamp": "2025-11-05T13:51:38.036274Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-05T13:51:38.036278Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-05T13:51:38.036281Z"
    },
    {
      "original": "There is an increased threat of a large-scale, combined Russian missile attack on Ukraine in the next 5 days, not including Kh-101 cruise missiles launched from strategic aviation.\nThe attack would involve Iskander-M ballistic missiles, Iskander-K cruise missiles, and hundreds of Geran-2 drones. The highest threat is to Kyiv, Poltava, Zaporizhzhia and Dnipropetrovsk Oblasts, especially for gas and energy infrastructure. \nAs of now, nothing is certain, but there have been actions noted that suggest preparations for a large attack.",
      "timestamp": "2025-11-05T13:51:38.036286Z"
    },
    {
      "original": "Once this war is over, I think a lot of people are going to consider the fall of Pokrovsk as the \"turning point\" for why Russia won. \nThis is not the case. The fall of Pokrovsk will be just one thing in a chain of events that trend towards collapse for Ukraine, and there is still much more to come. Attritional warfare prioritises degrading your enemy's ability to fight, and the territory you gain in the meantime is - for the most part - a biproduct of successful attrition. \nThere wasn't really a turning point for this war, as Russia is the larger country, with superior capabilities, and the ability to keep up the fight far longer than Ukraine, meaning they are destined to win unless something drastic and revolutionary happens. There are many reasons for this, of which I have outlined in the past. \nPokrovsk is just the \"new Bakhmut\" - the city that the media focuses on. You could even consider it Zelensky's PR city. I don't think Pokrovsk will be forgotten like the 2023 Zaporizhzhia counteroffensive, or the 2024-2025 Kursk offensive, however, as it will probably be labelled as the turning point further down the line.",
      "timestamp": "2025-11-05T13:51:38.036292Z"
    },
    {
      "original": "Currently, there are 40 Tu-95MS strategic bombers stationed at Ukrainka Airbase, Amur Oblast. \n30 Tu-95MS are not used and have remained stationary for a long time.\n1 Tu-95MS is there purely for training purposes. \n7 Tu-95MS redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, and will be equipped with Kh-101 cruise missiles.\n2 Tu-95MS redeployed from Diaghilev Airbase, Ryazan Oblast, to Ukrainka Airbase, and will also be equipped with missiles.\nThe most interesting news is that 4 Tu-160s were previously stationed there, 1 of which was used for training purposes. On October 1, maintenance of 3 Tu-160s used for combat missions was carried out. \nSince then, 1 IL-76MD cargo plane landed there, carrying Kh-101 missiles, which were equipped to the 3 Tu-160s. The 3 Tu-160s equipped with missiles redeployed back to Engels-2 overnight and have since landed there.",
      "timestamp": "2025-11-05T13:51:38.036299Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-05T13:51:38.036304Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-05T13:51:38.036309Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nThe battle for Pokrovsk is approaching its end as the parts of the city begin to come under Russian control.\nIn the northern part of the city, Russian forces established control over new positions in the northernmost residential neighbourhoods, fully establishing themselves along the southern bank of the Hrishynka River. Additionally, they advanced from the area of School no. 14 and the northwestern industrial zone, to the remaining residential streets not yet under Russian control, capturing new positions towards the northern outskirts.\nIn the northeastern part of Pokrovsk, Russian forces consolidated in the southern part of the high-rise district and operationally encircled the remaining Ukrainian formations in the district. To the southeast, they made additional progress in the low-rise residential areas towards the eastern outskirts of the city, establishing control over most of the rest of the buildings there.\nThe most important news comes from the bottleneck of the Myrnohrad pocket. After entering the high-rise district and compromising it as a blocking position against attempts to physically cut off Myrnohrad, Russian forces advanced beyond northeastern Pokrovsk, past the cemetery, and to the highway, where they entrenched in the windbreaks. From there, they entered and captured the soft drinks factory and infiltrated into the northwestern part of Rivne.\nOn the northern end of the bottleneck, the Russians advanced from their positions near the pig farm and reached the high-rise intersection, establishing full control over it and the surrounding positions. They then went on to advance west down the road, where they have reached the next pig farm complex.\nCurrently, there is a ~1.3 km corridor of open fields and a small, disconnected residential area consisting of two short streets connecting the Myrnohrad pocket with the rest of the front. This area is entirely in the grey zone, and movement in and out of the pocket is now practically impossible. The vast majority of formations still in the pocket will either be killed or captured. \nMeanwhile, north of Pokrovsk, Russian forces began counterattacking against the Ukrainian infiltrations in northern Rodynske. They were able to quickly retake the northern low-rise residential area, and begin assaults on the Ukrainian soldiers entrenched in the three-story buildings. Extremely fierce fighting is ongoing here, with both sides making use of extensive fire power. Some Ukrainian soldiers have been encircled, while others still reside in the grey zone. \n+ ~4.57 in favour of Russia.",
      "timestamp": "2025-11-05T13:51:38.036319Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-05T13:51:38.036323Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-05T13:51:38.036327Z"
    },
    {
      "original": "Can confirm. They entered from the south around 2 days ago.",
      "timestamp": "2025-11-05T13:51:38.036330Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-05T13:51:38.036333Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-05T13:51:38.036348Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-05T13:51:38.036353Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-05T13:51:38.036357Z"
    },
    {
      "original": "Map correction in Pokrovsk:\nSome Ukrainian forces remain entrenched in the high-rise buildings of the Dinas District in northeastern Pokrovsk. They are effectively cut off from the rest of the Myrnohrad pocket.",
      "timestamp": "2025-11-05T13:51:38.036361Z"
    },
    {
      "original": "Scenes from the Dinas District of Pokrovsk. Russian soldiers are currently clearing it. \nIt is widely considered to be the last Ukrainian stronghold in the city.",
      "timestamp": "2025-11-05T13:51:38.036365Z"
    },
    {
      "original": "FAILED COUNTERBLOW: UKRAINE'S RODINSKOYE GAMBLE GAME CAME AT A HIGH COST",
      "timestamp": "2025-11-05T13:51:39.035008Z"
    },
    {
      "original": "Amid Ongoing Strikes: Germany Definitively Refuses to Supply Ukraine with Taurus﻿ Missiles, Russia Begins Serial Production of Oreshnik﻿\nOn the night of November 3–4, Russia and Ukraine continued their exchange of strikes. According to a statement from the Russian Ministry of Defence, Russian air defence systems destroyed 85 Ukrainian unmanned aerial vehicles (UAVs). For its part, the Ukrainian Air Force reported repelling a mass attack, during which Russian forces used one Iskander-M ballistic missile, six S-300 anti-aircraft guided missiles, and 130 attack UAVs.\nAccording to Sky News, since the start of 2025, Russia has launched approximately 44,000 Geran UAVs of various modifications at Ukraine, a figure four times higher than the 2024 tally, which saw around 11,000 launches. Against this backdrop, Germany has definitively ruled out the possibility of transferring Taurus cruise missiles to Ukraine, as reported by Handelsblatt citing government sources. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035026Z"
    },
    {
      "original": "Amid Ongoing Strikes: Germany Definitively Refuses to Supply Ukraine with Taurus﻿ Missiles, Russia Begins Serial Production of Oreshnik﻿\nOn the night of November 3–4, Russia and Ukraine continued their exchange of strikes. According to a statement from the Russian Ministry of Defence, Russian air defence systems destroyed 85 Ukrainian unmanned aerial vehicles (UAVs). For its part, the Ukrainian Air Force reported repelling a mass attack, during which Russian forces used one Iskander-M ballistic missile, six S-300 anti-aircraft guided missiles, and 130 attack UAVs.\nAccording to Sky News, since the start of 2025, Russia has launched approximately 44,000 Geran UAVs of various modifications at Ukraine, a figure four times higher than the 2024 tally, which saw around 11,000 launches. Against this backdrop, Germany has definitively ruled out the possibility of transferring Taurus cruise missiles to Ukraine, as reported by Handelsblatt citing government sources. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035036Z"
    },
    {
      "original": "Battle For Oskol: Armed Forces of Ukraine Are Desperately Trying To Break Blockade On Kupyansk\nUnits of the Russian Armed Forces have control of the village of Zaporizhsky in the sector of Pokrovsky. In the Petropavlovsk area of the Kharkiv region, Russian forces continue mopping-up operations. \nThe European Union has provided Kyiv with additional financial support to help maintain public administration and macroeconomic stability.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035043Z"
    },
    {
      "original": "Battle For Oskol: Armed Forces of Ukraine Are Desperately Trying To Break Blockade On Kupyansk\nUnits of the Russian Armed Forces have control of the village of Zaporizhsky in the sector of Pokrovsky. In the Petropavlovsk area of the Kharkiv region, Russian forces continue mopping-up operations. \nThe European Union has provided Kyiv with additional financial support to help maintain public administration and macroeconomic stability.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035050Z"
    },
    {
      "original": "Boats Hit: Summary Of Russian Combat Footage From November 4, 2025\nOn November 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-05T13:51:39.035057Z"
    },
    {
      "original": "Boats Hit: Summary Of Russian Combat Footage From November 4, 2025\nOn November 4, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-05T13:51:39.035064Z"
    },
    {
      "original": "U.S. Plans To Occupy Venezuelan Oil Fields, Target Maduro - Report\nThe administration of United States President Donald Trump has developed a range of options for military action in Venezuela, The New York Times reported on November 4, citing multiple U.S. officials.\nThe first option would involve airstrikes against military facilities, some of which might be involved in facilitating drug trafficking, with the aim of collapsing Venezuelan military support for Maduro.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035071Z"
    },
    {
      "original": "Picking Its Next War: Israel Held High-Level Meeting On Houthi ‘Threat’ \nIsraeli Prime Minister Benjamin Netanyahu and Defense Minister Israel Katz held on November 3 a special discussion with senior security officials, including military and intelligence chiefs, to address the growing threat posed by the Houthis (Ansar Allah) in Yemen.\nAccording to i24NEWS, Netanyahu framed the threat posed by the Houthis as one of the country’s critical security priorities.\nMany observers warned that the end of the war in the Gaza Strip  will enable Israel to escalate on other fronts like Yemen, Lebanon, Iraq and Iran. The Houthis appear to be well aware of that.\nSpeaking on November 4, Abdel-Malik al-Houthi, the leader of the group, ordered his forces to prepare for an inevitable confrontation with Israel.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035080Z"
    },
    {
      "original": "Things Are About To Get Way Worse For Ukrainian Troops In Pokrovsk, Myrnohrad (Videos)\nOn November 5, the Russian military expanded its control within the city of Pokrovsk and began advancing to completely besiege Ukrainian troops in the nearby city of Myrnohrad and the pocket to the south. Kiev, from its side, continued to act as if everything was under control.\nIn its daily briefing, the Russian Ministry of Defense said that the Tsentr [Center] Group of Forces, specifically the assault groups of the 2nd and 51st armies, had repelled multiple Ukrainian counterattacks and made additional gains in the eastern and central parts of Pokrovsk.\nThe most critical advance reportedly took place between Pokrovsk and Myrnohrad, with the Tsentr Group of Forces storming Rivne right in the middle. Once the settlement is captured, Ukrainian troops in Myrnohrad and the pocket south down to Sukhyi Yar, will be completely besieged.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035088Z"
    },
    {
      "original": "Things Are About To Get Way Worse For Ukrainian Troops In Pokrovsk, Myrnohrad (Videos)\nOn November 5, the Russian military expanded its control within the city of Pokrovsk and began advancing to completely besiege Ukrainian troops in the nearby city of Myrnohrad and the pocket to the south. Kiev, from its side, continued to act as if everything was under control.\nIn its daily briefing, the Russian Ministry of Defense said that the Tsentr [Center] Group of Forces, specifically the assault groups of the 2nd and 51st armies, had repelled multiple Ukrainian counterattacks and made additional gains in the eastern and central parts of Pokrovsk.\nThe most critical advance reportedly took place between Pokrovsk and Myrnohrad, with the Tsentr Group of Forces storming Rivne right in the middle. Once the settlement is captured, Ukrainian troops in Myrnohrad and the pocket south down to Sukhyi Yar, will be completely besieged.\nRead more \nHERE",
      "timestamp": "2025-11-05T13:51:39.035096Z"
    }
  ],
  "script_run_time": "2025-11-05T13:51:39.035925Z"
}