{
  "messages": [
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря тримає курс у бік Одещини.",
      "timestamp": "2025-12-31T07:53:20.176277Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії у напрямку Південне/Григорівка.",
      "timestamp": "2025-12-31T07:53:20.176294Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Запоріжжя з  півдня.",
      "timestamp": "2025-12-31T07:53:20.176299Z"
    },
    {
      "original": "🛵\n БпЛА на Кривий Ріг зі сходу.",
      "timestamp": "2025-12-31T07:53:20.176304Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Полтавщини, повз Гадяч у південно-західному напрямку.",
      "timestamp": "2025-12-31T07:53:20.176308Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА на Кам'янське/Дніпро з півдня.",
      "timestamp": "2025-12-31T07:53:20.176316Z"
    },
    {
      "original": "🛵\n Дніпро - в районі міста ворожий БпЛА.",
      "timestamp": "2025-12-31T07:53:20.176320Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря \n➡️\n у напрямку Одеси/Чорноморська.",
      "timestamp": "2025-12-31T07:53:20.176326Z"
    },
    {
      "original": "🛵\n БпЛА на Кривий Ріг!",
      "timestamp": "2025-12-31T07:53:20.176331Z"
    },
    {
      "original": "🛵\n Групи БпЛА з акваторії Чорного моря \n➡️\n у напрямку Одещини.",
      "timestamp": "2025-12-31T07:53:20.176337Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії у напрямку Білгород-Дністровського та Татарбунари.",
      "timestamp": "2025-12-31T07:53:20.176343Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 101 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 31 грудня (з 18:00 30 грудня) противник атакував 127 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Брянськ, Міллерово, Приморсько-Ахтарськ – рф., Чауда – ТОТ АР Крим, близько 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено 101 ворожий БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 20 ударних БпЛА на 11 локаціях. \nВорог продовжує атаку безпілотниками. Триває бойова робота. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-31T07:53:20.176362Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА на Маяки з південного заходу.",
      "timestamp": "2025-12-31T07:53:20.176366Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря на Чорноморське.",
      "timestamp": "2025-12-31T07:53:20.176371Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-31T07:53:20.176377Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря в напрямку на Чорноморськ;\n🛵\n Миколаївщина: БпЛА в напрямку Одещини (вектор - н.п.Буялик);\n🛵\n Сумщина: БпЛА в напрямку Чернігівщини (вектор - н.п.Бахмач);\n🛵\n БпЛА на межі Донеччини і Харківщини кусом на схід Дніпропетровщини.",
      "timestamp": "2025-12-31T07:53:20.176386Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря в напрямку - н.п.Татарбунари.",
      "timestamp": "2025-12-31T07:53:20.176390Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-31T07:53:20.176396Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА в напрямку Прилук з північного сходу.",
      "timestamp": "2025-12-31T07:53:20.176401Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА в напрямку н.п.Маяки з півдня.",
      "timestamp": "2025-12-31T07:53:20.176405Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.\n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.\n📝\nRussian authorities claim 91 drones were intercepted on their way to the state residence.",
      "timestamp": "2025-12-31T07:53:20.712966Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.  \n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.  \n📝\nRussian…",
      "timestamp": "2025-12-31T07:53:20.712984Z"
    },
    {
      "original": "Shocker",
      "timestamp": "2025-12-31T07:53:20.712988Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have captured new positions northeast of Svyatohirsk.\nBuilding on their earlier success, Russian forces advanced further through the Sviati Hory National Park, capturing additional positions further southwest in the direction of the Sosnove - Oleksandrivka. DRGs have since infiltrated through the forests into the area of the Sosnove Railway Station.\n+ ~1.38 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-31T07:53:20.712994Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks and have made additional progress in western Kupyansk.\nFollowing the capture of the Kupyansk Motor Transport College, Ukrainian forces began attacking northwest through the low-rise residential streets in the grey-zone. Other forces who were already advancing southeast from the highway linked up with them, physically encircling the remaining Russian formations entrenched in and around the Yuvileynyi high-rise micro-district. \n+ ~0.27 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-31T07:53:20.713001Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made more progress south of Varachyne.\nFollowing earlier assaults which saw Russia capture Varachyne and the defences south of the village, they continued advancing south, capturing additional treeline positions. Other assault groups advanced further south down the gulley to the east, capturing new positions in the forests there. \nUkrainian forces are responding by heavily striking Russian logistical routes to the Yablunivka - Varachyne sector with FPV drones. As a result of this and somewhat clearer weather conditions at times, Russian movement to and from positions is becoming much more difficult. A significant portion of supplies are now being carried by drone drops. \n+ ~1.35 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-31T07:53:20.713008Z"
    },
    {
      "original": "Iskander on Kharkiv OBlast",
      "timestamp": "2025-12-31T07:53:20.713011Z"
    },
    {
      "original": "Iskander on Kharkiv OBlast",
      "timestamp": "2025-12-31T07:53:20.713015Z"
    },
    {
      "original": "Explosion in Kharkiv",
      "timestamp": "2025-12-31T07:53:20.713018Z"
    },
    {
      "original": "Iskander on Odesa from Crimea",
      "timestamp": "2025-12-31T07:53:20.713021Z"
    },
    {
      "original": "Explosion in Odesa",
      "timestamp": "2025-12-31T07:53:20.713024Z"
    },
    {
      "original": "Around an hour and a half ago, two Russian KAB glide-bombs impacted the southern suburbs of Zaporizhzhia City. \nOne civilian was wounded. No further details are known at this moment.",
      "timestamp": "2025-12-31T07:53:20.713040Z"
    },
    {
      "original": "Around an hour and a half ago, two Russian KAB glide-bombs impacted the southern suburbs of Zaporizhzhia City.   One civilian was wounded. No further details are known at this moment.",
      "timestamp": "2025-12-31T07:53:20.713043Z"
    },
    {
      "original": "Yesterday's strike on Zaporizhzhia City targeted Workshop No. 35 of the Motor Sich Plant. The videos published by the Zaporizhzhia OVA were from outside the houses just across the street.\nCoordinates: 47.83048, 35.19542",
      "timestamp": "2025-12-31T07:53:20.713047Z"
    },
    {
      "original": "It could also be on new years. It's just too difficult to tell right now. I will update you all when I get more concrete information.",
      "timestamp": "2025-12-31T07:53:20.713051Z"
    },
    {
      "original": "So, it appears that the next large-scale, combined missile and drone attack will either take place on the morning of new years', or January 2, with missiles likely targeting between 1am and 8am Kyiv time. \nThis attack will include strategic bombers, as well as other types of missiles.\n- 2 Tu-95MS redeployed from Engels-2 Airbase, Saratov Oblast, to Belaya Airbase, Irkutsk Oblast. They were both equipped with Kh-101 cruise missiles at Engels-2 Airbase.\n- 2 Tu-95MS redeployed from Ukrainka Airbase, Amur Oblast, to Belaya Airbase. They have since been equipped with Kh-101 missiles. \n- 1 Tu-95MS redeployed from Belaya Airbase to Engels-2 Airbase after being equipped with Kh-101 missiles.\n- 5 Tu-95MS remain at Olenya Airbase, Murmansk Oblast. They are equipped/being equipped with Kh-101 missiles.\n- 1-2 Tu-160 strategic bombers at Ukrainka Airbase are equipped with Kh-101 missiles.\n- 2 Tu-22m3 strategic bombers redeployed from Diaghilev Airbase, Ryazan Oblast, to Olenya Airbase. It's unclear if they are equipped with Kh-32 cruise missiles.\n- 3-4 Tu-22m3 bombers are equipped with Kh-32 missiles at Engels-2 Airbase.\n- At least 4 MiG-31K fighters are equipped with Kinzhal hypersonic aeroballistic missiles at Savasleika Airbase, Nizhny Novgorod Oblast.\n- Iskander-M ballistic missiles and possibly Iskander-K cruise missiles were delivered to OTRK installations near Taganrog (Rostov Oblast), Kursk City, and other areas.\n- Statuses of the Black Sea Fleet and missile carriers in the Caspian Sea are unknown, but it's likely that at least one of the two will be used in the next attack.\n- An unprecedented accumulation of Geran-2 and Gerbera drones remains at all major launch sites near Ukraine.",
      "timestamp": "2025-12-31T07:53:20.713063Z"
    },
    {
      "original": "So, it appears that the next large-scale, combined missile and drone attack will either take place on the morning of new years', or January 2, with missiles likely targeting between 1am and 8am Kyiv time.   This attack will include strategic bombers, as well…",
      "timestamp": "2025-12-31T07:53:20.713066Z"
    },
    {
      "original": "Btw, this is essentially just a data dump. I'm not saying all of what is listed here will be used. Clarifications will continue to be made.",
      "timestamp": "2025-12-31T07:53:20.713069Z"
    },
    {
      "original": "And no, this is a not a \"response\" to a non-existent Ukrainian drone attack on Putin's house.\nThis attack has been in preparation for the last 3.5 days. \nRussia has never really done \"responses\" to anything, even if they say they do. Politically and emotionally charged decision-making doesn't seem to be a big thing in the Russian command, unlike some other countries.",
      "timestamp": "2025-12-31T07:53:20.713074Z"
    },
    {
      "original": "And no, this is a not a \"response\" to a non-existent Ukrainian drone attack on Putin's house.  This attack has been in preparation for the last 3.5 days.   Russia has never really done \"responses\" to anything, even if they say they do. Politically and emotionally…",
      "timestamp": "2025-12-31T07:53:20.713077Z"
    },
    {
      "original": "It also wont target Ukrainian government buildings. Ignore the propaganda noise and be smarter than it. These sorts of missile attacks are nothing new.\nEveryone will forget about this in a few days.",
      "timestamp": "2025-12-31T07:53:20.713081Z"
    },
    {
      "original": "Yesterday, due to recent Russian advances, the Pokrovs'ke Territorial Community announced mandatory evacuation orders for 42 settlements, including the town of Pokrovs'ke, in Dnipropetrovsk Oblast.\nInterestingly, a significant portion of the villages named are already under Russian control or contested. This is likely due to a combination of false reports being sent, and the announcement being delayed to support official reports on the defence of the area.",
      "timestamp": "2025-12-31T07:53:20.713085Z"
    },
    {
      "original": "The Chernihiv OVA announced mandatory evacuation orders for civilians in 14 unspecified border villages of Chernihiv Oblast.\nIt's likely that these are: Senkivka, Khrinivka, Klyusy, Hirsk, Yeline, Mistky, Salne, Huta-Studenetska, Baranivka, Bleshnya, Mkhy, Krasni Lozy, Karopvychi, and Hati.",
      "timestamp": "2025-12-31T07:53:20.713089Z"
    },
    {
      "original": "AMK, I don't know if you read the comments at all, but can I have a suggestion about the map reports? They sound dry, detailless and lacks depth. \"They advanced, further taking bla bla. Then they advanced to the south.\" Why? How? What was the key factors in this? What is the probable long term goal in doing so? What are the strategies (or tactics in this case)? I think WeebUnion is a masterclass in this, it's not my place to teach you how to do your job, but I really admire your work overall and you seem like a guy whose open to criticism. Keep up the good work and thanks.",
      "timestamp": "2025-12-31T07:53:20.713092Z"
    },
    {
      "original": "AMK, I don't know if you read the comments at all, but can I have a suggestion about the map reports? They sound dry, detailless and lacks depth. \"They advanced, further taking bla bla. Then they advanced to the south.\" Why? How? What was the key factors in…",
      "timestamp": "2025-12-31T07:53:20.713095Z"
    },
    {
      "original": "I'll respond to this as a post as I'd like more people to see this.\nI add that kind of information in where I can, but these map updates have always been more situational. I just don't have enough information on that stuff, so I omit it most of the time. I could make guesses, but I'm not confident in that considering how much more unpredictable things have gotten as this war evolves.\nAs an analyst, it's important to understand that you don't and can't know everything. For me, speculating about the processes of an attack wouldn't be analysing things. But, I do write separate posts with this sort of information once the dust has settled and things are clarified.",
      "timestamp": "2025-12-31T07:53:20.713100Z"
    },
    {
      "original": "The Ukrainian Group of Forces \"South\" published footage claiming to show their forces clearing Hulyaipole. \nIn reality, the video was recorded in the town of Zaliznychne, 6 km away. \nCoordinates: 47.6475668, 36.1651338",
      "timestamp": "2025-12-31T07:53:20.713108Z"
    },
    {
      "original": "Military Situation In Ukraine On December 30, 2025 (Maps Update)",
      "timestamp": "2025-12-31T07:53:21.388895Z"
    },
    {
      "original": "Military Situation In Ukraine On December 30, 2025 (Maps Update)",
      "timestamp": "2025-12-31T07:53:21.388907Z"
    },
    {
      "original": "Russia’s Mi-34M1, Small Helicopter With Big Attack Potentials, Made Maiden Flight (Video)\nRussia’s Mi-34M1 light helicopter, powered by the new domestically produced VK-650V engine, has completed its maiden flight, CEO of Russian Helicopters Holding - part of the Rostec state corporation - Nikolay Kolesov announced on December 30.\nThe helicopter took off under the guidance of Sergey Barkov, a test pilot at the Mil and Kamov National Helicopter Center, a subsidiary of Russian Helicopters.\nNo military version of the Mi-34M1 has been presented yet, and it is unclear if there are even any plans for such a version. However, the specifications of the helicopter, which are comparable to France’s Aérospatiale Gazelle and the United States’s MD 500, makes it very suitable for such a role.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388917Z"
    },
    {
      "original": "Russia’s Mi-34M1, Small Helicopter With Big Attack Potentials, Made Maiden Flight (Video)\nRussia’s Mi-34M1 light helicopter, powered by the new domestically produced VK-650V engine, has completed its maiden flight, CEO of Russian Helicopters Holding - part of the Rostec state corporation - Nikolay Kolesov announced on December 30.\nThe helicopter took off under the guidance of Sergey Barkov, a test pilot at the Mil and Kamov National Helicopter Center, a subsidiary of Russian Helicopters.\nNo military version of the Mi-34M1 has been presented yet, and it is unclear if there are even any plans for such a version. However, the specifications of the helicopter, which are comparable to France’s Aérospatiale Gazelle and the United States’s MD 500, makes it very suitable for such a role.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388926Z"
    },
    {
      "original": "Russian Army Set To Trap Ukrainian Troops In Krasny Liman \nOn December 30, the Russian military advanced to the north of Krasny Liman in Donetsk, in an apparent effort to cut all roads leading to the key city and trap Ukrainian troops there.\nThe Zapad [West] Group of Forces started a fresh attack from its positions between Yarova and Oleksandrivka towards Sosnove. Russian troops managed to reach the settlement, and battles are now reported to be taking place in its outskirts, where Ukrainian defenses mainly consist of a series of checkpoints.\nThe recent operations of the Zapad Group of Forces were not limited to the area around Krasny Liman in Donetsk. The group also advanced to the north, in Kharkiv, and managed to capture Boguslavka, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388934Z"
    },
    {
      "original": "Russian Army Set To Trap Ukrainian Troops In Krasny Liman \nOn December 30, the Russian military advanced to the north of Krasny Liman in Donetsk, in an apparent effort to cut all roads leading to the key city and trap Ukrainian troops there.\nThe Zapad [West] Group of Forces started a fresh attack from its positions between Yarova and Oleksandrivka towards Sosnove. Russian troops managed to reach the settlement, and battles are now reported to be taking place in its outskirts, where Ukrainian defenses mainly consist of a series of checkpoints.\nThe recent operations of the Zapad Group of Forces were not limited to the area around Krasny Liman in Donetsk. The group also advanced to the north, in Kharkiv, and managed to capture Boguslavka, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388942Z"
    },
    {
      "original": "Military Situation In Syria On December 30, 2025 (Map Update)",
      "timestamp": "2025-12-31T07:53:21.388946Z"
    },
    {
      "original": "Ukraine's \"War Party\" Provocation Targets Putin, Tests U.S.-Russia Rapprochement\nThe \"war party\" is trying to disrupt the negotiations. Kiev carried out a new, high-profile provocation directed against Russian President Vladimir Putin personally. The U.S. reaction to the incident was unexpected.\nOn the night of the 29th, the Kyiv regime launched a large-scale drone attack on the Russian president's primary residence in Valdai, Novgorod Oblast. A total of at least 23 unmanned aerial vehicles were involved. The Russian army's air defense systems destroyed all targets, preventing them from hitting important state facilities. This attack occurred shortly after a telephone conversation between Putin and Trump, during which they discussed the results of negotiations between Trump and Ukrainian President Volodymyr Zelensky.\nAnother round of peace talks between Donald Trump and Volodymyr Zelensky took place on December 29 at the Mar-a-Lago residence in Florida. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388956Z"
    },
    {
      "original": "Ukraine's \"War Party\" Provocation Targets Putin, Tests U.S.-Russia Rapprochement\nThe \"war party\" is trying to disrupt the negotiations. Kiev carried out a new, high-profile provocation directed against Russian President Vladimir Putin personally. The U.S. reaction to the incident was unexpected.\nOn the night of the 29th, the Kyiv regime launched a large-scale drone attack on the Russian president's primary residence in Valdai, Novgorod Oblast. A total of at least 23 unmanned aerial vehicles were involved. The Russian army's air defense systems destroyed all targets, preventing them from hitting important state facilities. This attack occurred shortly after a telephone conversation between Putin and Trump, during which they discussed the results of negotiations between Trump and Ukrainian President Volodymyr Zelensky.\nAnother round of peace talks between Donald Trump and Volodymyr Zelensky took place on December 29 at the Mar-a-Lago residence in Florida. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388965Z"
    },
    {
      "original": "UAE Announces Withdrawal From Yemen, But Saudi Arabia Keeps Pressure On\nThe United Arab Emirates announced on December 30 afternoon that it will end its military presence in Yemen. The announcement came just a few hours after Saudi Arabia launched strikes against allies of Abu Dhabi and called for an Emirate withdrawal from the country within 24 hours.\n“The Ministry of Defense affirms that the UAE has participated as part of the Arab Coalition since 2015 in support of legitimacy in Yemen, in backing international efforts to combat terrorist organizations, and in pursuit of security and stability for the brotherly Yemeni people,” the UAE Ministry of Defense said in a statement.\nThe steps taken by the UAE were not apparently satisfactory enough for Saudi Arabia, which responded by calling on Abu Dhabi to stop any military or financial support to its allies in Yemen. \nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388974Z"
    },
    {
      "original": "THE GEOPOLITICAL TIPPING POINT: A REVIEW OF 2025",
      "timestamp": "2025-12-31T07:53:21.388977Z"
    },
    {
      "original": "Ukrainian Collapse In Zaporizhzhia: Russian Advance Near Prymorske Changes the Operational Picture\nIn the Slaviansk sector, Russian units are advancing west of Yarove and have reached Sosnove. They are also fighting on the approaches to Oleksandrivka and Korovyi Yar. In the Kharkiv sector, advances are being recorded on nearly all fronts, including in the Liman forest area, where four strongpoints have been seized and counterattacks repelled.\nThey resumed active operations south of Konstantynivka and in the Andriivka area. In the Zaporizhzhia sector, near Prymorske, units have reached the southern shore of the Malokaterynivka Estuary and are approaching Zaporizhzhia. In Kupyansk, despite both sides claiming success, heavy street fighting continues.\nPolish Prime Minister Donald Tusk stated that the United States has expressed a willingness to consider providing Ukraine with security guarantees after a peace treaty is concluded.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388985Z"
    },
    {
      "original": "Ukrainian Collapse In Zaporizhzhia: Russian Advance Near Prymorske Changes the Operational Picture\nIn the Slaviansk sector, Russian units are advancing west of Yarove and have reached Sosnove. They are also fighting on the approaches to Oleksandrivka and Korovyi Yar. In the Kharkiv sector, advances are being recorded on nearly all fronts, including in the Liman forest area, where four strongpoints have been seized and counterattacks repelled.\nThey resumed active operations south of Konstantynivka and in the Andriivka area. In the Zaporizhzhia sector, near Prymorske, units have reached the southern shore of the Malokaterynivka Estuary and are approaching Zaporizhzhia. In Kupyansk, despite both sides claiming success, heavy street fighting continues.\nPolish Prime Minister Donald Tusk stated that the United States has expressed a willingness to consider providing Ukraine with security guarantees after a peace treaty is concluded.\nRead more \nHERE",
      "timestamp": "2025-12-31T07:53:21.388993Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 30, 2025\nOn December 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-31T07:53:21.389000Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 30, 2025\nOn December 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-31T07:53:21.389007Z"
    }
  ],
  "script_run_time": "2025-12-31T07:53:21.389853Z"
}