{
  "messages": [
    {
      "original": "🛵\n  БпЛА на півночі від н.п.Холми на Чернігівщині, курс на Сумщину.\n🛵\n  БпЛА на півночі від Запоріжжя, курс на захід.\n🛵\n  БпЛА на півночі Херсонщини, курс на Миколаївщину-Дніпропетровщину.",
      "timestamp": "2026-01-02T04:32:11.609749Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини на Харківщину.\n🛵\n БпЛА на півдні Дніпропетровщини, курс на північ.\n🛵\n БпЛА із Запоріжжя на південь Дніпропетровщини, курс на північ.",
      "timestamp": "2026-01-02T04:32:11.609769Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу Дніпропетровщини на захід.",
      "timestamp": "2026-01-02T04:32:11.609775Z"
    },
    {
      "original": "🛵\n БпЛА рухається по Київському водосховищу, курс на захід.",
      "timestamp": "2026-01-02T04:32:11.609779Z"
    },
    {
      "original": "🛵\n  БпЛА на Запоріжжя та на Камянське  на Дніпропетровщині.",
      "timestamp": "2026-01-02T04:32:11.609784Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2026-01-02T04:32:11.609788Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини, курс на н.п.Божедарівка та Апостолове.\n🛵\n БпЛА на півночі від Запоріжжя, курс на схід.\n🛵\n БпЛА на сході Запоріжжя, курс на н.п. Гуляйполе та на Покровське на Дніпропетровщині.",
      "timestamp": "2026-01-02T04:32:11.609796Z"
    },
    {
      "original": "🛵\n БпЛА на  Дніпро з півдня.",
      "timestamp": "2026-01-02T04:32:11.609800Z"
    },
    {
      "original": "🛵\n  БпЛА на Запоріжжя з півночі.",
      "timestamp": "2026-01-02T04:32:11.609804Z"
    },
    {
      "original": "🛵\n  БпЛА з Херсонщини на Миколаївщину, курс на Миколаїв.",
      "timestamp": "2026-01-02T04:32:11.609809Z"
    },
    {
      "original": "🛵\n  БпЛА на Ізюм на Харківщині та на Камянське на Дніпропетровщині.",
      "timestamp": "2026-01-02T04:32:11.609813Z"
    },
    {
      "original": "🛵\n  БпЛА на Миколаїв з півдня.",
      "timestamp": "2026-01-02T04:32:11.609818Z"
    },
    {
      "original": "🛵\n  БпЛА на заході Чернігівщини, на сході від н.п. Любеч, в напрямку н.п. Ріпки",
      "timestamp": "2026-01-02T04:32:11.609822Z"
    },
    {
      "original": "🛵\n  БпЛА на Чернігів з півдня.",
      "timestamp": "2026-01-02T04:32:11.609827Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2026-01-02T04:32:11.609834Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини курсом на Сновськ.",
      "timestamp": "2026-01-02T04:32:11.609840Z"
    },
    {
      "original": "🛵\n Чернігів - БпЛА зі сходу у напрямку міста.",
      "timestamp": "2026-01-02T04:32:11.609845Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2026-01-02T04:32:11.609851Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Київщину (Вишгородський район).",
      "timestamp": "2026-01-02T04:32:11.609855Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-02T04:32:11.609859Z"
    },
    {
      "original": "Changed course again, flying towards Drabiv, Cherkasy Oblast.",
      "timestamp": "2026-01-02T04:32:12.392458Z"
    },
    {
      "original": "Changed course again, flying towards Drabiv, Cherkasy Oblast.",
      "timestamp": "2026-01-02T04:32:12.392470Z"
    },
    {
      "original": "5 mins from Kaniv, Cherkasy Oblast",
      "timestamp": "2026-01-02T04:32:12.392473Z"
    },
    {
      "original": "Now approaching Drabiv from the northeast.\nAltitude: 500m",
      "timestamp": "2026-01-02T04:32:12.392478Z"
    },
    {
      "original": "Passing by Ozeryshche to Kaniv",
      "timestamp": "2026-01-02T04:32:12.392482Z"
    },
    {
      "original": "Less than 10 km from Kaniv",
      "timestamp": "2026-01-02T04:32:12.392485Z"
    },
    {
      "original": "Less than 10 km from Kaniv",
      "timestamp": "2026-01-02T04:32:12.392488Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2026-01-02T04:32:12.392491Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2026-01-02T04:32:12.392497Z"
    },
    {
      "original": "The missile impacted Kaniv. An explosion was heard. The target doesn't appear to have been the hydroelectric power plant.",
      "timestamp": "2026-01-02T04:32:12.392502Z"
    },
    {
      "original": "Scenes from Kaniv",
      "timestamp": "2026-01-02T04:32:12.392505Z"
    },
    {
      "original": "The Russian MOD announced that a Ukrainian Su-27 fighter was shot down yesterday.\nIt appears that it was shot down over northern Zaporizhzhia Oblast by an R-37 air-to-air missile launched by a Russian Su-35 in the vicinity of Kam'yanka, Zaporizhzhia Oblast, as the Su-27 was approaching its launch lines to launch glide-bombs at Russian positions (likely in the Hulyaipole direction).\nWhile this is not 100% confirmed yet, it seems very likely. What's interesting is that, unlike usual, the Su-35 wasn't covering any Su-34s launching KAB glide-bombs and may have been circling in the area for the Ukrainian jets to arrive.",
      "timestamp": "2026-01-02T04:32:12.392512Z"
    },
    {
      "original": "🇸🇩\n⚡\n- Sudanese drone strike kills Hamid Ali Abubakar, a senior advisor to Hamdan Dagalo, the Head of the Rapid Support Forces, RSF  \nHamid Ali Abubakar served as Commander-in-Chief of the Revolutionary Awakening Council, RAC, an elite brigade loyal to the RSF. Abubakar's RAC were one of the units responsible for \ncapturing al-Fashir\n in the Darfur region, and \ncommitting massacres against civilians\n.",
      "timestamp": "2026-01-02T04:32:12.392521Z"
    },
    {
      "original": "⚡️\n🇷🇺\n🇺🇦\n🇷🇺\nThe Russian Volunteer Corps announced that their leader Denis \"WhiteRex\" Kapustin was killed along the Zaporizhzhia frontline after he was struck by a Russian FPV drone.   @wfwitness",
      "timestamp": "2026-01-02T04:32:12.392529Z"
    },
    {
      "original": "The Ukrainian GUR announced that the head of the Russian Volunteer Corps Denis Kapustin is still alive, and that his death was faked in a counterintelligence operation.\nThey stated that they staged his death to prevent his assassination and deceived the Russian Special Forces into granting them the reported $500,000 USD allocated as the prize money for killing him. The money will go towards funding the Ukrainian Armed Forces.",
      "timestamp": "2026-01-02T04:32:12.392533Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance following the fall of Hulyaipole and have made new progress in two different areas.\nIn the northeast, Russian forces continued advancing through the fields west of Hulyaipole, and entered the neighbouring town of Zaliznychne. They advanced along the two gulleys leading from the western edge of the city, establishing control over positions in the forest plantations there. \nOther forces advanced along the highway, capturing positions in two clusters of agricultural buildings and some treelines, before breaking into Zaliznychne. They quickly captured the railway station in the town centre, however, the 425th Separate Assault Regiment \"Skala\" launched a counterattack and managed to clear them out. Fighting continues in the eastern part of the town.\nIn the southwest, Russian forces restarted assault operations west of Luhivske. They advanced down the road to Bilohiriya and entrenched in the eastern houses of the village. Other forces crossed the Konka River from Novopokrovka and captured the southern part of Bilohirya, linking up with the first assault groups and continuing the clearing of the settlement.\n+ ~4.95 km² in favour of Russia.\n+ ~0.29 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392541Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance west of Pokrovsk and have recaptured the Pokrovsk Coal Mine.\nBuilding on their success southwest of the mine, Russian forces re-entered the western part of the mine from the nearby gulley. Other assault groups entered from the south, allowing for them to re-establish full control over it. \nUsing the mine as an accumulation point, the Russians began pushing further north, capturing new positions in the forest plantations. Infiltrations were carried out to areas as far as 1.9 km north of the mine.\n+ ~2.92 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392548Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have made additional progress north of the Kleban-Bykske Reservoir.\nRussian forces continued pushing west through the forests along the northern bank of the reservoir and captured new positions there as Ukrainian forces continued to withdraw. Other forces advanced from the north, capturing positions in the treelines and reaching the edge of the forests.\n+ ~4.06 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392554Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance in and around Dibrova.\nAfter capturing the central and western part of Dibrova, Russian forces launched their final attacks on the main part of the village, establishing control over the remaining streets. Ukrainian forces retain control over a small residential area along the northern bank of the Sivserkyi Donets River. \nOther assault groups continued clearing the forests to the northwest and expanded their zone of control south of the earlier spearhead.\n+ ~1.35 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392561Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks and have made new progress on both banks of the Oskil River.\nIn the east, Ukrainian forces continued building on their previous successes and advanced further through the forests northwest of Petropavlivka, recapturing new positions there and establishing control over the small residential area that makes up part of the northwestern outskirts of the village. Additionally, they continued advancing northwest from Kucherivka, capturing new positions in the industrial zone and the adjacent forests. \nIn the west, after extensive clearing operations, the last Russian soldiers surrendered in the \"Comb\" stronghold, which is made up of a number of high-rise buildings, allowing for the Ukrainians to establish full control over it and shift their efforts towards completing the capture of the city centre.\n+ ~2.42 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392567Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to slowly advance and have captured new positions in the direction of Kolodyazne.\nAfter entering the small forest southeast of Dvorichanske, Russian forces captured the rest of it, entrenching along both sides of the gulley there. Other assault groups crossed the road northwest of Kamyanka and established control over another forest.\n+ ~1.09 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392573Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their assault operations and have made new progress in two different areas.\nIn the southwest, Russian forces managed to break through Ukrainian positions in the forests west of Lyman and reached the outskirts of Hrafske, consolidating in large parts of the forests. This allowed for them to finally entrench in around half of Prylipka after weeks of unsuccessful assaults, and capture positions in the forests to the south. Additionally, the Russians improved their positions in the forests southwest of Lyman in the direction of the Hrafske - Symynivka Road. \nMeanwhile, additional Ukrainian reinforcements were redeployed to this sector, who are now carrying out intensified counterattacks on Russian positions in southern Vilcha and southern Lyman. So far, the attacks on Vilcha have been unsuccessful and no confirmed advances have been made in Lyman. \nIn the northeast, Russian forces continued incrementally advancing through Vovchanski-Khutory and captured most of the central part of the village. Fighting is ongoing for additional residential streets there.\n+ ~4.60 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392581Z"
    },
    {
      "original": "In the Krasnopillya direction, over the last 10 days Russian forces continued to advance and have captured additional positions west of the international border.\nIn the south, Russian forces captured the last parts of the large forests and managed to capture the Ukrainian strongpoints along the railway line, which are situated at the highest elevation in all of Sumy Oblast. These positions were used by Ukrainian drone operators and contained repeaters for FPV drones used to attack border regions of Belgorod Oblast, including the town of Krasnaya Yaruga. Capturing this point was likely the primary objective of these Russian incursions (on the tactical level).\nIn the north, Russian forces advanced from the village of Vysoke into the nearby gulley and established control over positions in the forest plantations there. \n+ ~1.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392587Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations and have made new progress in the direction of Mala Korchakivka.\nIn the east, following an increase in their ability to supply Oleksiivka from the ground, Russian forces advanced south from the village down the C-191504 Road, capturing new positions in the treelines on either side of it. Other assault groups advanced from the treelines to the northwest, capturing additional positions further south down the road. From there, the Russians began pushing southeast down a treeline in the direction of forests north of Korchakivka.\nIn the west, under the cover of fog, Russian forces continued their assault operations in Andriivka and managed to dislodge the Ukrainians from their last positions in the southwestern houses of the village, thereby establishing full control over the settlement.\n+ ~4.16 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-02T04:32:12.392594Z"
    },
    {
      "original": "Military Situation In Ukraine On December 31, 2025 (Maps Update)",
      "timestamp": "2026-01-02T04:32:13.155703Z"
    },
    {
      "original": "Military Situation In Ukraine On December 31, 2025 (Maps Update)",
      "timestamp": "2026-01-02T04:32:13.155714Z"
    },
    {
      "original": "SOUTHFRONT WISHES YOU HAPPY NEW YEAR 2026!",
      "timestamp": "2026-01-02T04:32:13.155718Z"
    },
    {
      "original": "New Year's Exchange Of Fire: Russian Strikes Target Rail Hubs As Ukrainian Drone Hits Kherson Café. Dozens Killed\nOn the night of January 1, 2026, according to data from the Ukrainian Air Force, Russian forces deployed 205 attack UAVs, of which 176 were shot down/suppressed. One of the key damaged objects was a UAV pilot training center in the Progress settlement of the Chernihiv region. The Russian side stated that precisely from this site, fixed-wing drones are launched at Russian territory, and that the strike destroyed between 10 and 15 crews.\nAt the other end of the country, in western Ukraine, Geran-2 attack UAVs struck the Lutsk oil depot. A column of smoke and fire data recorded by the FIRMS satellite service confirmed the successful hit.\nSpecial attention was paid to transport logistics. Ukrainian Vice Prime Minister Dmytro Kuleba reported a massive attack on the country's key railway hubs, stretching from the Odesa region and Volyn to Sumy region. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T04:32:13.155729Z"
    },
    {
      "original": "New Year's Exchange Of Fire: Russian Strikes Target Rail Hubs As Ukrainian Drone Hits Kherson Café. Dozens Killed\nOn the night of January 1, 2026, according to data from the Ukrainian Air Force, Russian forces deployed 205 attack UAVs, of which 176 were shot down/suppressed. One of the key damaged objects was a UAV pilot training center in the Progress settlement of the Chernihiv region. The Russian side stated that precisely from this site, fixed-wing drones are launched at Russian territory, and that the strike destroyed between 10 and 15 crews.\nAt the other end of the country, in western Ukraine, Geran-2 attack UAVs struck the Lutsk oil depot. A column of smoke and fire data recorded by the FIRMS satellite service confirmed the successful hit.\nSpecial attention was paid to transport logistics. Ukrainian Vice Prime Minister Dmytro Kuleba reported a massive attack on the country's key railway hubs, stretching from the Odesa region and Volyn to Sumy region. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T04:32:13.155738Z"
    },
    {
      "original": "Military Situation In Gaza Strip On January 1, 2026 (Map Update)",
      "timestamp": "2026-01-02T04:32:13.155742Z"
    },
    {
      "original": "Fighting Near Kupyansk in Ukraine: Attempts to Redeploy Ukrainian Reserves Do Not Change the Overall Picture\nIn the Kupyansk sector, the situation has stabilized with elements of a protracted positional struggle. Within this context, the Ukrainian command is attempting to redeploy additional forces and armored vehicles in preparation for new attempts to advance on the city.\nIn the Kharkiv sector, Russian units are advancing south of Vovchansk and have made progress in Vovchanski Khutora. They are also engaged in combat in the forested area between Prylypka and Liman, approaching Hrafske. In the same area, Ukrainian units repelled five counterattacks in the forest near Liman after spending two weeks reinforcing personnel for attacks.\nIn the Dobropillia salient, Russian operations to clear Rodynske continue, as does fighting for Bilytske and Suvorove. In the Konstantynivka area, troops are advancing toward Stepanivka and have taken control of the northern part of the Kleban-Byk Reservoir. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T04:32:13.155751Z"
    },
    {
      "original": "Fighting Near Kupyansk in Ukraine: Attempts to Redeploy Ukrainian Reserves Do Not Change the Overall Picture\nIn the Kupyansk sector, the situation has stabilized with elements of a protracted positional struggle. Within this context, the Ukrainian command is attempting to redeploy additional forces and armored vehicles in preparation for new attempts to advance on the city.\nIn the Kharkiv sector, Russian units are advancing south of Vovchansk and have made progress in Vovchanski Khutora. They are also engaged in combat in the forested area between Prylypka and Liman, approaching Hrafske. In the same area, Ukrainian units repelled five counterattacks in the forest near Liman after spending two weeks reinforcing personnel for attacks.\nIn the Dobropillia salient, Russian operations to clear Rodynske continue, as does fighting for Bilytske and Suvorove. In the Konstantynivka area, troops are advancing toward Stepanivka and have taken control of the northern part of the Kleban-Byk Reservoir. \n👉\n Read more \nHERE",
      "timestamp": "2026-01-02T04:32:13.155760Z"
    },
    {
      "original": "Military Situation In Ukraine On January 1, 2026 (Maps Update)",
      "timestamp": "2026-01-02T04:32:13.155763Z"
    },
    {
      "original": "Military Situation In Ukraine On January 1, 2026 (Maps Update)",
      "timestamp": "2026-01-02T04:32:13.155768Z"
    }
  ],
  "script_run_time": "2026-01-02T04:32:13.156530Z"
}