{
  "messages": [
    {
      "original": "🛵\n БпЛА на сході Харківщини, в напрямку Харкова.\n🛵\n БпЛА на півночі від Сум, курс на росію.",
      "timestamp": "2025-12-24T04:04:21.155478Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-24T04:04:21.155493Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-24T04:04:21.155499Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-24T04:04:21.155503Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Харків.",
      "timestamp": "2025-12-24T04:04:21.155508Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Березну.\n🛵\n БпЛА на Полтавщині курсом на Лубни.\n🛵\n БпЛА на Сумщині курсом на Глухів та Суми.",
      "timestamp": "2025-12-24T04:04:21.155516Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-24T04:04:21.155520Z"
    },
    {
      "original": "🛵\n Чернігів - БпЛА зі сходу у напрямку міста!",
      "timestamp": "2025-12-24T04:04:21.155524Z"
    },
    {
      "original": "🚀\nКАБ курсом на Запоріжжя.",
      "timestamp": "2025-12-24T04:04:21.155529Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі.",
      "timestamp": "2025-12-24T04:04:21.155533Z"
    },
    {
      "original": "🚀\nРакетна небезпека в областях, де оголошена тривога!",
      "timestamp": "2025-12-24T04:04:21.155541Z"
    },
    {
      "original": "🛵\n БпЛА з Полтавщини на Київщину (Бориспільський район).\n🛵\n БпЛА на межі Чернігівщини на Полтавщини.\n🛵\n Група БпЛА з Сумщини на Чернігівщину та Полтавщину.",
      "timestamp": "2025-12-24T04:04:21.155549Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-24T04:04:21.155553Z"
    },
    {
      "original": "🛵\n Херсон - БпЛА зі сходу у напрямку міста!",
      "timestamp": "2025-12-24T04:04:21.155558Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-24T04:04:21.155562Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря курсом на Одещину (Білгород-Дністровський район).",
      "timestamp": "2025-12-24T04:04:21.155567Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря курсом на Одещину (Білгород-Дністровський район).",
      "timestamp": "2025-12-24T04:04:21.155571Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Затоку.",
      "timestamp": "2025-12-24T04:04:21.155575Z"
    },
    {
      "original": "Швидкісна ціль на Харків з півночі.",
      "timestamp": "2025-12-24T04:04:21.155579Z"
    },
    {
      "original": "Друга швидкісна ціль на Харків з півночі.",
      "timestamp": "2025-12-24T04:04:21.155582Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини на Полтавщину.",
      "timestamp": "2025-12-24T04:04:21.155586Z"
    },
    {
      "original": "2 Kinzhals on Chernihiv Oblast",
      "timestamp": "2025-12-24T04:04:21.821455Z"
    },
    {
      "original": "Flying further to Kyiv Oblast",
      "timestamp": "2025-12-24T04:04:21.821466Z"
    },
    {
      "original": "Flying further to Kyiv Oblast",
      "timestamp": "2025-12-24T04:04:21.821470Z"
    },
    {
      "original": "3 in total. Flying one after another.",
      "timestamp": "2025-12-24T04:04:21.821473Z"
    },
    {
      "original": "2 Kinzhals to Shepetivka, Khmelnytskyi Oblast.\n1 Kinzhal to Hostomel, Kyiv Oblast.",
      "timestamp": "2025-12-24T04:04:21.821477Z"
    },
    {
      "original": "2 Kinzhals to Shepetivka, Khmelnytskyi Oblast. 1 Kinzhal to Hostomel, Kyiv Oblast.",
      "timestamp": "2025-12-24T04:04:21.821481Z"
    },
    {
      "original": "50 km from Shepetivka",
      "timestamp": "2025-12-24T04:04:21.821484Z"
    },
    {
      "original": "Hostomel",
      "timestamp": "2025-12-24T04:04:21.821487Z"
    },
    {
      "original": "Correction: 2 past Hostomel, not 1",
      "timestamp": "2025-12-24T04:04:21.821491Z"
    },
    {
      "original": "2 Kinzhals are flying further to Burshtyn, Ivano-Frankivsk Oblast.",
      "timestamp": "2025-12-24T04:04:21.821494Z"
    },
    {
      "original": "Explosions in Shepetivka, Khmelnytskyi Oblast.",
      "timestamp": "2025-12-24T04:04:21.821497Z"
    },
    {
      "original": "The remaining 2 Tu-95MS carried out launch maneuvers from Arkhangelsk Oblast. \nIf these are real, they should enter Ukrainian airspace in the next 70-100 minutes.",
      "timestamp": "2025-12-24T04:04:21.821501Z"
    },
    {
      "original": "The remaining 2 Tu-95MS carried out launch maneuvers from Arkhangelsk Oblast.   If these are real, they should enter Ukrainian airspace in the next 70-100 minutes.",
      "timestamp": "2025-12-24T04:04:21.821505Z"
    },
    {
      "original": "These launches were likely simulated, meaning that the missile attack (or at least most of it) is now over. More than 30 missiles of various types were used. I will publish a full report + the consequences later on. \nIf you wish to support my work, you can do so here: \nhttps://buymeacoffee.com/amk_mapping\n. \nThank you for following along.",
      "timestamp": "2025-12-24T04:04:21.821511Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~14 Kh-101 cruise missiles launched from 7 Tu-95MS strategic bombers at their launch lines in southern Nizhny Novgorod Oblast.\n~6 Kh-101 cruise missiles launched from 3 Tu-95MS strategic bombers at their launch lines in Kalachyovksy District, Volgograd Oblast.\n~10 Kh-101 cruise missiles launched from 2 Tu-160M strategic bombers at their launch lines in southern Nizhny Novgorod Oblast.\n~4 Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31K fighters at their launch lines in the vicinity of Lipetsk City, Lipetsk Oblast.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 9 Kh-101 cruise missiles.\n-----------------------\nThe main targets for this strike were Ukrainian energy infrastructure. The following was targeted:\n\"Zhytomyr\" 330 kV electrical substation, Zhytomyr Oblast (50.29100, 28.69980) by ~5 Kh-101s.\n\"Shepetivka\" 330 kV electrical substation, Khmelnytskyi Oblast (50.14639, 27.0579) by ~9 Kh-101s and ~4 Kinzhals.\nUnknown target in southern Khmelnytskyi Oblast by ~5 Kh-101s\nUnknown target near the Ivano-Frankivsk - Ternopil border by ~5 Kh-101s\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2025-12-24T04:04:21.821527Z"
    },
    {
      "original": "Smoke was seen rising over Zhytomyr city following a series of Russian Kh-101 cruise missile strikes this morning. \nThe strikes targeted the city's 330 kV electrical substation, resulting in widespread power outages.",
      "timestamp": "2025-12-24T04:04:21.821534Z"
    },
    {
      "original": "This morning, a Russian Geran-2 drone struck the roof of an apartment building in Kyiv.\nJudging by the speed of the drone, the altitude change, and how it was tilting towards the end of its flight, it was likely under the influence of Ukrainian electronic warfare.\nAt least four civilians were injured.",
      "timestamp": "2025-12-24T04:04:21.821540Z"
    },
    {
      "original": "This morning, a Russian Geran-2 drone struck the roof of an apartment building in Kyiv.\nJudging by the speed of the drone, the altitude change, and how it was tilting towards the end of its flight, it was likely under the influence of Ukrainian electronic warfare.\nAt least four civilians were injured.",
      "timestamp": "2025-12-24T04:04:21.821545Z"
    },
    {
      "original": "Overnight, dozens of Russian Geran-2 drones attacked the city of Rivne. \nThe main target was the city's 330 kV electrical substation, where a large fire subsequently broke out. Widespread power outages are reported.",
      "timestamp": "2025-12-24T04:04:21.821549Z"
    },
    {
      "original": "Overnight, dozens of Russian Geran-2 drones attacked the city of Rivne. \nThe main target was the city's 330 kV electrical substation, where a large fire subsequently broke out. Widespread power outages are reported.",
      "timestamp": "2025-12-24T04:04:21.821557Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their offensive and have made significant progress over the last few days.\nFollowing a brief partial-stabilisation of the situation, Russian forces intensified their assault operations once again and collapsed the northern section of Ukraine's defence. They repelled the most recent Ukrainian counterattacks north of the Haichur River which were aimed at expanding their bridgehead and began pushing back from the area of the agricultural buildings, eventually eliminating Ukraine's bridgehead altogether. \nFrom there, building on their momentum, Russian forces crossed the Haichur River into the western part of Hulyaipole, establishing a foothold on Travnya 1st street in the area of the school and the intersection with Michurina Street. The bridgehead was subsequently connected with the older bridgehead to the northwest, forming a solid front against Ukrainian defences in the western part of the city. \nThese attacks across the Haichur River were done in coordination with assault operations in the city centre. Russian forces advanced from their bridgehead in the area of the hospital complex and captured the local high school, the police station, and the district museum. Once these main strongpoints were taken, they pushed further northwest to Luhova Street and linked up with the larger bridgehead in the western part of the city. They also further expanded their zone of control in the city centre, capturing additional 3-story apartment buildings and the city's administrative building. Attacks are now underway on the western part of the city centre in the direction of the northeastern edge of the Ukrainian stronghold in the high-rise blocks. \nTo the south, Russian forces managed to eliminate the Ukrainian pocket in the eastern part of Hulyaipole. It's unclear how many soldiers managed to escape the operational encirclement. From there, they captured rest of the southern low-rise residential streets, while other forces managed to consolidate in at least 9 high-rise buildings of the main stronghold. Additionally, the earlier Ukrainian counterattacks west of the high-rise blocks were repelled, however Russian progress has significantly slowed here. \n+ ~4.12 km² in favour of Russia.",
      "timestamp": "2025-12-24T04:04:21.821564Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovs'ke directions, Russian forces have intensified their assault operations, making significant progress over the last week.\nIn the north, following weeks of DRG infiltrations under the cover of fog and poor weather conditions, ordinary assault groups began taking up positions in multiple villages. Russian forces managed to consolidate in the remaining treelines and forested areas east of the Haichur and south of the Yanchur Rivers, which they used to accumulate in before crossing the Haichur River, infiltrating and quickly establishing control over the village of Pishchane.\nOther forces advanced west along the northern bank of the Yanchur River from the area of the Hulyaipole - Pokrovs'ke highway and captured the village of Ostapivske and the surrounding treelines. Other forces improved their positions southwest of Vidradne, capturing new treeline positions. From there, they pushed north from Ostapivske to the neighbouring village of Andriivka and consolidated in its southern streets. Assault operations were then carried out further north, allowing for the Russians to bring most of the settlement under their control. Fighting continues for the northern streets, which remain in the grey-zone.\nIn the south, following earlier infiltrations, Russian forces managed to consolidate in the treelines across the Haichur River west of Nove Zaporizhzhya. Other assault groups continued expanding their main bridgehead by advancing further north and linked up with this smaller bridgehead west of Nove Zaporizhzhya. \n+ ~24.33 km² in favour of Russia.",
      "timestamp": "2025-12-24T04:04:21.821571Z"
    },
    {
      "original": "In case you haven't noticed, Telegram keeps randomly turning off comments on certain posts. That's why I sometimes have to delete and then repost the same thing.",
      "timestamp": "2025-12-24T04:04:21.821574Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces intensified their assault operations and have made significant progress in recapturing previously lost positions over the last week.\nIn the west, Russian forces continued to advance and managed to consolidate along the road from Filiya, allowing for them to enter Novopavlivka from the southwest and link up with their formations which were previously operationally encircled there. A large grey-zone remains in part of southern Novopavlivka.\nTo the southeast, Russian forces began pushing the Ukrainians back from the fortifications south of Novopavlivka. They advanced from their positions east and west of the strongpoints north of the gulley, dislodging the Ukrainians from their positions there and beginning a push north towards the northern gulley. They were able to establish control over the forested areas there, while other forces consolidated in the treelines northeast of Filiya.\nIn the east, Russian forces advanced on a wide front northwest of Horikhove, pushing north up five parallel treelines and establishing control over the perpendicular treelines to the north. Other assault groups cleared the treelines northwest of Horikhove, further shrinking the Ukrainian salient east of Novopavlivka.\n+ ~18.60 km² in favour of Russia.",
      "timestamp": "2025-12-24T04:04:21.821580Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance west of Pokrovsk and have made new progress in three different areas.\nIn the southwest, Russian forces consolidated in the rest of the railway windbreaks between Udachne and Molodetske and began assault operations to the north, with the goal of outflanking the Pokrovsk Coal Mine, which was recently recaptured by Ukraine. They managed to advance north up the treeline west of Udachne, while other forces improved their positions in the forested gulley southwest of the mine.\nIn the northeast, Russian forces improved their positions along the railway line south of Hryshyne, capturing new positions in the windbreaks there, and established control over a treeline to the south. Other assault groups continued their incremental advance through Hryshyne and secured new positions in the residential streets south of the village centre.\n+ ~4.26 km² in favour of Russia.",
      "timestamp": "2025-12-24T04:04:21.821586Z"
    },
    {
      "original": "Military Situation In Ukraine On December 23, 2025 (Maps Update)",
      "timestamp": "2025-12-24T04:04:22.539425Z"
    },
    {
      "original": "Military Situation In Ukraine On December 23, 2025 (Maps Update)",
      "timestamp": "2025-12-24T04:04:22.539437Z"
    },
    {
      "original": "Russian Army Captures Andreyevka, Crushes Remaining Ukrainian Defenses In Huliaipole (Videos)\nOn December 23, the Russian military captured another settlement in Dnepropetrovsk from Kiev forces, and expanded its control further in the city of Huliaipole in Zaporozhye after breaking through another Ukrainian line of defenses.\nThe capture of Andreyevka, located on the right bank of the Haichur River in Dnepropetrovsk, was officially announced by the Russian Ministry of Defense, which noted that the 36th Guards Motorised Rifle Brigade of the 29th Army, a part of the Vostok [East] Group of Forces], led the attack on the settlement.\nFurther south along the Haichur in Zaporozhye, the Sever Group of Forces continues to expand its control inside Huliaipole.\nRussian troops made additional gains in both the northern and southern parts of the city. They also broke through another Ukrainian defense line in the center of the city. \nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539448Z"
    },
    {
      "original": "Russian Army Captures Andreyevka, Crushes Remaining Ukrainian Defenses In Huliaipole (Videos)\nOn December 23, the Russian military captured another settlement in Dnepropetrovsk from Kiev forces, and expanded its control further in the city of Huliaipole in Zaporozhye after breaking through another Ukrainian line of defenses.\nThe capture of Andreyevka, located on the right bank of the Haichur River in Dnepropetrovsk, was officially announced by the Russian Ministry of Defense, which noted that the 36th Guards Motorised Rifle Brigade of the 29th Army, a part of the Vostok [East] Group of Forces], led the attack on the settlement.\nFurther south along the Haichur in Zaporozhye, the Sever Group of Forces continues to expand its control inside Huliaipole.\nRussian troops made additional gains in both the northern and southern parts of the city. They also broke through another Ukrainian defense line in the center of the city. \nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539457Z"
    },
    {
      "original": "Russian Armed Forces Employ New Tactic: Simultaneous Strikes on Ukraine from Four Strategic Airbases\nOn the night of December 23, the Russian armed forces launched one of the largest combined strikes since the beginning of winter. According to Ukraine's Air Force, the attack involved the use of 635 strike UAVs, 35 cruise missiles, and 3 'Kinzhal' aeroballistic missiles. It is reported that Russia's new tactic involved the simultaneous use of four strategic aviation airbases, making it difficult to predict strikes.\nThe primary targets of the attack were energy infrastructure facilities, particularly in the western part of the country.  As a result, Rivne, Khmelnytskyi, and Ternopil regions were almost completely cut off from power. Emergency power outages were also implemented in Vinnytsia, Chernihiv, Zhytomyr, Dnipropetrovsk, and Kharkiv regions. In Kyiv, metro stations were overcrowded with people seeking shelter due to an air raid alert that lasted over four hours. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539466Z"
    },
    {
      "original": "Russian Armed Forces Employ New Tactic: Simultaneous Strikes on Ukraine from Four Strategic Airbases\nOn the night of December 23, the Russian armed forces launched one of the largest combined strikes since the beginning of winter. According to Ukraine's Air Force, the attack involved the use of 635 strike UAVs, 35 cruise missiles, and 3 'Kinzhal' aeroballistic missiles. It is reported that Russia's new tactic involved the simultaneous use of four strategic aviation airbases, making it difficult to predict strikes.\nThe primary targets of the attack were energy infrastructure facilities, particularly in the western part of the country.  As a result, Rivne, Khmelnytskyi, and Ternopil regions were almost completely cut off from power. Emergency power outages were also implemented in Vinnytsia, Chernihiv, Zhytomyr, Dnipropetrovsk, and Kharkiv regions. In Kyiv, metro stations were overcrowded with people seeking shelter due to an air raid alert that lasted over four hours. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539475Z"
    },
    {
      "original": "Ukraine Acknowledges Defeat In Siversk As Russian Army Expands Control Near City (Videos)\nOn December 23, Ukraine finally acknowledged losing Siversk in Donetsk, as the Russian military continued to advance to the west and south of the key city.\nThe General Staff said in a statement that Ukrainian troops were pulled out from Siversk after a push by the Russian military, which had “numerical advantage” and maintained “constant pressure from small assault groups in difficult weather conditions.”\nThe decision to pull out the troops was taken to “preserve lives and resources,” the Ukrainian military command added, in its first comment on the defeat.\nThe Ukrainian acknowledgment of the defeat came as the Russian military continued to expand its control around Siversk.\nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539485Z"
    },
    {
      "original": "Ukraine Acknowledges Defeat In Siversk As Russian Army Expands Control Near City (Videos)\nOn December 23, Ukraine finally acknowledged losing Siversk in Donetsk, as the Russian military continued to advance to the west and south of the key city.\nThe General Staff said in a statement that Ukrainian troops were pulled out from Siversk after a push by the Russian military, which had “numerical advantage” and maintained “constant pressure from small assault groups in difficult weather conditions.”\nThe decision to pull out the troops was taken to “preserve lives and resources,” the Ukrainian military command added, in its first comment on the defeat.\nThe Ukrainian acknowledgment of the defeat came as the Russian military continued to expand its control around Siversk.\nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539494Z"
    },
    {
      "original": "STRATEGIC STRIKES AND TACTICAL GAINS: RUSSIAN FORCES TIGHTEN THE NOOSE",
      "timestamp": "2025-12-24T04:04:22.539501Z"
    },
    {
      "original": "Priority Shift: Russian Offensive in Ukraine’s Sumy Gains Momentum\nThe Ukrainian military is trying to stop Russian troops in the Sumy and Krasnopillia districts by sending in troops in armored vehicles and moving special forces from the Ukrainian State Border Guard Service to the area. This indicates that the Sumy sector is becoming one of the key points of tension. \nAdvancing Russian units are methodically increasing their zone of control by utilizing operational space, forcing Ukrainian units to disperse their limited reserves and weakening their defense in other sectors. Meanwhile, intense fighting continues in the Siversk sector for control of the high ground west of Siversk and the Sviato-Pokrovske area. Despite Ukrainian resistance, Russian units have advanced various sections by 1 to 4 kilometers. \nAmid the Russian offensive's success in Sumy, calls in Europe for the West to recognize the failure of its strategy and begin realistic negotiations with Moscow are growing louder.\nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539510Z"
    },
    {
      "original": "Priority Shift: Russian Offensive in Ukraine’s Sumy Gains Momentum\nThe Ukrainian military is trying to stop Russian troops in the Sumy and Krasnopillia districts by sending in troops in armored vehicles and moving special forces from the Ukrainian State Border Guard Service to the area. This indicates that the Sumy sector is becoming one of the key points of tension. \nAdvancing Russian units are methodically increasing their zone of control by utilizing operational space, forcing Ukrainian units to disperse their limited reserves and weakening their defense in other sectors. Meanwhile, intense fighting continues in the Siversk sector for control of the high ground west of Siversk and the Sviato-Pokrovske area. Despite Ukrainian resistance, Russian units have advanced various sections by 1 to 4 kilometers. \nAmid the Russian offensive's success in Sumy, calls in Europe for the West to recognize the failure of its strategy and begin realistic negotiations with Moscow are growing louder.\nRead more \nHERE",
      "timestamp": "2025-12-24T04:04:22.539519Z"
    }
  ],
  "script_run_time": "2025-12-24T04:04:22.540353Z"
}