{
  "messages": [
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-03T06:48:09.721650Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня.",
      "timestamp": "2025-11-03T06:48:09.721667Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня.",
      "timestamp": "2025-11-03T06:48:09.721672Z"
    },
    {
      "original": "Швидкісна ціль в напрямку Дніпро/Запоріжжя.",
      "timestamp": "2025-11-03T06:48:09.721676Z"
    },
    {
      "original": "Дніпро - в укриття!",
      "timestamp": "2025-11-03T06:48:09.721679Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-03T06:48:09.721684Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-03T06:48:09.721688Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину.",
      "timestamp": "2025-11-03T06:48:09.721691Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину.",
      "timestamp": "2025-11-03T06:48:09.721694Z"
    },
    {
      "original": "Ще швидкісна ціль на Сумщину.",
      "timestamp": "2025-11-03T06:48:09.721697Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курсом на Ніжин.\n🛵\n БпЛА на Сумщині, курсом на Конотоп.\n🛵\n БпЛА в південній частині Харківщини, курсом на південь.",
      "timestamp": "2025-11-03T06:48:09.721708Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-03T06:48:09.721713Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-03T06:48:09.721718Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-03T06:48:09.721722Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-03T06:48:09.721726Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-03T06:48:09.721730Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-03T06:48:09.721734Z"
    },
    {
      "original": "🛵\n БпЛА в Новгород-Сіверському районі Чернігівщини, курс західний.\n🛵\n БпЛА в Ізюмському районі Харківщини, курс північний.\n🛵\n БпЛА в Синельниківському районі Дніпропетровщини, курс північно-західний.",
      "timestamp": "2025-11-03T06:48:09.721743Z"
    },
    {
      "original": "🛵\n БпЛА в Ніжинському районі Чернігівщини, курс південний.\n🛵\n БпЛА в Синельниківському районі Дніпропетровщини, курс західний.\n🛵\n БпЛА в Ізюмському районі Харківщини, курс західний.",
      "timestamp": "2025-11-03T06:48:09.721751Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-11-03T06:48:09.721755Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА в західній частині Херсонщини! Залучено засоби для збиття.",
      "timestamp": "2025-11-03T06:48:09.721759Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 116 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 03 листопада (з 19:00 02 листопада) противник атакував трьома аеробалістичними ракетами Х-47М2 «Кинджал» із повітряного простору Липецької обл., чотирма балістичними ракетами Іскандер-М із ТОТ АР Крим, п’ятьма зенітними керованими ракетами С-300/С-400 із Курської обл., а також 138 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Орел, Приморсько-Ахтарськ – рф, близько 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено одну аеробалістичну ракету Х-47М2 «Кинджал» та 115 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання ракет та 20 ударних БпЛА на 11 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-11-03T06:48:09.721778Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-11-03T06:48:09.721782Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-03T06:48:09.721786Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччині.",
      "timestamp": "2025-11-03T06:48:09.721790Z"
    },
    {
      "original": "Iskander on Bilopillya, Sumy Oblast",
      "timestamp": "2025-11-03T06:48:10.241919Z"
    },
    {
      "original": "Flying southwest to Romny, Sumy Oblast",
      "timestamp": "2025-11-03T06:48:10.241932Z"
    },
    {
      "original": "Flying southwest to Romny, Sumy Oblast",
      "timestamp": "2025-11-03T06:48:10.241936Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-11-03T06:48:10.241939Z"
    },
    {
      "original": "Another Iskander to Romny. The first impacted somewhere northeast of the city.",
      "timestamp": "2025-11-03T06:48:10.241942Z"
    },
    {
      "original": "Another Iskander to Romny. The first impacted somewhere northeast of the city.",
      "timestamp": "2025-11-03T06:48:10.241946Z"
    },
    {
      "original": "Also impacted northeast of Romny. Explosions were heard.",
      "timestamp": "2025-11-03T06:48:10.241949Z"
    },
    {
      "original": "It seems both Iskanders impacted Dnipro. I'm clarifying the cause of the explosions in Zaporihzhzhia",
      "timestamp": "2025-11-03T06:48:10.241952Z"
    },
    {
      "original": "Alright, so regarding the Dnipro strikes, it seems that 2-3 Iskanders impacted within Dnipro's city limits.\nThe explosions heard in Zaporizhzhia were *likely* 4 Tornado-S rockets hitting something in the southern suburbs.",
      "timestamp": "2025-11-03T06:48:10.241957Z"
    },
    {
      "original": "Also impacted northeast of Romny. Explosions were heard.",
      "timestamp": "2025-11-03T06:48:10.241960Z"
    },
    {
      "original": "The other aerial targets detected in Sumy Oblast are just MLRS striking the border regions. No other Iskanders are expected.",
      "timestamp": "2025-11-03T06:48:10.241964Z"
    },
    {
      "original": "Alright, so regarding the Dnipro strikes, it seems that 2-3 Iskanders impacted within Dnipro's city limits.  The explosions heard in Zaporizhzhia were *likely* 4 Tornado-S rockets hitting something in the southern suburbs.",
      "timestamp": "2025-11-03T06:48:10.241967Z"
    },
    {
      "original": "Correction on Zaporizhzhia: The 4 Tornado-S rockets impacted somewhere in the villages just outside Zaporizhzhia City, not in the city limits.",
      "timestamp": "2025-11-03T06:48:10.241970Z"
    },
    {
      "original": "Russian forces have captured the village of Kamyanka, Velykyi Burluk direction, Kharkiv Oblast.\nPre-war population: ~961.\nTotal land area: ~4.21 km².",
      "timestamp": "2025-11-03T06:48:10.241975Z"
    },
    {
      "original": "In the Stepnohirsk direction, Ukrainian forces resumed counterattacks and were able to make new progress north of the river. \nIn the west, Ukrainian forces cleared areas previously entered by Russian DRGs and began advancing towards southern Prymorske. They pushed down the main residential streets and entered the southern dachas. Russian KAB bombs and artillery are striking these assault groups, however they were able to keep advancing south towards the railway station.\nTo the east, Ukrainian forces cleared Tavriiska Street from DRGs, cementing their presence in the main part of Stepnohirsk. Small assault groups continue their operations south of the river, and in the area of the 3rd Microdistrict. \n+ ~2.46 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T06:48:10.241981Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to advance towards the Vovcha River from the south, and have captured additional positions on the tactical heights.\nAfter capturing Novoleksandrivka and establishing themselves north of Verbove, Russian forces advanced north up the treelines and east from Novooleksandrivka, establishing control over a new section of the tactical heights. This advance levels the frontline between Novooleksandrivka and Oleksandrivka, and strengthens Russia's position in the direction of the Vovcha River. \n+ ~11.00 km² in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.241986Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their efforts at eliminating the Ukrainian salient north of Dachne and have begun making progress in the southern part of it.\nAfter developing the flanks of the salient, Ukrainian forces withdrew north across a gulley to avoid being encircled. Russian forces have since captured the rest of the forests north of the Vovcha River, and established control over the large trench fortification on the approaches to Dachne. They then advanced to the treelines further north, capturing them too.\n+ ~4.96 km² in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.241990Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces are advancing, with Ukrainian forces making substantial progress against the former Kucheriv Yar salient.\nIn the north, Ukrainian forces advanced further south from Kucheriv Yar, and over the past week have regained positions at the clay quarry and in the surrounding treelines. They also advanced down and established control over the rest of the Velyka Balka Gulley.\nTo the south, Ukrainian forces advanced out of Nove Shakhove and the neighbouring dachas to the east, establishing control over two more clay quarries, as well as the surrounding treelines and forested areas.\nFurther south, Ukrainian forces entered the southern outskirts of Nykanorivka and captured positions in the forests there. Clashes with Russian forces are ongoing in the western part of the village, where a large grey zone has formed. Additionally, the Ukrainians were able to recapture one of the mineshafts for the Krasnolimanskaya Mine, as well as part of the forest and perpendicular treeline to the north, and are now attacking in the direction of Boikivka. \nOn the other hand, Russian forces began counterattacking towards Nykanorivka. They advanced towards the village from the south, reaching the southern bank of the tributary of the Kazenyi Torets River, where they entrenched in the forests. They also entered the southwestern dachas and crossed the tributary to the main part of Nykanorivka where fighting is ongoing. \nMeanwhile on the eastern side of the salient, Russian forces failed to consolidate in the central part of Volodymyrivka and were forced to withdraw to the southern streets. They also withdrew from the northern half of Pankivka. Ukrainian forces withdrew from the treeline south of the Novyy Reservoir and are retaining their foothold in northern Volodymyrivka. \n+ ~20.42 km² in favour of Ukraine.\n+ ~3.07 km² in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.241999Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and over the past week have made new progress in the grey zone east of Kostyantynivka.\nIn the east they advanced from the chalk quarries to the large, fortified forest, entering it and establishing a foothold in it. They also captured some of the groves to the southeast. \nIn the west, the Russians consolidated further in Predtechyne, capturing houses in the central and western parts of the village. They also crossed one of the dams along the chain of reservoirs and captured positions in the former agricultural complex on the southern outskirts of Predtechyne. \nAdditionally, Russian forces advanced down the highway from Stupochky, recapturing positions in the windbreaks and nearby strongholds, and reaching the large forest east of Kostyantynivka.\n+ ~5.56 in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.242005Z"
    },
    {
      "original": "On the southern flank of Siversk, Russian forces continued to advance and have entered the village of Zvanivka.\nAfter earlier infiltrations, Russian forces managed to enter and properly establish themselves in the southern part of Zvanivka, consolidating in the first houses. Fighting is ongoing for areas further north towards the centre of the village. \n+ ~0.38 km² in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.242010Z"
    },
    {
      "original": "On the northern flank of Siversk, Ukrainian forces began a series of counterattacks and have regained control over most of Yampil.\nAs Russian forces were about to capture the last parts of southwestern Yampil, Ukrainian forces began counterattacking. Russian assault groups who had been advancing did not consolidate properly, which allowed for the Ukrainians to quickly and relatively easily reverse weeks of progress, and break through to the centre of the village.  Soon, most of the settlement was back under Ukrainian control, as attacks were carried out towards its western residential areas. \n+ 10.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T06:48:10.242014Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces launched a series of counterattacks and have regained control over most of Borivska Andriivka. \nDuring Russian assault operations that saw them capture most of the village, Ukrainian forces managed to retain control over the southwestern part of it. From here, they were able to accumulate additional infantry and began attacking northeast towards the centre of the village. Once capturing the centre, they began pushing towards the eastern outskirts, where they were able to make additional progress both in the village and in the treelines to the south. \n+ ~3.39 km² in favour of Ukraine.",
      "timestamp": "2025-11-03T06:48:10.242022Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in and around the city, and have made significant progress east of the Oskil River.\nRussian forces were able to break through from the forests east of Holubivka towards the northern outskirts of Kupyansk. They established control over new positions in the forests outside the city before entering and entrenching in the first buildings of the eastern part of the city in the area of School no. 7. \nIn west bank Kupyansk, Russian forces were able to clear out the pocket of grey zone, establishing full control over the city centre and surrounding residential areas. \nMeanwhile, Ukrainian forces are continuing attempts at cutting off the Russians in Kupyansk from the north. Attacks are being carried out towards the Oskil River from the west, however there is no evidence of consolidation yet. The grey zone has been expanded.\n+ ~6.42 km² in favour of Russia.",
      "timestamp": "2025-11-03T06:48:10.242028Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine. \nIt's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret what they are saying, before passing it off as exclusive intel on devastating Russian strikes.",
      "timestamp": "2025-11-03T06:48:10.242032Z"
    },
    {
      "original": "It's always so funny seeing Russian channels with supposed \"insider information\" get things completely wrong when it comes to their own strikes on Ukraine.   It's very clear that they are in a few of the more low-quality Ukrainian monitoring channels and misinterpret…",
      "timestamp": "2025-11-03T06:48:10.242036Z"
    },
    {
      "original": "What's funny is that I can guarantee you that I probably have several times more information on these strikes from various open and closed sources than these Russian channels. And I live in fucking New Zealand \n🤣\n🤣\n. It should go to show how unreliable some people on here are, and how easily misinformation spreads.",
      "timestamp": "2025-11-03T06:48:10.242041Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued their assault operations and have made significant progress over the past week.\nRussian forces advanced from the central part of Kamyanka to the northern outskirts, establishing control over the remaining residential streets. They also captured the forests to the northwest and west.\nFurther north, Russian forces advanced south from Bolohivka, capturing treeline positions on the tactical heights and adjacent forested areas. This allowed for the front to begin shifting westwards, with the Ukrainians retreating from their positions towards Kolodyazne.\n+ ~18.40 km²",
      "timestamp": "2025-11-03T06:48:10.242047Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781655Z"
    },
    {
      "original": "Overview of Russian-Ukrainian Strikes: Russia Increased Missile Use Fivefold in October\nOn the night of November 1-2, Russia and Ukraine continued their exchange of strikes. According to the Ukrainian Air Force, the Russian side employed 79 attack unmanned aerial vehicles (UAVs) and two ballistic missiles. In turn, Russian air defense systems, as stated by the Russian Defense Ministry, destroyed 164 Ukrainian UAVs over the course of the night.\nUkrainian aviation expert Valeriy Romanenko highlighted a significant increase in Russia's use of ballistic missiles. He stated that 101 such missiles were launched at Ukraine in October, which is approximately five times the figure from the previous month, when 21 launches were recorded. Romanenko links this intensification to Ukraine's acute shortage of modern air defense systems, such as Patriots, which reduces interception capabilities. The expert also noted that, in his opinion, Russia had been accumulating missiles since spring...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781672Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 2, 2025 (Map Update)",
      "timestamp": "2025-11-03T06:48:10.781676Z"
    },
    {
      "original": "The Situation in Kupyansk: The Dire Plight of Ukrainian Servicemen and Prisoner Testimonies\nA complex operational situation remains tense in the Kupyansk area on the Kharkiv direction, and under these conditions, Ukrainian servicemen continue to surrender. The testimonies of captured soldiers from the 14th Separate Mechanized Brigade of the Ukrainian Armed Forces, Yuriy Shapovalenko and Alexey Vinder, paint a picture of the critical situation facing the surrounded formations.\n\"We surrendered ourselves. About four days after we were brought here, we realized we were surrounded by the Russians. Resupply was gone – no ammunition, our water ran out, very little food was left. We ate one can of stew among three men per day. The route across the Oskol River was already cut off – it's all your FPV drones there. Because of that, there was no logistics left. A lot of your soldiers entered the city. So, we decided to come out with a white rag,\" recounted prisoner of war Shapovalenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781684Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-03T06:48:10.781688Z"
    },
    {
      "original": "Military Situation In Ukraine On November 2, 2025 (Maps Update)",
      "timestamp": "2025-11-03T06:48:10.781693Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781701Z"
    },
    {
      "original": "Russian Tanks with Upgraded \"Porcupine\" Protection Against Drones\nNew footage circulating online reveals Russian tanks outfitted with what is commonly called a \"porcupine-style\" protection system. This upgrade marks a significant step forward from earlier field-made countermeasures against unmanned aerial vehicles (UAVs), replacing the once relatively short \"hedgehog spikes\" with long, imposing metal structures that truly evoke the image of a porcupine.\nRussian crews keep raising the bar for the survivability of their armored vehicles under UAV attacks. On the frontline, tanks such as the T-80BVM and T-72B3M have been spotted sporting almost impenetrable defense. Their unmistakable look comes from a combination of lattice screens, metal rods, and splayed cables forming a solid protective cage around the hull and turret.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781709Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781718Z"
    },
    {
      "original": "Russian Assault Groups Clear Stepnogorsk in Ukraine: «Shot-Assault» Tactics Yield Results\nUnits from the 7th Guards Air Assault Division are advancing through residential areas in Stepnogorsk. In Sumy Oblast, a deployment point for foreign mercenaries was destroyed. Criticism of new social initiatives was voiced in the Ukrainian parliament.\nIn the south of the Dnipropetrovsk Oblast, offensive operations are being continued by units of the «East» grouping. The main clashes are taking place in the Uspenovka area, which, according to Russian sources, is now mostly under the control of the advancing units.\nThe Ukrainian Armed Forces are counterattacking towards Uspenovka from the Novoye and Sladkoye lines. Further south, Russian units are advancing towards Veseloye and Zeleny Gai from the Poltavka and Malinovka areas. To the north, the clearance of the Rybnoye locality is nearing completion.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-03T06:48:10.781727Z"
    }
  ],
  "script_run_time": "2025-11-03T06:48:10.782533Z"
}