{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-11T18:50:53.150090Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-11T18:50:53.150104Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння  зі сходу.",
      "timestamp": "2025-12-11T18:50:53.150109Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-11T18:50:53.150113Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-11T18:50:53.150117Z"
    },
    {
      "original": "🛸\n Повітряна тривога через ворожий БпЛА на півдні Миколаївщини! Залучено засоби для  збиття.",
      "timestamp": "2025-12-11T18:50:53.150122Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область та  на Харківщину зі сходу.",
      "timestamp": "2025-12-11T18:50:53.150126Z"
    },
    {
      "original": "🛸\nВорожий БпЛА поблизу Херсону! Залучено засоби для  збиття.",
      "timestamp": "2025-12-11T18:50:53.150130Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на н.п. Городня.",
      "timestamp": "2025-12-11T18:50:53.150135Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-12-11T18:50:53.150139Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-11T18:50:53.150143Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з півночі.",
      "timestamp": "2025-12-11T18:50:53.150148Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з півночі.",
      "timestamp": "2025-12-11T18:50:53.150152Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-11T18:50:53.150156Z"
    },
    {
      "original": "🚀\n \n🚀\nСхід Харківщини - загроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-11T18:50:53.150161Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на Запоріжжі.\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-11T18:50:53.150168Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-11T18:50:53.150172Z"
    },
    {
      "original": "🛵\n БпЛА з Донеччини на Дніпропетровщину.",
      "timestamp": "2025-12-11T18:50:53.150176Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Чернігів зі сходу.",
      "timestamp": "2025-12-11T18:50:53.150180Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини (Прилуцький район) курс на Київщину, н.п.Згурівка",
      "timestamp": "2025-12-11T18:50:53.150185Z"
    },
    {
      "original": "Close-up view of the situation in Kupyansk, where Russian forces have been operationally encircled in the western part of the city:  The yellow lines represent the former Russian supply routes, which are now largely impassable due to the presence of Ukrainian…",
      "timestamp": "2025-12-11T18:50:53.943096Z"
    },
    {
      "original": "Update on the situation in Kupyansk:\nThe situation continues to deteriorate for the Russian garrison in the western part of the city, which remains operationally encircled. An information blackout has been imposed by the Russian command, with information sharing resulting in severe punishments. This makes it difficult to determine the exact situation, however based on satellite imagery, geolocations, and reports from various sources, we can draw up a somewhat accurate representation of how things are currently playing out. \nAs I wrote in my last post, Ukrainian forces have managed to block the last supply route for Russian forces in western Kupyansk, which runs along the western bank of the Oskil River. As a result, all supply to the garrison has to be conducted by drones, although this isn't a new phenomenon for this sector. Nevertheless, the Ukrainians failed to consolidate, and Russia has largely repelled the attacks on this area. \nThe Ukrainian command has brought up additional reserves to Kupyansk, including mercenaries, which are continuing the counterattacks, despite heavy losses. However, they are encountering increasing difficulties in securing key areas, despite many instances of poor Russian coordination. Russian FAB glide-bomb strikes have remained unusually low, but are currently focusing on striking the logistical routes into the city. As a result of this, and other Russian strikes, as well as the attack on the dam in Pechenihy, supply for Ukrainian assault groups is becoming increasingly difficult. \nMoreover, Russian forces have begun attempts at eliminating the Ukrainian presence to northeast and north of Radkivka, which has long been a \"thorn\" for Russia which decreased their logistical potential. The outcome of these attacks is unknown, but if successful, they will likely consolidate and reinforce the whole area and attempt to advance south and cut off the Ukrainian spearhead in the northern part of Kupyansk. \nMeanwhile, Ukrainian forces continued making incremental progress within Kupyansk. Control over a number of high-rise buildings and nearby houses in the north was confirmed, although this likely occurred more than two weeks ago. They also managed to recapture the grain elevators just west of the city centre (which the Russians subsequently dropped at least one FAB on) as well as the residential streets to the west. Additionally, despite recent Russian counterattacks in the southwestern Yuvileynyi high-rise micro-district which saw them recover control over the rest of the apartment buildings there, Ukrainian forces were able to consolidate in approximately half of the low-rise residential area to the west. \nThe situation in other parts of western Kupyansk remains very fluid and dynamic. Ukrainian and Russian soldiers continue to hold positions overlapping each other, leading to a complicated mess of small groups of soldiers from each side maneuvering through urban areas and constantly being targeted by drones and artillery. However, the initiative remains firmly with Ukraine, and the first cases of Russian soldiers attempting to cross the Oskil River via the area of the destroyed highway overpass into the eastern part of the city have been recorded. \nMeanwhile, east of the Oskil River, Russian forces continue their assault operations in Petropavlivka. Currently, it appears they are trying to \"save\" the situation in western Kupyansk by securing this key village, eliminating the Ukrainian control in the area of Synkivka, and swinging west to \"link up\" with the garrison via the southeastern suburbs of Kupyansk. However, the Ukrainian defence east of the river is very strong, and Russian advances and consolidation has proven difficult and costly.",
      "timestamp": "2025-12-11T18:50:53.943114Z"
    },
    {
      "original": "Cambodian T-55 tanks can be seen being transported to the frontline.",
      "timestamp": "2025-12-11T18:50:53.943118Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-11T18:50:53.943121Z"
    },
    {
      "original": "Kupyansk before the war. It was a nice city.",
      "timestamp": "2025-12-11T18:50:53.943124Z"
    },
    {
      "original": "I want to be clear with this now: I want nothing to do with betting or gambling on the war in Ukraine. \nRecently, following the ISW fraud controversy with Polymarket, I keep seeing people suggest that my maps and reports should be used as a deciding factor for determining the outcome of bets. One of those such posts got over 1.6 million views.\nI even had the \"Pentagon Pizza Watch\" account reach out to me asking if my map could be embedded in his external betting service. He proceeded to get angry at me when I pointed out how immoral and scummy it was, and how when he used Deepstate's API, it ultimately got their service temporarily taken down, leaving many people - including humanitarian aid workers - in the dark. \nBetting on a war where hundreds of thousands of people are dying and millions are suffering is immoral and disgusting, and I will never support it or take part in any of it. Your actions on the internet have real life consequences, even if they aren't immediately apparent and obvious to you.",
      "timestamp": "2025-12-11T18:50:53.943130Z"
    },
    {
      "original": "The Thai military reports that Cambodia has launched more than 3,160 BM-21 Grad rockets and carried out 125 drone strikes so far during the renewed conflict.",
      "timestamp": "2025-12-11T18:50:53.943133Z"
    },
    {
      "original": "Russian forces have captured the village of Pazeno, southwestern flank of Siversk, Donetsk Oblast.\nPre-war population: ~16.\nTotal land area: ~0.43 km².\nThe fighting for Pazeno lasted approximately 8 days.",
      "timestamp": "2025-12-11T18:50:53.943138Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-11T18:50:53.943143Z"
    },
    {
      "original": "New satellite imagery reveals that Russia has installed a large number of new hangars for storing Geran-2 drones at Donetsk International Airport. Each of these hangars fits one drone and are used for storage right before launches are carried out.\nAdditionally, a total of 4 static ramp launchers are visible, along with one lane for vehicle-based launches. These upgrades are part of a larger effort observed at various launch points aimed at facilitating for increased production rates of drones, allowing for increased numbers to be used during large-scale attacks. \nImage credit",
      "timestamp": "2025-12-11T18:50:53.943148Z"
    },
    {
      "original": "Another tanker of the Russian “Shadow fleet” has been hit in the Black Sea by Ukrainian surface drones.",
      "timestamp": "2025-12-11T18:50:53.943152Z"
    },
    {
      "original": "Last night, another combined missile and drone attack was carried out on the city of Kremenchuk, Poltava Oblast.\nAmong the targets hit were the main power plant and the oil refinery. NASA FIRMS picked up a large fire burning at the refinery, despite heavy cloud cover over the city.\n3 Iskander-M ballistic missiles were launched from the vicinity of Kursk City, Kursk Oblast - one of which was equipped with a cluster warhead. The Iskanders likely targeted the refinery.\nApproximately 50 Geran-2 drones were also used. They likely primarily targeted energy infrastructure. \n(Credit to \"\nIntel Cams | OSINT\n\" on YouTube for the first clip)",
      "timestamp": "2025-12-11T18:50:53.943158Z"
    },
    {
      "original": "Last night, another combined missile and drone attack was carried out on the city of Kremenchuk, Poltava Oblast.\nAmong the targets hit were the main power plant and the oil refinery. NASA FIRMS picked up a large fire burning at the refinery, despite heavy cloud cover over the city.\n3 Iskander-M ballistic missiles were launched from the vicinity of Kursk City, Kursk Oblast - one of which was equipped with a cluster warhead. The Iskanders likely targeted the refinery.\nApproximately 50 Geran-2 drones were also used. They likely primarily targeted energy infrastructure. \n(Credit to \"\nIntel Cams | OSINT\n\" on YouTube for the first clip)",
      "timestamp": "2025-12-11T18:50:53.943165Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-11T18:50:53.943169Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-11T18:50:53.943172Z"
    },
    {
      "original": "Over the last few days, the defence of Siversk has completely collapsed. \nA fortress city that the Russians couldn't reach for nearly 4 years is about to be captured after just a week of fighting.\nIf this isn't a sign of how bad Ukraine's manpower shortages have got, I don't know what is.",
      "timestamp": "2025-12-11T18:50:53.943177Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-11T18:50:53.943183Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-11T18:50:53.943189Z"
    },
    {
      "original": "The last Ukrainian defences in the besieged city of Myrnohrad are being breached by Russian forces, who have now entered the city centre. \nThe parts of the pocket still under firm Ukrainian control have decreased to around 2.8 km², compared to ~36 km² at the beginning of the siege. \nNevertheless, Russian FAB glide-bombs continue to strike the remaining blocks still under Ukrainian control. This video shows a FAB-1500 strike on a high-rise apartment building.",
      "timestamp": "2025-12-11T18:50:53.943193Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-12-11T18:50:53.943196Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-12-11T18:50:53.943199Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace. Possibly the work of Russian air defence.",
      "timestamp": "2025-12-11T18:50:53.943205Z"
    },
    {
      "original": "U.S. Deployed Electronic Attack Jets Near Venezuela, Seized Tanker In Caribbean (Video)\nPresident Donald Trump announced on December 10 that the United States had seized a sanctioned oil tanker off the coast of Venezuela.\n“We’ve just seized a tanker on the coast of Venezuela, large tanker, very large, largest one ever, actually, and other things are happening,” said Trump.\nWhen asked by reporters at the White House what would happen with the oil loaded in the tanker, Trump answered: “We keep it, I guess.”\nIn a post on X, U.S. Attorney General Pam Bondi said that the FBI, Homeland Security and Coast Guard, along with support from the U.S. military, carried out a seizure warrant for a crude tanker used to transport sanctioned oil from Venezuela and Iran.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610233Z"
    },
    {
      "original": "U.S. Deployed Electronic Attack Jets Near Venezuela, Seized Tanker In Caribbean (Video)\nPresident Donald Trump announced on December 10 that the United States had seized a sanctioned oil tanker off the coast of Venezuela.\n“We’ve just seized a tanker on the coast of Venezuela, large tanker, very large, largest one ever, actually, and other things are happening,” said Trump.\nWhen asked by reporters at the White House what would happen with the oil loaded in the tanker, Trump answered: “We keep it, I guess.”\nIn a post on X, U.S. Attorney General Pam Bondi said that the FBI, Homeland Security and Coast Guard, along with support from the U.S. military, carried out a seizure warrant for a crude tanker used to transport sanctioned oil from Venezuela and Iran.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610253Z"
    },
    {
      "original": "Military Situation In Yemen On December 11, 2025 (Map Update)",
      "timestamp": "2025-12-11T18:50:54.610257Z"
    },
    {
      "original": "Russian Army Is Very Much In Control Of Siversk (Videos)\nOn December 11, the Russian military broke through Ukraine’s last lines of defense in Siversk, bringing the key city in Donetsk under its control.\nThe Yug [South] Group of Forces took over the entire northwestern part of Siversk, reducing the presence of Kiev forces to some pockets beyond the Bakhmutka River to the west. The central, southern and eastern parts of Siversk were cleared earlier this month, with reports from December 10 suggesting that Russian troops were in control of 90 percent of the city.\nVideo footage showing Russian troops battling Kiev forces and raising their flags in different areas within Sivers, including the western part of the city, has already surfaced online.\nThe Russian Ministry of Defense has not yet confirmed the capture of Siversk, but military expert Andrey Marochko confirmed to TASS before the footage emerged that Kiev forces were fighting in the last quarter of the city.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610266Z"
    },
    {
      "original": "Military Situation In Ukraine On December 11, 2025 (Maps Update)",
      "timestamp": "2025-12-11T18:50:54.610269Z"
    },
    {
      "original": "Military Situation In Ukraine On December 11, 2025 (Maps Update)",
      "timestamp": "2025-12-11T18:50:54.610273Z"
    },
    {
      "original": "Russian Offensive In Kharkiv Gains Momentum With Capture Of Liman (Videos)\nOn December 11, the Russian military expanded its control in the direction of Vovchansk in Kharkiv, capturing the settlement of Liman from Kiev forces.\nThe Russian Ministry of Defense confirmed the capture of Liman, located to the southeast of Vovchans, by the Sever [North] Group of Forces in a brief statement. The settlement is among the largest near Vovchansk and together with Synelnykove, it formed one of Ukraine’s main defense lines around the city.\nThe Sever Group of Forces captured Synelnykove in November, before defeating Kiev forces in Vovchansk itself earlier this month.\nThe capture of Liman now signals the start of a Ukrainian collapse to the east and southeast of Vovchans, as the Russian offensive there is gaining momentum.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610282Z"
    },
    {
      "original": "Russian Offensive In Kharkiv Gains Momentum With Capture Of Liman (Videos)\nOn December 11, the Russian military expanded its control in the direction of Vovchansk in Kharkiv, capturing the settlement of Liman from Kiev forces.\nThe Russian Ministry of Defense confirmed the capture of Liman, located to the southeast of Vovchans, by the Sever [North] Group of Forces in a brief statement. The settlement is among the largest near Vovchansk and together with Synelnykove, it formed one of Ukraine’s main defense lines around the city.\nThe Sever Group of Forces captured Synelnykove in November, before defeating Kiev forces in Vovchansk itself earlier this month.\nThe capture of Liman now signals the start of a Ukrainian collapse to the east and southeast of Vovchans, as the Russian offensive there is gaining momentum.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610291Z"
    },
    {
      "original": "Massive Ukrainian Drone Raid Targets Moscow. Russian Strikes Crush Ukraine's Power Grid\nOn the night of December 10-11, Russia and Ukraine continued their intense exchange of strikes targeting each other's critical infrastructure. According to the Ukrainian Air Force, 154 air attack assets were launched across the country: 151 strike drones and 3 Iskander-M/KN-23 ballistic missiles, of which 83 drones and 2 missiles were downed or suppressed.\nThe primary Russian strike package targeted Ukrainian energy and fuel sector facilities. The epicenter of the attack was Kremenchuk in the Poltava region, where impacts, including from ballistic missiles, caused fires at an oil refinery and reportedly affected the Kremenchuk Hydroelectric Power Plant. \nIn Fastiv, Kyiv region, railway hubs were hit again. Due to extensive damage to the energy grid, operator DTEK announced unprecedented 17-hour scheduled power outages in Kyiv.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610299Z"
    },
    {
      "original": "Massive Ukrainian Drone Raid Targets Moscow. Russian Strikes Crush Ukraine's Power Grid\nOn the night of December 10-11, Russia and Ukraine continued their intense exchange of strikes targeting each other's critical infrastructure. According to the Ukrainian Air Force, 154 air attack assets were launched across the country: 151 strike drones and 3 Iskander-M/KN-23 ballistic missiles, of which 83 drones and 2 missiles were downed or suppressed.\nThe primary Russian strike package targeted Ukrainian energy and fuel sector facilities. The epicenter of the attack was Kremenchuk in the Poltava region, where impacts, including from ballistic missiles, caused fires at an oil refinery and reportedly affected the Kremenchuk Hydroelectric Power Plant. \nIn Fastiv, Kyiv region, railway hubs were hit again. Due to extensive damage to the energy grid, operator DTEK announced unprecedented 17-hour scheduled power outages in Kyiv.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-11T18:50:54.610307Z"
    }
  ],
  "script_run_time": "2025-12-11T18:50:54.611015Z"
}