{
  "messages": [
    {
      "original": "🛵\n БпЛА в напрямку Києва з північного напрямку!",
      "timestamp": "2025-09-06T07:36:56.356470Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Васильків!",
      "timestamp": "2025-09-06T07:36:56.356489Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі та Донеччині.",
      "timestamp": "2025-09-06T07:36:56.356498Z"
    },
    {
      "original": "🛵\n БпЛА на межі Донеччини та Харківщини, курс південно-західний.",
      "timestamp": "2025-09-06T07:36:56.356504Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Києва з східного напрямку!",
      "timestamp": "2025-09-06T07:36:56.356509Z"
    },
    {
      "original": "🛵\n БпЛА в Сумському та Охтирському районах Сумської області, курс південно-західний.\n🛵\n БпЛА в Конотопському районі Сумської області, курс західний.\n🛵\n БпЛА в Павлоградському та Синельниківському районах Дніпропетровської області, курс західний.",
      "timestamp": "2025-09-06T07:36:56.356517Z"
    },
    {
      "original": "БпЛА з акваторії Чорного моря в напрямку Білгород-Дністровського району Одещини.",
      "timestamp": "2025-09-06T07:36:56.356521Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!\n🛸\n Ворожий розвідувальний БпЛА  на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T07:36:56.356527Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку! \n🛸\n Ворожий розвідувальний БпЛА  на Миколаївщині! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T07:36:56.356533Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-06T07:36:56.356538Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на східному напрямку!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-06T07:36:56.356544Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!",
      "timestamp": "2025-09-06T07:36:56.356549Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на  північно-східному напрямку!",
      "timestamp": "2025-09-06T07:36:56.356553Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-09-06T07:36:56.356557Z"
    },
    {
      "original": "🛵\n Чернігівська область (Чернігівський, Корюківський райони), Сумська область (Конотопський, Шосткинський райони) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T07:36:56.356566Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА  з акваторії Чорного моря в напрямку Одеси! Залучено засоби для його збиття.",
      "timestamp": "2025-09-06T07:36:56.356572Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-06T07:36:56.356577Z"
    },
    {
      "original": "🛵\n Чернігівська область (Чернігівський, Корюківський райони), Сумська область (Конотопський, Шосткинський райони) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T07:36:56.356581Z"
    },
    {
      "original": "БпЛА в західній частині Чернігівщини, курс західний.\nБпЛА в північній частині Київщини, курс західний.",
      "timestamp": "2025-09-06T07:36:56.356587Z"
    },
    {
      "original": "Чернігівська область (Чернігівський, Корюківський райони), Київська область (Вишгородський район) - загроза ударних БпЛА!",
      "timestamp": "2025-09-06T07:36:56.356591Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 68 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 6 вересня (із 18.00 5 вересня) противник атакував 91-ма ударним БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Брянськ, Міллерово, Орел, Приморсько-Ахтарськ – рф.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 68 ворожих БпЛА типу Shahed і дрони-імітатори різних типів на півночі та сході країни.\nЗафіксовано влучання 18 ударних БпЛА на 8 локаціях, падіння збитих (уламки) на 4 локаціях.\nДекілька ворожих БпЛА – в повітрі, атака триває!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-06T07:36:56.356610Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-09-06T07:36:56.356615Z"
    },
    {
      "original": "🛵\n ворожий БпЛА на Чернігівщині \n➡️\n курсом на Київщину.\n🛵\n БпЛА на півночі Київщини \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-09-06T07:36:56.356623Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-09-06T07:36:56.356627Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have been advancing, with both sides battling to gain the initiative.\nAfter Ukrainian forces failed to cut off the remnants of the Russian salient, Russian forces regrouped south of Kucheriv Yar and attacked west. They were able to drive a wedge between Vilne and Nove Shakhove, capturing positions along three parallel treelines on the tactical heights, threatening Ukraine's position in Nove Shakhove. \nTo the south, Ukrainian forces continued to advance in Nykanorivka, and improved their positions in the central part of the village.\nIn the east, after weeks of battles, Ukrainian forces re-established full control over Volodymyrivka, pushing the Russians out of the southern streets of the village. \n+ ~2.00 km² in favour of Russia.\n+ ~1.31 km² in favour of Ukraine.",
      "timestamp": "2025-09-06T07:36:56.856923Z"
    },
    {
      "original": "A media-silent Russian advance through Pokrovsk has been occurring for the past 10 days. Russian forces have reached the city centre.",
      "timestamp": "2025-09-06T07:36:56.856935Z"
    },
    {
      "original": "In the Pokrovsk direction, over the past week Russian forces have continued to expand their zone of control inside the city and have made significant progress towards the city centre.\nRussian forces advanced in two areas. In the north, they completed the capture of the southwestern streets of the city and crossed the E-50 Highway to the market district. They were able to rapidly capture the city central markets, reaching the city centre from the west. They also advanced southeast down the highway to the edge of the Shakhtarskyi District, and reached Yuvileynyy Park from the north. Additionally, the Russians completed the capture of the village of Troyanda, which was previously partially in the grey zone. \nIn the south, Russian forces advanced further east through the Kalynivka District, capturing additional positions in the low-rise residential buildings and the nearby dachas. They were also able to enter the southwestern part of the Lazurnyi District, establishing control over several high-rise buildings. \nThe main goal for Russia in Pokrovsk seems to be to reach the railway station in the northeastern part of the city. In the area of the railway station - north of the railway tracks - is a heavily fortified industrial area, which contains a network of bunkers and coal tunnels which stretch out to the rest of Pokrovsk. It is believed to be one of the largest underground tunnel systems in all of Europe. \n+ ~2.00 km² in favour of Russia.",
      "timestamp": "2025-09-06T07:36:56.856943Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces resumed their assault operations southwest of Udachne and reached the Donetsk-Dnipropetrovsk regional border.\nAfter improving their positions on the treeline southeast of Molodetske, Russian forces advanced west to the forest plantations and the treeline on the regional border. They gained a foothold in both and used the treeline to enter and capture positions in the southwestern houses of Molodetske. \n+ ~2.15 km² in favour of Russia.",
      "timestamp": "2025-09-06T07:36:56.856949Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Dnipro. At least 30 impacts were recorded. One of the main targets seems to have been the Salyut Plant (48.527413, 35.093740), which has refrigeration units with ammonia, as well as fuel and oil storage.",
      "timestamp": "2025-09-06T07:36:56.856952Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Dnipro. At least 30 impacts were recorded. One of the main targets seems to have been the Salyut Plant (48.527413, 35.093740), which has refrigeration units with ammonia, as well as fuel and oil storage.",
      "timestamp": "2025-09-06T07:36:56.856956Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-06T07:36:56.856959Z"
    },
    {
      "original": "Iskander on Sumy",
      "timestamp": "2025-09-06T07:36:56.856962Z"
    },
    {
      "original": "Flying to Khotin",
      "timestamp": "2025-09-06T07:36:56.856965Z"
    },
    {
      "original": "Another Iskander was launched",
      "timestamp": "2025-09-06T07:36:56.856968Z"
    },
    {
      "original": "Both disappeared",
      "timestamp": "2025-09-06T07:36:56.856972Z"
    },
    {
      "original": "The speed suggests they were S-300s in Ground-to-ground mode",
      "timestamp": "2025-09-06T07:36:56.856975Z"
    },
    {
      "original": "Another missile flying in the same direction",
      "timestamp": "2025-09-06T07:36:56.856978Z"
    },
    {
      "original": "Another missile flying in the same direction",
      "timestamp": "2025-09-06T07:36:56.856981Z"
    },
    {
      "original": "This one disappeared too. They are targeting the border area near Khotin.",
      "timestamp": "2025-09-06T07:36:56.856984Z"
    },
    {
      "original": "Another S-300 to Khotin",
      "timestamp": "2025-09-06T07:36:56.856987Z"
    },
    {
      "original": "Another S-300 to Khotin",
      "timestamp": "2025-09-06T07:36:56.856990Z"
    },
    {
      "original": "Two were launched here. Both impacted the same area near the frontline.",
      "timestamp": "2025-09-06T07:36:56.856993Z"
    },
    {
      "original": "Analysis on the Pokrovske-Prosyana direction (Part 1):\nSince the fall of Vuhledar, Russian forces have been carrying out a concerted effort to collapse and capture the rest of Ukrainian-controlled south Donetsk Oblast. Now with that goal almost completed, the next goal for Russia in this direction is likely to seize two important settlements in Zaporizhzhia Oblast and Dnipropetrovsk Oblast: The city of Hulyaipole, and the town of Pokrovske. \nBoth Hulyaipole and Pokrovske are key logistical hubs for Ukrainian forces defending the line from Andriivka-Kletsove in Donetsk Oblast, to the eastern flank of Orikhiv in Zaporizhzhia Oblast. However, Hulyaipole is the strongest of the two, and lies right next to the line of contact in an area that has seen little movement for over three years. Ukrainian forces have used this time to convert this city into a fortress that Russia would undoubtably take substantial losses if trying to storm head on. So naturally, Russia will likely carry out their usual strategy with cities like this: simply bypassing them and attacking from the less-fortified rear. \nAfter the fall of Vuhledar in September 2024, the frontline entered a stage of collapse, as the Ukrainians didn't carry out a coordinated withdrawal and fallback from the city. This allowed for the Russians to simply keep advancing further and further, with their only difficult points being specific settlements with higher concentrations of Ukrainian manpower. This continued until they reached the outskirts of Velyka Novosilka, which after a second series of attacks (including coordinated efforts from the west), also fell quite quickly relative to its significance. \nThe fall of Velyka Novosilka marked a new era for the remnants of the south Donetsk front. It allowed for a refocusing of efforts west of the city after the remaining pockets of Ukrainian resistance south of the Vovcha River and east of the Mokri Yaly River were cleared. The fall of Velyka Novosilka led to the subsequent fall of Komar, and the establishment of a three-settlement line of key logistical hubs now used by Russia to attack even further west to achieve their new goals. \nI have split this into three areas: 1, 2, and 3: \nArea 1 is largely supplied by Komar, with its southern boundary forming the operational border between the Russian 36th and 6th Combined Arms Armies. Area 1 covers the remnants of the Ukrainian positions east of the Vovcha River, as well as south of Novopavlivka. \nArea 2 is largely supplied by Velyka Novosilka, and covers the zone from the bend in the Vovcha River to the Yanchur River, and includes the Donetsk-Zaporizhzhia-Dnipropetrovsk tri-border point. \nArea 3 is largely supplied by Staromylnivka, and covers the East-Zaporihzhzhia front, including Hulyaipole. It is the strongest and most stable section of this front. \nBut let's break this down further before looking at possible future movements\n.\nArea 1 was previously the \"easiest\" section of this front for Russia. After they had properly established themselves west of the Mokri Yaly River, they were able to advance to the eastern bank of the Vovcha River. However, Komar's proximity to the frontline, and its position in what was at the time a more evident salient, made it difficult to transfer supplies through due to the presence of Ukrainian FPV drones. Ukrainian forces likely took advantage of this and exploited a lack of Russian consolidation in and around Andriivka-Klevtsove, Zelenyi Hai, and Olekandrohrad, to conduct a series of counterattacks towards the Mokri Yaly River. However, the presence of the Vovcha River made supply for the Ukrainians here difficult too, and the attacks eventually resulted in a withdrawal from their forward positions in and around Tolstoi. But to further cement Russia's presence in Area 1, Russian assault operations were carried out to the bend in the Vovcha River in order to further isolate Ukrainian positions east of the river, which brings us to Area 2. \n(\nPart 2\n below)",
      "timestamp": "2025-09-06T07:36:56.857006Z"
    },
    {
      "original": "Analysis on the Pokrovske-Prosyana direction (Part 1):  Since the fall of Vuhledar, Russian forces have been carrying out a concerted effort to collapse and capture the rest of Ukrainian-controlled south Donetsk Oblast. Now with that goal almost completed…",
      "timestamp": "2025-09-06T07:36:56.857009Z"
    },
    {
      "original": "Analysis on the Pokrovske-Prosyana direction (Part 2):\nArea 2 is where the bulk of Russian offensive actions are taking place. They have been constantly fattening their zone of control west of the Mokri Yaly River, and are now over 20km west of it. Here, they have been exploiting a lack of Ukrainian manpower to move through fields and treelines relatively quickly and \"smoothly\", bypassing key villages which hold the main Ukrainian presences, taking them into dangerous salients, and forcing them to withdraw (Komyshuvakha is a prime example of this). Ukraine simply can't cover every section of Area 2 with soldiers, so instead chooses to concentrate most of them in settlements, utilising their cover for forward deployment points to exert their control outwards to the fields. Naturally, this gives Russian drone operators easier targets to hit, as the positions of Ukrainians are more predictable. With these quicker Russian advances, Ukrainian drone operators in villages previously several kilometres behind the line of contact are often caught off guard and have to quickly (and likely chaotically) withdraw further west, set up their new UAV control points, and go through the process of re-establishing themselves effectively. This takes time, is very dangerous when closer to the line of contact, and the lag between the withdrawal and completion of new positions results in less Ukrainian FPV drone coverage, which Russia exploits for less losses when advancing here.\nArea 3 sees little frontline activity. Skirmishes and occasional ground attacks occur, but it's mostly limited to mutual artillery shelling and FPV drone strikes on well-dug-in positions. But I believe there is a reason for this, and that is because the Russians don't need to advance here right now...\nWith the Ukrainian presence west of the Vovcha River in Area 1 now isolated and likely coming to an end, and Russian forces enjoying steady advances westwards in Area 2, it appears that Russia is trying to reach the town of Pokrovske and subsequently the rear of Hulyaipole. A significant portion of movement in and out of Hulyaipole goes through Pokrovske, so if the Russians can capture Velykomykhailivka (another important Ukrainian logistical hub), then get close to, and capture Pokrovske, it will put them in a much stronger position to storm Hulyaipole from three directions. Currently Russian forces are advancing downhill to the rest of Hulyaipole - reminiscent of the operations to reach the rear of Vuhledar. If they cross the Yanchur River and establish a solid bridgehead west of it, the city will be in danger of being taken into a pocket. Area 3 won't have to be activated unless it becomes the \"bottom of the salient\", where supply for Ukraine is the most difficult due to its distance from the outside of the salient, similar to the current situation in Pokrovsk-Myrnohrad. \nBut there is one other thing to consider with a prolonged operation like this: It may depend on the situation on other fronts - namely Novopavlivka to the northeast. Depending on how strong Ukraine is in the Pokrovske area when the town falls, Russia may have to have collapsed the Novopavlivka salient, and advance north of the Vovcha River to the north of Pokrovske, but that could be difficult due to the placement of Mezhova. This is why it would be impossible to put a timeline on an operation like this, as all sections of the frontline influence each other. \nLegend for the map:\nOrange lines: Important roads\nGreen lines: Area boundaries\nYellow circles: Important logistical hubs\nRed arrows: Possible approximate future Russian attack vectors\nLight blue lines: Significant rivers\n(\nPart 1\n above)",
      "timestamp": "2025-09-06T07:36:56.857028Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n The IDF announced the designation of a humanitarian area in Khan Yunis and urged citizens to enter the area as ground operations expand in Gaza City under Operation Gideon’s Chariots II.\n@wfwitness",
      "timestamp": "2025-09-06T07:36:56.857036Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n The IDF announced the designation of a humanitarian area in Khan Yunis and urged citizens to enter the area as ground operations expand in Gaza City under Operation Gideon’s Chariots II.  @wfwitness",
      "timestamp": "2025-09-06T07:36:56.857041Z"
    },
    {
      "original": "This area has limited infrastructure and is not very big, but interestingly it includes most of Khan Younis Refugee Camp in eastern Khan Younis City, which was previously under a mandatory evacuation order. Khan Younis camp has its own dedicated Hamas battalion under the Khan Younis Brigade, and is the source of most attacks on Israeli forces in Khan Younis.",
      "timestamp": "2025-09-06T07:36:56.857044Z"
    }
  ],
  "script_run_time": "2025-09-06T07:36:57.238248Z"
}