{
  "messages": [
    {
      "original": "🛵\nЗапоріжжя! БпЛА над містом! Перебувайте в укриттях!",
      "timestamp": "2026-01-18T11:37:23.941155Z"
    },
    {
      "original": "🛸\n🛸\n Активність ворожих розвідувальних БпЛА на Чернігівщині (райони Чернігова і Славутича), на Сумщині (Глухівська, Білопільска громади) на сході та півдні Харківщини (н.п.Приколотне, Шевченкове, Лозова), на Донеччині та  сході Дніпропетровщини.",
      "timestamp": "2026-01-18T11:37:23.941175Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Харківщину зі сходу та Донеччину.",
      "timestamp": "2026-01-18T11:37:23.941181Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Нікопольський р-н), курс - західний/південно-західний.",
      "timestamp": "2026-01-18T11:37:23.941185Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку область.",
      "timestamp": "2026-01-18T11:37:23.941190Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА на півночі Київського водосховища, курс - південний.",
      "timestamp": "2026-01-18T11:37:23.941196Z"
    },
    {
      "original": "🛸\n🛸\n Активність ворожих розвідувальних БпЛА на півночі Київщини, в центральній частині Сумщини, на сході Харківщини та Дніпропетровщини, на Донеччині.",
      "timestamp": "2026-01-18T11:37:23.941202Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході Запорізької області, курс - північний/східний.",
      "timestamp": "2026-01-18T11:37:23.941207Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2026-01-18T11:37:23.941212Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Вільнянська з північного заходу.",
      "timestamp": "2026-01-18T11:37:23.941216Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку м.Дніпро з півдня.",
      "timestamp": "2026-01-18T11:37:23.941222Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Запоріжжя з північного заходу.",
      "timestamp": "2026-01-18T11:37:23.941228Z"
    },
    {
      "original": "🛵\n🛸\n Дніпропетровщина: БпЛА на південному сході від Павлограда, курс-східний/північно-східний.",
      "timestamp": "2026-01-18T11:37:23.941236Z"
    },
    {
      "original": "🛵\n🛸\nБпЛА в напрямку Харкова з півночі.",
      "timestamp": "2026-01-18T11:37:23.941242Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході від Новгород-Сіверська, курс - південно-західний.",
      "timestamp": "2026-01-18T11:37:23.941247Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на півдні Донеччини курсом на схід Дніпропетровщини.",
      "timestamp": "2026-01-18T11:37:23.941254Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА в напрямку н.п.Солоне, Тернівка.",
      "timestamp": "2026-01-18T11:37:23.941258Z"
    },
    {
      "original": "🛵\n🛸\nБпЛА в напрямку Харкова з північного сходу.",
      "timestamp": "2026-01-18T11:37:23.941264Z"
    },
    {
      "original": "🛵\n🛸\n Херсонщина: БпЛА в напрямку н.п.Висунці з півдня.",
      "timestamp": "2026-01-18T11:37:23.941269Z"
    },
    {
      "original": "🛵\n🛸\n Чернігівщина: БпЛА в напрямку Чернігова/Славутича та н.п.Куликівка.",
      "timestamp": "2026-01-18T11:37:23.941275Z"
    },
    {
      "original": "In the Bilyi Kolodyaz and Ternova directions, Russian forces continued their assault operations and have advanced in five different areas. \nIn the east, following a series of unsuccessful Ukrainian counterattacks, Russian forces advanced south from Lyman, capturing positions in the forests outside the village. They also made additional incremental progress through the forests southwest of Lyman, and in the direction of eastern Hrafske.\nTo the northwest, Russian forces captured the western part of Prylipka, as well as the remaining positions in the forests to the south of the village. From there, they began pushing south and southwest in the direction of Hrafske, collapsing most of the remaining Ukrainian defences outside the village. \nIn the west, Russian forces continued incrementally advancing in eastern Startsya, and restarted their assault operations further west. As a result of these new attacks, they managed to gain a foothold in multiple forested areas in the gulleys west of the village.\n+ ~4.88 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768521Z"
    },
    {
      "original": "In the Khotin, Yunakivka, and Myropillya directions, Russian forces continued their assault operations and have advanced in two different areas.\nIn the west, Russsian forces continued advancing south from Andriivka, capturing new positions in the treelines there. Attacks were also carried out on the forest plantations northwest of Mala Morchakivka. \nTo the east, Russian forces restarted their assault operations in the direction of Sadky, and entered the forests north of the village. A grey-zone has formed and fighting is ongoing.\nFurther east, Russian forces restarted their assault operations in the direction of Oleksandriya. Despite an initial failed attack, they were able to recapture a number of positions in the forests just south of the international border. \n+ ~1.58 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768539Z"
    },
    {
      "original": "In the Hlukhiv direction, Russian forces crossed the international border into Sumy Oblast, capturing the village of Komarivka.\nAround three weeks ago, Russian soldiers crossed the Kleven River (which runs along the international border) at multiple points in the direction of Komarivka and Kharkivka. While the attacks on Kharkivka were ultimately repelled, the Russians were able to establish a small bridgehead in Komarivka.\nFrom there, they began to expand the bridgehead to include the rest of the village, and captured parts of the forests to the east and southwest.\n+ ~4.90 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768547Z"
    },
    {
      "original": "Footage showing two strikes on a Ukrainian HIMARS launcher near the village of Svirok, Chernihiv Oblast, with Russian drones of an unknown type, after it carried out launches into Bryansk Oblast.\nCoordinates: 51.73405, 32.65498",
      "timestamp": "2026-01-18T11:37:24.768551Z"
    },
    {
      "original": "Zelensky has issued a statement claiming that Russia is preparing another large-scale, combined missile and drone attack on Ukraine.\nLast time he did this, there was an attack the same day, however there will be no attack tonight as Russian preparations are not complete yet. \n- 1 Tu-95MS redeployed from Ukrainka Airbase, Amur Oblast, to Olenya Airbase, Murmansk Oblast after being equipped with Kh-101 cruise missiles. 7 other Tu-95s (that are used for combat missions) are still stationed at Ukrainka Airbase. \n- 3 Buyan-M corvettes were deployed from Kaspiysk Naval Base, Republic of Dagestan, to the waters of the Caspian Sea. They can launch a maximum of 24 Kalibr cruise missiles.\n- Equipments of Kalibr carriers with missiles at Novorossiysk Naval Base, Kransodar Krai, may also be underway.\n- Additional deliveries of Iskander-M ballistic missiles and Iskander-K cruise missiles to OTRK installations near Ukraine have taken place. \n- Kinzhals launched from MiG-31Ks may also be used, but likely only in conjunction with Kh-101 cruise missiles from strategic bombers. \n- A minimum of 350 Geran-2 drones are expected to be used during this attack.\nIf Tu-95MS and Tu-160 strategic bombers are used, the highest threat is to the western regions of Ukraine, especially energy infrastructure in Lviv and Ivano-Frankivsk Oblasts. This would also increase the likelihood of MiG-31K fighters being involved and decrease the chances of Iskander-Ks being used.\nIf strategic bombers aren't used, the highest threat is to the central and northern regions of Ukraine, especially energy and gas infrastructure in Kyiv and Poltava Oblasts. This would decrease the likelihood of MiG-31Ks being involved and increase the chances of Iskander-Ks being used. \nAs for the claim of possible Oreshnik IRBM launches that have been floating around, there is no actual threat right now. Anyone claiming that is fear mongering or copy-pasting unreliable sources. Iskander-I (Iskander-M with 1,000 range) might be used, but this seems unlikely for the next few weeks.\nInformation continues to be clarified as there have been a lot of inaccurate and conflicting reports recently.",
      "timestamp": "2026-01-18T11:37:24.768563Z"
    },
    {
      "original": "Situation in northern Syria:\nFollowing negotiations between the U.S. and SDF, the SDF agreed to withdraw from most of the rest of their positions west of the Euphrates River in the Aleppo Governorate, including the towns of Dayr Hafir and Maskanah, leaving only their small bridgehead west of the Tishreen Dam. \nThe first withdrawals from frontline positions near Dayr Hafir have already begun, with the main movements expected closer to 7am local time (around 5 hours from the time of writing). The STG has agreed not to target the withdrawing SDF units, who will receive reinforcements to assist in this operation. \nMeanwhile, clashes between the SDF and SNA + STG formations continue in the direction of the Tishreen dam (red square), while both sides continue mutual shelling of other areas with artillery and MLRS.",
      "timestamp": "2026-01-18T11:37:24.768570Z"
    },
    {
      "original": "Russian forces have recaptured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.38 km².",
      "timestamp": "2026-01-18T11:37:24.768583Z"
    },
    {
      "original": "Ukrainian UAVs attacked the \"Atlant Aero\" plant in the city of Taganrog, Rostov Oblast.   Explosions were heard and a large fire broke out at the production buildings.   Atlant Aero specialises in the production of of aircraft and spacecraft. It also produces…",
      "timestamp": "2026-01-18T11:37:24.768588Z"
    },
    {
      "original": "The Ukrainian Navy published high-resolution satellite imagery showing the damage the \"Atlant Aero\" plant sustained after it was hit by at least 1 Neptune cruise missile, and possibly UAVs, in Taganrog, Rostov Oblast.\nThe main damage is to production workshops for drones. This plant produces Molniya FPV drones, as components for Orion drones.",
      "timestamp": "2026-01-18T11:37:24.768594Z"
    },
    {
      "original": "Last night, Russia carried out another Geran-2 drone attack on the Kyiv Hydroelectric Power Plant in the city of Vyshhorod, Kyiv Oblast.\nAt least 7 impacts were recorded, with power outages and fluctuations reported.",
      "timestamp": "2026-01-18T11:37:24.768598Z"
    },
    {
      "original": "Kharkiv City is once again under attack from Russian Tornado-S rockets. \nAt least 8 impacts have been recorded so far, targeting the Kharkiv Tractor Plant. A large fire can be seen burning from the impact site.",
      "timestamp": "2026-01-18T11:37:24.768603Z"
    },
    {
      "original": "Kharkiv City is once again under attack from Russian Tornado-S rockets. \nAt least 8 impacts have been recorded so far, targeting the Kharkiv Tractor Plant. A large fire can be seen burning from the impact site.",
      "timestamp": "2026-01-18T11:37:24.768607Z"
    },
    {
      "original": "Update from northern Syria:\nFollowing the SDF withdrawal from most of the Aleppo Governorate west of the Euphrates River, STG government forces began advancing further, collapsing SDF lines south of the river. \n- They advanced east down the M-4 highway, quickly reaching the city of Al Taqbah from the west. \n- They advanced north down the road from the M-42 Highway, capturing the Safiya and Thawra Oil Fields, before entering and establishing control over the Taqbah Airbase. \n- They advanced north up the M-6 Highway from Resafa, capturing Al-Mansurah, before pushing west down the M-4 Highway, reaching Al-Taqbah from the east, while other forces secured the rest of the southern bank of the Euphrates River further east.\nFrom there, an assault on Al Taqbah was launched, with the STG capturing the southern part of the city, including the prison. Fierce street battles are ongoing with the SDF, who are expected to withdraw north over the Euphrates River soon. \nMeanwhile, fighting has begun in the Deir-Ezzor and Raqqah Governorates between tribal Arab groups and the SDF, resulting in the SDF bringing in reinforcements to those areas.",
      "timestamp": "2026-01-18T11:37:24.768615Z"
    },
    {
      "original": "Footage showing Russian Geran-2 drone strikes on the \"Zaporizka\" 750 kV substation and the \"Zaporizhia-330\" 330 kV substation in Zaporizhzhia Oblast. \nThese strikes likely took place before January 13. Since then, the 750 kV substation has been hit with at least 6 Iskander-M ballistic missiles. A second fresh crater can also be seen in the snow behind the strike on the 330 kV substation.\n750 kV coordinates: 47.99956, 35.50957\n330 kV coordinates: 47.90490, 35.24912",
      "timestamp": "2026-01-18T11:37:24.768621Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Kiliya, Odesa Oblast. Approximately 10 drones were used.\nThe substation was protected by large concrete barriers aimed at minimising damage from Geran strikes, however these barriers suffered significant damage and a fire subsequently broke out. \nCoordinates: 45.47710, 29.24244",
      "timestamp": "2026-01-18T11:37:24.768626Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Kiliya, Odesa Oblast. Approximately 10 drones were used.\nThe substation was protected by large concrete barriers aimed at minimising damage from Geran strikes, however these barriers suffered significant damage and a fire subsequently broke out. \nCoordinates: 45.47710, 29.24244",
      "timestamp": "2026-01-18T11:37:24.768630Z"
    },
    {
      "original": "In the Komyshuvakha direction, Russian forces continued their assault operations \"wrapping up\" the Ukrainian fortifications from the west, and have made new progress in two different areas. \nIn the south, Russian forces continued taking positions northeast of Stepove, and entered new treelines and forest plantations in the direction of Mali Shcherbaky. \nTo the north, the Russians secured positions northwest of Pavlivka, and following earlier infiltrations, consolidated in the western part of the village. Fierce fighting is ongoing for the rest of the settlement.\nAdditionally, Russian assault groups continued their attacks into Novoyakovlivka and Novoboikivske where the grey-zone remains.\n+ ~4.24 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768638Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued their assault operations and have advanced in two different areas.\nIn the southwest, after capturing Zelene, Russian forces advanced west and captured positions in the treelines east of the reservoirs. Other forces consolidated in the southern part of Olenokostiantynivka following earlier infiltrations, and pushed west from there too, capturing new positions in the treelines and an orchard and infiltrating further west in the direction of Tsitkove. \nIn the northeast, Russian forces began advancing northwest of Solodke again. They managed to eliminate the Ukrainian presence in a number of areas, transforming the situation from a state of mixed positions overlapping each other, to somewhat solid Russian control. They also entered territory previously re-consolidated by Ukrainian forces, and recaptured a number of treeline positions there.\n+ ~15.20 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768645Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces have made additional progress in two different areas, while deep infiltrations into the grey-zone continue.\nIn the southwest, following earlier attacks, Russian forces managed to establish full control over Ivanivka. From there, they infiltrated further west in the direction of Novyi Donbas. Prior to this, infiltrations t Novyi Donbas were carried out along the railway line from Dorozhnje. Meanwhile, fighting continued in western and central Nove Shakhove, with both Russian and Ukrainian forces carrying out attacks.\nTo the northeast, Russian forces continued infiltrating deep into the grey-zone. The main Ukrainian resistance here consists of FPV drone strikes on movement  in Russian-controlled territory, and on the movements of soldiers through the grey-zone in the direction of Ukrainian positions. Russian forces continue carrying infiltrations into the dachas northeast of Nove Shakhove and towards the southern approaches to Kucheriv Yar.\nTo the east, Russian forces captured positions in the forest plantations just outside Toretske and entered the large trench fortification there. From there, Russian soldiers entered the southern part of the village and carried out infiltrations into its central streets.\n+ ~2.01 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768653Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their offensive and have made new progress south of Kostyantynivka.\nIn the west, after clearing the pocket south of the highway, Russian forces began advancing north of the highway, capturing new treeline positions and entering the southeastern houses of Stepanivka.\nTo the east, Russian forces advanced northeast up the highway towards Berestok, capturing positions in the windbreaks. Other assault groups completed the capture of the forests north of the Kleban-Bykske Reservoir following a Ukrainian withdrawal and consolidated in additional treeline positions south of Berestok. A few Ukrainian soldiers remain trapped in bunkers in the forests north of the reservoir, and Russian forces are carrying out combing operations. Attacks are also being carried out north in the direction of Kostyantynivka, as well as through the fields in the grey-zone west of Ivanopillya.\nIn the northeast, Russian forces continued their assault operations in the area of the Kostyantynivka Railway Station and in the southeastern streets, but are struggling with logistics due to the Ukrainian FPV drone kill-zones imposed on logistical routes. Russian forces are also infiltrating in small groups along the highway from Stupochky, with some soldiers reaching as far as eastern Kostyantynivka. \n+ ~6.10 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768661Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continue to advance on a wide front from Sviato-Pokrovske to Markove, further developing their offensive. \nIn the northeast, Russian forces fully secured the western face of the gulley that leads southwest from Riznykivka, capturing positions in the forest plantations there, and consolidated in the eastern part of the large forest to the southwest. They also captured additional positions on the tactical heights overlooking the forest.\nTo the southwest, following earlier infiltrations, Russian forces consolidated in the first houses of Nykyforivka. Attacks are continuing, aimed at expanding their foothold. \nFurther southwest, the Russians captured the central and northeastern parts of Minkivka and improved their positions the southern and southwestern parts, while other forces secured new treeline positions to the south and advanced further northwest up the windbreaks on either side of the Siverskyi Donets Canal. Additionally, they captured further treeline positions southwest of Novomarkove and entered the eastern part of Markove which is now practically entirely in the grey-zone. \n+ ~8.63 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-18T11:37:24.768668Z"
    },
    {
      "original": "U.S. Issues Warning As Syrian Government Forces Corner Kurdish Fighters In Raqqa (Videos)\nThe United States military’s Central Command (CENTCOM) on January 17 issued a warning to the forces of the Islamist-led Syrian Transitional Government (STG) over their ongoing large-scale offensive against the Kurdish-led Syrian Democratic Forces in the north of the country.\nThe battle began in the morning when the STG sent its forces to a wide area to the west of the Euphrates River in the eastern Aleppo countryside. A day earlier the SDF announced its intention to withdraw from the area under an agreement meant to de-escalate tensions with Damascus. However, the deployment of the government began faster than what was agreed on.\nThe government didn’t stop there. It escalated further, designating all areas to the west of the Euphrates as a “closed military zone,” including the city of Tabqa and its surroundings in the southern Raqqa countryside, which were not a part of the original agreement.\nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598026Z"
    },
    {
      "original": "U.S. Issues Warning As Syrian Government Forces Corner Kurdish Fighters In Raqqa (Videos)\nThe United States military’s Central Command (CENTCOM) on January 17 issued a warning to the forces of the Islamist-led Syrian Transitional Government (STG) over their ongoing large-scale offensive against the Kurdish-led Syrian Democratic Forces in the north of the country.\nThe battle began in the morning when the STG sent its forces to a wide area to the west of the Euphrates River in the eastern Aleppo countryside. A day earlier the SDF announced its intention to withdraw from the area under an agreement meant to de-escalate tensions with Damascus. However, the deployment of the government began faster than what was agreed on.\nThe government didn’t stop there. It escalated further, designating all areas to the west of the Euphrates as a “closed military zone,” including the city of Tabqa and its surroundings in the southern Raqqa countryside, which were not a part of the original agreement.\nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598044Z"
    },
    {
      "original": "Military Situation In Ukraine On January 17, 2026 (Maps Update)",
      "timestamp": "2026-01-18T11:37:25.598049Z"
    },
    {
      "original": "Military Situation In Ukraine On January 17, 2026 (Maps Update)",
      "timestamp": "2026-01-18T11:37:25.598054Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598063Z"
    },
    {
      "original": "Haichur Left Bank Under Fire: Russian Army Develops Offensive Against Ukrainian Forces In Zaporizhzhia\nIn the Zaporizhzhia sector, the Russian \"East\" units consolidated their success on the western bank of the Haichur River. They established control over Pryluky and advanced towards Vozdvyzhenka. The units also reached the approaches to Tsvitkove. \nIn the Slaviansk sector, the Russian army made progress after consolidating its position in Zakotne. Units of the 3rd Army of the \"South\" grouping are advancing toward the Kryva Luka–Kalenyky line while continuing to fight intensely for Reznikivka. \nIn the Kostiantynivka sector, fierce battles are ongoing to the northwest of the city. An offensive is also developing on the southern flank from the Kleban-Byk Reservoir. In the Sumy sector, assault groups advanced up to 750 meters along fifteen sections of the front in the Sumy region. \nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598071Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-18T11:37:25.598078Z"
    },
    {
      "original": "Patriot Targeted: Summary Of Russian Combat Footage From January 17, 2026\nOn January 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-18T11:37:25.598085Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598094Z"
    },
    {
      "original": "Syrian Government Takes Over Tabqa, SDF Collapses In Deir Ezzor After Tribal Uprising (Videos)\nThe forces of the Islamist-led Syrian Democratic Forces (STG) have captured the strategic city of Tabqa in the southern Raqqa countryside from the Kurdish-led Syrian Democratic Forces (SDF).\nSyria’s Information Minister Hamza al-Mustafa announced the capture of the city along with the Euphrates Dam early on January 18. It was reported that several sleeper cells made of Arab tribal fighters linked to the STG facilitated the government’s final assault on the city.\nThe loss of Tabqa was a major blow to the SDF, whose leadership agreed to withdraw from a nearby area around the town of Deir Hafer in the western Aleppo countryside to de-escalate a day earlier. The STG took over that wide area, then pushed towards the city, effectively violating the agreement.\nAs STG forces were deploying in Tabqa, an Arab tribal uprising began in the areas controlled by the SDF in the eastern Deir Ezzor countryside.\nRead more \nHERE",
      "timestamp": "2026-01-18T11:37:25.598103Z"
    }
  ],
  "script_run_time": "2026-01-18T11:37:25.598904Z"
}