{
  "messages": [
    {
      "original": "🛵\n Ударні БпЛА на Вишгородський район Київської області.",
      "timestamp": "2025-10-12T15:26:39.597159Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T15:26:39.597173Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини, курсом у Запорізьку область.",
      "timestamp": "2025-10-12T15:26:39.597179Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T15:26:39.597184Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T15:26:39.597190Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на півночі Сумщини, курсом на південь.",
      "timestamp": "2025-10-12T15:26:39.597194Z"
    },
    {
      "original": "🛵\n БпЛА на Бориспільський район.",
      "timestamp": "2025-10-12T15:26:39.597203Z"
    },
    {
      "original": "🛵\n БпЛА на заході Харківщини, курсом на Харків.",
      "timestamp": "2025-10-12T15:26:39.597207Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-10-12T15:26:39.597213Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T15:26:39.597217Z"
    },
    {
      "original": "🛵\n Ударний БпЛА на південь від Павлограду, на північно-західний напрямок.",
      "timestamp": "2025-10-12T15:26:39.597222Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-12T15:26:39.597226Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T15:26:39.597230Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-12T15:26:39.597235Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-12T15:26:39.597239Z"
    },
    {
      "original": "Курсом на Харків.",
      "timestamp": "2025-10-12T15:26:39.597242Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини, курсом на південь та на схід.",
      "timestamp": "2025-10-12T15:26:39.597247Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T15:26:39.597251Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T15:26:39.597256Z"
    },
    {
      "original": "🚀\nПуски КАБ на схід Харківщини.",
      "timestamp": "2025-10-12T15:26:39.597260Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-10-12T15:26:39.597264Z"
    },
    {
      "original": "Deepstate has just transferred most of Kupyansk City west of the Oskil River into their dreaded grey-zone.",
      "timestamp": "2025-10-12T15:26:40.205263Z"
    },
    {
      "original": "In the Lyman direction, and on the northern flank of Siversk, Russian forces continued to advance, making new progress in four different areas.\nIn the east, Russian forces were able to clear the remaining Ukrainian positions in the forests directly west of Dronivka, and have reached the railway bridge over the Siverskyi Donets River. They havs also begun pushing south through the forests, down the western bank of the river.\nFurther west, Russian forces continued to develop their attacks in Yampil. After entering Yampil from the north, they continued to push south and have captured part of the centre of the village, including the local church, and have entered the western residential areas. Ukrainian forces are counterattacking from the southwestern streets, slowing down the Russian advance. \nTo the north, Russian forces broke through Ukrainian positions west of the railway crossing and began pushing further west down the railway line through the Yampil Forest. They also secured positions in the forests to the north after separate attacks were carried out. \nFurther north, Russian forces began assault operations from their positions in the forests south of Zarichne. They were able to advance down the Zarichne - Yampil Road, and have cleared additional trenches to the west. Clearing operations are now underway on the Ukrainian salient in the area of the road. \n+ ~4.86 km² in favour of Russia.",
      "timestamp": "2025-10-12T15:26:40.205279Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive towards the city and have made progress in four different areas.\nIn the southeast, under heavy artillery and FPV drone cover, Russian forces continued to advance west through the forested gulley and have captured new trenches. They also established control over new positions in the forests to the north and are approaching the rear of the main Ukrainian strongpoint in the agricultural complex. Ukrainian forces are counterattacking in the forested gulley, slowing down the Russian advance. The Ukrainians are also continuing their attempts at recapturing the agricultural complex within the village limits of Zarichne, but have so far been unsuccessful. \nFurther north, Russian forces continued their assault operations south of Kolodyazi, and have completed the capture of two parallel treelines. From there, they entered the adjacent gulley, and secured positions in the forest plantations, further isolating the Ukrainian pocket in and around the village of Myrne. Additionally, the Russians were able to clear the trench strongpoint at the intersection of two treelines, which Ukrainian forces infiltrated earlier. \nTo the west, Russian forces advanced down two treelines towards the road northeast of Stavky. Additional forces have also managed to complete the capture of the Ukrainian strongpoints in the forested gulley northeast of Drobysheve, while other assault groups cleared the two treelines on the tactical heights to the northwest. From there, the Russians pushed southwest down a treeline and a nearby gulley and established control over positions on the Drobysheve - Zarichne Road. \n+ ~8.18 km² in favour of Russia.",
      "timestamp": "2025-10-12T15:26:40.205287Z"
    },
    {
      "original": "Pakistan confirms that 23 of its soldiers have been killed in the cross-border clashes between them and Afghan Taliban. They also claimed that 200 from the Afghan side (likely including militants from TTP) were killed. \nPakistan is currently confirmed to be in control of 6 Afghan Taliban border posts but claim control over 21. Fighting, including artillery shelling, is still ongoing.",
      "timestamp": "2025-10-12T15:26:40.205292Z"
    },
    {
      "original": "Pakistani soldiers captured an American-made Humvee vehicle used by Afghan Taliban forces after it was left behind at one of their border posts captured by Pakistan.",
      "timestamp": "2025-10-12T15:26:40.205295Z"
    },
    {
      "original": "More Afghan Taliban reinforcements, including Humvees, were seen moving through the Spin Boldak District, Kandahar Provinnce, towards the border with Pakistan.\nApproximate coordinates: 31.31666, 65.96416 (around 58 km from the international border).",
      "timestamp": "2025-10-12T15:26:40.205299Z"
    },
    {
      "original": "The Israeli Prime Minister's Office, along with Al-Arabi, and Israeli Channel 12 report that all Israeli hostages - dead and alive - will be released early tomorrow morning, in exchange for the release of 2,000 Palestinian prisoners.\nThe exact time is reportedly going to be 6am local time, which is just under 14 hours from now.",
      "timestamp": "2025-10-12T15:26:40.205303Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T15:26:40.205306Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T15:26:40.205310Z"
    },
    {
      "original": "Explosions were just heard in the area of Boryspil, Kyiv Oblast, after 2 Russian Geran-3 jet drones attacked the region.",
      "timestamp": "2025-10-12T15:26:40.205317Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations along the eastern bank of the Oskil river, and have made progress in the village of Zahryzove.\nRussian forces advanced south from their positions in the northernmost part of Zahryzove, crossing a tributary of the Oskil River, and establishing control over new positions towards the centre of the village. They then went on to push further south through the residential areas, capturing the centre of the village, and reaching the southern streets, where fighting is now ongoing. \nOther forces advanced south from the forests southwest of Kruhlyakivka, crossing over the railway bridge, and establishing control over the forests to the south in the area of the railway tracks. These attacks largely aligned the front with the assault groups in central Zahryzove, although consolidation is ongoing. \n+ ~3.29 km² in favour of Russia.",
      "timestamp": "2025-10-12T15:26:40.205323Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces resumed their assault operations northwest of Stepova Novosilka, and have captured new trench positions. \nFollowing the capture of a substantial amount of ground west and northwest of Stepova Novosilka last month, Russian forces have now begun attacking towards the southeastern edge of Petropavlivka. They advanced west from their newly established positions in the treelines, capturing a forested area. From there they entered the treeline to the west, securing trench positions. \nTo the south, the Russians advanced from the treeline positions just north of the highway, and established control over a new trench line, thereby securing the southern flank of the captured positions to the north. \n+ ~0.98 km² in favour of Russia.",
      "timestamp": "2025-10-12T15:26:40.205329Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.\nEarlier, clashes were reported in multiple parts of Gaza City between Hamas' internal security forces and Gazan clans as a part of Hamas' large-scale, coordinated effort to regain full authority over Gaza Governorate, in preparation for the next state of the peace plan.",
      "timestamp": "2025-10-12T15:26:40.205333Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.\nEarlier, clashes were reported in multiple parts of Gaza City between Hamas' internal security forces and Gazan clans as a part of Hamas' large-scale, coordinated effort to regain full authority over Gaza Governorate, in preparation for the next state of the peace plan.",
      "timestamp": "2025-10-12T15:26:40.205337Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are carrying out assault operations, with Russian forces making progress towards the village of Varachyne. \nOnce the situation in and around Novomykolaivka had stabilised, Russian forces began launching a series of counterattacks. They were able to advance southwest down a treeline along the tactical heights, resecuring the road into Oleksiivka, allowing for limited ground supply into the village to return for the Russian garrison stuck there. \nRussian forces were also able to consolidate in the southeastern houses of Novomykolaivka, and began advancing along the tactical heights towards Varachyne from the northwest. They entered the treelines on its northwestern approaches, which were used to infiltrate the village, which is now in the grey zone. The Russians were also able to capture the treelines northeast of Varachyne. \nMeanwhile, Ukrainian forces continued their assault operations towards Oleksiivka, and have managed to consolidate in the agricultural buildings on its western outskirts. Attempts are now underway to enter the residential part of the village from the west. These attacks are being carried out under heavy FPV drone and artillery cover, which is resulting in heavy casualties for the Russian garrison in Oleksiivka, but due to the road being open for limited ground movement again, rotations can now be carried out to some extent. Ukrainian casualties in these attacks are also high, as the vast majority of them are being repelled. \n+ ~7.91 km² in favour of Russia.\n+ ~0.16 km² in favour of Ukraine.",
      "timestamp": "2025-10-12T15:26:40.205344Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.  Earlier, clashes…",
      "timestamp": "2025-10-12T15:26:40.205347Z"
    },
    {
      "original": "New rule for the Channel's group chat: All fascists will be perm muted, no exceptions. Fascism is not welcome here, unlike many other chats. \nIf you don't like that, you're the problem.",
      "timestamp": "2025-10-12T15:26:40.205351Z"
    },
    {
      "original": "New rule for the Channel's group chat: All fascists will be perm muted, no exceptions. Fascism is not welcome here, unlike many other chats.   If you don't like that, you're the problem.",
      "timestamp": "2025-10-12T15:26:40.205356Z"
    },
    {
      "original": "It's genuinely scary how quickly so many ordinary people have been radicalised by egotistical idiots like Nick Fuentes, and sigma edits on Tik Tok, and how normalised its become in online spaces.\nI'm generally very acceptive of almost all political opinions, but some things need to have strong measures put against.",
      "timestamp": "2025-10-12T15:26:40.205361Z"
    },
    {
      "original": "Russian Su-34s from over Belgorod Oblast carried out 2 KAB glide-bomb strikes on southeastern Kharkiv City, a short time ago.\nThe strikes targeted the Slobidskyi District, and the Nemyshlianskyi District, injuring at least one civilian. The exact targets are unknown at this moment, but it should become clearer later on. Currently it is known that no residential buildings suffered any significant damage.",
      "timestamp": "2025-10-12T15:26:40.205365Z"
    },
    {
      "original": "Russian Su-34s from over Belgorod Oblast carried out 2 KAB glide-bomb strikes on southeastern Kharkiv City, a short time ago.\nThe strikes targeted the Slobidskyi District, and the Nemyshlianskyi District, injuring at least one civilian. The exact targets are unknown at this moment, but it should become clearer later on. Currently it is known that no residential buildings suffered any significant damage.",
      "timestamp": "2025-10-12T15:26:40.205368Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744744Z"
    },
    {
      "original": "Squeezing ‘The Pocket’: Russian Forces Tighten Grip On Pokrovsk\nRussian troops are finalizing the operational encirclement of the forces defending Pokrovsk and Myrnohrad. Ukrainian forces have launched five counterattacks in the Oleksiyivka area. Russian units of the 70th Regiment have consolidated their positions in Mala Tokmachka.\nThe Hungarian government, led by Viktor Orbán, has launched a major petition campaign against the European Union's military strategy.\nRead more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744759Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T15:26:40.744767Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 11, 2025\nOn October 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-12T15:26:40.744773Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744783Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744792Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744801Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744809Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744818Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T15:26:40.744826Z"
    }
  ],
  "script_run_time": "2025-10-12T15:26:40.745623Z"
}