{
  "messages": [
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-24T11:28:42.740658Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Козелець, Славутич.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Чаплине.",
      "timestamp": "2025-11-24T11:28:42.740679Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів зі сходу!",
      "timestamp": "2025-11-24T11:28:42.740684Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-24T11:28:42.740688Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Донеччини, півдні Харківщини \n➡️\n курсом на Лозову.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на Славутич.",
      "timestamp": "2025-11-24T11:28:42.740696Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 125 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 24 листопада (з 19:00 23 листопада) противник атакував 162-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Брянськ, Орел, Міллерово, Приморсько-Ахтарськ – рф, Гвардійське - ТОТ АР Крим, понад 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 125 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 37 ударних БпЛА на 15 локаціях, а також падіння збитих (уламки) на одній локації. Найбільше постраждали об’єкти цивільної інфраструктури та приватні домогосподарства на Харківщині, Чернігівщині, Дніпропетровщині. На жаль, є жертви серед цивільного населення.\n✊\n Тримаймо небо!\n🇺🇦\nРазом – до перемоги!",
      "timestamp": "2025-11-24T11:28:42.740714Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-24T11:28:42.740722Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщині та Дніпропетровщині \n➡️\n на північно-західний напрямок.",
      "timestamp": "2025-11-24T11:28:42.740728Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-11-24T11:28:42.740732Z"
    },
    {
      "original": "🚀\nПуски КАБ на  Донеччину, в напрямку сходу Дніпропетровщини.",
      "timestamp": "2025-11-24T11:28:42.740736Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-24T11:28:42.740740Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігова \n➡️\n курсом південь.",
      "timestamp": "2025-11-24T11:28:42.740745Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині(на північ від н.п. Корюківка)\n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-11-24T11:28:42.740750Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини \n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-11-24T11:28:42.740756Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-24T11:28:42.740760Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на південь.",
      "timestamp": "2025-11-24T11:28:42.740765Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К",
      "timestamp": "2025-11-24T11:28:42.740771Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з півночі.",
      "timestamp": "2025-11-24T11:28:42.740775Z"
    },
    {
      "original": "🛵\n БпЛА на півночі від Сум, курс на захід.\n🛵\n БпЛА в напрямку Дніпра зі сходу.",
      "timestamp": "2025-11-24T11:28:42.740783Z"
    },
    {
      "original": "📢\n Відбій ракетної небезпеки.",
      "timestamp": "2025-11-24T11:28:42.740787Z"
    },
    {
      "original": "For all those saying I'm a psyop account living in Russia \n😁",
      "timestamp": "2025-11-24T11:28:43.443904Z"
    },
    {
      "original": "Everyone is freaking out about the new twitter location feature, and now my timeline is 90% posts about this. \nThis is why you don't lie about where you live lmao.",
      "timestamp": "2025-11-24T11:28:43.443916Z"
    },
    {
      "original": "First round of negotiations between  Ukrainian and American delegations was indeed quite tense.\nDuring one of these “heated” discussions, Umerov even broke his pen.",
      "timestamp": "2025-11-24T11:28:43.443920Z"
    },
    {
      "original": "First round of negotiations between  Ukrainian and American delegations was indeed quite tense.\nDuring one of these “heated” discussions, Umerov even broke his pen.",
      "timestamp": "2025-11-24T11:28:43.443924Z"
    },
    {
      "original": "During the day, the IDF carried out a targeted assassination strike on the Hezbollah chief of staff in the southern suburbs of Beirut.  The strike was successful, killing him along with 4 other Hezbollah members. The U.S. was reportedly not notified in advance.",
      "timestamp": "2025-11-24T11:28:43.443928Z"
    },
    {
      "original": "Israeli surface-to-air missile systems in northern Israel have been placed on high alert due to the threat of Hezbollah rocket launches from Lebanon in retaliation for the IDF assassination strike on the Hezbollah Chief of staff.",
      "timestamp": "2025-11-24T11:28:43.443931Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their assault operations, making new progress in two different areas.\nIn the east, Russian forces advanced further north along the E-105 Highway to Zaporizhzhia City where they captured additional positions in the Kollektivnyye Dachas, reaching its northeastern edge. They then infiltrated further north along the highway and reached the irrigation reservoir, where they are attempting to consolidate in the buildings there. Additionally, the Russians continued their assault operations in the western part of the Kollektivnyye Dachas, as well as on the Ogorody Dachas, so far without any confirmed advances.\nIn the west, Russian forces continued making incremental progress in Prymorske. They advanced further north through the southern residential areas, and reached the first gulley at Dachna Street, where new positions were captured. From there, they pushed further north and consolidated positions south of Stadionna Street, while DRGs penetrated towards the second gulley and the abandoned industrial buildings on its eastern outskirts. \n+ ~1.04 km² in favour of Russia.",
      "timestamp": "2025-11-24T11:28:43.443937Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces continued their assault operations on the village of Novodanylivka and have made important progress.\nRussian forces advanced further north from their positions south of Novodanylivka, capturing new positions in the forested areas and reaching its southern outskirts. From there, they continued infiltrating the southern part of the village, attempting to coordinate with soldiers already in the village from earlier attacks. As a result, they were able to cross the H-08 Highway and consolidate in the grey-zone in the southern houses and have since begun pushing further north into the centre. \nMeanwhile, clashes continue in Mala Tokmachka. Despite claims by Russian sources, Russian forces are still yet to complete the capture of the village and are attempting to clear the grey zone in the western streets. Ukraine brought in reinforcements to the village from Orikhiv, but the frontline is now stretched further due to the Russian assault on Novodanylivka. \n+ ~1.37 km² in favour of Russia.",
      "timestamp": "2025-11-24T11:28:43.443942Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to make quick progress and have captured two more villages east of Hulyaipole. \nAfter capturing Vesele, Russian forces continued developing their outflanking maneuver wet of Zelenyi Hai. They secured the rest of the positions north of the Kalmychka River, before expanding their zone of control further south in the direction of the reservoir. The Ukrainian command sent in significant reinforcements to Zelenyi Hai and Vysoke in an attempt to hold the line east of Hulyaipole, but didn't properly take into account the advances to the rear of the villages, resulting in a portion of them being encircled. \nRussian forces were able to advance from Vesele to the encircled Ukrainian formations in and around Zelenyi Hai, and quickly captured the village. They then advanced further south in coordination with assault groups attacking from the east, reaching and entering Vysoke. Vysoke was then captured shortly afterwards, along with additional treeline positions to the south, southwest, and west.\n+ ~25.40 km² in favour of Russia",
      "timestamp": "2025-11-24T11:28:43.443947Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovsk'e directions, Russian forces continued to make significant progress and have reached the eastern bank of the Haichur River.\nIn the south, Russian forces accumulated additional infantry in the treelines on the tactical heights south of Danylivka, before attacking further west to the villages of Nechaivka and Radisne. After a few days of DRG operations, Russian assault groups established full control over both of these villages, before turning south and capturing Nove Zaporizhzhya. Additionally, they were able to level the frontline between Nove Zaporizhzhya and Zlahoda, capturing positions in numerous different treelines east of the Haichur River, while other forces levelled the frontline in the treelines northwest of Solodke. \nTo the north, Russian forces recaptured the western half of Yehorivka after Ukrainian assault groups infiltrated it earlier. Meanwhile, other forces began bypassing Danylivka from the north, where they were able to capture positions in 6 different treelines. From there they entered and captured the village of Virdadne. Additionally, the Russians re-entered the village of Hai from the northeast, recapturing it along with the adjacent treeline positions. \nTo the northeast, Russian forces were able to consolidate in the two parallel treelines south of Tykhe and began infiltration attempts into the village. So far, despite flag raises within the settlement, there is no evidence of consolidation there. \n+ ~49.66 km² in favour of Russia.",
      "timestamp": "2025-11-24T11:28:43.443953Z"
    },
    {
      "original": "Huliaipole \n🟠",
      "timestamp": "2025-11-24T11:28:43.443958Z"
    },
    {
      "original": "Huliaipole \n🟠",
      "timestamp": "2025-11-24T11:28:43.443961Z"
    },
    {
      "original": "I can confirm too. DRGs have been operating in the city, assault groups may have followed.",
      "timestamp": "2025-11-24T11:28:43.443968Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches",
      "timestamp": "2025-11-24T11:28:43.443971Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches",
      "timestamp": "2025-11-24T11:28:43.443974Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T11:28:43.443976Z"
    },
    {
      "original": "It departed from Savasleika Airbase, Nizhny Novogord Oblast. Sirens are sounding in all regions of Ukraine.",
      "timestamp": "2025-11-24T11:28:43.443979Z"
    },
    {
      "original": "Its flying in the general direction of the launch lines. Flight characteristics suggest training.",
      "timestamp": "2025-11-24T11:28:43.443982Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T11:28:43.443985Z"
    },
    {
      "original": "Correction: 3 MiGs are airborne",
      "timestamp": "2025-11-24T11:28:43.443988Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T11:28:43.443991Z"
    },
    {
      "original": "They are carrying out training in Lipetsk Oblast.",
      "timestamp": "2025-11-24T11:28:43.443993Z"
    },
    {
      "original": "The 3 MiG-31K fighters landed back at Savasleika Airbase after carrying out simulated launched of Kinzhals in Lipetsk Oblast.",
      "timestamp": "2025-11-24T11:28:43.443996Z"
    },
    {
      "original": "In the Dobropillya direction, after around four months of battles, Russian forces have captured the city of Pokrovsk. Additional progress has been made in other areas too.\nWest of Pokrovsk, Russian forces continued the assault on the Pokrovsk Coal Mine, where they established control over its southern buildings, including the power station. Fighting is ongoing for the other parts of the mine; however most Ukrainian soldiers have already withdrawn. \nIn northern Pokrovsk, Russian forces advanced from their newly captured positions north of the Hrishynka River, capturing the rest of the houses along the northernmost residential streets as well as the adjacent \"Druzhba\" dachas and treelines.\nNortheast of Pokrovsk, Russian forces consolidated in the Zaporozhskiy residential area and the forested areas along the T-05-15 Highway, physically encircling the remaining Ukrainian formations in the Myrnohrad pocket.\nNortheast of Pokrovsk, Russian forces broke through along the railway windbreaks and entered the northwestern part of Myrnohrad. They also captured the poultry farm and warehouses along the H-32 Highway. \nEast and southeast of Pokrovsk, Russian forces captured the Kohozhkine residential area on the eastern edge of Pokrovsk, along with the former industral zone to the north. Other assault groups captured the remaining treeline positions south of the railway line.\nIn southern Myrnohrad, Russian forces cleared the last streets of the southern low-rise residential area, capturing the Ozerka Cemetery and linking up with assault groups clearing the high-rise Zapadny District. Further north, Russian forces captured six more high-rise buildings in the southwestern part of the Zapadny District, while other forces crossed the park into the northeastern part of the district where they seized the former cinema along with another 6 high-rises. \nIn northeastern Myrnohrad, Russian forces captured School No. 5, School No. 10, and at least 19 more high-rise buildings in the Damanskyi, 5-23, and Skhidnyi Districts. Additionally, they were able to improve their positions further in low-rise residential areas of the 8th District, reaching Prokovyeva Street from the north.\nIn Rodynske, Russian forces continued to slowly advance back through the city. They captured the rest of the central-most block, along with the rest of the three-story buildings further north and reached School No. 35 from the northern low-rise residential areas. Heavy fighting is ongoing for the rest of the city centre and western blocks. \n+ ~8.71 km² in favour of Russia.",
      "timestamp": "2025-11-24T11:28:43.444006Z"
    },
    {
      "original": "The airspace over large parts of Astrakhan Oblast, including the Kapustin Yar Test Site will be temporarily closed for 24 hours on November 31.\nThere is a possibility of Oreshnik IRBM tests during that time, which would likely trigger sirens for all regions of Ukraine. The chances of an Oreshnik strike are practically zero.",
      "timestamp": "2025-11-24T11:28:43.444009Z"
    },
    {
      "original": "30k on Telegram and now 50k on Twitter. \nIts incredible seeing these numbers go up, and its been a privilege to bring the news to you all.",
      "timestamp": "2025-11-24T11:28:43.444013Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued to advance and have made progress in four different areas.\nIn the southwest, Russian forces pushed the Ukrainians back from the Fedorivka - Boikivka area, recapturing positions in the forests and at one of the ventilation shafts for the Krasnolimanskaya Mine. They were also able to recapture the rest of the residential part of Nykanorivka in the western part of the village.\nTo the northeast, Russian forces broke into eastern Shakhove from the south, quickly advancing up the street along the eastern bank of the Kazenyi Torets River, reaching its northern end. They also captured the rest of the forested areas east of Shakove, partially securing their eastern flank. \nFurther northeast, Russian forces intensified their assault operations in the direction of Sofiivka. They captured positions in four different treelines southeast and east of the village and secured the major Ukrainian strongpoints in the forested gulley, from which they are infiltrating the agricultural buildings on the eastern outskirts of Sofiivka. \n+ ~13.62 km² in favour of Russia.",
      "timestamp": "2025-11-24T11:28:43.444019Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-24T11:28:44.181201Z"
    },
    {
      "original": "Military Situation In Ukraine On November 23, 2025 (Maps Update)",
      "timestamp": "2025-11-24T11:28:44.181212Z"
    },
    {
      "original": "Polymarket Bets: Which Cities Could The Russian Army Capture In November And December?\nWhich cities have already had bids placed on Polymarket? Which cities could be captured as early as November? What awaits the Ukrainian market in December?\nBets on the capture of Ukrainian cities on Polymarket have become a popular form of entertainment in many countries. This section is called the Ukrainian Map. To understand the ongoing events, one doesn't need insider information; following our daily reports on the situation in Ukraine is enough. To make analysis easier, we are introducing a new column: \"Polymarket Bets,\" which summarizes information on the most interesting fronts.\nOne of our initial forecasts regarding the capture of Uspenovka was recently confirmed, and the market closed shortly after the article's publication.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181222Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181230Z"
    },
    {
      "original": "The Human Cost Of \"Easy Money\": How Mercenary Fatalities Disproportionately Claim Global South Lives\nThe number of foreign mercenaries killed while serving in the Ukrainian army is increasing. People are paying for the easy money they were promised with their lives and health. By signing a contract, bounty hunters are essentially buying a one-way ticket.\nWith the support of Western media, Kyiv continues to actively recruit foreign mercenaries. In an attempt to solve the problem of dwindling human resources, the Ukrainian army is open to any foreigner who wishes to join its ranks. Extensive advertising on social networks and in the media promises volunteers a life of luxury.\nThese invitations are mainly responded to by citizens of developing countries. Latin America is the main supplier of human resources for the Ukrainian army. Mercenaries are promised an easy time hunting Russian soldiers. The list of promises also includes service in ‘elite units’...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181239Z"
    },
    {
      "original": "The Operation in Pokrovsk Is Nearing Completion as Russian Units Finish Mopping Up Remaining Ukrainian Forces\nRussian troops taken full control of Novoye Zaporozhye in the Zaporizhzhia sector. In Rodynske, Russian units restored control over part of the urban territory after the Ukrainian army made recent breakthrough attempts. Meanwhile, intensive negotiations are ongoing in Geneva between Ukrainian and US delegations on the Trump administration's peace plan.\nOperations to establish control over Pokrovsk's urban territory are nearing completion. Russian forces' control has been confirmed over most of the urban area. To the north, the operational ring has finally closed around the tree lines west of Rovnoye, where increased fire density has been established.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181247Z"
    },
    {
      "original": "The Operation in Pokrovsk Is Nearing Completion as Russian Units Finish Mopping Up Remaining Ukrainian Forces\nRussian troops taken full control of Novoye Zaporozhye in the Zaporizhzhia sector. In Rodynske, Russian units restored control over part of the urban territory after the Ukrainian army made recent breakthrough attempts. Meanwhile, intensive negotiations are ongoing in Geneva between Ukrainian and US delegations on the Trump administration's peace plan.\nOperations to establish control over Pokrovsk's urban territory are nearing completion. Russian forces' control has been confirmed over most of the urban area. To the north, the operational ring has finally closed around the tree lines west of Rovnoye, where increased fire density has been established.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181255Z"
    },
    {
      "original": "Israel Assassinated Hezbollah’s Military Chief, What Comes Next Is War (Photos, Video)\nThe Israeli escalation against Hezbollah reached a new peak on November 23 with the assassination of the group’s chief of staff in the Lebanese capital, Beirut.\nHaytham Ali Tabataba, known by his nom de guerre “Abu Ali,” was killed in a targeted strike that hit the third and fourth floors of a nine-story building in the Haret Hreik area in the southern suburbs of Beirut, a stronghold of Hezbollah commonly known as Dahiya.\nLebanon’s state-run National News Agency said that three “missiles” hit the building, but photos from the scene of the strike suggest that more than five projectiles were used.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181263Z"
    },
    {
      "original": "Israel Assassinated Hezbollah’s Military Chief, What Comes Next Is War (Photos, Video)\nThe Israeli escalation against Hezbollah reached a new peak on November 23 with the assassination of the group’s chief of staff in the Lebanese capital, Beirut.\nHaytham Ali Tabataba, known by his nom de guerre “Abu Ali,” was killed in a targeted strike that hit the third and fourth floors of a nine-story building in the Haret Hreik area in the southern suburbs of Beirut, a stronghold of Hezbollah commonly known as Dahiya.\nLebanon’s state-run National News Agency said that three “missiles” hit the building, but photos from the scene of the strike suggest that more than five projectiles were used.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181271Z"
    },
    {
      "original": "Sectarian Violence Reignites In Syria With Attack On Alawites In Homs (Videos)\nSyria witnessed another episode of sectarian violence on November 24 after the killing of a Bedouin couple triggered retaliatory attacks against the Alawite community in the central governorate of Homs. \nThe man and his wife, both from the Bani Khalid Bedouin tribe, were found killed in their home in the town of Zaidal in the eastern Homs countryside early in the day, with the woman’s body partially burned and sectarian-charged graffiti found at the scene.\nQuickly after the news spread out, armed Bedouins carried out retaliatory attacks against Alawites in Homs city, storming al-Muhajirin and other neighborhoods where members of the community reside. Authorities announced an investigation into the crime in Zaidal and deployed troops in the city in an attempt to control the situation.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181279Z"
    },
    {
      "original": "Sectarian Violence Reignites In Syria With Attack On Alawites In Homs (Videos)\nSyria witnessed another episode of sectarian violence on November 24 after the killing of a Bedouin couple triggered retaliatory attacks against the Alawite community in the central governorate of Homs. \nThe man and his wife, both from the Bani Khalid Bedouin tribe, were found killed in their home in the town of Zaidal in the eastern Homs countryside early in the day, with the woman’s body partially burned and sectarian-charged graffiti found at the scene.\nQuickly after the news spread out, armed Bedouins carried out retaliatory attacks against Alawites in Homs city, storming al-Muhajirin and other neighborhoods where members of the community reside. Authorities announced an investigation into the crime in Zaidal and deployed troops in the city in an attempt to control the situation.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-24T11:28:44.181288Z"
    }
  ],
  "script_run_time": "2025-11-24T11:28:44.182075Z"
}