{
  "messages": [
    {
      "original": "Група КР на сході Київщини курсом на захід.",
      "timestamp": "2025-08-28T07:27:23.496703Z"
    },
    {
      "original": "Група КР курсом на Київ.",
      "timestamp": "2025-08-28T07:27:23.496719Z"
    },
    {
      "original": "Група КР на Черкащині курсом на захід.",
      "timestamp": "2025-08-28T07:27:23.496723Z"
    },
    {
      "original": "Група КР курсом на Вінниччину!",
      "timestamp": "2025-08-28T07:27:23.496727Z"
    },
    {
      "original": "КР з півдня курсом на Васильків.",
      "timestamp": "2025-08-28T07:27:23.496730Z"
    },
    {
      "original": "Група КР курсом на Вінниччину!",
      "timestamp": "2025-08-28T07:27:23.496734Z"
    },
    {
      "original": "Група КР на півночі Вінниччини курсом на захід.",
      "timestamp": "2025-08-28T07:27:23.496737Z"
    },
    {
      "original": "Група КР на півночі Вінниччини курсом на захід.",
      "timestamp": "2025-08-28T07:27:23.496741Z"
    },
    {
      "original": "Курсом на Старокостянтинів.",
      "timestamp": "2025-08-28T07:27:23.496744Z"
    },
    {
      "original": "🛵\n Запоріжжя - БпЛА з півдня у напрямку міста!",
      "timestamp": "2025-08-28T07:27:23.496750Z"
    },
    {
      "original": "КР з Вінниччини на Хмельниччину.",
      "timestamp": "2025-08-28T07:27:23.496754Z"
    },
    {
      "original": "🛵\n БпЛА повз Бровари у напрямку Києва!",
      "timestamp": "2025-08-28T07:27:23.496760Z"
    },
    {
      "original": "🛵\n БпЛА повз Бровари у напрямку Києва!",
      "timestamp": "2025-08-28T07:27:23.496764Z"
    },
    {
      "original": "БпЛА курсом на Васильків!",
      "timestamp": "2025-08-28T07:27:23.496767Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА на Чернігівщині у південно-західному напрямку.\n🛵\n БпЛА на Вінниччині курсом на захід.",
      "timestamp": "2025-08-28T07:27:23.496777Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Києва!",
      "timestamp": "2025-08-28T07:27:23.496784Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Бориспіль.",
      "timestamp": "2025-08-28T07:27:23.496789Z"
    },
    {
      "original": "🛵\n БпЛА повз Бровари у напрямку Києва!",
      "timestamp": "2025-08-28T07:27:23.496794Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини \n➡️\n курсом на південний захід!",
      "timestamp": "2025-08-28T07:27:23.496800Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини \n➡️\n курсом на південний захід!",
      "timestamp": "2025-08-28T07:27:23.496805Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Київщину!",
      "timestamp": "2025-08-28T07:27:23.496810Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Чернігівщини \n➡️\n курсом на Київщину!",
      "timestamp": "2025-08-28T07:27:23.496815Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Київ!",
      "timestamp": "2025-08-28T07:27:23.496821Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному та північно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-28T07:27:23.496830Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 589 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 28 серпня (із 19.30 27 серпня) противник завдав масованого удару по території України із застосуванням ударних БпЛА, ракет повітряного та наземного базування, загалом – 629 засобів повітряного нападу:\n- 598 ударних БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків Курськ, Брянськ, Міллерово, Орел, Шаталово, Приморсько-Ахтарськ – рф., Гвардійське – ТОТ Криму;\n- 2 аеробалістичні ракети Х-47М2 \"Кинджал\" із повітряного простору Липецької та Воронезької обл. – рф.;\n- 9 балістичних ракет Іскандер-М/KN-23 із Брянської та Воронезької обл. – рф.;\n- 20 крилатих ракет Х-101 із повітряного простору Саратовської обл. – рф.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 589 повітряних цілей:\n- 563 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів;\n- 1 аеробалістичну ракету Х-47М2 \"Кинджал\";\n- 7 балістичних ракет Іскандер-М/KN-23;\n- 18 крилатих ракет Х-101.\nЗафіксовано влучання ракет та ударних БпЛА на 13 локаціях, падіння збитих (уламки) на 26 локаціях.\n❗️\nПовітряна атака триває, протиповітряна оборона продовжує бойову роботу із знищення ворожих цілей. Дотримуйтесь правил безпеки, перебувайте в укриттях!\nЧергова жорстока атака росії, чергові жертви серед мирного населення, серед загиблих – діти. Висловлюємо щирі співчуття близьким, хто втратив рідних. російські військові злочинці обов’язково будуть покарані.",
      "timestamp": "2025-08-28T07:27:23.496852Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину та Харківщину!",
      "timestamp": "2025-08-28T07:27:23.496856Z"
    },
    {
      "original": "🛸\n На півночі Чернігівщини, сході Сумщини, півдні Дніпропетровщини, півночі Запорізької області -  розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-08-28T07:27:23.496861Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at an agricultural complex in the village of Vyshneve, Dnipropetrovsk Oblast after it was attacked by multiple Russian Geran-2 drones last night. \nThe Dnipropetrovsk OVA acknowledged the attack and the subsequent fire but claimed it was extinguished and that there were no civilian casualties. \nThe impacts are ~14.3km from the frontline. \nCoordinates: 47.874681, 36.325765",
      "timestamp": "2025-08-28T07:27:24.089306Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at an agricultural complex in the village of Vyshneve, Dnipropetrovsk Oblast after it was attacked by multiple Russian Geran-2 drones last night. \nThe Dnipropetrovsk OVA acknowledged the attack and the subsequent fire but claimed it was extinguished and that there were no civilian casualties. \nThe impacts are ~14.3km from the frontline. \nCoordinates: 47.874681, 36.325765",
      "timestamp": "2025-08-28T07:27:24.089320Z"
    },
    {
      "original": "New footage showing two Russian Geran-2 drone strikes on the village of Novotroitske, Zaporizhzhia Oblast. They reportedly targeted temporary deployment points for soldiers and equipment from the 65th mechanised brigade, as well as drone operators from the \"dragonflies\" drone group (part of the 65th brigade). \nImpact 1: 47.795034, 35.727342\nImpact 2: 47.794994, 35.726744\nDistance from the frontline: 29.4km",
      "timestamp": "2025-08-28T07:27:24.089326Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Novomykhailivka, Borova direction, Donetsk Oblast.\nPre-war population: ~35.\nTotal land area: ~0.47km².",
      "timestamp": "2025-08-28T07:27:24.089331Z"
    },
    {
      "original": "Update from the Gaza Strip - Northern Governorate:\nThe IDF resumed its large-scale clearing and demolition operations in Jabalia al-balad, and have captured additional areas north of Al-Quds Street. \nThey were able to clear a significant portion of the already largely demolished urban areas south of the Jabalia Refugee Camp, and entered the denser and more \"dangerous\" residential areas on approach to Al-Falouja Street. \n+ ~0.36km² in favour of the IDF.",
      "timestamp": "2025-08-28T07:27:24.089336Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:\nThe IDF continued their large-scale offensive on the Al-Zeitoun Neighbourhood of Gaza City and have made further advances towards its centre.\nAfter securing control over the southwestern-most non-flattened part of the neighbourhood, Israeli armoured units continued to advance northwest, clearing additional residential areas and reaching Al-Maslakh Street. \nAdditionally, to the east, Israeli forces built on their progress in the Kuba Neighbourhood and crossed the Salah Al-Deen Highway to the southern-most part of Al-Zeitoun Neighbourhood where they cleared additional dense urban areas, linking up with the Israeil forces in the area of Al-Maslakh Street.\nAs I previously suspected in a post on August 16, the IDF has set up a forward deployment point at the Al-Furqan Primary School in the flattened part of Al-Zeitoun, where demolition equipment and Merkava tanks are stationed. This building was chosen as it is the only structure in the area that hasn't been flattened. I have circled it on the map (coordinates: 31.4887380, 34.4456188). \nMeanwhile, Palestinian armed groups such as the Al-Qassam Brigades (Hamas) and the Saraya Al-Quds Briagdes (PIJ) continued to carry out ambushes against Israeli forces, primarily utilising IEDs and anti-tank missiles, albeit at a lower rate than previously. \n+ ~0.43km² in favour of the IDF.",
      "timestamp": "2025-08-28T07:27:24.089344Z"
    },
    {
      "original": "Update from the Gaza Strip - Khan Younis Governorate:\nAfter a brief pause, the IDF resumed its clearing operations in the centre of Khan Younis city and have made new progress in a western direction.\nIsraeli forces pushed further down Al-Sunneya, Gammal Abdel Nasser, and Salah Al-Deen streets, clearing high-rise residential areas, as well as commercial areas. Demolition operations continued in the already occupied parts of the city to support the newly constructed Magen Oz corridor which runs through the centre of Khan Younis to Israeli-occupied Rafah. Despite these recent advances, a significant amount of Khan Younis city centre is yet to be cleared\nMilitants from various Palestinian armed groups continued their attacks on Israeli forces, primarily employing IEDs and mortars. \n+ ~0.18km² in favour of the IDF.",
      "timestamp": "2025-08-28T07:27:24.089350Z"
    },
    {
      "original": "I'm aware of the missile attack I missed. I'm working on a map summary, along with strike results and geolocations.",
      "timestamp": "2025-08-28T07:27:24.089354Z"
    },
    {
      "original": "Last night another large-scale combined missile attack was carried out on Ukraine. The main target was Kyiv, although Starkostyantyniv Airbase in Khmelnytskyi Oblast, Vasylkiv in Kyiv Oblast, and targets in Ivano Frankivsk and Zhytomyr Oblasts were also hit. \nThe following missiles were used:\n~15 Kh-101 cruise missiles launched from 3 Tu-95MS strategic bombers in Engels District, Saratov Oblast.\n~10 Iskander-M ballistic missiles launched from OTRK installations northeast of Klintsy, Bryansk Oblast and near Liski, Voronezh Oblast. \n4 Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31Ks near Lipetsk City, Lipetsk Oblast. \nInterception rates are unknown, but at least one Kh-101 and one Iskander-M were shot down by Patriot systems in Kyiv.",
      "timestamp": "2025-08-28T07:27:24.089361Z"
    },
    {
      "original": "Last night another large-scale combined missile attack was carried out on Ukraine. The main target was Kyiv, although Starkostyantyniv Airbase in Khmelnytskyi Oblast, Vasylkiv in Kyiv Oblast, and targets in Ivano Frankivsk and Zhytomyr Oblasts were also hit.…",
      "timestamp": "2025-08-28T07:27:24.089364Z"
    },
    {
      "original": "There were also ~3 Kh-101 strikes on Kozyatyn, Vinnytsia Oblast which I missed.",
      "timestamp": "2025-08-28T07:27:24.089367Z"
    },
    {
      "original": "Footage from last night's missile attack on Kyiv. The first video shows a Kh-101 cruise missile impact. Large fires continue to burn at multiple points in the city, with secondary detonations being heard.",
      "timestamp": "2025-08-28T07:27:24.089371Z"
    },
    {
      "original": "Footage from last night's missile attack on Kyiv. The first video shows a Kh-101 cruise missile impact. Large fires continue to burn at multiple points in the city, with secondary detonations being heard.",
      "timestamp": "2025-08-28T07:27:24.089374Z"
    },
    {
      "original": "A large fire is burning in Kozyatyn, Vinnytsia Oblast after it was hit by ~3 Kh-101 cruise missiles. Power outages are reported.",
      "timestamp": "2025-08-28T07:27:24.089377Z"
    },
    {
      "original": "A 5-story apartment building has partially collapsed in Darnystia District of Kyiv. At least 3 civilians were killed. \nThe level of damage the building recieved, which is made of brick (unlike the much stronger reinforced concrete apartments), suggests that it may have been hit by a downed missile. Additionally, no missile strikes were reported in east bank Kyiv.",
      "timestamp": "2025-08-28T07:27:24.089384Z"
    },
    {
      "original": "A large fire is burning in Kozyatyn, Vinnytsia Oblast after it was hit by ~3 Kh-101 cruise missiles. Power outages are reported.",
      "timestamp": "2025-08-28T07:27:24.089387Z"
    },
    {
      "original": "NASA FIRMS data shows that large fires are burning at the Kozyatyn Locomotive Depot after it was hit by Kh-101 cruise missiles and Geran-2 drones. A photo from the scene showing a burnt-out train corroborates this.",
      "timestamp": "2025-08-28T07:27:24.089391Z"
    },
    {
      "original": "NASA FIRMS data shows that large fires are burning at the Kozyatyn Locomotive Depot after it was hit by Kh-101 cruise missiles and Geran-2 drones. A photo from the scene showing a burnt-out train corroborates this.",
      "timestamp": "2025-08-28T07:27:24.089394Z"
    },
    {
      "original": "Russian forces have captured the town of Udachne, western flank of Pokrovsk, Donetsk Oblast. \nPre-war population: ~1,633.\nTotal land area: ~3.41 km².\nThe battles for Udachne lasted approximately 225 days.",
      "timestamp": "2025-08-28T07:27:24.089401Z"
    },
    {
      "original": "Flight of a Geran-3 jet drone over Kyiv this morning. This is likely the first ever footage of a Geran-3 in action",
      "timestamp": "2025-08-28T07:27:24.089405Z"
    }
  ],
  "script_run_time": "2025-08-28T07:27:24.534407Z"
}