{
  "messages": [
    {
      "original": "🛵\n З акваторії чорного моря БпЛА в напрямку Одещини",
      "timestamp": "2025-10-18T09:27:34.596361Z"
    },
    {
      "original": "🛵\n Бпла на Сумщині,курс Чернігівщина",
      "timestamp": "2025-10-18T09:27:34.596376Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-18T09:27:34.596381Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину",
      "timestamp": "2025-10-18T09:27:34.596385Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, напрямок на Павлоград",
      "timestamp": "2025-10-18T09:27:34.596390Z"
    },
    {
      "original": "🛵\n Бпла на Сумщині,курс північно-західний",
      "timestamp": "2025-10-18T09:27:34.596395Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини (Новгород-Сіверський р-н), курс південний",
      "timestamp": "2025-10-18T09:27:34.596399Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Корюківський р-н), курс південно-західний.",
      "timestamp": "2025-10-18T09:27:34.596404Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Чернігівський р-н), курс західний/південно-західний.",
      "timestamp": "2025-10-18T09:27:34.596409Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА у напрямку міста!",
      "timestamp": "2025-10-18T09:27:34.596413Z"
    },
    {
      "original": "🛵\n🛸\n  Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-18T09:27:34.596421Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 136 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 18 жовтня (з 19:00 17 жовтня) противник атакував трьома зенітними керованими ракетами С-300 із Курської обл. - рф та 164 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Міллєрово, Курськ, Орел, Приморсько-Ахтарськ – рф, близько 100 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 136 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 27 ударних БпЛА на 12 локаціях, а також падіння збитих (уламки) на 4 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-10-18T09:27:34.596441Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-18T09:27:34.596447Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину зі сходу.",
      "timestamp": "2025-10-18T09:27:34.596451Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-10-18T09:27:34.596456Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-18T09:27:34.596460Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-10-18T09:27:34.596466Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-18T09:27:34.596471Z"
    },
    {
      "original": "🛵\n Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-18T09:27:34.596475Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА над акваторією Чорного моря поблизу узбережжя Одещини! Залучено засоби для збиття.\nБпЛА може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-10-18T09:27:34.596481Z"
    },
    {
      "original": "Iskander on Sumy Oblast.",
      "timestamp": "2025-10-18T09:27:35.361557Z"
    },
    {
      "original": "Flying south of the city. 2 missiles.",
      "timestamp": "2025-10-18T09:27:35.361568Z"
    },
    {
      "original": "Flying south of the city. 2 missiles.",
      "timestamp": "2025-10-18T09:27:35.361572Z"
    },
    {
      "original": "Approaching the Lebedyn area, Sumy Oblast",
      "timestamp": "2025-10-18T09:27:35.361575Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-10-18T09:27:35.361578Z"
    },
    {
      "original": "Explosions were heard from Sumy City.",
      "timestamp": "2025-10-18T09:27:35.361581Z"
    },
    {
      "original": "Another Iskander to Sumy Oblast, flying in the same direction.",
      "timestamp": "2025-10-18T09:27:35.361584Z"
    },
    {
      "original": "4th Iskander to Sumy Oblast",
      "timestamp": "2025-10-18T09:27:35.361587Z"
    },
    {
      "original": "5th Iskander to Sumy Oblast. All flew one after another towards Lebedyn.",
      "timestamp": "2025-10-18T09:27:35.361590Z"
    },
    {
      "original": "The Iskanders seem to be impacting in this general area.",
      "timestamp": "2025-10-18T09:27:35.361594Z"
    },
    {
      "original": "Zelensky has arrived in Washington ahead of his meeting with Trump.",
      "timestamp": "2025-10-18T09:27:35.361597Z"
    },
    {
      "original": "Kryvyi Rih, Dnipropetrovsk Oblast, is being attacked by Russian Geran-2 drones. ~19 drones are involved, and several impacts have been recorded.",
      "timestamp": "2025-10-18T09:27:35.361603Z"
    },
    {
      "original": "Can you see this message?\nedit: Some of my posts aren't going through, not sure why.",
      "timestamp": "2025-10-18T09:27:35.361608Z"
    },
    {
      "original": "POV: Western MSM every single time Kryvyi Rih gets attacked.",
      "timestamp": "2025-10-18T09:27:35.361611Z"
    },
    {
      "original": "Both Iskanders seem to have impacted in/near the village of Martove, Kharkiv Oblast.",
      "timestamp": "2025-10-18T09:27:35.361614Z"
    },
    {
      "original": "Footage showing the two Russian Iskander-M ballistic missile strikes that targeted the village of Martove, Kharkiv Oblast, last night. They reportedly targeted a Ukrainian preparation site for launching long-range UAVs. \nCoordinates: 49.95638, 36.96833",
      "timestamp": "2025-10-18T09:27:35.361618Z"
    },
    {
      "original": "Russian forces have captured the village of Poltavka, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~1,110.\nTotal land area: ~6.49 km².",
      "timestamp": "2025-10-18T09:27:35.361623Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Crimea for a large attack. Groups are flying towards Yevpatoriya on the western coast of Crimea, and Saki on the southern coast. More are flying in from off the coast of southern Kherson Oblast.",
      "timestamp": "2025-10-18T09:27:35.361626Z"
    },
    {
      "original": "During the Ukrainian UAV attack on Crimea today, a Russian Su-30SM fighter involved in air defence operations crashed after it was hit by friendly fire. Russian VKS-affiliated channel Fighterbomber confirmed the reports, stating that the crew survived and is safe.",
      "timestamp": "2025-10-18T09:27:35.361629Z"
    },
    {
      "original": "A short time ago, Russian long-range Smerch MLRS targeted the Peresadivka area of Mykolaiv Oblast, around 64 km from the nearest Russian-controlled territory. Explosions were heard in the area. A Russian reconnaissance drone was operating there at the time.",
      "timestamp": "2025-10-18T09:27:35.361632Z"
    },
    {
      "original": "Ukrainian drones from the \"Lasar\" drone group of the National Guard hit and destroyed the Russian BM-30 Smerch launcher that targeted Peresadivka, Mykolaiv Oblast last night. \nA reconnaissance drone monitored the launches of Smerch rockets, before relaying the coordinates of its relocated position to drone crews who subsequently struck it. \nCoordinates: 46.325527, 32.735003 (~30 km from the frontline).",
      "timestamp": "2025-10-18T09:27:35.361637Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City.",
      "timestamp": "2025-10-18T09:27:35.361640Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City.",
      "timestamp": "2025-10-18T09:27:35.361643Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-10-18T09:27:35.361646Z"
    },
    {
      "original": "Recently, the situation east of Kostyantynivka has become very mixed and complicated as Russian forces attempt to consolidate outside the city and begin entering the more built-up area.\nAs a result, I have decided to add a very large grey zone, where Russian and Ukrainian positions are mixed and layered, often operationally encircling each other. This map below shows areas where Russian and Ukrainian soldiers have been recorded, although this doesn't necessarily show consolidation. In the future, once the situation clears up and one side clearly regains the initiative, the map will be updated to show additional control zones. But for now, it will look something like this.\nThis has happened due to the large open areas here, with limited cover from treelines and individual, isolated buildings. Additionally, Ukraine's manpower shortages have forced them to resort to increased drone usage. Kostyantynivka provides practically endless hiding spots for drone operators, while Russia has Chasiv Yar and the surrounding forests and villages to use for this. Both Russian and Ukrainian soldiers are operating in small assault groups of usually 2-4 people, clearing each other out of their positions. A similar situation was observed (and still is to some extent) in the Dobropillya direction.\nMeanwhile, extensive preparatory bombing and shelling continues on Kostyantynivka, primarily targeting its eastern districts, ahead of the Russian storming operation on the city.",
      "timestamp": "2025-10-18T09:27:35.361651Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance over the last week, and have captured the rest of Poltavka.\nAfter crossing the Yanchur River and securing a bridgehead on its western bank, Russian forces pushed further under heavy drone and artillery cover, expanding their zone of control to the northern outskirts of Poltavka. Other forces advanced south, linking up with the formations north of Malynivka. \nAdditionally, the Russians improved their positions north of Malynivka, capturing the rest of the forests there and beginning a push west of Poltavka. However, the arrival of Ukrainian reinforcements has slowed their advance, and counterattacks will likely begin in the near future. \n+ ~4.55 km² in favour of Russia.",
      "timestamp": "2025-10-18T09:27:35.361656Z"
    },
    {
      "original": "Russian Army Advances Deeper In Kupyansk, Captures Two More Settlements In Kharkiv (Videos) \nOn October 17, the Russian military advanced deeper into the city of Kupyansk and imposed control over two other settlements elsewhere in the Kharkiv direction.\nThe Zapad [West] Group of Forces has reportedly imposed control of all the areas to the north of Kuznechnaya street in the center of Kupyansk following fierce clashes with Kiev forces.\nIn addition to ongoing operations in Kupyansk, the Zapad Group of Forces continues to advance in the pocket to the east of the Oskil River, between the city and Kolisnykivka.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165354Z"
    },
    {
      "original": "Russian Army Advances Deeper In Kupyansk, Captures Two More Settlements In Kharkiv (Videos) \nOn October 17, the Russian military advanced deeper into the city of Kupyansk and imposed control over two other settlements elsewhere in the Kharkiv direction.\nThe Zapad [West] Group of Forces has reportedly imposed control of all the areas to the north of Kuznechnaya street in the center of Kupyansk following fierce clashes with Kiev forces.\nIn addition to ongoing operations in Kupyansk, the Zapad Group of Forces continues to advance in the pocket to the east of the Oskil River, between the city and Kolisnykivka.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165370Z"
    },
    {
      "original": "Russian Troops Capture Pryvillya After Successful Breakthrough In Dnepropetrovsk\nOn October 17, Russian military’s Vostok [East] Group of Forces captured Pryvillya after successfully breaking through Ukrainian defenses in the Dnepropetrovsk once again.\nThe capture of Pryvillya, which is located along the Yanchur River, was confirmed by the Russian Ministry of Defense. Russian troops advanced more than five kilometers from Verbove to reach the settlement, capturing a large area on the way.\nThe next step by the Vostok Group of Forces will likely be an attack on Vyshneve to the north. Russian troops have been advancing towards the eastern outskirts of the settlement from Verbove.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165380Z"
    },
    {
      "original": "Russian Troops Capture Pryvillya After Successful Breakthrough In Dnepropetrovsk\nOn October 17, Russian military’s Vostok [East] Group of Forces captured Pryvillya after successfully breaking through Ukrainian defenses in the Dnepropetrovsk once again.\nThe capture of Pryvillya, which is located along the Yanchur River, was confirmed by the Russian Ministry of Defense. Russian troops advanced more than five kilometers from Verbove to reach the settlement, capturing a large area on the way.\nThe next step by the Vostok Group of Forces will likely be an attack on Vyshneve to the north. Russian troops have been advancing towards the eastern outskirts of the settlement from Verbove.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165388Z"
    },
    {
      "original": "Air Defenses And Drones: New Report Reveals Turkish Plan To Arm Syria\nTurkey is planning to arm Syria’s new military with advanced weapons, including armored vehicles, drones, artillery, missiles, and air defense systems, in the coming weeks, Bloomberg, reported on October 17, citing Turkish officials.\nThe officials told the news outlet that the weapons will be deployed in northern Syria to avoid any tensions with Israel in the south. They noted that this plan is part of broader understandings with Syria’s Islamist-led Interim Government to support efforts to rebuild the Syrian military.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165396Z"
    },
    {
      "original": "Iran Is Digging Up One Of Its Nuclear Sites, Israel Could Use This As Pretext To Attack \nThe Institute for Science and International Security (ISIS) reported activities at one of Iran’s most secretive nuclear sites, citing satellite images from Maxar, Vantor, and Airbus which were taken between the end of September and early October.\nIn a report published on October 16, the Washington-based institute said that the middle of three entrances at Isfahan Nuclear Technology Research Center, which were previously blocked by earth and rubble, had been cleared leaving the tunnel portal’s door visible as of September 26.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165403Z"
    },
    {
      "original": "Iran Is Digging Up One Of Its Nuclear Sites, Israel Could Use This As Pretext To Attack \nThe Institute for Science and International Security (ISIS) reported activities at one of Iran’s most secretive nuclear sites, citing satellite images from Maxar, Vantor, and Airbus which were taken between the end of September and early October.\nIn a report published on October 16, the Washington-based institute said that the middle of three entrances at Isfahan Nuclear Technology Research Center, which were previously blocked by earth and rubble, had been cleared leaving the tunnel portal’s door visible as of September 26.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165411Z"
    },
    {
      "original": "POWER AND PRESSURE: FRONTLINES IGNITE AS LEADERS TALK PEACE",
      "timestamp": "2025-10-18T09:27:36.165414Z"
    },
    {
      "original": "Heavy Urban Fighting: Russian Troops Are Advancing In Pokrovsk\nOver 60% of the territory in the industrial zone of Pokrovsk is under the control of Russian forces. Russia's 47th Tank Division has taken control of the village of Peschanoye. \nPresident Donald Trump stated that delivering Tomahawk missiles could lead to an 'escalation', and that the US is not prepared to reduce its stockpile of these missiles.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165422Z"
    },
    {
      "original": "Heavy Urban Fighting: Russian Troops Are Advancing In Pokrovsk\nOver 60% of the territory in the industrial zone of Pokrovsk is under the control of Russian forces. Russia's 47th Tank Division has taken control of the village of Peschanoye. \nPresident Donald Trump stated that delivering Tomahawk missiles could lead to an 'escalation', and that the US is not prepared to reduce its stockpile of these missiles.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165429Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165435Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From October 17, 2025\nOn October 17, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-10-18T09:27:36.165446Z"
    }
  ],
  "script_run_time": "2025-10-18T09:27:36.166129Z"
}