{
  "messages": [
    {
      "original": "🛵\n Конотопський район Сумщина небезпека по ударним БпЛА!",
      "timestamp": "2025-09-17T14:12:01.583757Z"
    },
    {
      "original": "🛵\n Небезпека по ударним БпЛА в  Богодухівському районі.",
      "timestamp": "2025-09-17T14:12:01.583776Z"
    },
    {
      "original": "🛵\n Загроза ударних БпЛА в  Полтавському районі.",
      "timestamp": "2025-09-17T14:12:01.583781Z"
    },
    {
      "original": "🛵\n Над Харковом ударні БпЛА, під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-09-17T14:12:01.583786Z"
    },
    {
      "original": "🛵\n Ударні БпЛА  в Роменському районі!",
      "timestamp": "2025-09-17T14:12:01.583790Z"
    },
    {
      "original": "🛵\n Конотоп у вашому напрямку ударні БпЛА, перебувайте в безпечних місцях!",
      "timestamp": "2025-09-17T14:12:01.583795Z"
    },
    {
      "original": "🛵\n Оновлення по ударних БпЛА: \n- в районі Харкова, курсом на захід;\n- захід Сумщини на Конотоп. Центр, курсом на південно-західний напрямок;\n- північно-східний напрямок Дніпропетровщини, курсом на північ.",
      "timestamp": "2025-09-17T14:12:01.583802Z"
    },
    {
      "original": "🛵\n Загроза ударних БпЛА Харкова  та Харківського району.",
      "timestamp": "2025-09-17T14:12:01.583807Z"
    },
    {
      "original": "🚀\n \n🚀\nСумський та Конотопський райони - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-17T14:12:01.583816Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину, в напрямку громади Хотінь.",
      "timestamp": "2025-09-17T14:12:01.583821Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-17T14:12:01.583826Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-09-17T14:12:01.583831Z"
    },
    {
      "original": "🛵\n Загроза ударних БпЛА для Харкова  та Харківського району.",
      "timestamp": "2025-09-17T14:12:01.583835Z"
    },
    {
      "original": "🛵\n \n🛸\n Поблизу громади Недригайлів на Сумщині БпЛА, вектором руху на південь. Під час тривоги перебувайте в безпечних місцях.",
      "timestamp": "2025-09-17T14:12:01.583841Z"
    },
    {
      "original": "🛵\n Небезпека по ударним БпЛА в  Нікопольському  районі.",
      "timestamp": "2025-09-17T14:12:01.583845Z"
    },
    {
      "original": "🛵\n Ударні БпЛА в  Синельниківському, Новгород-Сіверському районах, Запорізькій області та на Донеччині. Дані безпілотники становлять загрозу для життя та здоров'я громадян визначених областей  та районів, під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-09-17T14:12:01.583850Z"
    },
    {
      "original": "🛵\n У  напрямку Криворізького району ударні БпЛА.",
      "timestamp": "2025-09-17T14:12:01.583854Z"
    },
    {
      "original": "🛵\n Ударні БпЛА із півдня Запорізької області, курсом на Дніпро.",
      "timestamp": "2025-09-17T14:12:01.583860Z"
    },
    {
      "original": "🛵\n Загроза по ударним БпЛА в  Олександрійському районі Кіровоградської області.",
      "timestamp": "2025-09-17T14:12:01.583865Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку Сновська з північного сходу.\n🛵\n БпЛА на м.Дніпро з південного та південно-західного напрямку.\n🛵\n БпЛА на межі Кіровоградщини і Дніпропетровщини в західному напрямку.",
      "timestamp": "2025-09-17T14:12:01.583872Z"
    },
    {
      "original": "2 minutes away",
      "timestamp": "2025-09-17T14:12:01.994558Z"
    },
    {
      "original": "Approaching the village of Inhulets.",
      "timestamp": "2025-09-17T14:12:01.994581Z"
    },
    {
      "original": "Another Su-34 is flying from Crimea towards Kherson Oblast. It may fly to Zaporizhzhia Oblast, following two earlier aircraft.",
      "timestamp": "2025-09-17T14:12:01.994585Z"
    },
    {
      "original": "Approaching the village of Inhulets.",
      "timestamp": "2025-09-17T14:12:01.994589Z"
    },
    {
      "original": "Explosions were heard. 4 KABs impacted the area.",
      "timestamp": "2025-09-17T14:12:01.994592Z"
    },
    {
      "original": "Another Su-34 is flying from Crimea towards Kherson Oblast. It may fly to Zaporizhzhia Oblast, following two earlier aircraft.",
      "timestamp": "2025-09-17T14:12:01.994595Z"
    },
    {
      "original": "The 3rd plane is circling in the Crimea-Kherson border area. It will escort the two Su-34s back to their home base, which are already on the return flight, flying southeast over Kherson Oblast.",
      "timestamp": "2025-09-17T14:12:01.994602Z"
    },
    {
      "original": "Watch out guys, Astraia Intel knows more about how the war is going than the literal president of Ukraine. I think if Zelensky (someone who has constantly lied about this war) is sounding the alarm bells, it's a solid sign that things haven't been going in Ukraine's favour.",
      "timestamp": "2025-09-17T14:12:01.994605Z"
    },
    {
      "original": "Watch out guys, Astraia Intel knows more about how the war is going than the literal president of Ukraine. I think if Zelensky (someone who has constantly lied about this war) is sounding the alarm bells, it's a solid sign that things haven't been going in…",
      "timestamp": "2025-09-17T14:12:01.994609Z"
    },
    {
      "original": "\"They will accept military rule because I say so\"",
      "timestamp": "2025-09-17T14:12:01.994612Z"
    },
    {
      "original": "Yesterday, the battle for the Serebryanskyi Forest in Luhansk Oblast finally ended after the remaining Ukrainian forces were pushed out of its southwestern-most part.\nThis battle began in late 2022 during the Ukrainian Kharkiv counteroffensive and lasted for nearly three years. Ukrainian forces, including Azov, held their positions in a massive complex of trenches and bunkers within the now largely destroyed forest. \nHowever, the vast majority of Russian advances during this nearly 3-year-long battle occurred in the final month. I have overlayed what the frontline roughly looked like on August 6, around the beginning of the Russian offensive here. \nAs a result, Ukrainian control in Luhansk Oblast has now shrunk to roughly 47 km².",
      "timestamp": "2025-09-17T14:12:01.994619Z"
    },
    {
      "original": "Russian Su-34s carried out launch maneuvers of KAB glide-bombs towards Tokarivka, Kherson Oblast.",
      "timestamp": "2025-09-17T14:12:01.994622Z"
    },
    {
      "original": "Russian Su-34s carried out launch maneuvers of KAB glide-bombs towards Tokarivka, Kherson Oblast.",
      "timestamp": "2025-09-17T14:12:01.994625Z"
    },
    {
      "original": "~90 seconds until impacts",
      "timestamp": "2025-09-17T14:12:01.994628Z"
    },
    {
      "original": "~90 seconds until impacts",
      "timestamp": "2025-09-17T14:12:01.994631Z"
    },
    {
      "original": "Approaching",
      "timestamp": "2025-09-17T14:12:01.994634Z"
    },
    {
      "original": "Approaching",
      "timestamp": "2025-09-17T14:12:01.994637Z"
    },
    {
      "original": "Explosions in Tokarivka",
      "timestamp": "2025-09-17T14:12:01.994642Z"
    },
    {
      "original": "The KABs impacted the village of Inhulets. The same area that was hit yesterday. The Su-34s are now returning back to Crimea.",
      "timestamp": "2025-09-17T14:12:01.994646Z"
    },
    {
      "original": "Russian forces have captured the village of Olhivske, Hulyaipole Direction, Zaporizhzhia Oblast.\nPre-war population: ~55.\nTotal land area: ~0.34 km².",
      "timestamp": "2025-09-17T14:12:01.994650Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:\nWith the IDF officially announcing the beginning of its offensive to capture Gaza City, intensified operations have been recorded in two main parts of the city over the past 48 hours.\nIn the southwest, Israeli forces resumed clearing operations in the already flattened parts of southern Gaza City. They quickly reached Dahdouh Road from the southeast and are now within 1.15 km of the coast. Israeli forces have now taken up positions in a residential quarter (31.50155, 34.42969) in the first part of the partially destroyed coastal Sheikh Ijlin Neighbourhood. \nTo the northeast, the IDF continued pushing from Jabalia at their usual pace and entered into the Gaza Governorate in the area of the Al Sheik Radwan Pool. They began clearing operations towards Gaza City centre from this area, capturing several dense residential blocks (31.52189, 34.4701 & 31.5241, 34.47019), before armoured units began their main vector of attack northwest down Kamal Naser Street. Here they advanced for close to 500 metres, reaching Al-Jala Street, where they expanded for about 240 metres through the dense residential blocks to the southwest (31.52593, 34.46655). \n+ ~1.80 km² in favour of the IDF.",
      "timestamp": "2025-09-17T14:12:01.994657Z"
    },
    {
      "original": "Update from the Gaza Strip - Northern Governorate:\nFollowing the announcement by the IDF that they would be beginning their offensive on Gaza City, a series of supporting attacks were launched on the Northern Governorate to support formations advancing in Gaza Governorate. \nIsraeli armoured units began advancing along the coastal Al-Rashid Road, as well as along roads previously created by the IDF during their previous operations here, reaching the first districts of Jabalia City. They were able to quickly clear and capture the outlying streets (31.5529, 34.4642), reaching the edge of the Madinat Al 'Awada Neighbourhood from the north (31.54792, 34.46454). At the same time, other forces captured other key points along the way, including the destroyed Gaza Oil Company complex (31.55287, 34.46791), and the former IDF base at the Gaza Desalination Plant (31.56156, 34.46763). \nTo the southeast, Israeli forces massively intensified their operations in the Nazla Neighbourhood of Jabalia City and cleared a large section of the dense residential zones north of Al-Quds Street, reaching the edge of the Sheik Radwan Neighbourhood of Gaza City (31.53159, 34.47553). \nThe goal here appears to be to isolate remaining Palestinian militant cells in Jabalia Refugee Camp, Jabalia City, Beit Lahiya, and Atatra, so the IDF can focus on establishing a stronger presence in the northern suburbs of Gaza City. \n+ ~2.28 km² in favour of the IDF.",
      "timestamp": "2025-09-17T14:12:01.994665Z"
    },
    {
      "original": "Meanwhile, after what seems like forever...\nThere haven't been any charges yet, but it will be interesting to see how this plays out.",
      "timestamp": "2025-09-17T14:12:01.994669Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that groups of Ukrainian soldiers were encircled in the western part of Sichneve around four days ago, after Russian forces bypassed the village and continued advancing further west. \nRussian forces are now striking them with FPV drones, while ground forces are attempting to clear the pocket by attacking from the east of the village. A large grey zone has formed in the treelines west of the settlement, so it's possible that Ukraine will make attempts at rescuing these soldiers through this. \nHowever, as a result of the local collapse of Ukrainian lines in this area and the subsequent encirclement of Ukrainian troops, Ukrainian Commander-in-Chief Oleksandr Syrskyi dismissed Maksym Kituhin, the commander of the 20th Army Corps, from his current position. He will still serve in the AFU, but in another unspecified role.",
      "timestamp": "2025-09-17T14:12:01.994673Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-17T14:12:01.994677Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to Israel",
      "timestamp": "2025-09-17T14:12:01.994681Z"
    },
    {
      "original": "The missile launch failed, and it fell along the way.",
      "timestamp": "2025-09-17T14:12:01.994685Z"
    },
    {
      "original": "Footage showing a Russian Mi-28 helicopter flying over Bakhmut. The city is beginning to become overgrown now that fighting is moving away.",
      "timestamp": "2025-09-17T14:12:01.994688Z"
    },
    {
      "original": "Military Situation In Ukraine On September 16, 2025 (Maps Update)",
      "timestamp": "2025-09-17T14:12:02.531481Z"
    },
    {
      "original": "Military Situation In Ukraine On September 16, 2025 (Maps Update)",
      "timestamp": "2025-09-17T14:12:02.531493Z"
    },
    {
      "original": "Trump Announces Second Deadly Strike Near Venezuela After Hinting At Regime Change (Video)\nPresident Donald Trump announced on September 15 that the United States military struck another boat that he claimed was carrying illegal drugs from Venezuela. The announcement came a day after the president refused to rule out the possibility of changing the regime in Caracas.\n“This morning, on my Orders, US Military Forces conducted a SECOND Kinetic Strike against positively identified, extraordinarily violent drug trafficking cartels and narcoterrorists in the SOUTHCOM area of responsibility,” Trump wrote in a post on his Truth Social network.\n\"The Strike resulted in 3 male terrorists killed in action,” he added, noting that \"No U.S. Forces were harmed in this Strike.”\nTensions have been mounting between Venezuela and the U.S. since last month, when the Trump administration deployed a large naval force with more than 4,000 troops close to the country’s shores on a “counter narco-terror operation”.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531504Z"
    },
    {
      "original": "Israeli Troops Storm Gaza City Following Destructive Strikes (Videos)\nThe Israeli Defense Forces (IDF) released video footage showing the 98th Division storming Gaza City at the start of the large-scale offensive against Hamas early on September 16.\nIn a statement, the military said that the division entered Gaza City with support from the Israeli Air Force and Navy, with dozens of “terror infrastructures” of Hamas being struck, including observation posts and booby-trapped buildings.\nThe remaining civilians in Gaza City were instructed by the IDF to leave and head for an Israeli-designated “humanitarian zone” in the Strip’s south at the start of the offensive. The military estimated that only 40% of people have evacuated as of last night. Still, it moved on with the offensive.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531512Z"
    },
    {
      "original": "Israeli Troops Storm Gaza City Following Destructive Strikes (Videos)\nThe Israeli Defense Forces (IDF) released video footage showing the 98th Division storming Gaza City at the start of the large-scale offensive against Hamas early on September 16.\nIn a statement, the military said that the division entered Gaza City with support from the Israeli Air Force and Navy, with dozens of “terror infrastructures” of Hamas being struck, including observation posts and booby-trapped buildings.\nThe remaining civilians in Gaza City were instructed by the IDF to leave and head for an Israeli-designated “humanitarian zone” in the Strip’s south at the start of the offensive. The military estimated that only 40% of people have evacuated as of last night. Still, it moved on with the offensive.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531521Z"
    },
    {
      "original": "PANIC IN KIEV AS RUSSIAN ARMY PUSHES FORWARD",
      "timestamp": "2025-09-17T14:12:02.531524Z"
    },
    {
      "original": "Ukrainian Armed Forces' Tactics in the Sumy Direction: Buying Time Through Drones and Stubborn Resistance\n \n(VIDEO) \nAttempts by Russian forces to create a buffer zone in the \nSumy direction\n have encountered fierce and well-organized resistance from the Ukrainian Armed Forces (AFU). The situation remains complex, both sides are suffering losses.\nA vivid illustration of the reasons for this situation is provided by a \nvideo report by a Russian soldier\n in a unit operating in the Sumy direction. He describes the current operational situation as extremely tense, in\n which the key advantage of the AFU has been the massive and technologically advanced use of drones.\n\"We have no advantage in FPV drones, including fiber-optic ones. Even though we were the first to start using them, developed them, the enemy very quickly caught up and even surpassed us in terms of quantity.\nThe enemy has gone much further… They use a system of aerial relays… They have it all set up...\"\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531537Z"
    },
    {
      "original": "Israel Is Arming, Financing Thousands Of Druze Fighters In Syria\nIsrael is arming and financing Druze factions in the southern Syrian governorate of al-Suwayda in an effort to help them unite, Reuters reported on September 16.\nFollowing the fall of the regime of former President Bashar al-Assad last December, Israel vowed to protect Druze in the country, citing its historic relations with its own Druze community.\nIn July, Israel intervened to help Druze factions repel an attack by the forces of the country’s new Islamist-led government and affiliated Bediouin tribes in a battle that left more than 2,000 people dead, including hundreds of Druze civilians who were executed.\nSince the massacre, Druze factions have been working to unify.\nTwo senior Syrian Druze commanders who spoke to Reuters said that Israel has been helping to unify splintered Druze factions and had delivered military supplies, including guns and ammunition, to them.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531547Z"
    },
    {
      "original": "Russian Army Widens Control In Kupyansk, Advances Near Siversk (Videos)\nThe Russian military advanced by early September 17 in several directions in the Kharkiv region, including within the city of Kupyansk, as well as in the direction of Siversk in the neighboring region of Donetsk.\nRussian troops advanced further in Kupyansk. The troops captured most of the city’s northern part, appalling multiple Ukrainian counter attacks. However, Kiev forces are reported to have entrenched themselves in high-rise buildings in the center of the city, where heavy fighting is taking place.\nMeanwhile, in the direction of Siversk, the Russian military made gains in several areas. The troops secured vast parts of the Serebryansky forest. Another push was reported from the western outskirts of Hryhorivka in the southern direction.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531555Z"
    },
    {
      "original": "Russian Army Widens Control In Kupyansk, Advances Near Siversk (Videos)\nThe Russian military advanced by early September 17 in several directions in the Kharkiv region, including within the city of Kupyansk, as well as in the direction of Siversk in the neighboring region of Donetsk.\nRussian troops advanced further in Kupyansk. The troops captured most of the city’s northern part, appalling multiple Ukrainian counter attacks. However, Kiev forces are reported to have entrenched themselves in high-rise buildings in the center of the city, where heavy fighting is taking place.\nMeanwhile, in the direction of Siversk, the Russian military made gains in several areas. The troops secured vast parts of the Serebryansky forest. Another push was reported from the western outskirts of Hryhorivka in the southern direction.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531563Z"
    },
    {
      "original": "Russian Army Repels Ukrainian Attacks In Sumy, Destroys First Austrian Abrams (Videos)\nThe Russian military has repelled two more Ukrainian counterattacks in the Sumy direction, inflicting heavy losses on Kiev forces.\nAccording to reports from September 17, the counterattacks were repelled near Alekseevka and Sadky.\nInterestingly, a video from the recent battles in Sumy shows a Russian FPV suicide drone hitting what appears to be one of the American-made M1A1 AIM v.1 Abrams main battle tanks supplied recently by Australia.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531594Z"
    },
    {
      "original": "Russian Army Repels Ukrainian Attacks In Sumy, Destroys First Austrian Abrams (Videos)\nThe Russian military has repelled two more Ukrainian counterattacks in the Sumy direction, inflicting heavy losses on Kiev forces.\nAccording to reports from September 17, the counterattacks were repelled near Alekseevka and Sadky.\nInterestingly, a video from the recent battles in Sumy shows a Russian FPV suicide drone hitting what appears to be one of the American-made M1A1 AIM v.1 Abrams main battle tanks supplied recently by Australia.\nRead more \nHERE",
      "timestamp": "2025-09-17T14:12:02.531603Z"
    }
  ],
  "script_run_time": "2025-09-17T14:12:02.532411Z"
}