{
  "messages": [
    {
      "original": "🛵\n БпЛА на півдні Миколаївщини, курс північний.",
      "timestamp": "2025-09-21T03:52:28.791252Z"
    },
    {
      "original": "🛵\n Оновлення щодо руху ворожих БпЛА:\n1. Північний захід та південний схід Чернігівщини - БпЛА курсом на південь;\n2. Схід та південний схід Сумщини - групи БпЛА, курс південно-західний;\n3.  БпЛА північніше Полтави, вектором руху на місто;\n4. БпЛА на півночі та центрі Харківщини, курс південний;\n5. БпЛА на Дніпропетровщині розтягнулися з півночі до центру між Дніпром та Павлоградом, вектор руху Запоріжжя;\n6. Декілька БпЛА на півночі Дніпропетровщини тримають курс на Павлоград;\n7. БпЛА на північному заході Запоріжжя та на північному сході Херсонщини тримають курс на південь.",
      "timestamp": "2025-09-21T03:52:28.791272Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-21T03:52:28.791279Z"
    },
    {
      "original": "🛵\n Загроза застосування ворожих БпЛА для Одеської області (Чорноморський р-н.).\n⚡\n Залучено засоби для збиття.",
      "timestamp": "2025-09-21T03:52:28.791285Z"
    },
    {
      "original": "🛵\n БпЛА на Кривий Ріг зі сходу.",
      "timestamp": "2025-09-21T03:52:28.791290Z"
    },
    {
      "original": "🛵\n Групи ворожих БпЛА на Миргород з північного сходу.",
      "timestamp": "2025-09-21T03:52:28.791294Z"
    },
    {
      "original": "🛵\n БпЛА з Полтавщини на Черкащину, вектор руху Чигирин.",
      "timestamp": "2025-09-21T03:52:28.791301Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини,\n⚡\n Залучено засоби для їх збиття.\n🛵\n БпЛА південніше Кременчука, курс південно-західний;\n🛵\n БпЛА на півдні Полтавщини, курс південний (Дніпропетровщина).",
      "timestamp": "2025-09-21T03:52:28.791311Z"
    },
    {
      "original": "🛵\n Загроза ворожих БпЛА на Сумщині;\n🛵\n БпЛА  в центральній частині Чернігівщини, курс східний.",
      "timestamp": "2025-09-21T03:52:28.791316Z"
    },
    {
      "original": "💥\n 20 вересня 2025 року. Бойова робота Повітряних Сил під час російського масованого удару по території України.\nНа відео працюють зенітні ракетні системи, розрахунки МВГ, ну і, звичайно, пілоти F-16!\nЛевова частка збитих сьогодні Х-101 – саме на рахунку українських Fighting Falcons.\n🤝\n Дякуємо партнерам за допомогу у захисті нашого неба!\n🇺🇦\n Посилюємо українську ППО – наближаємо перемогу разом!",
      "timestamp": "2025-09-21T03:52:28.791325Z"
    },
    {
      "original": "🛸\n Одеська область загроза застосування ударних БпЛА;\n🛵\n У центральній частині Чернігівщини надалі перебувають ворожі БпЛА;\n🛵\n Нові ворожі БпЛА на сході Сумщини.",
      "timestamp": "2025-09-21T03:52:28.791333Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-09-21T03:52:28.791339Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-21T03:52:28.791344Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-21T03:52:28.791349Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на сході Сумщини та півночі Харківщини, курс південний.",
      "timestamp": "2025-09-21T03:52:28.791354Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на півночі Харківщини, курс південний.\n⚡\n Можлива робота ППО.",
      "timestamp": "2025-09-21T03:52:28.791359Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Чернігівщини та півночі Харківщини, курс південний.\n🛵\n Групи БпЛА на Чернігівської та Київської областей, курс західний.",
      "timestamp": "2025-09-21T03:52:28.791365Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та східному напрямках!\n🚀\n Загроза застосування авіаційних засобів ураження, для прифронтових областей.",
      "timestamp": "2025-09-21T03:52:28.791372Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку!\n🚀\n Загроза застосування авіаційних засобів ураження, для прифронтових областей.",
      "timestamp": "2025-09-21T03:52:28.791380Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-21T03:52:28.791385Z"
    },
    {
      "original": "Scenes from Dnipro from during the drone attack (before the missiles arrived). Multiple large fires are still burning.",
      "timestamp": "2025-09-21T03:52:29.426737Z"
    },
    {
      "original": "Scenes from Dnipro from during the drone attack (before the missiles arrived). Multiple large fires are still burning.",
      "timestamp": "2025-09-21T03:52:29.426748Z"
    },
    {
      "original": "Ukrainian UAVs attacked the Saratov Oil Refinery in Saratov Oblast again, last night. At least 3 impacts were recorded, and fires are now burning there. \nAdditionally, flights in and out of Saratov international airport were temporarily suspended.",
      "timestamp": "2025-09-21T03:52:29.426754Z"
    },
    {
      "original": "Ukrainian UAVs attacked the Saratov Oil Refinery in Saratov Oblast again, last night. At least 3 impacts were recorded, and fires are now burning there. \nAdditionally, flights in and out of Saratov international airport were temporarily suspended.",
      "timestamp": "2025-09-21T03:52:29.426758Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Novokuibyshevsk Oil Refinery in Samara once again. At least two impacts were recorded, one of which being at the ELOU-AVT-11 oil processing unit.\nNovokuibyshevsk Refinery is approximately 900 km from the closest Ukrainian-controlled territory.",
      "timestamp": "2025-09-21T03:52:29.426763Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Novokuibyshevsk Oil Refinery in Samara once again. At least two impacts were recorded, one of which being at the ELOU-AVT-11 oil processing unit.\nNovokuibyshevsk Refinery is approximately 900 km from the closest Ukrainian-controlled territory.",
      "timestamp": "2025-09-21T03:52:29.426767Z"
    },
    {
      "original": "I have added a new layer to my Gaza map showing the estimated reach of Hamas' civil authority in the Gaza Strip. \nCurrently, I have areas of Deir Al-Balah, Nuseirat Refugee Camp, Maghazi Refugee Camp, Al-Bureij Refugee Camp, Az Zawayda, Al-Mawasi, and Khan Younis Refugee Camp in that zone. \nThis will be updated alongside Israeli advances.",
      "timestamp": "2025-09-21T03:52:29.426772Z"
    },
    {
      "original": "Interesting...",
      "timestamp": "2025-09-21T03:52:29.426775Z"
    },
    {
      "original": "Russian forces have captured the village of Berezove, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: 585.\nTotal land area: ~2.43 km².",
      "timestamp": "2025-09-21T03:52:29.426783Z"
    },
    {
      "original": "Russian forces have captured the village of Shandryholove, Lyman direction, Donetsk Oblast.\nPre-war population: ~1,040.\nTotal land area: 3.47 km².",
      "timestamp": "2025-09-21T03:52:29.426787Z"
    },
    {
      "original": "In the Dobropillya - Druzhkivka direction, both Russian and Ukrainian forces have advanced, making significant progress. \nUkrainian forces continued their attempts at cutting off the Russian salient to Kucheriv Yar. Prior to these attacks, Ukrainian forces regained control over Dorozhnje and the section of railway line to the south, sometime in the past two weeks. They also cleared the remaining Russian DRGs from the eastern approaches of Bilytske. Once they secured their position in the western part of Nykanorivka, Ukrainian forces pushed southwest and downhill through the treelines on the tactical heights to the western outskirts of Boikivka, where fighting is ongoing for a large trench fortification and nearby forests. \nOn the eastern flank of the salient, Ukrainian forces continued to slowly advance south down the eastern bank of the Kazenyi Torets River and gained a foothold in the northern houses of Novotoretske. They also pushed southeast down a gulley and recaptured the treelines on the heights to the north. West of the Kazenyi Torets River, the Ukrainians recaptured most of Pankivka, and began attacking west towards the Hektova Balka Gulley, supporting the flanking attacks further south. They were able to capture a forest and improve their positions along the treelines running west.\nIn the northern part of the Kucheriv Yar salient, Ukrainian forces continued to advance on Kucheriv Yar, and crossed the Hruzka River at a new point, capturing a U-shaped treeline and gaining a foothold at the southern part of the adjacent chalk quarry. Russian forces continued their assault operations in eastern Nove Shakhove. \nMeanwhile, further east, Russian forces began pushing back from the Popiv Yar area, recapturing previously lost positions in the forested areas north and west of the chalk quarries. The Ukrainians are attempting to counterattack here. \nTo the north, Russian forces significantly intensified their assault operations in the direction of Druzhkivka - possibly marking the beginning of a new offensive. Here, they advanced up both banks of the Poltavka River, capturing treeline positions on the heights to the west, as well as positions in the forests and treelines up to the gulley east of the river. Attacks are also once again underway towards the gulley leading to Sofiivka, although it's unclear how successful they were due to sentinel satellite imagery being completely obscured with clouds. \n+ ~28.14 km² in favour of Ukraine. \n+ ~14.00 km² in favour of Russia.",
      "timestamp": "2025-09-21T03:52:29.426796Z"
    },
    {
      "original": "Russian Su-34s are flying towards their launch lines in Kherson Oblast, likely to launch KAB glide-bombs. They are currently flying over the Rozdolne area of Crimea.",
      "timestamp": "2025-09-21T03:52:29.426799Z"
    },
    {
      "original": "Russian Su-34s are flying towards their launch lines in Kherson Oblast, likely to launch KAB glide-bombs. They are currently flying over the Rozdolne area of Crimea.",
      "timestamp": "2025-09-21T03:52:29.426812Z"
    },
    {
      "original": "They are now approaching Chaplynka, Kherson Oblast. They will launch glide-bombs in the next few minutes.",
      "timestamp": "2025-09-21T03:52:29.426816Z"
    },
    {
      "original": "They are now approaching Chaplynka, Kherson Oblast. They will launch glide-bombs in the next few minutes.",
      "timestamp": "2025-09-21T03:52:29.426819Z"
    },
    {
      "original": "KAB launches to the village of Inhulets once again.",
      "timestamp": "2025-09-21T03:52:29.426822Z"
    },
    {
      "original": "KAB launches to the village of Inhulets once again.",
      "timestamp": "2025-09-21T03:52:29.426825Z"
    },
    {
      "original": "A Russian recon drone is filming. The KABs will impact shortly.",
      "timestamp": "2025-09-21T03:52:29.426828Z"
    },
    {
      "original": "A Russian recon drone is filming. The KABs will impact shortly.",
      "timestamp": "2025-09-21T03:52:29.426831Z"
    },
    {
      "original": "Explosions in Inhulets.",
      "timestamp": "2025-09-21T03:52:29.426834Z"
    },
    {
      "original": "Explosions in Inhulets.",
      "timestamp": "2025-09-21T03:52:29.426837Z"
    },
    {
      "original": "The Su-34s are returning to Crimea with a Su-35 covering them.",
      "timestamp": "2025-09-21T03:52:29.426840Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance towards the Yanchur River, and have captured numerous new positions in a previously static section of the frontline.\nRussian forces advanced on a front from Malynivka to Stepove, pushing along several different treelines towards the Yanchur River, significantly shrinking Ukraine's zone of control east of it. \nThey also pushed northwest along the treelines on the southern bank of the Solona River, and established control over the village of Olhivske. Ukrainian forces have withdrawn to the northern approaches of Poltavka, where fighting is ongoing.\n+ ~20.90 km² in favour of Russia.",
      "timestamp": "2025-09-21T03:52:29.426845Z"
    }
  ],
  "script_run_time": "2025-09-21T03:52:30.063960Z"
}