{
  "messages": [
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-09T08:39:48.813085Z"
    },
    {
      "original": "🛵\n Нові групи ворожих БпЛА на півночі та північному сході Чернігівщини, курс - південно-західний;",
      "timestamp": "2025-09-09T08:39:48.813102Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-09T08:39:48.813111Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-09T08:39:48.813118Z"
    },
    {
      "original": "🛸\n🛸\nВорожі розвідувальні БпЛА на  Сумщині (в районі н.п.Боромля) та на межі Донеччини і Дніпропетровщини! Залучено засоби для їх збиття.",
      "timestamp": "2025-09-09T08:39:48.813124Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-09-09T08:39:48.813129Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину (напрямок н.п.Хотінь)",
      "timestamp": "2025-09-09T08:39:48.813133Z"
    },
    {
      "original": "Ще швидкісні цілі тим самим курсом (н.п.Хотінь/Миколаївка)",
      "timestamp": "2025-09-09T08:39:48.813136Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 60 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 9 вересня (із 19.00 8 вересня) противник атакував 84-ма ударними БпЛА типу Shahed, Гербера та безпілотниками інших типів із напрямків: Брянськ, Курськ, Міллєрово, Приморсько-Ахтарськ – рф., понад 50 із них – шахеди.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.30, протиповітряною обороною збито/подавлено 60 ворожих БпЛА типу Shahed, Гербера та дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 23 ударних БпЛА на 10 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-09T08:39:48.813154Z"
    },
    {
      "original": "Швидкісна ціль на Сумщину (вектор - н.п.Хотінь)",
      "timestamp": "2025-09-09T08:39:48.813158Z"
    },
    {
      "original": "🛵\n Нові групи ворожих БпЛА на північному сході Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-09-09T08:39:48.813170Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-09-09T08:39:48.813175Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-09T08:39:48.813180Z"
    },
    {
      "original": "🛸\n На північному сході Сумщини, на на Харківщині, на південному сході Дніпропетровщини -  розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.\n🛵\n Чернігів - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T08:39:48.813186Z"
    },
    {
      "original": "🛵\n Конотопський район на Сумщині- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T08:39:48.813190Z"
    },
    {
      "original": "🛵\n Вишгородський р-н Київська обл.- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T08:39:48.813195Z"
    },
    {
      "original": "🛸\n Повітряна тривога по ворожому розвідувальному БпЛА в районі Одеси! Залучено засоби для їх збиття.",
      "timestamp": "2025-09-09T08:39:48.813201Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному та північно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-09T08:39:48.813210Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-09T08:39:48.813215Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на північ Харківщини.",
      "timestamp": "2025-09-09T08:39:48.813221Z"
    },
    {
      "original": "🛸\n На північному сході Сумщини, на на Харківщині, на південному сході Дніпропетровщини -  розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.\n🛵\nНа півночі Сумщини та Чернігівщини  ударні БпЛА.",
      "timestamp": "2025-09-09T08:39:48.813227Z"
    },
    {
      "original": "A series of Israeli airstrikes targeted the Hermel region, northeastern Lebanon, a short time ago.",
      "timestamp": "2025-09-09T08:39:49.532352Z"
    },
    {
      "original": "A series of Israeli airstrikes targeted the Hermel region, northeastern Lebanon, a short time ago.",
      "timestamp": "2025-09-09T08:39:49.532364Z"
    },
    {
      "original": "The drone has entered Israeli airspace, flying northwest.",
      "timestamp": "2025-09-09T08:39:49.532369Z"
    },
    {
      "original": "The Houthi drone impacted the Ramon Airport area again. It was not intercepted.",
      "timestamp": "2025-09-09T08:39:49.532376Z"
    },
    {
      "original": "The Houthi drone impacted the Ramon Airport area again. It was not intercepted.",
      "timestamp": "2025-09-09T08:39:49.532379Z"
    },
    {
      "original": "It seems to have fallen outside of the airport, impacting an open area. No casualties.",
      "timestamp": "2025-09-09T08:39:49.532383Z"
    },
    {
      "original": "Russia is continuing to prepare for their next large-scale combined missile attack on Ukraine.\nAnother Tu-95MS strategic bomber redeployed from Olenya Airbase, Murmansk Oblast, to Engels-2 Airbase, Saratov Oblast, to be equipped with Kh-101 cruise missiles. An IL-76MD military transport aircraft also landed at Engels-2 a short time ago. The cargo consists of Kh-101 missiles. \nAdditionally, 1 Tu-160 redeployed from Engels-2 Airbase to Ukrainka Airbase, probably to be equipped with missiles.\nAs of now, at least 2 Tu-95s are known to be equipped with Kh-101 missiles at Olenya, as well as another 2 at Ukrainka. This is on top of 1 Tu-95 and 1 Tu-160 currently in the process of being equipped at Engels-2, and possibly another Tu-160 being equipped at Ukrainka.",
      "timestamp": "2025-09-09T08:39:49.532389Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the factory management building for the Zaporizhzhia Abrasive Plant was heavily damaged by Geran-2 drone strikes during the attacks on September 7.   Image credit: https://t.me/osint_alarm/223",
      "timestamp": "2025-09-09T08:39:49.532394Z"
    },
    {
      "original": "Here are some close-up photos of the Abrasive Plant that was hit in Zaporizhzhia.",
      "timestamp": "2025-09-09T08:39:49.532397Z"
    },
    {
      "original": "Here are some close-up photos of the Abrasive Plant that was hit in Zaporizhzhia.",
      "timestamp": "2025-09-09T08:39:49.532401Z"
    },
    {
      "original": "A series of Israeli airstrikes targeted the Hermel region, northeastern Lebanon, a short time ago.",
      "timestamp": "2025-09-09T08:39:49.532404Z"
    },
    {
      "original": "The IDF claimed that the airstrikes on northeastern Lebanon targeted Hezbollah camps, including ones used by their elite \"Radwan\" force.",
      "timestamp": "2025-09-09T08:39:49.532410Z"
    },
    {
      "original": "Sirens are again sounding in southern Israel due to the threat of Houthi UAVs. This time in the area of the Rotem Industrial Zone.",
      "timestamp": "2025-09-09T08:39:49.532413Z"
    },
    {
      "original": "Sirens are again sounding in southern Israel due to the threat of Houthi UAVs. This time in the area of the Rotem Industrial Zone.",
      "timestamp": "2025-09-09T08:39:49.532419Z"
    },
    {
      "original": "The UAV is flying west to the Dimona Nuclear Research Centre.",
      "timestamp": "2025-09-09T08:39:49.532422Z"
    },
    {
      "original": "The UAV is flying west to the Dimona Nuclear Research Centre.",
      "timestamp": "2025-09-09T08:39:49.532425Z"
    },
    {
      "original": "Israeli media reports that the UAV fell outside Dimona.",
      "timestamp": "2025-09-09T08:39:49.532429Z"
    },
    {
      "original": "This evening, Donetsk City and Makiivka came under a large-scale combined Ukrainian missile, rocket, and drone attack. Russian air defences were completely overwhelmed by the number of aerial targets, resulting in many of the cruise missiles getting through and impacting their targets. \nAmong the targets hit was the \"Topaz\" plant, where at least 4 Storm Shadow missiles impacted one after another. Additionally, the Scientific Research Institute of Complex Automation was hit, likely by Ukrainian-produced \"Peklo\" long-range jet drones. The Donetsk Metalurgical plant was also hit by at least one UAV. \nFurthermore, HIMARS GMLRS launched from the vicinity of Kramatorsk targeted Makiivka, although it's unclear if any impacted. Their goal was likely to further saturate air defence for the jet-drones and storm shadows. \nMost UAVs and jet-drones were shot down by air defence units in Donetsk, Makiivka, and Yenakijeve, but a large portion of Storm Shadow cruise missiles launched by tactical aviation over Dnipropetrovsk Oblast got through. \nUkrainian sources report that the targets were command posts used by the Russian Army, as well as the 41st Artillery Brigade, although this is currently unconfirmed.",
      "timestamp": "2025-09-09T08:39:49.532436Z"
    },
    {
      "original": "This evening, Donetsk City and Makiivka came under a large-scale combined Ukrainian missile, rocket, and drone attack. Russian air defences were completely overwhelmed by the number of aerial targets, resulting in many of the cruise missiles getting through and impacting their targets. \nAmong the targets hit was the \"Topaz\" plant, where at least 4 Storm Shadow missiles impacted one after another. Additionally, the Scientific Research Institute of Complex Automation was hit, likely by Ukrainian-produced \"Peklo\" long-range jet drones. The Donetsk Metalurgical plant was also hit by at least one UAV. \nFurthermore, HIMARS GMLRS launched from the vicinity of Kramatorsk targeted Makiivka, although it's unclear if any impacted. Their goal was likely to further saturate air defence for the jet-drones and storm shadows. \nMost UAVs and jet-drones were shot down by air defence units in Donetsk, Makiivka, and Yenakijeve, but a large portion of Storm Shadow cruise missiles launched by tactical aviation over Dnipropetrovsk Oblast got through. \nUkrainian sources report that the targets were command posts used by the Russian Army, as well as the 41st Artillery Brigade, although this is currently unconfirmed.",
      "timestamp": "2025-09-09T08:39:49.532442Z"
    },
    {
      "original": "Last night, a Russian missile strike was carried out on the city of Druzhkivka, Donetsk Oblast. 1-2 Iskander-M ballistic missiles were used, reportedly targeting an industrial zone (unconfirmed). Around 15 minutes later, another series of explosions were heard, likely from secondary detonations. \nCensorship regarding this event is unusually strong, so there is only one public video/photo showing the event, which is from a Russian channel.",
      "timestamp": "2025-09-09T08:39:49.532446Z"
    },
    {
      "original": "The channel chat is temporarily locked for new users because of a bot raid. Next time 200 scam bots raid my chat, I'd appreciate it if someone DMed me so it doesn't get like this.",
      "timestamp": "2025-09-09T08:39:49.532449Z"
    },
    {
      "original": "Explosions in Kharkiv City. KAB glide-bomb strikes.",
      "timestamp": "2025-09-09T08:39:49.532453Z"
    },
    {
      "original": "There is an increased threat of a large-scale combined Russian missile attack on Ukraine tomorrow. Currently as many as 9 Tu-95MS and Tu-160 strategic bombers are known to be equipped with Kh-101 cruise missiles at Engels-2 Airbase, Saratov Oblast, and Olenya Airbase, Murmansk Oblast.\nAdditionally, accumulations of Geran-2 drones at multiple launch points, likely for usage with missiles, has been recorded. \nThe possibility of a missile attack tomorrow is not 100%, but it is likely. The usage of Kalibrs and Iskanders is also possible.",
      "timestamp": "2025-09-09T08:39:49.532457Z"
    }
  ],
  "script_run_time": "2025-09-09T08:39:50.102998Z"
}