{
  "messages": [
    {
      "original": "🛵\n БпЛА з Херсонщини на Миколаївщину, курсом на захід.",
      "timestamp": "2025-12-01T09:31:14.571569Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Миколаєва, під час тривоги перебувайте в укриттях!",
      "timestamp": "2025-12-01T09:31:14.571586Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-01T09:31:14.571592Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Миколаївщині, курс  північно-західний.",
      "timestamp": "2025-12-01T09:31:14.571597Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини, курсом на н.п. Новгород-Сіверський.",
      "timestamp": "2025-12-01T09:31:14.571601Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-01T09:31:14.571605Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 63 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 1 грудня (з 18:00 30 листопада) противник атакував 89-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Міллерово, Приморсько-Ахтарськ – рф, Чауда - ТОТ АР Крим, близько 55 із них – \"шахеди\".\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 63 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 26 ударних БпЛА на 9 локаціях. \n✊\n Тримаймо небо!\n \n🇺🇦\nРазом – до перемоги!",
      "timestamp": "2025-12-01T09:31:14.571636Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курсом на н.п. Куликівка.",
      "timestamp": "2025-12-01T09:31:14.571644Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Таганрогу.",
      "timestamp": "2025-12-01T09:31:14.571649Z"
    },
    {
      "original": "Дніпро в укриття!",
      "timestamp": "2025-12-01T09:31:14.571652Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-12-01T09:31:14.571657Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-01T09:31:14.571661Z"
    },
    {
      "original": "🛵\n БпЛА на північ Київщини (Вишгородський р-н) з Чернігівщини.",
      "timestamp": "2025-12-01T09:31:14.571666Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-01T09:31:14.571670Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Харківщину.",
      "timestamp": "2025-12-01T09:31:14.571717Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-01T09:31:14.571722Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-12-01T09:31:14.571728Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на  Сумщині, курс на Суми.",
      "timestamp": "2025-12-01T09:31:14.571732Z"
    },
    {
      "original": "🛵\n БпЛА з Київщини на Житомирщину, на н.п. Городок.",
      "timestamp": "2025-12-01T09:31:14.571737Z"
    },
    {
      "original": "🛵\n Безпілотник курсом на Житомир з півночі.",
      "timestamp": "2025-12-01T09:31:14.571741Z"
    },
    {
      "original": "15 hours of reporting and 237 posts on this channel today...\nI'm gonna get some rest \n😆",
      "timestamp": "2025-12-01T09:31:15.403327Z"
    },
    {
      "original": "Ukrainian propagandists didn’t clear the cameras line of sight when recording an “Attack on civilians in Kiev” revealing an interesting piece of military equipment.",
      "timestamp": "2025-12-01T09:31:15.403340Z"
    },
    {
      "original": "Ukrainian propagandists didn’t clear the cameras line of sight when recording an “Attack on civilians in Kiev” revealing an interesting piece of military equipment.",
      "timestamp": "2025-12-01T09:31:15.403344Z"
    },
    {
      "original": "In the evening, a Russian Iskander-M ballistic missile launched from the vicinity of Belbek Airbase in Crimea impacted the vicinity of Odesa International Airport.",
      "timestamp": "2025-12-01T09:31:15.403348Z"
    },
    {
      "original": "In the evening, a Russian Iskander-M ballistic missile launched from the vicinity of Belbek Airbase in Crimea impacted the vicinity of Odesa International Airport.",
      "timestamp": "2025-12-01T09:31:15.403352Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again attacked Dnipropetrovsk Oblast.\nThe main target was the village of Orlivschyna, where approximately 12 drones impacted an unknown target.\nAdditionally, around 7 drones targeted the vicinity of the village of Dubovyky, and another ~5 targeted the city of Pavlohrad.\nBoth videos are from Orlivschyna.",
      "timestamp": "2025-12-01T09:31:15.403358Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again attacked Dnipropetrovsk Oblast.\nThe main target was the village of Orlivschyna, where approximately 12 drones impacted an unknown target.\nAdditionally, around 7 drones targeted the vicinity of the village of Dubovyky, and another ~5 targeted the city of Pavlohrad.\nBoth videos are from Orlivschyna.",
      "timestamp": "2025-12-01T09:31:15.403363Z"
    },
    {
      "original": "Last night, at least 15 Russian Geran-2 drones attacked the city of Vyshhorod, Kyiv Oblast. \nAll of the drones targeted the Kyiv Hydroelectric Power Plant, however falling debris damaged an apartment building, resulting in a large fire spreading which killed one civilian and wounded 11 others.",
      "timestamp": "2025-12-01T09:31:15.403371Z"
    },
    {
      "original": "🇺🇸\n🇻🇪\n⚡\n- US issued NOTAMs over sections of Venezuela's southern border. NOTAMs remain active until March 1st, 2026.",
      "timestamp": "2025-12-01T09:31:15.403378Z"
    },
    {
      "original": "Re-Ukraine negotiations \nI’ve said it for two years but I must repeat that the US does not want peace, they only want what benefits them. Donbass is unimportant to the west, they will happily exchange it for a chance to rebuild Ukraines army or interfere with their own forces. I told you that the U.S., Ukraine and the EU will never come to an agreement (by design) that Russia finds workable. Even the “Russian plan” that the U.S. presented wasn’t a Russian plan and ignored basic underlying issues. It wouldn’t have worked and that was the greatest round of concessions we’ve seen in a proposal. \nThis is a global war that everyone is to scared to call spade.",
      "timestamp": "2025-12-01T09:31:15.403383Z"
    },
    {
      "original": "In the Bilopillya direction, Russian forces have restarted their assault operations along the international border between Kursk and Sumy Oblasts.\nIn the west, Russian forces advanced from their positions in the southern part of Tetkino, moving west along Chapayeva Street. Chapayeva Street was considered one of the last areas of Tetkino not yet under Russian control and still had a small Ukrainian presence. The Russians were able to establish control over the majority of this street and pushed to the west, capturing a cluster of houses on the outskirts of the town, further increasing their presence on the eastern bank of the Seym River on the Kursk side of the border.\nMeanwhile, artillery bombardment of Ukrainian positions in the village of Ryzhivka has intensified. Ukrainian forces have in turn increased their FPV drone strikes on Tetkino and Russian supply routes further into the rear. Russian Geran-2 drones have been striking Ukrainian drone operator positions in the rear as well. Despite the increased intensity of fighting, there has been no noticeable increase in Ukrainian airstrikes on Kursk.\nIn the east, Russian forces resumed attacks in the village of Bezsalivka, which is largely held by Ukrainian drones. Russian soldiers managed to marginally advance in the northern houses and forests on both sides of the Volfa River. Russian artillery shelling of Iskryskivshchyna has intensified, and strikes are being carried out on Ukrainian drone operator positions in order to support assault operations in Bezsalivka and nearby areas.\n+ ~0.64 km² in favour of Russia.",
      "timestamp": "2025-12-01T09:31:15.403390Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continued their intensified assault operations aimed at regaining control over key areas in Sumy Oblast.\nIn the west, at some point recently, Russian forces managed to consolidate in the gulley directly east of Kindrativka, further solidifying their presence south of the reservoir. They have since renewed their attempts at storming the eastern part of Kindrativka, but have so far achieved no confirmed successes. \nTo the southeast, Russian forces were able to full capture the treeline stretching between Andriivka and the southern part of Oleksiivka, allowing for the remaining positions on the western approaches of Oleksiivka to be occupied. \nFrom there, the Russians launched an attack on the southeastern part of Andriivka, and managed to consolidate in a few houses there. Ukrainian forces carried out counterattacks against these positions but were unsuccessful due to increased numbers of Russian FPV drones being used. The Ukrainians also carried out an attack towards the northern outskirts of Andriivka, but this was repelled too. Russian artillery shelling has intensified on Andriivka and the surrounding areas, supporting their assault operations. \nIn the east, Russian forces continued to advance near Varachyne. They managed to recapture the treeline leading to its northeastern outskirts and entered the first houses of the village. Assault operations are now underway on Ukrainian positions in the southern houses. \n+ ~5.26 km² in favour of Russia",
      "timestamp": "2025-12-01T09:31:15.403398Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in and around Vovchansk and have made important progress in three different areas.\nIn the northeast, Russian forces continued to advance through southeastern Vovchansk. They reached the eastern end of Panina Street and cleared the rest of the buildings west of Hurkanivska Street. They then advanced beyond Hurkanivska Street and are engaged in fierce fighting for the residential blocks there.\nTo the southwest, Russian forces intensified their storming of Vilcha, despite the arrival of Ukrainian reinforcements. They captured the rest of the windbreaks on either side of the railway line and pushed east down the treeline north of the town. Then, in coordination with attacks from the east, Russian soldiers advanced south down a perpendicular treeline, entering the northern streets of Vilcha. Advances were also made in the western streets towards the town centre. \nIn the west, Russian forces resumed their assault operations in the forests west of Synelnykove. They captured new positions just south of the Siverskyi Donets River and entered the eastern houses of Prylipka where heavy fighting is underway. \n+ ~3.00 km² in favour of Russia.",
      "timestamp": "2025-12-01T09:31:15.403404Z"
    },
    {
      "original": "High threat of Iskander launches from Taganrog, Rostov Oblast.",
      "timestamp": "2025-12-01T09:31:15.403408Z"
    },
    {
      "original": "Iskander on Dnipro",
      "timestamp": "2025-12-01T09:31:15.403411Z"
    },
    {
      "original": "Explosion in Dnipro",
      "timestamp": "2025-12-01T09:31:15.403414Z"
    },
    {
      "original": "High threat of repeated launches to Dnipro",
      "timestamp": "2025-12-01T09:31:15.403417Z"
    },
    {
      "original": "Repeated explosion in Dnipro. Another Iskander strike. Radars didn't pick it up for some reason.",
      "timestamp": "2025-12-01T09:31:15.403423Z"
    },
    {
      "original": "Regarding Russian strategic bomber movements:\nDuring the most recent combined attack on Ukraine, 7 Tu-95MS were used (not 4 as I previously reported). They all landed at Engels-2 Airbase, where at least 4 of them were immediately re-equipped with Kh-101 cruise missiles delivered by 2 Il-76MD and 1 AN-124-100 cargo planes.\nThe 4 Tu-95MS confirmed to be equipped with missiles flew back to Ukrainka Airbase, Amur Oblast, alongside 1 IL-78M tanker.\nThe other 3 Tu-95MS redeployed back to Belaya Airbase, Irkutsk Oblast. \n1 Tu-160 redeployed from Engels-2 Airbase to Belaya Airbase.",
      "timestamp": "2025-12-01T09:31:15.403429Z"
    },
    {
      "original": "There is an increased threat of another large-scale, combined missile and drone attack taking place on Ukraine in the next 72 hours.\nThe highest threat is for tonight/tomorrow morning. \n4-6 MiG-31K fighters have once again been re-equipped with Kinzhal hypersonic aeroballistic missiles at Savasleika Airbase, Nizhny Novgorod Oblast.\n1 \"Varshavyanka\" submarine, and 1-2 surface carriers have been equipped with Kalibr cruise missiles at Novorossiysk Naval Base, Krasnodar Krai, with a total possible salvo of between 14 and 22 missiles.\nIskander-M ballistic missiles have been delivered to OTRK installations near Liski (Voronezh Oblast), Taganrog (Rostov Oblast), and northeast of Simferopol (Crimea). \nIskander-K missiles have also been delivered to various OTRK installations near Ukraine.\nThere remains a significant number of Geran-2 drones accumulated at various launch sites near Ukraine, especially at the Tsumbulova Test Site in Oryol Oblast. \nThe highest threat is to Kyiv, Zaporizhzhia, Dnipropetrovsk, Poltava, Cherkasy, and Zhytomyr Oblasts. \nI will publish an update on this in the evening/early night, Kyiv Time.",
      "timestamp": "2025-12-01T09:31:15.403439Z"
    },
    {
      "original": "From 85 to 5,500: Dynamics of Russian Drone Strikes in 2025. Strike Overview\nOn November 29-30, Russia and Ukraine continued their exchange of strikes. According to a statement from the Russian Defense Ministry, on the night of November 30, air defense forces destroyed 33 UAVs. For its part, the Ukrainian Air Force reported an attack involving two \"Iskander-M\" ballistic missiles and 122 drones, of which, according to preliminary data, 104 units were shot down or suppressed.\nStatistics on the use of Russian drones in 2025 indicate a stabilization following a peak intensity in the summer. The monthly attack rate has settled at around 5,500 drones, signaling a shift towards a strategy of managed and sustainable resource expenditure, rather than uncontrolled escalation.\nOpen-source data shows a consistent progression. While the daily average in January was around 85 drones, it peaked at 203 units by July. Since August, stabilization has been observed within a range of 130-190 drones per day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182744Z"
    },
    {
      "original": "From 85 to 5,500: Dynamics of Russian Drone Strikes in 2025. Strike Overview\nOn November 29-30, Russia and Ukraine continued their exchange of strikes. According to a statement from the Russian Defense Ministry, on the night of November 30, air defense forces destroyed 33 UAVs. For its part, the Ukrainian Air Force reported an attack involving two \"Iskander-M\" ballistic missiles and 122 drones, of which, according to preliminary data, 104 units were shot down or suppressed.\nStatistics on the use of Russian drones in 2025 indicate a stabilization following a peak intensity in the summer. The monthly attack rate has settled at around 5,500 drones, signaling a shift towards a strategy of managed and sustainable resource expenditure, rather than uncontrolled escalation.\nOpen-source data shows a consistent progression. While the daily average in January was around 85 drones, it peaked at 203 units by July. Since August, stabilization has been observed within a range of 130-190 drones per day.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182763Z"
    },
    {
      "original": "Military Situation In Gaza Strip On November 30, 2025 (Map Update)",
      "timestamp": "2025-12-01T09:31:16.182768Z"
    },
    {
      "original": "European Fortress: How The Conflict In Ukraine Is Forging A New Defense Landscape For The Continent\nThe strategic alliance between Germany’s Rheinmetall and Italy’s Leonardo indicates a shift toward the development of rearmament tools. NATO is using the Ukrainian testing ground to develop a new security logistics system in which controlling arms supply chains is more important than diplomatic maneuvering. Record profits for defense industry giants like Lockheed Martin and Rheinmetall are a direct consequence of the conflict in Ukraine.\nThe conflict in Ukraine has been a turning point for global security and an unprecedented catalyst for growth of the Western defense-industrial complex. The era of «peace by inertia» that followed the Cold War has ended, giving way to total remilitarization. European powers, long reliant on the American «nuclear umbrella», are hastily establishing their own security architecture.\n________________________\nYOU CAN DOWNLOAD THE FULL RESEARCH TEXT IN \nPDF\n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182780Z"
    },
    {
      "original": "European Fortress: How The Conflict In Ukraine Is Forging A New Defense Landscape For The Continent\nThe strategic alliance between Germany’s Rheinmetall and Italy’s Leonardo indicates a shift toward the development of rearmament tools. NATO is using the Ukrainian testing ground to develop a new security logistics system in which controlling arms supply chains is more important than diplomatic maneuvering. Record profits for defense industry giants like Lockheed Martin and Rheinmetall are a direct consequence of the conflict in Ukraine.\nThe conflict in Ukraine has been a turning point for global security and an unprecedented catalyst for growth of the Western defense-industrial complex. The era of «peace by inertia» that followed the Cold War has ended, giving way to total remilitarization. European powers, long reliant on the American «nuclear umbrella», are hastily establishing their own security architecture.\n________________________\nYOU CAN DOWNLOAD THE FULL RESEARCH TEXT IN \nPDF\n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182791Z"
    },
    {
      "original": "SouthFront: Analysis & Intelligence\n pinned a photo",
      "timestamp": "2025-12-01T09:31:16.182796Z"
    },
    {
      "original": "Military Situation In Ukraine On November 30, 2025 (Maps Update)",
      "timestamp": "2025-12-01T09:31:16.182799Z"
    },
    {
      "original": "Military Situation In Ukraine On November 30, 2025 (Maps Update)",
      "timestamp": "2025-12-01T09:31:16.182803Z"
    },
    {
      "original": "Assault On Huliaipole: Fighting On Eastern Outskirts Amid Encirclement Threat To Ukrainian Units In Zelenyi Hai\nRussian forces have secured the industrial zone in southern Konstantynivka and key strongpoints on the heights near Huliaipole, severing all supply routes to the Ukrainian garrison there. Meanwhile, on the diplomatic front, a new round of talks between Ukrainian representatives and an American delegation led by Secretary of State Marco Rubio was held in Florida.\nRussian units of the \"West\" group of forces are continuing their advance, breaking through Ukrainian defensive lines. In the central sector, they cleared the tree lines near Dobropillia in heavy fighting, pushing hostilities to the outskirts of the settlement.\nOn an adjacent front, Russian forces have cleared positions on the approaches to Varvarivka across a five-kilometer-wide sector. Their forward units are now advancing on the settlement itself. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182813Z"
    },
    {
      "original": "Assault On Huliaipole: Fighting On Eastern Outskirts Amid Encirclement Threat To Ukrainian Units In Zelenyi Hai\nRussian forces have secured the industrial zone in southern Konstantynivka and key strongpoints on the heights near Huliaipole, severing all supply routes to the Ukrainian garrison there. Meanwhile, on the diplomatic front, a new round of talks between Ukrainian representatives and an American delegation led by Secretary of State Marco Rubio was held in Florida.\nRussian units of the \"West\" group of forces are continuing their advance, breaking through Ukrainian defensive lines. In the central sector, they cleared the tree lines near Dobropillia in heavy fighting, pushing hostilities to the outskirts of the settlement.\nOn an adjacent front, Russian forces have cleared positions on the approaches to Varvarivka across a five-kilometer-wide sector. Their forward units are now advancing on the settlement itself. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-01T09:31:16.182822Z"
    }
  ],
  "script_run_time": "2025-12-01T09:31:16.183707Z"
}