{
  "messages": [
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-10-24T23:16:51.181273Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північ Харківщини.",
      "timestamp": "2025-10-24T23:16:51.181287Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині, курсом на Бориспіль.",
      "timestamp": "2025-10-24T23:16:51.181293Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-24T23:16:51.181298Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-24T23:16:51.181302Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-24T23:16:51.181307Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-24T23:16:51.181311Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря, курсом на Херсонщину/Миколаївщину.",
      "timestamp": "2025-10-24T23:16:51.181315Z"
    },
    {
      "original": "🛵\n БпЛА північніше Броварів, курсом на Київ",
      "timestamp": "2025-10-24T23:16:51.181322Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на сході Харківщини.",
      "timestamp": "2025-10-24T23:16:51.181327Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині змінив курс на Чернігівщину.\n🛵\n БпЛА на сході Чернігівщини, курс південний.\n🛵\n БпЛА на сході Дніпропетровщини, постійно змінюють напрямок руху.\n🛵\n БпЛА з акваторії Чорного моря, курсом на Миколаївщину.",
      "timestamp": "2025-10-24T23:16:51.181336Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-10-24T23:16:51.181341Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-24T23:16:51.181347Z"
    },
    {
      "original": "🛵\n БпЛА на межі Чернігівщини та Сумщини, курс південний.",
      "timestamp": "2025-10-24T23:16:51.181352Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-24T23:16:51.181356Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-10-24T23:16:51.181360Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-10-24T23:16:51.181364Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-10-24T23:16:51.181368Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-10-24T23:16:51.181372Z"
    },
    {
      "original": "🛵\n БпЛА південніше Сум, курс західний.",
      "timestamp": "2025-10-24T23:16:51.181376Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курс північний/північно-західний.",
      "timestamp": "2025-10-24T23:16:51.181381Z"
    },
    {
      "original": "🛵\n БпЛА західніше Сум, курс західний.\n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний.\n🛵\n БпЛА на межі Чернігівщини та Сумщини, постійно змінює напрямок руху.\n🛵\n БпЛА на півночі Полтавщини, курс північно-західний.",
      "timestamp": "2025-10-24T23:16:51.181390Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-24T23:16:51.181394Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курсом на Мерефу.\n🛵\n БпЛА на Дніпропетровщині, курсом на Петропавлівку.\n🛵\n БпЛА на межі Чернігівщини та Сумщини, постійно змінює напрямок руху.\n🛵\n БпЛА на півночі Полтавщини, курс західний.",
      "timestamp": "2025-10-24T23:16:51.181402Z"
    },
    {
      "original": "Changed course slightly to Chornomorsk, Odesa Oblast.",
      "timestamp": "2025-10-24T23:16:51.763466Z"
    },
    {
      "original": "Changed course slightly to Chornomorsk, Odesa Oblast.",
      "timestamp": "2025-10-24T23:16:51.763477Z"
    },
    {
      "original": "Correction: 3 jet glide-bombs",
      "timestamp": "2025-10-24T23:16:51.763481Z"
    },
    {
      "original": "Correction: 3 jet glide-bombs",
      "timestamp": "2025-10-24T23:16:51.763484Z"
    },
    {
      "original": "Approaching the coast.",
      "timestamp": "2025-10-24T23:16:51.763487Z"
    },
    {
      "original": "4 glide-bombs are now detected, flying 500km/h",
      "timestamp": "2025-10-24T23:16:51.763490Z"
    },
    {
      "original": "2 explosions in Chornomorsk, Odesa Oblast.",
      "timestamp": "2025-10-24T23:16:51.763493Z"
    },
    {
      "original": "2 explosions in Chornomorsk, Odesa Oblast.",
      "timestamp": "2025-10-24T23:16:51.763496Z"
    },
    {
      "original": "Patriot/Iris-T launches",
      "timestamp": "2025-10-24T23:16:51.763500Z"
    },
    {
      "original": "Explosions in Chornomorsk.",
      "timestamp": "2025-10-24T23:16:51.763503Z"
    },
    {
      "original": "2 more glide-bombs approaching. 10km away",
      "timestamp": "2025-10-24T23:16:51.763509Z"
    },
    {
      "original": "2 more glide-bombs approaching. 10km away",
      "timestamp": "2025-10-24T23:16:51.763512Z"
    },
    {
      "original": "More explosions in Chornomorsk.",
      "timestamp": "2025-10-24T23:16:51.763515Z"
    },
    {
      "original": "3 of the glide-bombs were shot down, 1 impacted Chornomorsk. It's all clear now.",
      "timestamp": "2025-10-24T23:16:51.763518Z"
    },
    {
      "original": "LPR channel mixing up the 3 IRIS-T launches (each intercepted once glide-bomb) with Neptune missile launches lol.",
      "timestamp": "2025-10-24T23:16:51.763521Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces continued their assault on the city of Rodynske and have made significant progress towards capturing it.\nFollowing the Ukrainian counterattacks in Chervonyi Lyman, the Russians began a series of counterattacks aimed at regaining control over their flanks. They re-secured the treeline positions southeast of the village and began pushing back into its western houses. \nOnce the village was back under their control, Russian soldiers advanced into the southern part of Rodynske, and began attacking towards the city centre. This was done in coordination with other forces capturing the rest of the high-rise buildings in the southeast of the city. Meanwhile, in the north of the Rodynske, Russian forces continued to clear the low-rise residential areas. As a result, the area under Ukrainian control is rapidly shrinking as they get squeezed out of the rest of the city centre and western suburbs. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-10-24T23:16:51.763527Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian and Russian forces have advanced over the last week, with the Ukrainians recapturing the village of Kucheriv Yar. \nBefore attacking Kucheriv Yar, Ukrainian forces cleared out the Russian DRGs who had infiltrated down the road to the southern outskirts of Zolotyi Kolodyaz. Once this was complete, they attacked down the gulley from Vesele to Kucheriv Yar, entering the village, establishing control over it, and taking POWs. They also secured the positions surrounding the village, including the gulley leading south from Hruzke.\nTo the southwest, Ukrainian forces were able to consolidate in the village of Vilne after repelling earlier Russian attacks, and recaptured positions in the forests to the northeast which the Russians were using as staging grounds and infantry accumulation points to attack Vilne. \nIn the east, Russian forces managed to enter Shakhove from the west, moving along the gulleys and forests. As of now, heavy fighting is ongoing towards the centre of this stronghold village, with the Russians attempting to consolidate further. Additionally, Russian forces advanced in Volodymyrivka, making new progress back towards the northern part of the village. \n+ ~19.10 km² in favour of Ukraine.\n+ ~3.77 km² in favour of Russia.",
      "timestamp": "2025-10-24T23:16:51.763534Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault on Pleshchiivka, and have made new advances inside the settlement.\nAfter gaining a foothold in the southern part of the village, Russian forces continued their attacks further north under heavy drone and artillery cover. They were able to entrench and consolidate in denser residential areas in the western part of Pleshchiivka, before pushing north along the streets next to the railway line, capturing new positions there. Attacks are now underway on the centre of the village, where the grey zone is expanding. \n+ ~0.18 km² in favour of Russia.",
      "timestamp": "2025-10-24T23:16:51.763539Z"
    },
    {
      "original": "I keep seeing people bringing up this older post of mine as a \"gotcha\", so I'll address what I meant in it here:\nThis post was made in October 2024 when the last cohesive and layered Ukrainian defence line ran through the Pokrovsk area. The 9-12 months figure I provided was a timeline based on if, hypothetically, Russia kept advancing at the exact same rate which they were advancing at in October 2024.\nIt was not a prediction, but instead a post aimed at highlighting Ukraine's lack of defences in the Donbas, which was caused by them greatly underestimating Russia's capabilities following the fall of Avdiivka. Since that post, Ukraine has constructed many more defences further back, including more modernised and adapted fortifications which are more effective against drones.",
      "timestamp": "2025-10-24T23:16:51.763546Z"
    },
    {
      "original": "Siversk general direction. Russian forces consolidate their positions and logistic routes near Soledar and behind the current front, Ukrainian drones aren't very active in their rear.\nThe red square represents frequent Russian shelling over the past days of a location with high Ukrainian infantry traffic. Many Ukrainian casualties were recorded because of this, but for some reason they keep using this exact route.",
      "timestamp": "2025-10-24T23:16:51.763550Z"
    },
    {
      "original": "Siversk general direction. Russian forces consolidate their positions and logistic routes near Soledar and behind the current front, Ukrainian drones aren't very active in their rear. The red square represents frequent Russian shelling over the past days of…",
      "timestamp": "2025-10-24T23:16:51.763553Z"
    },
    {
      "original": "The Russians also entered Zvanivka yesterday, which could be related to the heavy shelling in that area.",
      "timestamp": "2025-10-24T23:16:51.763556Z"
    },
    {
      "original": "In the Siversk direction, Russian forces resumed assault operations towards Siversk from the east, capturing new positions in the area of the reservoir.\nRussian forces advanced west from the village of Verkhnokamyanske to the next treeline over, recapturing previously lost positions there, and along the road to Siversk. They were also able to secure the entirety of the southern bank of the reservoir, capturing the trenches in the forests there. Additionally, Russian forces recaptured the trenches northwest of the reservoir, advancing slightly closer to eastern Siversk.\n+ ~2.54 km² in favour of Russia.",
      "timestamp": "2025-10-24T23:16:51.763561Z"
    },
    {
      "original": "The first Russian soldiers have entered the easternmost parts of Lyman. The battle for the city has begun.",
      "timestamp": "2025-10-24T23:16:51.763564Z"
    },
    {
      "original": "Russian forces have captured the city of Rodynske, northeastern flank of Pokrovsk, Donetsk Oblast.\nPre-war population: ~12,000.\nTotal land area: ~4.25 km².",
      "timestamp": "2025-10-24T23:16:51.763568Z"
    },
    {
      "original": "U.S. Bombers Flew Over Caribbean Again, Venezuela Deployed ‘Thousands’ Of Air Defenses\nUnited States Air Force bombers flew again over the Caribbean Sea as President Donald Trump renewed threats of land operations against drug cartels in Venezuela and President Nicolas Maduro announced the deployment of “thousands” of air defenses across the country.\nTensions have been on the rise between Venezuela and the U.S. since August, when the Trump administration doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges then deployed a naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nEarlier this month, a trio of U.S. Air Force’s B-52 bombers were tracked over the Caribbean close to Venezuela in an apparent show of force.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426067Z"
    },
    {
      "original": "U.S. Bombers Flew Over Caribbean Again, Venezuela Deployed ‘Thousands’ Of Air Defenses\nUnited States Air Force bombers flew again over the Caribbean Sea as President Donald Trump renewed threats of land operations against drug cartels in Venezuela and President Nicolas Maduro announced the deployment of “thousands” of air defenses across the country.\nTensions have been on the rise between Venezuela and the U.S. since August, when the Trump administration doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges then deployed a naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nEarlier this month, a trio of U.S. Air Force’s B-52 bombers were tracked over the Caribbean close to Venezuela in an apparent show of force.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426084Z"
    },
    {
      "original": "Russian Army Captures Town Near Seversk, Expands Control Along Kharkiv & Repels Attack \nOn October 24, the Russian military captured a key settlement near the city of Seversk in Donetsk, expanded its control along the border with Kharkiv, and repelled a Ukrainian counterattack close to the city of Kupyansk.\nIn Donetsk, the Yug [South] Group of Forces captured Dronivka, located right to the northwest of Seversk, according to the Russian Ministry of Defense. The attack on the settlement was led by the 7th Separate Guards Motor Rifle Brigade, which was congratulated by Defense Minister Andrey Belousov.\n“You have made a significant step towards Victory and achieving the goals of the special military operation. There is no doubt that new successes will follow,” MoD quoted Belousov as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426094Z"
    },
    {
      "original": "Russian Army Captures Town Near Seversk, Expands Control Along Kharkiv & Repels Attack \nOn October 24, the Russian military captured a key settlement near the city of Seversk in Donetsk, expanded its control along the border with Kharkiv, and repelled a Ukrainian counterattack close to the city of Kupyansk.\nIn Donetsk, the Yug [South] Group of Forces captured Dronivka, located right to the northwest of Seversk, according to the Russian Ministry of Defense. The attack on the settlement was led by the 7th Separate Guards Motor Rifle Brigade, which was congratulated by Defense Minister Andrey Belousov.\n“You have made a significant step towards Victory and achieving the goals of the special military operation. There is no doubt that new successes will follow,” MoD quoted Belousov as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426103Z"
    },
    {
      "original": "Russian Army Increases Pressure On Pokrovsk, Captures Another Town Along Yanchur River \nOn October 24, the Russian military increased pressure on Ukrainian troops in the city of Pokrovsk in Donetsk, capturing a nearby town, and made additional gains along the Yanchur River in Dnepropetrovsk.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Promin just a few kilometers to the southeast of Pokrovsk. This was the last urban center under the control of Kiev forces to the east of Myrnohrad. After capturing the settlement, Russian troops will likely expand operations within Myrnohrad, as well as to the south of Pokrovsk, mainly between Sukhyi Yar and Lysivka.\nUkrainian defenses in Pokrovsk itself appear to be collapsing. The Tsentr Group of Forces is reported to be in control of all areas to the south of the railroad that splits the city in half.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426112Z"
    },
    {
      "original": "Russian Army Increases Pressure On Pokrovsk, Captures Another Town Along Yanchur River \nOn October 24, the Russian military increased pressure on Ukrainian troops in the city of Pokrovsk in Donetsk, capturing a nearby town, and made additional gains along the Yanchur River in Dnepropetrovsk.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Promin just a few kilometers to the southeast of Pokrovsk. This was the last urban center under the control of Kiev forces to the east of Myrnohrad. After capturing the settlement, Russian troops will likely expand operations within Myrnohrad, as well as to the south of Pokrovsk, mainly between Sukhyi Yar and Lysivka.\nUkrainian defenses in Pokrovsk itself appear to be collapsing. The Tsentr Group of Forces is reported to be in control of all areas to the south of the railroad that splits the city in half.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426121Z"
    },
    {
      "original": "Russia Demonstrates Why It Would Be Best For US To Negotiate Another START\nOn October 22, President Vladimir Putin oversaw strategic nuclear forces drills, with official footage showing him controlling the situation from a special presidential room. He monitored the test launches of several types of strategic weapons, including ICBMs (intercontinental ballistic missiles), SLBMs (submarine-launched ballistic missiles) and ALCMs (air-launched cruise missiles). The Kremlin also released videos showing the tests from land, sea and air.\nThe drills were scheduled months ago, but many media outlets are claiming that Russia is sending a clear message with these exercises, especially now that US President Donald Trump called off the meeting with President Putin. Such interpretations might seem a bit far-fetched, but the truth is that it was certainly a mistake on Washington DC's part to cancel such an important meeting.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426129Z"
    },
    {
      "original": "Russia Tests AI-Aided Anti-Drone System With Rotary Guns \nRussia is testing a new anti-drone system based on twin GShG-7.62 machine guns with an artificial intelligence-powered aiming sight.\nVideo footage showing a successful live-fire test of the system, which took place somewhere in the Crimean Peninsula, surfaced online on October 23. During the test, the system took down a small fixed-wing drone flying at a low altitude within seconds.\nThe system is reportedly being developed by a Saint Petersburg-based company. It consists of two manually-controlled GShG-7.62 machine guns with an aiming sight built around a thermal imager and a radar with AI identification and tracking feature.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426137Z"
    },
    {
      "original": "Russia Tests AI-Aided Anti-Drone System With Rotary Guns \nRussia is testing a new anti-drone system based on twin GShG-7.62 machine guns with an artificial intelligence-powered aiming sight.\nVideo footage showing a successful live-fire test of the system, which took place somewhere in the Crimean Peninsula, surfaced online on October 23. During the test, the system took down a small fixed-wing drone flying at a low altitude within seconds.\nThe system is reportedly being developed by a Saint Petersburg-based company. It consists of two manually-controlled GShG-7.62 machine guns with an aiming sight built around a thermal imager and a radar with AI identification and tracking feature.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426149Z"
    },
    {
      "original": "Israel Kills Hezbollah’s Logistics Chief Amid Reports Of Near Large Attack On Lebanon\nThe Israeli Air Force killed Hezbollah’s south Lebanon logistics chief Abbas Hassan Karaki in a drone strike on October 24, amid reports of ongoing preparations by the Israeli Defense Forces (IDF) for a large attack against the country.\nKaraki was targeted in the southern town of Toul. Lebanon’s health ministry said the drone strike killed two people and wounded two others.\nIn a statement, the IDF said that Karaki was the head of logistics in Hezbollah’s so-called Southern Front, and held other senior roles in the group in recent years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426159Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426169Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426178Z"
    },
    {
      "original": "PERSISTENT PRESSURE: RUSSIAN FORCES MAKE INCREMENTAL GAINS ACROSS EASTERN FRONT",
      "timestamp": "2025-10-24T23:16:52.426182Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426190Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-24T23:16:52.426197Z"
    }
  ],
  "script_run_time": "2025-10-24T23:16:52.427016Z"
}