{
  "messages": [
    {
      "original": "🛵\n На півночі Херсонщини ворожі БпЛА в південно-західному напрямку.",
      "timestamp": "2025-09-12T20:27:52.802866Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-09-12T20:27:52.802888Z"
    },
    {
      "original": "🛵\n На півночі Херсонщини ворожі БпЛА \n➡️\n в південно-західному напрямку.\n🛵\n ударний БпЛА на Миколаївщині \n➡️\n курс на південний захід.",
      "timestamp": "2025-09-12T20:27:52.802898Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-09-12T20:27:52.802902Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину.",
      "timestamp": "2025-09-12T20:27:52.802907Z"
    },
    {
      "original": "🛸\n ворожі БпЛА з акваторії Чорного моря в напрямку Одещини.\n \n⚡\n Залучено засоби для збиття.",
      "timestamp": "2025-09-12T20:27:52.802914Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-12T20:27:52.802920Z"
    },
    {
      "original": "🛸\n ворожі БпЛА на Сумщині \n➡️\n курсом на Чернігівщину ( Ніжинський р-н)\n🛵\n ударний БпЛА на Миколаївщині \n➡️\n в південно-західному напрямку.",
      "timestamp": "2025-09-12T20:27:52.802928Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину.",
      "timestamp": "2025-09-12T20:27:52.802933Z"
    },
    {
      "original": "🛵\n ударний БпЛА на півночі Херсонщини \n➡️\n в південно-західному напрямку.",
      "timestamp": "2025-09-12T20:27:52.802940Z"
    },
    {
      "original": "🚀\n \n🚀\n Запорізька область - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-12T20:27:52.802945Z"
    },
    {
      "original": "Ворожі БпЛА на Чернігівщині \n➡️\n курсом на Київщину (Вишгородський р-н)",
      "timestamp": "2025-09-12T20:27:52.802950Z"
    },
    {
      "original": "Ворожі БпЛА на Чернігівщині (Ніжинський р-н) \n➡️\n курсом на південь.\nБпЛА на півночі Київщини \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-09-12T20:27:52.802960Z"
    },
    {
      "original": "🛵\n ударні БпЛА на півдні Харківщини \n➡️\n курсом на захід/ південь.\n🛵\n група ударних БпЛА на Херсонщині \n➡️\n курсом на Миколаївщину.\n🛵\n група ворожих БпЛА на Чернігівщині \n➡️\n курсом на північ.\n🛵\n ворожий БпЛА на Миколаївщині \n➡️\n в напрямку Одещини.",
      "timestamp": "2025-09-12T20:27:52.802975Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-09-12T20:27:52.802979Z"
    },
    {
      "original": "🚀\nШвидкісна ціль на Харківщині, курсом на  захід.",
      "timestamp": "2025-09-12T20:27:52.802983Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-09-12T20:27:52.802988Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-12T20:27:52.802992Z"
    },
    {
      "original": "🛵\n ударні БпЛА на півдні Харківщини \n➡️\n курсом на Дніпропетровщину.\n🛵\n група ударних БпЛА на Херсонщині \n➡️\n курсом на захід.\n🛵\n група ворожих БпЛА на Донеччині \n➡️\n курсом на північ.",
      "timestamp": "2025-09-12T20:27:52.803003Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину.",
      "timestamp": "2025-09-12T20:27:52.803010Z"
    },
    {
      "original": "🛵\n група ударних БпЛА на Харківщині \n➡️\n західним курсом.\n🛵\n група ворожих БпЛА в акваторії Чорного моря \n➡️\n курсом на Одещину.",
      "timestamp": "2025-09-12T20:27:52.803019Z"
    },
    {
      "original": "I've geolocated some of the footage from the Assassination of Charlie Kirk at Utah Valley University.\nBefore the shooting, the assassin was seen atop the roof of the Career Development Center at 40.278201, -111.7127806.\nAfter the shooting, the assassin was seen running from his position on that same rooftop. \nWhen factoring in where Charlie Kirk was sitting (~40.277531, -111.714015), the length of the shot comes out to approximately 128 metres.",
      "timestamp": "2025-09-12T20:27:53.356522Z"
    },
    {
      "original": "Ballistic missile launch from Yemen to southern Israel.",
      "timestamp": "2025-09-12T20:27:53.356536Z"
    },
    {
      "original": "Sirens in the Negev, southern Israel",
      "timestamp": "2025-09-12T20:27:53.356540Z"
    },
    {
      "original": "Sirens in the Negev, southern Israel",
      "timestamp": "2025-09-12T20:27:53.356543Z"
    },
    {
      "original": "Interceptor launch",
      "timestamp": "2025-09-12T20:27:53.356546Z"
    },
    {
      "original": "Interceptor launch",
      "timestamp": "2025-09-12T20:27:53.356549Z"
    },
    {
      "original": "The ballistic missile was intercepted.",
      "timestamp": "2025-09-12T20:27:53.356553Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches.",
      "timestamp": "2025-09-12T20:27:53.356556Z"
    },
    {
      "original": "MiG-31K airborne. Threat of Kinzhal launches.",
      "timestamp": "2025-09-12T20:27:53.356560Z"
    },
    {
      "original": "Carrying out a training mission in Tambov Oblast.",
      "timestamp": "2025-09-12T20:27:53.356563Z"
    },
    {
      "original": "Russian forces have captured the village of Sosnivka, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~206.\nTotal land area: ~1.00km²",
      "timestamp": "2025-09-12T20:27:53.356568Z"
    },
    {
      "original": "Russian forces have captured the village of Novomykolaivka, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~155.\nTotal land area: ~0.99 km².",
      "timestamp": "2025-09-12T20:27:53.356573Z"
    },
    {
      "original": "The IDF confirmed that four Israeli soldiers were killed in the ambush on an Israeli tank in Jabalia, Northern Gaza, yesterday.",
      "timestamp": "2025-09-12T20:27:53.356580Z"
    },
    {
      "original": "The Al-Qassam Brigades has published footage showing their attack on an Israeli tank on an Israeli Merkava tank in the centre of Jabalia City, northern Gaza. \nOne of the fighters emerges from a destroyed building and runs towards the tank, hurling an IED into the open commander's hatch, killing all four Israeli soldiers inside and destroying the tank. Notably, this event took place in a completely flattened part of Jabalia, confirming Hamas' continued presence in the area.",
      "timestamp": "2025-09-12T20:27:53.356585Z"
    },
    {
      "original": "I've geolocated some of the footage from the Assassination of Charlie Kirk at Utah Valley University.  Before the shooting, the assassin was seen atop the roof of the Career Development Center at 40.278201, -111.7127806.  After the shooting, the assassin was…",
      "timestamp": "2025-09-12T20:27:53.356588Z"
    },
    {
      "original": "Charlie Kirk Assassination Update:\nBy piecing together footage and aligning key moments from the videos, I made an approximate timeline of events from when the bullet was fired and have plotted it on a map. \nThe shooter began fleeing just 3 seconds after Charlie Kirk was hit. \nAfter running for approximately 90 metres, he was at the other end of the building ~39 seconds after Charlie was hit. \nHe then dropped down from the roof and ran an additional ~65 metres in approximately 46 seconds, before crossing Campus Drive 1 minute 25 seconds after Charlie was hit. It's currently unknown where he went from there.",
      "timestamp": "2025-09-12T20:27:53.356595Z"
    },
    {
      "original": "Charlie Kirk Assassination Update:  By piecing together footage and aligning key moments from the videos, I made an approximate timeline of events from when the bullet was fired and have plotted it on a map.   The shooter began fleeing just 3 seconds after…",
      "timestamp": "2025-09-12T20:27:53.356598Z"
    },
    {
      "original": "Some CCTV footage from a nearby house allowed me to extend the shooter's path, but I can't 100% guarantee the accuracy of this part. \nHopefully some more info will surface in the next 24 hours, so I can make a more definitive update.",
      "timestamp": "2025-09-12T20:27:53.356615Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to advance in the area of the Zaporizhzhia-Dnipropetrovsk regional border, and have captured the village of Novomykolaivka.\nRussian forces advanced from the treelines north of Obratne, reaching a tributary of the Yanchur River, and crossing over into the eastern houses of Novomykolaivka. They were able to capture the village relatively quickly, and expanded their zone of control to the treelines north and south of it. They also advanced from the village of Zaporizke and captured the treeline to the southwest. \n+ ~6.66 km² in favour of Russia.",
      "timestamp": "2025-09-12T20:27:53.356621Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to advance deeper into Dnipropetrovsk Oblast and have completed the capture of Sosnivka.\nAfter breaking through Ukrainian positions in the direction of Velykomykhailivka and repelling Ukrainian counterattacks, Russian forces resumed their assault operations in Sosnivka and established control over the northern part of the village which was previously in the grey zone. \nAdditionally, they advanced down a treeline northwest of the village and pushed down the gulley south of the village. \n+ ~1.90 km² in favour of Russia.",
      "timestamp": "2025-09-12T20:27:53.356626Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance and have captured new positions southeast of Pokrovsk.\nRussian forces advanced to the treeline running east of Novoukrainka, and established control over most of it. They also captured a section of the Lysivka - Novopavlivka Road, and entered the western outskirts of Lysivka from the forest. \n+ ~0.85 km² in favour of Russia.",
      "timestamp": "2025-09-12T20:27:53.356631Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces advanced, with Ukrainian forces continuing to recapture large areas northeast of Pokrovsk.\nUkrainian forces advanced in two areas. In the northeast, after Russian assault operations stalled, they advanced from the area of Sofiivka towards Poltavka and Rusyn Yar, recapturing positions in several different treelines and along two gulleys. \nTo the southwest, Ukrainian forces advanced south and southeast from Volodymyrivka, capturing positions in three different treelines, and entering the northern houses of Novotoretske. Additionally, fighting continues for Pankivka, where the whole village is in the grey zone. \nMeanwhile, Russian forces continued to expand the western flank of their salient to Kucheriv Yar, and re-entered the village of Nove Shakhove, capturing positions in its eastern houses. Ukrainian forces continued attempts to enter Kucheriv Yar from the north. \n+ ~13.39 km² in favour of Ukraine.\n+ ~1.52 km² in favour of Russia.",
      "timestamp": "2025-09-12T20:27:53.356638Z"
    },
    {
      "original": "Deepstate's latest update shows that Russian advances in Dnipropetrovsk Oblast (Pokrovske direction) are not slowing.",
      "timestamp": "2025-09-12T20:27:53.356641Z"
    },
    {
      "original": "Are we really going to continue to use maps showing fake advances? Ukraine failed to cut off the Russians in their salient to Kucheriv Yar and refocused further east after recapturing Volodomyrivka. \nRussia still holds Doroznje, while this map shows it 5 km behind the front line. This map is from someone called \"Shalin\", and the claims are based off Deepstate, old footage, and dubious claims that have been proven false time and time again. \nAlso, I love how they still have it marked as Russia being encircled east of Kucheriv Yar after almost an entire month lmao.",
      "timestamp": "2025-09-12T20:27:53.356648Z"
    },
    {
      "original": "Are we really going to continue to use maps showing fake advances? Ukraine failed to cut off the Russians in their salient to Kucheriv Yar and refocused further east after recapturing Volodomyrivka.   Russia still holds Doroznje, while this map shows it 5…",
      "timestamp": "2025-09-12T20:27:53.356652Z"
    },
    {
      "original": "The comments....",
      "timestamp": "2025-09-12T20:27:53.356657Z"
    },
    {
      "original": "Footage showing two Russian Kh-38ML missile strikes on a Ukrainian crossing over the Oskil River near the village of Osynovo, Kupyansk direction.\nCoordinates: 49.64260, 37.63548",
      "timestamp": "2025-09-12T20:27:53.356661Z"
    }
  ],
  "script_run_time": "2025-09-12T20:27:53.790123Z"
}