{
  "messages": [
    {
      "original": "🚀\nПовторні пуски КАБ на Сумщину.",
      "timestamp": "2025-12-29T23:49:55.953532Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку обл.",
      "timestamp": "2025-12-29T23:49:55.953547Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину (Куп'янський, Ізюмський р-ни).",
      "timestamp": "2025-12-29T23:49:55.953552Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку обл.",
      "timestamp": "2025-12-29T23:49:55.953556Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград",
      "timestamp": "2025-12-29T23:49:55.953560Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини",
      "timestamp": "2025-12-29T23:49:55.953564Z"
    },
    {
      "original": "🛵\n БпЛА з півдня курсом на Запоріжжя.",
      "timestamp": "2025-12-29T23:49:55.953569Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини курсом на Харків.",
      "timestamp": "2025-12-29T23:49:55.953573Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА на півночі Сумщини",
      "timestamp": "2025-12-29T23:49:55.953577Z"
    },
    {
      "original": "🚀\n🚀\nДонецька, Дніпропетровська обл. - загроза застосування авіаційних засобів ураження",
      "timestamp": "2025-12-29T23:49:55.953582Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА на межі Херсонської та Дніпропетровської областей - курс на північний захід",
      "timestamp": "2025-12-29T23:49:55.953586Z"
    },
    {
      "original": "🛵\n Близько десяти ударних БпЛА продовжують рух на північний захід південніше Кривого Рогу",
      "timestamp": "2025-12-29T23:49:55.953590Z"
    },
    {
      "original": "🛵\n Група ударних БпЛА на півдні Кіровоградської обл.",
      "timestamp": "2025-12-29T23:49:55.953598Z"
    },
    {
      "original": "🛵\n Група ударних БпЛА на півночі та сході Миколаївщини",
      "timestamp": "2025-12-29T23:49:55.953602Z"
    },
    {
      "original": "🚀\n🚀\nСумщина - загроза застосування авіаційних засобів ураження",
      "timestamp": "2025-12-29T23:49:55.953607Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину та Донеччину",
      "timestamp": "2025-12-29T23:49:55.953612Z"
    },
    {
      "original": "🛵\n Група ударних БпЛА на півночі Одещини",
      "timestamp": "2025-12-29T23:49:55.953616Z"
    },
    {
      "original": "🚀\nХарківська обл. - пуски КАБ",
      "timestamp": "2025-12-29T23:49:55.953620Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на околицях м. Запоріжжя з південного напрямку",
      "timestamp": "2025-12-29T23:49:55.953623Z"
    },
    {
      "original": "🛵\n Одеська обл. - ворожий БпЛА у напрямку обласного центру з півночі!",
      "timestamp": "2025-12-29T23:49:55.953628Z"
    },
    {
      "original": "As usual, I won't comment on the Zelensky-Trump meeting. It's all theatre, there will be no peace deal. \nI continue to assess that none of the sides are prepared to negotiate in good faith, even if they say otherwise publicly. \nStop falling for the same tricks over and over again!",
      "timestamp": "2025-12-29T23:49:56.657533Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing FP-2 drone strikes on Russian rear targets.\nStrikes were carried on a Geran-2 storage facility near the city of Makiivka, Donetsk Oblast, and a repair unit for the Russian 1435th Motor Rifle Regiment near Antratsyt, Luhansk Oblast.",
      "timestamp": "2025-12-29T23:49:56.657550Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.\nThis attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles, Iskander-K cruise missiles, Kinzhal hypersonic aeroballistic missiles, and possibly Kalibr cruise missiles. There is still a possibility of strategic aviation being used, however.\nCurrently, it is known that at least two MiG-31K fighters are equipped with Kinzhals at Savasleika Airbase, Nizhny Novgorod Oblast. Additionally, Iskander-M and possibly Iskander-K cruise missiles have been delivered to OTRK installations in Taganrog (Rostov Oblast), Khalino Airbase (Kursk Oblast), and other areas recently. \nAnd, of course, an unprecedented accumulation of Geran-2 and Gerbera drones remains at the launch points surrounding Ukraine.",
      "timestamp": "2025-12-29T23:49:56.657557Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-29T23:49:56.657561Z"
    },
    {
      "original": "I feel like I should provide some context regarding my extensive coverage of Russian missile attacks, as it's always been one of the main focal points for my account.\nOver the last 2 years, I've spent over 1,000 hours covering more than 100 Russian missile and drone attacks on Ukraine live. To my knowledge, I was the first ever OSINTer in the world to provide real-time updates of missile trajectories with maps. But these attacks are only a small part of this war, so why spend so much time and effort covering it?\nFor me, when I first started covering these attacks, I had less than 50 followers on Twitter. Doing something like this brought attention to my account as no one had seen it in public spaces before. As my reporting got significant more accurate, more and more people tuned into my live updates. This provided me with a lot of motivation to continue covering these attacks, allowing for me to get even more precise and reliable. \nThis motivation, combined with me finding a lot of interest in these attacks and learning about so much stuff, meant I just never stopped, despite it being such a small portion of this war's events. \nMore recently, I have frequently been messaged by Ukrainians and people visiting Ukraine thanking me for my coverage as it provided them with knowledge of whether it is safe or not in their respective cities. The Ukrainian Airforce is notoriously slow on updating threats and air raid alerts, which is why far less people use official outlets for this anymore. \nSo, a combination of these factors means that I don't intend on stopping any time soon, even if it restricts my ability to cover other areas of the war such as political developments. Obviously, real-life factors for me can reduce my ability to cover attacks, but I hope to continue as it's good for my account and good for those watching it. \nA big thanks to those behind the scenes who help make this possible. You all know who you are.",
      "timestamp": "2025-12-29T23:49:56.657569Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-29T23:49:56.657573Z"
    },
    {
      "original": "3 Tu-22m3 strategic bombers have redeployed from Shaykovka Airbase, Kaluga Oblast, to Engels-2 Airbase, Saratov Oblast. Earlier, an IL-76MD cargo plane landed at Engels-2 Airbase, transporting Kh-32 cruise missiles for the Tu-22m3 bombers. \nEngels-2 was the airbase which the Tu-22m3 bombers departed from during the most recent large-scale attack. Therefore, there is a significantly increased threat to Odesa Oblast for the next 36 hours.",
      "timestamp": "2025-12-29T23:49:56.657577Z"
    },
    {
      "original": "3 Tu-22m3 strategic bombers have redeployed from Shaykovka Airbase, Kaluga Oblast, to Engels-2 Airbase, Saratov Oblast. Earlier, an IL-76MD cargo plane landed at Engels-2 Airbase, transporting Kh-32 cruise missiles for the Tu-22m3 bombers.   Engels-2 was the…",
      "timestamp": "2025-12-29T23:49:56.657581Z"
    },
    {
      "original": "Correction: at least one of the Tu-22m3 strategic bombers did not land at Engels-2 Airbase and flew further southwest into Volgograd Oblast.\nIt is currently flying past Volgograd in the direction of Novorossiysk, Krasnodar Krai, and the waters of the Black Sea.",
      "timestamp": "2025-12-29T23:49:56.657584Z"
    },
    {
      "original": "Last night, Ukraine apparently attempted to strike Moscow with Ukrainian-made Grom-2 ballistic missiles. \nRussian sources report that both missiles were shot down by air defence over Tula Oblast. They stated that missile dangers were declared in a number of regions after the missiles were shot down due to the speed at which they were flying, and apparently due to very late detections.",
      "timestamp": "2025-12-29T23:49:56.657588Z"
    },
    {
      "original": "Correction: at least one of the Tu-22m3 strategic bombers did not land at Engels-2 Airbase and flew further southwest into Volgograd Oblast.  It is currently flying past Volgograd in the direction of Novorossiysk, Krasnodar Krai, and the waters of the Black…",
      "timestamp": "2025-12-29T23:49:56.657592Z"
    },
    {
      "original": "The Tu-22m3 appears to be carrying out a training mission in the eastern Black Sea,",
      "timestamp": "2025-12-29T23:49:56.657595Z"
    },
    {
      "original": "New footage shows Russian drones carrying out deep strikes on Ukrainian targets.\nThe video shows the following being hit:\n- P-19 radar\n- 19Zh6 radar\n- 79K6 Pelican radar\n- Zoopark-3 radar\n- P-18 radar\n- An-26 cargo plane\n- Mi-24 helicopter (apparently a decoy)\n- 2 dry cargo ships",
      "timestamp": "2025-12-29T23:49:56.657603Z"
    },
    {
      "original": "I personally don't believe there was any drone attack attempts on Putin's presidential palace.\nThe Russian MOD claims that they shot down 91 (!) UAVs in Novgorod Oblast flying towards the presidential palace in the region. Not a single Russian monitoring channel reported on any UAV detections in the region during the day, despite their coverage reflecting Russian MOD interception statistics on other regions. \nTo me, this seems like an attempt at further portraying Ukraine as unwilling to negotiate while not having to carry out any false flag themselves. This kind of activity should be expected from both sides, so as usual, don't believe everything you see at face value.",
      "timestamp": "2025-12-29T23:49:56.657607Z"
    },
    {
      "original": "I personally don't believe there was any drone attack attempts on Putin's presidential palace.  The Russian MOD claims that they shot down 91 (!) UAVs in Novgorod Oblast flying towards the presidential palace in the region. Not a single Russian monitoring…",
      "timestamp": "2025-12-29T23:49:56.657610Z"
    },
    {
      "original": "Those who blindly trust the Russian MOD are as dumb and naive as NAFOids trusting everything that comes from the Ukrainian general staff.",
      "timestamp": "2025-12-29T23:49:56.657613Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-29T23:49:56.657618Z"
    },
    {
      "original": "No large attack tonight.\nThe highest threat is in place for tomorrow, meaning the probability of strategic bombers being used has increased.\nNothing is definite at the moment as some unusual Russian movements have taken place.",
      "timestamp": "2025-12-29T23:49:56.657622Z"
    },
    {
      "original": "No large attack tonight.  The highest threat is in place for tomorrow, meaning the probability of strategic bombers being used has increased.  Nothing is definite at the moment as some unusual Russian movements have taken place.",
      "timestamp": "2025-12-29T23:49:56.657625Z"
    },
    {
      "original": "It could also be on new years. It's just too difficult to tell right now. I will update you all when I get more concrete information.",
      "timestamp": "2025-12-29T23:49:56.657628Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to advance and have made new progress in two different areas.\nIn the west, Russian forces continued to advance north through Prymorske. They were able to consolidate in new positions in the southern part of the village, including in a number of three-story buildings. DRGs continued to operate further north in the area of the village centre, and reached its northern streets, while others infiltrated further east through the Pererva Gulley\nIn the east, Russian forces continued to expand their zone of control northeast of Stepnohirsk, capturing new positions in the treelines west of the gulley leading from Stepnohirsk. Other forces infiltrated further into Lukyanivske, and are engaged in fighting for the residential part of the village. Fighting also continues for the central and northern parts of Stepnohirsk, where a grey-zone remains.\n+ ~4.26 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T23:49:56.657634Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance following the fall of Hulyaipole and have made new progress south of the city.\nUkrainian forces have completed their withdrawal from the 2022-era fortifications east of the highway due to the risk of encirclement from the recent Russian advances in Hulyaipole. This allowed for the Russians to capture the remaining stretch of highway between Hulyaipole and Dorozhynyanka. Other assault groups advanced further southwest down the nearby gulley, capturing additional treeline positions.\n+ ~2.31 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T23:49:56.657640Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced in various different areas.\nIn the southwest, the frontline was corrected in favour of Ukraine after they carried out additional counterattacks around two weeks ago. They advanced east from the area of the pig farms, recapturing the rest of the road the Hryshyne, and consolidating in the treeline to the north. From there, they recaptured the forested areas on either side of the highway, including the intersection northwest of Svitle.\nTo the northeast, Russian forces continued their assault operations in Rodynske. They were able to recapture School No. 35 and some of the nearby 3-story buildings and are now assaulting Ukrainian positions in the remaining buildings to the west. Fighting continues for the northern low-rise residential area, where small assault groups from both sides are currently operating, and in the southwestern streets of the city.\nIn the northeast, Russian forces continued pushing the Ukrainians back from the rear of Rodynske. They advanced from their newly recaptured positions at the  Krasnolymanskaya Mine, consolidating in the nearby treeline and forested areas. Small groups of infantry are now attempting to advance across the fields and reach the railway line. Additionally, the Russians managed to advance further north up the forests northeast of the mine, recapturing the mine shaft and the surrounding areas following a Ukrainian withdrawal back to the village of Sukhetske. \n+ ~3.71 km² in favour of Ukraine.\n+ ~3.12 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T23:49:56.657649Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance, capturing new positions in two differenat areas southwest of Siversk,\nIn the north, Russian forces continued to advance in the village of Riznykivka. They pushed further west down the southern bank of the Sukha River, capturing new positions in the direction of the central part of the village.\nIn the south, Russian forces captured the rest of a treeline and an adjacent forest west of Zvanivka, thereby fully aligning the front with the gulley stretching southwest from Riznykivka.\n+ ~1.69 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T23:49:56.657656Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance southeast of Lyman and have made new progress in the village of Dibrova.\nRussian forces resumed their assault operations from northern Dibrova and captured new positions in the nearby forests. From there, they entered the western streets of the main part of the village, capturing new positions there too. Other forces advanced west from the eastern streets, securing the central part. Fighting is ongoing for the southwestern streets. \n+ ~0.75 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T23:49:56.657662Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.\n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.\n📝\nRussian authorities claim 91 drones were intercepted on their way to the state residence.",
      "timestamp": "2025-12-29T23:49:56.657672Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡️\n — Residents near Putin's Valdai residence told SOTA that they heard no air defense activity overnight.  \n➡️\n They noted that the heavily secured airspace surrounding the residence would make it almost impossible for drones to approach the area.  \n📝\nRussian…",
      "timestamp": "2025-12-29T23:49:56.657680Z"
    },
    {
      "original": "Shocker",
      "timestamp": "2025-12-29T23:49:56.657683Z"
    },
    {
      "original": "Military Situation In Ukraine On December 29, 2025 (Maps Update)",
      "timestamp": "2025-12-29T23:49:57.372972Z"
    },
    {
      "original": "Military Situation In Ukraine On December 29, 2025 (Maps Update)",
      "timestamp": "2025-12-29T23:49:57.372983Z"
    },
    {
      "original": "Exchange of Strikes: Kyiv Attacks Russian President's Residence, Moscow Prepares Retaliation\nRussian-Ukrainian exchanges of strikes in late December were accompanied by significant diplomatic statements. Russian Foreign Minister Sergey Lavrov stated that on the night of December 28-29, the \"Kyiv regime\" carried out a \"terrorist attack\" on a Russian presidential state residence in the Novgorod region using 91 strike unmanned aerial vehicles.\nHe claimed that all drones were destroyed and emphasized that the incident occurred during intense Russian-American negotiations on settling the Ukrainian conflict. Lavrov stated that the \"reckless actions\" would not go unanswered, with targets and timing for retaliatory strikes already determined, and that Russia's negotiating position would be revised due to the \"Kyiv regime's shift to a policy of state terrorism.\"\nUkrainian President Volodymyr Zelenskyy called the statement about the attack on the residence “another lie”...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T23:49:57.372993Z"
    },
    {
      "original": "Exchange of Strikes: Kyiv Attacks Russian President's Residence, Moscow Prepares Retaliation\nRussian-Ukrainian exchanges of strikes in late December were accompanied by significant diplomatic statements. Russian Foreign Minister Sergey Lavrov stated that on the night of December 28-29, the \"Kyiv regime\" carried out a \"terrorist attack\" on a Russian presidential state residence in the Novgorod region using 91 strike unmanned aerial vehicles.\nHe claimed that all drones were destroyed and emphasized that the incident occurred during intense Russian-American negotiations on settling the Ukrainian conflict. Lavrov stated that the \"reckless actions\" would not go unanswered, with targets and timing for retaliatory strikes already determined, and that Russia's negotiating position would be revised due to the \"Kyiv regime's shift to a policy of state terrorism.\"\nUkrainian President Volodymyr Zelenskyy called the statement about the attack on the residence “another lie”...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373002Z"
    },
    {
      "original": "Military Situation In Syria On December 29, 2025 (Map Update)",
      "timestamp": "2025-12-29T23:49:57.373005Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373013Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373022Z"
    },
    {
      "original": "'Fog Of War': Russian Army Advances In Lyman As Ukraine Takes More Losses \nIn the Lyman sector, Russian units captured several strongpoints around Hrekivka and took control of a small forested area. \nAdvances were also noted along the tree lines on the approaches to Korovyi Yar. In the Pokrovsk sector, the left flank of the group is advancing towards Dobropillia in the Hrishyne area and on the approaches to Serhiivka. In the Slaviansk sector, units advanced up to four kilometers in the Zakotne area, capturing territory north of the Siverskyi Donets River and the eastern part of the settlement. They simultaneously repelled mechanized counterattacks in the Sviato-Pokrovske area. \nFormer Polish Minister of Foreign Affairs Jacek Czaputowicz believes that Russian President Vladimir Putin will ultimately win the Ukrainian conflict.\nRead more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373029Z"
    },
    {
      "original": "'Fog Of War': Russian Army Advances In Lyman As Ukraine Takes More Losses \nIn the Lyman sector, Russian units captured several strongpoints around Hrekivka and took control of a small forested area. \nAdvances were also noted along the tree lines on the approaches to Korovyi Yar. In the Pokrovsk sector, the left flank of the group is advancing towards Dobropillia in the Hrishyne area and on the approaches to Serhiivka. In the Slaviansk sector, units advanced up to four kilometers in the Zakotne area, capturing territory north of the Siverskyi Donets River and the eastern part of the settlement. They simultaneously repelled mechanized counterattacks in the Sviato-Pokrovske area. \nFormer Polish Minister of Foreign Affairs Jacek Czaputowicz believes that Russian President Vladimir Putin will ultimately win the Ukrainian conflict.\nRead more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373037Z"
    },
    {
      "original": "No Retreat Order, No Evacuation: How The Ukrainian Command Abandoned Its Soldiers In Myrnohrad\nThe other day, Russian armed forces announced the complete establishment of control over the city of Myrnohrad on the Pokrovsk direction. Under conditions of complete encirclement, the remnants of Ukrainian subunits, having not received evacuation from their command, made contact with Russian forces and surrendered in an organized manner. Testimonies from a number of detained Armed Forces of Ukraine (AFU) servicemen paint a picture of heavy losses, logistical collapse, and a loss of control in this sector of the front.\nThus, soldiers from various AFU brigades—including Roman Prystupa, Valeriy Yasinsky, Hennadiy Antonenko, Ivan Kucera, and Mykhailo Hamarnyk—stated in joint testimony:\n\"We were in Myrnohrad. Constant shelling. In general, everything is fucked. We had heavy losses. We had to pull back to the city center. We all sat together from different units in one common basement of a house.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373049Z"
    },
    {
      "original": "No Retreat Order, No Evacuation: How The Ukrainian Command Abandoned Its Soldiers In Myrnohrad\nThe other day, Russian armed forces announced the complete establishment of control over the city of Myrnohrad on the Pokrovsk direction. Under conditions of complete encirclement, the remnants of Ukrainian subunits, having not received evacuation from their command, made contact with Russian forces and surrendered in an organized manner. Testimonies from a number of detained Armed Forces of Ukraine (AFU) servicemen paint a picture of heavy losses, logistical collapse, and a loss of control in this sector of the front.\nThus, soldiers from various AFU brigades—including Roman Prystupa, Valeriy Yasinsky, Hennadiy Antonenko, Ivan Kucera, and Mykhailo Hamarnyk—stated in joint testimony:\n\"We were in Myrnohrad. Constant shelling. In general, everything is fucked. We had heavy losses. We had to pull back to the city center. We all sat together from different units in one common basement of a house.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T23:49:57.373057Z"
    }
  ],
  "script_run_time": "2025-12-29T23:49:57.373738Z"
}