{
  "messages": [
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на східному напрямку!",
      "timestamp": "2025-10-23T15:13:07.430609Z"
    },
    {
      "original": "🛵\n БпЛА на схід від Сум, курсом на південь.",
      "timestamp": "2025-10-23T15:13:07.430625Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n в західному напрямку та на місто Павлоград.",
      "timestamp": "2025-10-23T15:13:07.430632Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-23T15:13:07.430636Z"
    },
    {
      "original": "🛵\n Група БпЛА на межі Сумщини та Чернігівщини курсом на південь.\n🛵\n БпЛА курсом на Суми.\n🛵\n БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-23T15:13:07.430644Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-10-23T15:13:07.430648Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Борзну та Сновськ.\n🛵\n БпЛА на Донеччині курсом на Олександрівку.",
      "timestamp": "2025-10-23T15:13:07.430653Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі східного напрямку!",
      "timestamp": "2025-10-23T15:13:07.430658Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-23T15:13:07.430662Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-10-23T15:13:07.430666Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини у південно-західному напрямку.\n🛵\n БпЛА з Сумщини на Чернігівщину.\n🛵\n БпЛА з Дніпропетровщини на Донеччину.",
      "timestamp": "2025-10-23T15:13:07.430673Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-10-23T15:13:07.430678Z"
    },
    {
      "original": "🛵\n Павлоград - БпЛА з півдня у напрямку міста!",
      "timestamp": "2025-10-23T15:13:07.430683Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-23T15:13:07.430690Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі.",
      "timestamp": "2025-10-23T15:13:07.430695Z"
    },
    {
      "original": "🛵\n група БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.",
      "timestamp": "2025-10-23T15:13:07.430700Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на сході Харківщини, поблизу н.п.Балаклія \n➡️\n курсом на захід.",
      "timestamp": "2025-10-23T15:13:07.430706Z"
    },
    {
      "original": "🛵\n  БпЛА на заході Харківщини, на північ від н.п. Берестин \n➡️\n курсом на захід, на Полтавщину.",
      "timestamp": "2025-10-23T15:13:07.430712Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південно-східному напрямку!",
      "timestamp": "2025-10-23T15:13:07.430716Z"
    },
    {
      "original": "🛵\n  БпЛА на північ від Харкова, курсом на схід.",
      "timestamp": "2025-10-23T15:13:07.430720Z"
    },
    {
      "original": "Cruise missiles (likely Iskander-K) entered Sumy Oblast, flying to Konotop on a western course.",
      "timestamp": "2025-10-23T15:13:08.123438Z"
    },
    {
      "original": "Cruise missiles (likely Iskander-K) entered Sumy Oblast, flying to Konotop on a western course.",
      "timestamp": "2025-10-23T15:13:08.123449Z"
    },
    {
      "original": "The missile(s) disappeared southeast of Konotop, Sumy Oblast. Multiple Geran-2 drones are now flying in that area. No explosions were reported.",
      "timestamp": "2025-10-23T15:13:08.123452Z"
    },
    {
      "original": "There are still no missiles detected. Multiple more Gerans have entered Ukrainian airspace at this same area. If they disappear in the same area as the missile(s) did, then it will become clear what happened.",
      "timestamp": "2025-10-23T15:13:08.123455Z"
    },
    {
      "original": "Russian forces have captured the village of Kozatske, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~190.\nTotal land area: ~0.88 km².",
      "timestamp": "2025-10-23T15:13:08.123460Z"
    },
    {
      "original": "There are still no missiles detected. Multiple more Gerans have entered Ukrainian airspace at this same area. If they disappear in the same area as the missile(s) did, then it will become clear what happened.",
      "timestamp": "2025-10-23T15:13:08.123463Z"
    },
    {
      "original": "The drones flew further west towards Chernihiv Oblast, away from where the missile(s) disappeared. Which is weird, because there was a cruise missile threat issued by the Ukrainian Airforce, and a target similar to that of a cruise missile was detected for a little under a minute.",
      "timestamp": "2025-10-23T15:13:08.123466Z"
    },
    {
      "original": "The Kamianske Hydroelectric Power Plant in Dnipropetrovsk Oblast came under attack for the second day in a row. As many as 9 Russian Geran-2 drones impacted it at different points, resulting in large fires breaking out.   Note: the claims on Russian channels…",
      "timestamp": "2025-10-23T15:13:08.123470Z"
    },
    {
      "original": "The city of Kamianske is now entirely without power following today's and yesterday's attacks on the Hydroelectric Power Plant.",
      "timestamp": "2025-10-23T15:13:08.123476Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:\nThe Tu-95MS strategic bombers stationed at Ukrainka Airbase, Amur Oblast have been carrying out long-range training alongside 3 IL-78 tankers in the area of the Kuril Islands of the Pacific Ocean as a part of Russia's ongoing nuclear exercises. 4-6 of them are equipped with Kh-101 cruise missiles.\n1 Tu-95MS redeployed from Olenya Airbase, Murmansk Oblast, to Engels-2 Airbase, Saratov Oblast, to be equipped with missiles. Now there are 2 Tu-95MS at Engels-2, and none at Olenya. \nAt least 3 Kalibr carriers stationed at Novorossiysk Naval Base, Krasnodar Krai are equipped with Kalibr cruise missiles, including one 11356R “Admiral Makarov” frigate, one 11356R “Admiral Essen” Frigate, and one Buyan-M corvette. \nNo new deliveries of Iskander-M ballistic or Iskander-K cruise missiles to OTRK installations surrounding Ukraine have taken place over the past three days, however there are still missiles there which are available for launch, meaning that individual strikes on newly discovered targets are likely over the next 48 hours.\n1 An-26 cargo plane landed at Shaykovka Airbase, Kaluga Oblast. The cargo consists of Kh-22 cruise missiles for the 7 Tu-22m3 strategic bombers currently stationed there. Some of these bombers may take part in the next large strike.\n2 Tu-22m3 bombers remain stationed at Olenya Airbase. They carried out a training mission as a part of Russia's nuclear exercises. Both bombers are equipped with missiles and carried out simulated launches (likely with electronic warfare) from over the Barents Sea yesterday. \nAccumulation of Geran-2/Gebera drones continues at other launch points in preparation for their usage both in the next large-scale attack, and smaller attacks prior to that. \n5 Tu-95MS remain stationed at Diaghilev Airbase, Ryazan Oblast. They are not expected to take part in the next large-scale attack. \n3 Tu-160s are stationed at Engels-2 Airbase, Saratov Oblast. At least 1 is equipped with Kh-101 cruise missiles. 4 other Tu-160s are stationed at Ukrainka Airbase, but their status is currently unknown. \nSu-34R and Su-24MR aircraft continue to carry out intensified reconnaissance operations, especially over Rostov Oblast and Krasnodar Krai. \nNo A-50U AWACS aircraft flights were recorded yesterday or today, despite their recent flight activity from Ulyanovsk-East Airbase. \n5 MiG-31Ks redeployed from Savasleika Airbase, Nizhny Novgorod Oblast, to Akhtubinsk Airbase, Astrakhan Oblast. It is from there that they launched Kinzhal hypersonic aeroballistic missiles during yesterday's missile attack. 6 MiG-31Ks are currently stationed at Akhtubinsk, while none are at Savasleika. Most likely, none of them are currently equipped with missiles.",
      "timestamp": "2025-10-23T15:13:08.123489Z"
    },
    {
      "original": "Russian forces have captured the village of Pavlivka, Hulyaipole direction, Zaporizhzhia Oblast. \nPre-war population: ~45.\nTotal land area: ~0.27 km².",
      "timestamp": "2025-10-23T15:13:08.123493Z"
    },
    {
      "original": "Near Oleksandro-Kalynove first snow fell recently, but didn’t last long. Today, too, it snowed a bit there.\nFurther east near Toretsk-Kostyantynivka area, still nothing, but temperatures go in the negatives often.",
      "timestamp": "2025-10-23T15:13:08.123498Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇷🇺\nUkrainian President Zelenskyy, at the European Council Summit, reaffirmed that territorial concessions are not on the table for negotiation. \n@wfwitness",
      "timestamp": "2025-10-23T15:13:08.123505Z"
    },
    {
      "original": "Last night, several Ukrainian UAVs attacked the Ryazan Oil Refinery in Ryazan Oblast. \nAt least two impacts were recorded, including 1 in the area of the hydrotreating unit and another the AVT-2 primary oil processing unit. Some sources reported that \"Peklo\" jet drones were used, which is possibly considering their recorded presence in the region during the night.\nRyazan Oil Refinery has previously had to operate at lower refining capacities due to Ukrainian drone strikes, with the most recent reductions taking place in August 2025. We will likely see additional reductions following today's strikes.\nHydrotreating coordinates: 54.572119, 39.741530\nAVT-2 coordinates: 54.5628, 39.73749",
      "timestamp": "2025-10-23T15:13:08.123513Z"
    },
    {
      "original": "Last night, several Ukrainian UAVs attacked the Ryazan Oil Refinery in Ryazan Oblast. \nAt least two impacts were recorded, including 1 in the area of the hydrotreating unit and another the AVT-2 primary oil processing unit. Some sources reported that \"Peklo\" jet drones were used, which is possibly considering their recorded presence in the region during the night.\nRyazan Oil Refinery has previously had to operate at lower refining capacities due to Ukrainian drone strikes, with the most recent reductions taking place in August 2025. We will likely see additional reductions following today's strikes.\nHydrotreating coordinates: 54.572119, 39.741530\nAVT-2 coordinates: 54.5628, 39.73749",
      "timestamp": "2025-10-23T15:13:08.123521Z"
    },
    {
      "original": "Last night, Ukrainian UAVs struck the 500 kV Arzamasskaya Electrical Substation in the village of Lesnogorsk, Nizhny Novgorod Oblast. \nThe substation is one of the main suppliers of energy in Nizhny Novgorod Oblast. It is used by key railway routes as well as Russia's energy corporation Gazprom. \nCoordinates: 55.09529, 43.93902",
      "timestamp": "2025-10-23T15:13:08.123525Z"
    },
    {
      "original": "Footage showing Russian Geran-2 drone strikes on a 330 kV electrical substation in the city of Konotop, Sumy Oblast. \nMedia 1 shows the strikes from a reconnaissance drone, while media 2 shows one of the strikes from the ground. At least 6 Gerans impacted the substation, resulting in a large fire breaking out and widespread power outages. \nCoordinates: 51.19231, 33.16702",
      "timestamp": "2025-10-23T15:13:08.123529Z"
    },
    {
      "original": "Footage showing Russian Geran-2 drone strikes on a 330 kV electrical substation in the city of Konotop, Sumy Oblast. \nMedia 1 shows the strikes from a reconnaissance drone, while media 2 shows one of the strikes from the ground. At least 6 Gerans impacted the substation, resulting in a large fire breaking out and widespread power outages. \nCoordinates: 51.19231, 33.16702",
      "timestamp": "2025-10-23T15:13:08.123534Z"
    },
    {
      "original": "Russian Su-34/35s are trying to shoot down Ukrainian F-16s northwest of Sumy.",
      "timestamp": "2025-10-23T15:13:08.123537Z"
    },
    {
      "original": "Russian Su-34/35s are trying to shoot down Ukrainian F-16s northwest of Sumy.",
      "timestamp": "2025-10-23T15:13:08.123540Z"
    },
    {
      "original": "An explosion was heard in Sumy.",
      "timestamp": "2025-10-23T15:13:08.123543Z"
    },
    {
      "original": "From what I've gathered, a Russian Su-35 launched an R-37M air-to-air missile from over Kursk Oblast. It was acting as an escort for Su-34s launching KAB glide-bombs at Krasnopillya, Sumy Oblast, but remained in the area after the Su-34s left.",
      "timestamp": "2025-10-23T15:13:08.123546Z"
    },
    {
      "original": "One F-16 flew back over Sumy on a southwestern course a few minutes ago.",
      "timestamp": "2025-10-23T15:13:08.123549Z"
    },
    {
      "original": "The F-16(s) were going to launch glide-bombs at Sudzha District, Kursk Oblast, but have been forced to abandon the combat mission.",
      "timestamp": "2025-10-23T15:13:08.123551Z"
    },
    {
      "original": "Why Russia Targets the Left Bank of the Dnipro: A Review of Russian-Ukrainian Strikes\nOctober 21-22: Ukraine and Russia continued intensive mutual strikes, accompanied by massive missile and drone attacks. \nNumerous Russian strikes targeted energy facilities, including:\n▪️\nCHPP-4, CHPP-5, and CHPP-6 in Kyiv.\n▪️\nThe Kamenska HPP in Dnipropetrovsk region.\n▪️\nThe Kremenchug HPP in Poltava region.\n▪️\nThe DniproHES in Zaporizhzhia region.\n▪️\nSubstations in Chernihiv and Sumy regions.\nAccording to Telegraf, Russia is employing a new tactic aimed at completely disabling the energy system on the left bank of the Dnipro. This is creating an imbalance in power supply between western and eastern Ukraine: a critical electricity shortage is emerging in the east due to the destruction of thermal and hydroelectric plants, while a surplus of energy is present in the west, where nuclear power plants operate. This surplus cannot be effectively transferred eastward due to limited grid capacity.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845493Z"
    },
    {
      "original": "Why Russia Targets the Left Bank of the Dnipro: A Review of Russian-Ukrainian Strikes\nOctober 21-22: Ukraine and Russia continued intensive mutual strikes, accompanied by massive missile and drone attacks. \nNumerous Russian strikes targeted energy facilities, including:\n▪️\nCHPP-4, CHPP-5, and CHPP-6 in Kyiv.\n▪️\nThe Kamenska HPP in Dnipropetrovsk region.\n▪️\nThe Kremenchug HPP in Poltava region.\n▪️\nThe DniproHES in Zaporizhzhia region.\n▪️\nSubstations in Chernihiv and Sumy regions.\nAccording to Telegraf, Russia is employing a new tactic aimed at completely disabling the energy system on the left bank of the Dnipro. This is creating an imbalance in power supply between western and eastern Ukraine: a critical electricity shortage is emerging in the east due to the destruction of thermal and hydroelectric plants, while a surplus of energy is present in the west, where nuclear power plants operate. This surplus cannot be effectively transferred eastward due to limited grid capacity.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845515Z"
    },
    {
      "original": "Pincers Around Uspenovka: Capture Of Pavlovka Opens New Avenues For Russian Advance To Gulyaypole\nThe Russian Armed Forces struck a foreign mercenaries at the Goncharovsky training camp. The 60th Separate Motorized Rifle Brigade has taken control of Pavlovka, a settlement on the right bank of the Yanchur River. \nSlovak Prime Minister Robert Fico said that the veto on the 19-th package could be lifted.\nRead more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845522Z"
    },
    {
      "original": "Pincers Around Uspenovka: Capture Of Pavlovka Opens New Avenues For Russian Advance To Gulyaypole\nThe Russian Armed Forces struck a foreign mercenaries at the Goncharovsky training camp. The 60th Separate Motorized Rifle Brigade has taken control of Pavlovka, a settlement on the right bank of the Yanchur River. \nSlovak Prime Minister Robert Fico said that the veto on the 19-th package could be lifted.\nRead more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845529Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 22, 2025\nOn October 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-23T15:13:08.845535Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From October 22, 2025\nOn October 22, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-23T15:13:08.845541Z"
    },
    {
      "original": "Britain’s Investment In “Combating Russian Hybrid Threats” Sparks Instability In The Balkans\nBritish Foreign Secretary Yvette Cooper announced within the Berlin Process that the United Kingdom would invest £4 million to “combat the constant flood of Russian hybrid threats aimed at destabilizing the region, and fanning ethnic tensions,” after which she also promised a wider £10 million in programs in the Western Balkans. In effect, this investment, evidently aimed against Serbia, contributes to an increasingly volatile situation in the region by implementing London’s old imperial logic of divide and rule.\nCooper hosted a meeting earlier this month within the framework of the Berlin Process, which was also attended by Serbian Foreign Minister Marko Đurić, and at which she confirmed “commitment to stability, security and prosperity in the Western Balkans,” adding that the “security in the Western Balkans affects the security of the whole of Europe and the security for us here in the UK.”\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845549Z"
    },
    {
      "original": "U.S. Takes War On Drugs To Eastern Pacific, Strikes Two Boats There And Threatens Colombia\nThe United States military struck two boats allegedly carrying drugs in the eastern Pacific Ocean on October 21 and 22, in a departure from previous strikes that targeted vessels in the Caribbean Sea.\nBoth strikes were announced by Defense Secretary Pete Hegseth, who said in two separate posts on X that they were carried out “at the direction” of President Donlad Trump. According to Hegseth, the first strike killed two people, while the second killed three.\n“These strikes will continue, day after day. These are not simply drug runners—these are narco-terrorists bringing death and destruction to our cities. These DTOs are the “Al Qaeda” of our hemisphere and will not escape justice. We will find them and kill them, until the threat to the American people is extinguished,” Hegseth said in the post announcing the second strike.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845557Z"
    },
    {
      "original": "U.S. Takes War On Drugs To Eastern Pacific, Strikes Two Boats There And Threatens Colombia\nThe United States military struck two boats allegedly carrying drugs in the eastern Pacific Ocean on October 21 and 22, in a departure from previous strikes that targeted vessels in the Caribbean Sea.\nBoth strikes were announced by Defense Secretary Pete Hegseth, who said in two separate posts on X that they were carried out “at the direction” of President Donlad Trump. According to Hegseth, the first strike killed two people, while the second killed three.\n“These strikes will continue, day after day. These are not simply drug runners—these are narco-terrorists bringing death and destruction to our cities. These DTOs are the “Al Qaeda” of our hemisphere and will not escape justice. We will find them and kill them, until the threat to the American people is extinguished,” Hegseth said in the post announcing the second strike.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845566Z"
    },
    {
      "original": "Russian Army Reaches Key Road North Of Pokrovsk, Enters Another Town Along Yanchur \nOn October 23, the Russian military reached a key road north of the city of Pokrovsk in the Donetsk direction, and entered another settlement along the Yanchur River in the Dnepropetrovsk direction.\nIn Donetsk, the Tsentr [Center] Group of Forces broke through Ukrainian defenses in Rodynske, located a few kilometers to the north of Pokrovsk, capturing most of the settlement southern part, and reaching the road to its west. This road links Pokrovsk with Dobropillia further to the north. It is one of the last remaining roads that Kiev has been using to supply its forces in Pokrovsk, Myrnohrad and nearby areas.\nRussian troops have reportedly taken over buildings overlooking the road. However, it is unclear yet if they managed to block it. It’s worth noting that the road has been under the first of Russian drone units for a while now.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845574Z"
    },
    {
      "original": "Russian Army Reaches Key Road North Of Pokrovsk, Enters Another Town Along Yanchur \nOn October 23, the Russian military reached a key road north of the city of Pokrovsk in the Donetsk direction, and entered another settlement along the Yanchur River in the Dnepropetrovsk direction.\nIn Donetsk, the Tsentr [Center] Group of Forces broke through Ukrainian defenses in Rodynske, located a few kilometers to the north of Pokrovsk, capturing most of the settlement southern part, and reaching the road to its west. This road links Pokrovsk with Dobropillia further to the north. It is one of the last remaining roads that Kiev has been using to supply its forces in Pokrovsk, Myrnohrad and nearby areas.\nRussian troops have reportedly taken over buildings overlooking the road. However, it is unclear yet if they managed to block it. It’s worth noting that the road has been under the first of Russian drone units for a while now.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-23T15:13:08.845582Z"
    },
    {
      "original": "Military Situation In Northern Palestine On October 23, 2025 (Map Update)",
      "timestamp": "2025-10-23T15:13:08.845585Z"
    }
  ],
  "script_run_time": "2025-10-23T15:13:08.846279Z"
}