{
  "messages": [
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-17T19:29:23.523645Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА в районі Чернігова та Сум. Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-17T19:29:23.523662Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T19:29:23.523669Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією у Запорізькій області.",
      "timestamp": "2025-08-17T19:29:23.523674Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА в Чернігівській, Харківській та Херсонській областях. Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-17T19:29:23.523679Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Запоріжжя, в Донецькій та Херсонській областях ! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-17T19:29:23.523683Z"
    },
    {
      "original": "⚠️\nСпостерігається активність  розвідувального БпЛА в Сумській області, можлива робота ППО.",
      "timestamp": "2025-08-17T19:29:23.523687Z"
    },
    {
      "original": "⚠\n Увага! м.Харківщина!\n🛵\n  Ворожий ударний БпЛА у вашому напрямку з білгородщини.",
      "timestamp": "2025-08-17T19:29:23.523693Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-08-17T19:29:23.523699Z"
    },
    {
      "original": "🛵\n Запорізька область на півночі БпЛА, курсом на південно-східний напрямок Дніпропетровщини.",
      "timestamp": "2025-08-17T19:29:23.523703Z"
    },
    {
      "original": "⚠️\nСпостерігається активність  розвідувальних БпЛА в Сумській області та в районі міста Суми, під час тривоги перебувайте у безпечних місцях!",
      "timestamp": "2025-08-17T19:29:23.523708Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на південно-східному напрямку Дніпропетровщини\n➡️\n   курсом на північ!",
      "timestamp": "2025-08-17T19:29:23.523714Z"
    },
    {
      "original": "🛵\n БпЛА на східному напрямку Дніпропетровщини\n➡️\n   курсом на Павлоград та Харківщину.",
      "timestamp": "2025-08-17T19:29:23.523719Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на заході Донеччини \n➡️\n   курсом на північ!",
      "timestamp": "2025-08-17T19:29:23.523725Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі південно-східного напрямку!",
      "timestamp": "2025-08-17T19:29:23.523729Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-17T19:29:23.523737Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на сході Дніпропетровщини\n➡️\n   курсом на Донеччину!\n🛵\n \"Шахеди\" на заході Донеччини \n➡️\n   курсом на північ та схід!",
      "timestamp": "2025-08-17T19:29:23.523746Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на сході Херсонщини \n➡️\n   курсом на захід.",
      "timestamp": "2025-08-17T19:29:23.523751Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на заході Донеччини \n➡️\n   курсом на Добропілля, Дружківку та Краматорськ.",
      "timestamp": "2025-08-17T19:29:23.523757Z"
    },
    {
      "original": "🛵\n БпЛА в Чорному морі \n➡️\n   курсом на Одещину.",
      "timestamp": "2025-08-17T19:29:23.523762Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Donetsk Oblast.\nAt least 35 drones attacked various targets in the region, including in Dobropillya, Sviatohorivka, Myrove, Novovodyane and Kramatorsk.",
      "timestamp": "2025-08-17T19:29:24.060882Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on Donetsk Oblast.\nAt least 35 drones attacked various targets in the region, including in Dobropillya, Sviatohorivka, Myrove, Novovodyane and Kramatorsk.",
      "timestamp": "2025-08-17T19:29:24.060895Z"
    },
    {
      "original": "As a result of new Russian advances in the Siversk, Lyman, Dobropillya, and Bilozerske directions, the Donetsk OVA has announced mandatory evacuation orders for families with children in 38 different settlements in Donetsk Oblast since August 8. \nAmong these settlements are the cities of Druzhkivka and Bilozerske. Additionally, 3 villages not in their announced list are being evacuated, and the city of Lyman is now under an evacuation order for all civilians. \nThe purple line on the map represents the current evacuation zones, and the yellow markers represent the settlements added to the evacuation zone since August 8.",
      "timestamp": "2025-08-17T19:29:24.060900Z"
    },
    {
      "original": "There is some truth to the Deepstate and Azov claims it seems",
      "timestamp": "2025-08-17T19:29:24.060904Z"
    },
    {
      "original": "KAB glide-bomb over northern Kharkiv",
      "timestamp": "2025-08-17T19:29:24.060907Z"
    },
    {
      "original": "KAB glide-bomb over northern Kharkiv",
      "timestamp": "2025-08-17T19:29:24.060910Z"
    },
    {
      "original": "Explosion in Kharkiv City",
      "timestamp": "2025-08-17T19:29:24.060917Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Vesele, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~227.\nTotal land area: ~0.91km².",
      "timestamp": "2025-08-17T19:29:24.060922Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Zolotyi Kolodyaz, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~910.\nTotal land area: ~2.47 km².",
      "timestamp": "2025-08-17T19:29:24.060926Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Rubizhne, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~105.\nTotal land area: ~0.47km².",
      "timestamp": "2025-08-17T19:29:24.060931Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Vilne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~71.\nTotal land area: ~0.30km².",
      "timestamp": "2025-08-17T19:29:24.060937Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Ivanivka, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~54.\nTotal land area: ~0.27km².",
      "timestamp": "2025-08-17T19:29:24.060942Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.58km².",
      "timestamp": "2025-08-17T19:29:24.060946Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.\nUkrainian forces re-established control over the village of Hruzke and the gulley running southwards, before pushing into Vesele from multiple directions, where they recaptured it and the surrounding areas.\nTo the west, after a failed attempt at entering it, the Ukrainians attacked Zolotyi Kolodyaz from the forests to the west again and broke through to the centre of the village. Fierce fighting ensued for around 24 hours, with the Russians being forced to retreat south due to the loss of Vesele and Hruzke, as well as because of Ukraine's numerical superiority here. Those same forces then pushed south and have reached the northern outskirts of Kucheriv Yar. \nAdditionally, after days of positional battles, Ukrainian forces pushed east from their positions in Rubizhne, and recaptured the rest of the village, which Russia had to withdraw from due to the loss of Zolotyi Kolodyaz. From there, Ukrainian forces pushed further and captured treeline positions on the nearby tactical heights, and in the gulley leading south from Zolotyi Kolodyaz.\nTo the south, the Ukrainians pushed outwards from Stepy, establishing a buffer zone in the treelines on the tactical heights there, while other forces moved along the heights to Vilne, which also came under their control.\nFurthermore, Ukrainian forces advanced east from Novyi Donbas, and entered the village of Nove Shakhove, capturing the western houses. They were also able to recapture the village of Ivanivka, as well as  Dorozhnje, which allowed for them to re-enter Nykanorivka which is now partially in the grey zone. \nRussian forces on the other hand, were able to improve their positions west of Shakhove around a week ago, advancing downhill through two parallel gulleys, capturing positions in the forest plantations there. \n+ ~60.60km² in favour of Ukraine.\n+ ~6.78km² in favour of Russia.",
      "timestamp": "2025-08-17T19:29:24.060955Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-17T19:29:24.060958Z"
    },
    {
      "original": "Now that Ukraine has achieved significant success in their counterattacks in the Bilozerske-Dobropillya direction, watch out for Pro-Russians suddenly switching up their opinions on this initial Russian breakthrough by claiming that \"oh actually, it was just a few DRGs all along!!!\" Those will be the same people declaring that this was a collapse (which it initially was). \nNo. Russia achieved a breakthrough, Ukraine moved in a lot of reinforcements from other areas of the front, counterattacked, and made large gains. While the claims of large groups of Russians being encircled are likely false, Deepstate and Azov were correct in saying that Ukraine was able to significantly advance. I doubted them, and I was wrong. \nNow let's see what happens in these areas where Ukrainian reinforcements were pulled from, namely the Kostyantynivka direction. It will be a good case study, as we haven't seen large scale movements from one direction to another since around a year ago in Kursk.",
      "timestamp": "2025-08-17T19:29:24.060963Z"
    },
    {
      "original": "In the Dobropillya-Bilozerske direction, both Russian and Ukrainian forces have been advancing, with Ukrainian forces making significant progress towards eliminating the Russian wedge to Zolotyi Kolodyaz.  Ukrainian forces re-established control over the village…",
      "timestamp": "2025-08-17T19:29:24.060972Z"
    },
    {
      "original": "These Ukrainian counterattacks began around 4 days ago btw",
      "timestamp": "2025-08-17T19:29:24.060975Z"
    },
    {
      "original": "Explosion in Kharkiv City",
      "timestamp": "2025-08-17T19:29:24.060979Z"
    },
    {
      "original": "The KAB impacted the village of Lisne, outside Kharkiv's city limits.",
      "timestamp": "2025-08-17T19:29:24.060982Z"
    },
    {
      "original": "The KAB impacted the village of Lisne, outside Kharkiv's city limits.",
      "timestamp": "2025-08-17T19:29:24.060985Z"
    },
    {
      "original": "The KAB hit somewhere near the Lisne Cemetary.",
      "timestamp": "2025-08-17T19:29:24.060988Z"
    },
    {
      "original": "The KAB hit somewhere near the Lisne Cemetary.",
      "timestamp": "2025-08-17T19:29:24.060992Z"
    },
    {
      "original": "Israeli Navy Attacks Power Plant Near Yemen’s Sanaa \nThe Israeli Navy early on August 17 launched strikes against a power plant located south of the Yemeni capital, Sanaa, which is held by the Houthis (Ansar Allah).\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes hit “energy infrastructure used by the Houthi terror regime,” near Sanaa, in response to “repeated attacks by the Houthi terror regime against the State of Israel and its citizens, including the launching of surface-to-surface missiles and UAVs toward Israeli territory.”\nThe Al-Masirah TV, which is run by the Houthis, said that the Hezyaz power plant was subjected to “an American-Israeli aggression.”\nThe channel later reported that workers and firefighters had put out a fire caused by the attack, and that work to repair the damage was underway.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.608976Z"
    },
    {
      "original": "Israeli Navy Attacks Power Plant Near Yemen’s Sanaa \nThe Israeli Navy early on August 17 launched strikes against a power plant located south of the Yemeni capital, Sanaa, which is held by the Houthis (Ansar Allah).\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes hit “energy infrastructure used by the Houthi terror regime,” near Sanaa, in response to “repeated attacks by the Houthi terror regime against the State of Israel and its citizens, including the launching of surface-to-surface missiles and UAVs toward Israeli territory.”\nThe Al-Masirah TV, which is run by the Houthis, said that the Hezyaz power plant was subjected to “an American-Israeli aggression.”\nThe channel later reported that workers and firefighters had put out a fire caused by the attack, and that work to repair the damage was underway.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.608993Z"
    },
    {
      "original": "Lebanese Warplane Conducted Patrol Over Syria Following Threats\nFor the first time ever, a warplane of the Lebanese Air Force (LAF) conducted on August 17 a patrol over Syria, specifically over the southern countryside of Homs in the center of the country. The unprecedented move came following threats to Beirut from Bedouin tribes loyal to the Islamist-led interim government in Damascus.\nData from the Flightradar24, which the patrol was spotted on, identified the warplane as an American-made A-29 Super Tucano turboprop light attack and counter-insurgency aircraft.\nThe patrol came exactly two days after some Bedouin tribes allied to the Syrian government gave Lebanon a “48 ultimatum” to release some 2,000 Syrian prisoners, including many Islamists who were convicted of terrorism.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609012Z"
    },
    {
      "original": "Lebanese Warplane Conducted Patrol Over Syria Following Threats\nFor the first time ever, a warplane of the Lebanese Air Force (LAF) conducted on August 17 a patrol over Syria, specifically over the southern countryside of Homs in the center of the country. The unprecedented move came following threats to Beirut from Bedouin tribes loyal to the Islamist-led interim government in Damascus.\nData from the Flightradar24, which the patrol was spotted on, identified the warplane as an American-made A-29 Super Tucano turboprop light attack and counter-insurgency aircraft.\nThe patrol came exactly two days after some Bedouin tribes allied to the Syrian government gave Lebanon a “48 ultimatum” to release some 2,000 Syrian prisoners, including many Islamists who were convicted of terrorism.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609021Z"
    },
    {
      "original": "Russia Tests New Drone-Ready Engineering Charge \nRussia’s Bars-Sarmat Center for Special-purpose Unmanned Systems has tested a new engineering charge, dubbed KZ-7, designed to be used as a warhead for suicide drones.\nVideo footage showing a live test of the KZ-7 was released on August 17. During the test, the charge, which weights 6,5 kg, was installed in a horizontal position 12 meters away from the targets. It was able to penetrate 700 mm of reinforced concrete, and 400 mm of rolled homogeneous armor.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609028Z"
    },
    {
      "original": "Russia Tests New Drone-Ready Engineering Charge \nRussia’s Bars-Sarmat Center for Special-purpose Unmanned Systems has tested a new engineering charge, dubbed KZ-7, designed to be used as a warhead for suicide drones.\nVideo footage showing a live test of the KZ-7 was released on August 17. During the test, the charge, which weights 6,5 kg, was installed in a horizontal position 12 meters away from the targets. It was able to penetrate 700 mm of reinforced concrete, and 400 mm of rolled homogeneous armor.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609036Z"
    },
    {
      "original": "NATO’s New Ally? Argentina And UK Secret Military Ties To Counter China In The South Atlantic\nThe South Atlantic, a region often overlooked in global geopolitics, is quietly becoming a theater of strategic maneuvering, with Britain and Argentina engaging in underreported military dialogue to counter Chinese influence. This development, driven by Argentine President Javier Milei’s pro-Western pivot, could reshape Latin America’s geopolitical landscape, bolster the US-led West’s position in the Southern Cone, and even ripple into the BRICS alliance.\nAccording to an Economist piece, Britain and Argentina have resumed defense talks after years of estrangement, spurred by Milei’s unorthodox stance on the Falklands and concerns about China’s growing footprint in the South Atlantic.\nArgentina currently seeks to modernize its dilapidated armed forces with NATO-compatible equipment, while Britain is considering loosening its stringent arms export restrictions.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609044Z"
    },
    {
      "original": "Military Situation In Yemen On August 17, 2025 (Map Update)",
      "timestamp": "2025-08-17T19:29:24.609048Z"
    },
    {
      "original": "Hamas, Islamic Jihad Are Still Resisting In Gaza \nThe Hamas Movement and the Palestinian Islamic Jihad continue to put on serious resistance in the Gaza Strip as the Israeli Defense Forces (IDF) prepares to mount an unprecedented offensive on the heart of the enclave.\nThe two factions shared between August 14 and 17 several videos documenting some of their recent operations against the IDF.\nThe first video shared by Hamas’ military wing, the al-Qassam Brigades, shows the group’s fighters clashing with Israeli troops from close range in the outskirts of Gaza City in the northern part of the Strip. The second video shows similar clashes from the city of Khan Younis in southern Gaza.\nIn both videos, Hamas fighters target Israeli troops with sniper rifles, blow up main battle tanks, armored personnel vehicles and armored bulldozers with rocket propelled grenades and shelling gatherings of the IDF with mortars.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609057Z"
    },
    {
      "original": "Hamas, Islamic Jihad Are Still Resisting In Gaza \nThe Hamas Movement and the Palestinian Islamic Jihad continue to put on serious resistance in the Gaza Strip as the Israeli Defense Forces (IDF) prepares to mount an unprecedented offensive on the heart of the enclave.\nThe two factions shared between August 14 and 17 several videos documenting some of their recent operations against the IDF.\nThe first video shared by Hamas’ military wing, the al-Qassam Brigades, shows the group’s fighters clashing with Israeli troops from close range in the outskirts of Gaza City in the northern part of the Strip. The second video shows similar clashes from the city of Khan Younis in southern Gaza.\nIn both videos, Hamas fighters target Israeli troops with sniper rifles, blow up main battle tanks, armored personnel vehicles and armored bulldozers with rocket propelled grenades and shelling gatherings of the IDF with mortars.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609065Z"
    },
    {
      "original": "Druze In Syria Demand Right Of Self Determination \nHundreds of Druze demonstrated in the city of al-Suwayda and other parts of the southern Syrian governorate on August 16 to demand the right to self determination.\nSome of the protesters waved Israeli flags to thank Israel for intervening on their side during the battle with the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes last month.\nThe protesters in al-Suwayda expressed their rejection of the interim government and demanded that those responsible for atrocities against Druze be brought to justice. Some of the protesters called on Israel to intervene to support their demand of self determination.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609073Z"
    },
    {
      "original": "Druze In Syria Demand Right Of Self Determination \nHundreds of Druze demonstrated in the city of al-Suwayda and other parts of the southern Syrian governorate on August 16 to demand the right to self determination.\nSome of the protesters waved Israeli flags to thank Israel for intervening on their side during the battle with the forces of Syria’s Islamist-led interim government and affiliated Bedouin tribes last month.\nThe protesters in al-Suwayda expressed their rejection of the interim government and demanded that those responsible for atrocities against Druze be brought to justice. Some of the protesters called on Israel to intervene to support their demand of self determination.\nRead more \nHERE",
      "timestamp": "2025-08-17T19:29:24.609082Z"
    },
    {
      "original": "Military Situation In Ukraine On August 17, 2025 (Maps Update)",
      "timestamp": "2025-08-17T19:29:24.609085Z"
    },
    {
      "original": "Military Situation In Ukraine On August 17, 2025 (Maps Update)",
      "timestamp": "2025-08-17T19:29:24.609089Z"
    }
  ],
  "script_run_time": "2025-08-17T19:29:24.609870Z"
}