{
  "messages": [
    {
      "original": "🛵\n Полтавщина (Лубянський  район)  - загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814464Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-25T05:48:10.814486Z"
    },
    {
      "original": "🛵\n Запорізька область  - загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814492Z"
    },
    {
      "original": "🛵\nСумщина (Сумський та Охтирський райони)    - загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814498Z"
    },
    {
      "original": "🛵\nСумщина (Роменський район) - загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814503Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному  напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-25T05:48:10.814512Z"
    },
    {
      "original": "🛵\n Донеччина - загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814517Z"
    },
    {
      "original": "🛵\n Харківська  область- загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814522Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Сумщині наближаються до Сум зі сходуі.",
      "timestamp": "2025-08-25T05:48:10.814527Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-25T05:48:10.814531Z"
    },
    {
      "original": "🛵\n Харків - загроза застосування ударних БпЛАз півночі!",
      "timestamp": "2025-08-25T05:48:10.814536Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на півночі  Чернігівщини, курс південно-західний",
      "timestamp": "2025-08-25T05:48:10.814541Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини рухаються у напрямку Полтавщини.",
      "timestamp": "2025-08-25T05:48:10.814546Z"
    },
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Дніпропетровської області (Синельниківський р-н).",
      "timestamp": "2025-08-25T05:48:10.814561Z"
    },
    {
      "original": "🛵\n Загроза застосування ударних БпЛА для Дніпропетровської області (Павлоградський р-н).",
      "timestamp": "2025-08-25T05:48:10.814568Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному  напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-25T05:48:10.814576Z"
    },
    {
      "original": "🛵\n Чернігівська та Сумська  області- загроза ударних БпЛА.",
      "timestamp": "2025-08-25T05:48:10.814581Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі.",
      "timestamp": "2025-08-25T05:48:10.814586Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння по областях.",
      "timestamp": "2025-08-25T05:48:10.814593Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 76 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 25 серпня (із 19.00 24 серпня) противник 104-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Шаталово, Орел, Міллерово, Приморсько-Ахтарськ – рф.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.00, протиповітряною обороною збито/подавлено 76 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання 28 БпЛА на 15 локаціях, падіння збитих (уламки) на 4 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-25T05:48:10.814612Z"
    },
    {
      "original": "2 Tu-95MS were redeployed from Engels-2 to Olenya airbase earlier today after being re-equipped with X-101 Cruise missiles",
      "timestamp": "2025-08-25T05:48:11.337504Z"
    },
    {
      "original": "⚡️\n🇵🇸\n🇵🇸\n❌\n🇮🇱\n - \nThe AlQassam Brigades announced targeting 2 IDF \"\nMerkava\n\" Tanks using \"highly explosive landmines\" in eastern '\nAlRawda\n', southern '\nZeitoun\n', northern Gaza.\nThe Unit observed the arrival of a rescue and evacuation force, confirming causalities.",
      "timestamp": "2025-08-25T05:48:11.337529Z"
    },
    {
      "original": "Satellite imagery reveals that since June, work has begun on Donetsk International Airport.   The trenches that ran over the runway have been covered, and construction work is underway at the abandoned carparks, possibly in preparation for installing fuel…",
      "timestamp": "2025-08-25T05:48:11.337534Z"
    },
    {
      "original": "High quality satellite imagery shows that in the past three weeks, new work has been done on Donetsk International Airport to convert it into a Geran-2 drone launch point, and presumably also a basing point for helicopters. \nWe also get a better view of the repair works on the main runway, where crews have been filling in old craters from artillery shelling and trench lines from before 2022. \nCoordinates: 48.075198, 37.741229.\nImage credit: \nt.me/zoka200/39320",
      "timestamp": "2025-08-25T05:48:11.337545Z"
    },
    {
      "original": "High quality satellite imagery shows that in the past three weeks, new work has been done on Donetsk International Airport to convert it into a Geran-2 drone launch point, and presumably also a basing point for helicopters.   We also get a better view of the…",
      "timestamp": "2025-08-25T05:48:11.337549Z"
    },
    {
      "original": "Meanwhile, a few days ago, Ukrainian UAVs damaged the former metro store next to the airport which Russia has been repairing.   \nCoordinates: 48.065190, 37.746970\nImage credit: \nhttp://t.me/kiber_boroshno/11956",
      "timestamp": "2025-08-25T05:48:11.337555Z"
    },
    {
      "original": "On the northeastern flank on Pokrovsk, both Russian and Ukrainian forces have advanced, with Ukrainian forces managing to infiltrate deep behind Russian lines.\nRussian forces were able to establish control over the large terykon overlooking the city of Myrnohrad as well as the southern bank of one of the sludge ponds. They also advanced west and southwest to the treelines north of Myrnohrad, capturing new positions there.\nTo the west, Russian forces made additional progress in Chervonyi Lyman, advancing further west through the settlement, and improving their positions in the forested areas on the outskirts of Rodynske. \nUkrainian forces from the 425th Separate Assault Regiment \"Skala\", taking advantage of the Russian 5th Independent Motorised Rifle Brigade not taking up positions west of Mykolaivka and misreporting this to the higher command, managed to infiltrate northwest, crossing the Kazenyi Torets River. They then advanced further along a treeline, reaching the village of Myrne with no resistance. Here they entrenched in the main part of the settlement, effectively cutting the Pokrovsk - Kostyantynivka Highway. \n+ ~6.75km² in favour of Russia.\n+ ~4.94km² in favour of Ukraine.",
      "timestamp": "2025-08-25T05:48:11.337562Z"
    },
    {
      "original": "Earlier today, 1 Russian IL-76MD military transport aircraft landed at Savasleika Airbase, Nizhny Novgorod Oblast. The cargo likely consists of Kinzhal hypersonic aeroballistic missiles. \nThis suggests that the stockpile of Kinzhals built up at the airbase during the first half of the year when there were no Kinzhal launches is almost depleted from the recent uptick in usage, as this is the first recorded IL-76MD flight to Savasleika in some time.",
      "timestamp": "2025-08-25T05:48:11.337566Z"
    },
    {
      "original": "I want to make a “Ukraine mapper tierlist” just for fun. It will represent my view of the accuracy, usefulness, and readability of different prominent mappers without taking into account their personal opinions on the war.\nGive me mapper suggestions in the comments (I will not be included in this list). I will also be making this public once it’s completed so you guys can make your own versions of it.",
      "timestamp": "2025-08-25T05:48:11.337571Z"
    },
    {
      "original": "I want to make a “Ukraine mapper tierlist” just for fun. It will represent my view of the accuracy, usefulness, and readability of different prominent mappers without taking into account their personal opinions on the war.  Give me mapper suggestions in the…",
      "timestamp": "2025-08-25T05:48:11.337574Z"
    },
    {
      "original": "Here is the Ukraine War Mapper Tier list. The background colours represent whether they are Pro-Ukraine, Neutral, or Pro-Russian. \nYou can make your own version with the same mappers here: \nhttps://tiermaker.com/create/ukraine-war-mapper-tierlist-15512010\nMappers in order of the image:\nSuriyakmaps \nPlayfra\nThorkill\nWeeb Union\nBalkan Mapper\nAnatoly Radov\nMilitary Summary\nTheti Mapping\nGeoConfirmed\nVitaly\nKalibrated\nDPA\nZ-Committee\nClement Molin\nStormap\nUAcontrolmap\nDIVGEN\nRybar\nTwo Majors\nMajakovsk\nPetrenko\nDeepstate\nShalin\nCreamy Caprice\nISW\nTendar\nLiveuamap",
      "timestamp": "2025-08-25T05:48:11.337596Z"
    },
    {
      "original": "Unidentified missile to Konotop, Sumy Oblast",
      "timestamp": "2025-08-25T05:48:11.337599Z"
    },
    {
      "original": "Unidentified missile to Konotop, Sumy Oblast",
      "timestamp": "2025-08-25T05:48:11.337602Z"
    },
    {
      "original": "Disappeared in the border area",
      "timestamp": "2025-08-25T05:48:11.337605Z"
    },
    {
      "original": "Two Russian Su-34s are flying over the Sea of Azov towards Crimea. They may be flying to carry out KAB glide-bomb strikes on Kherson Oblast.",
      "timestamp": "2025-08-25T05:48:11.337609Z"
    },
    {
      "original": "Disappeared in the border area",
      "timestamp": "2025-08-25T05:48:11.337612Z"
    },
    {
      "original": "A Russian recon drone was operating in the area",
      "timestamp": "2025-08-25T05:48:11.337615Z"
    },
    {
      "original": "Two Russian Su-34s are flying over the Sea of Azov towards Crimea. They may be flying to carry out KAB glide-bomb strikes on Kherson Oblast.",
      "timestamp": "2025-08-25T05:48:11.337618Z"
    },
    {
      "original": "3 KAB strikes were carried out on the Beryslav area of Kherson Oblast. Two Russian recon drones filmed the strikes.",
      "timestamp": "2025-08-25T05:48:11.337621Z"
    },
    {
      "original": "Sumy City is currently under a relatively small Russian Geran-2 drone attack. At least two impacts have been recorded so far.",
      "timestamp": "2025-08-25T05:48:11.337624Z"
    },
    {
      "original": "Russian forces have captured the village of Vorone, Pokrovske Direction, Dnipropetrovsk Oblast.\nPre-war population: ~55.\nTotal land area: ~0.33km².",
      "timestamp": "2025-08-25T05:48:11.337628Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Tolstoi, Prosyana direction, Donetsk Oblast.\nPre-war population: ~176.\nTotal land area: ~0.46km²",
      "timestamp": "2025-08-25T05:48:11.337633Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Oleksandrohrad, Pokrovske direction, Donetsk Oblast.\nPre-war population: ~115.\nTotal land area: ~0.55km².\nNote: this advance probably occurred around 2 weeks ago, but was only just confirmed.",
      "timestamp": "2025-08-25T05:48:11.337638Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance towards the stronghold village of Shakhove, making significant progress from their initial wedge through Ukrainian lines. \nRussian forces advanced in three areas. Most of the progress was made in the west, where over the past 10 days, they have been making incremental progress towards the western bank of the Kazenyi Torets River. \nThe Russians were able to build on their previous progress in the areas of Kucheriv Yar and Pankivka, advancing eastwards on a wide front, capturing new positions in the treelines, forest plantations, quarries, and forests on the tactical heights, approaching the villages of Shakhove and Toretske. \nTo the southeast, Russian forces resumed their assault operations east of Volodymyrivka, improving their positions in the forest plantations in the low-lying ground, and approaching the rear of the village. \nTo the north, Russian forces continued their incremental advances downhill towards Sofiivka, where they established control over new positions in the main forested gulley, as well as in the adjacent treelines. \n+ ~16.97km² in favour of Russia.",
      "timestamp": "2025-08-25T05:48:11.337647Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n Images of Israeli airstrikes on Gaza City, a few moments ago.\n@wfwitness",
      "timestamp": "2025-08-25T05:48:11.337653Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇵🇸\n Images of Israeli airstrikes on Gaza City, a few moments ago.\n@wfwitness",
      "timestamp": "2025-08-25T05:48:11.337660Z"
    }
  ],
  "script_run_time": "2025-08-25T05:48:11.741681Z"
}