{
  "messages": [
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-11-05T21:37:15.746926Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф \n➡️\n на північ Харківщини.",
      "timestamp": "2025-11-05T21:37:15.746949Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Дніпропетровщини \n➡️\n курсом на південь.\n🛵\n БпЛА на півдні Харківщини \n➡️\n курсом на Лозову, Краснопавлівку.\n🛵\n БпЛА в районі Чугуєва \n➡️\n курсом захід.\n🛵\n Кілька груп БпЛА на у центрі та на півдні Сумщини \n➡️\n курсом на південь.\n🛵\n Кілька БпЛА на півночі Чернігівщини \n➡️\n курсом на Седнів, Мену.",
      "timestamp": "2025-11-05T21:37:15.746973Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-05T21:37:15.746984Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-05T21:37:15.746989Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-11-05T21:37:15.746995Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-11-05T21:37:15.747001Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Чаплине.\n🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Добропілля.\n🛵\n БпЛА на півдні Харківщини \n➡️\n курсом Ізюм, Лозову.\n🛵\n Кілька груп БпЛА на півночі та у центрі Харківщини \n➡️\n курсом на південь.\n🛵\n Кілька БпЛА на сході Полтавщини \n➡️\n курсом на Карлівку.\n🛵\n Кілька груп БпЛА на сході та півдні Сумщини \n➡️\n курсом на Охтирку, Лебедин.\n🛵\n БпЛА на півночі Чернігівщини \n➡️\n курсом на схід.",
      "timestamp": "2025-11-05T21:37:15.747028Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n курсом на Запоріжжя!",
      "timestamp": "2025-11-05T21:37:15.747034Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф, \n➡️\n на північний схід Харківщини!",
      "timestamp": "2025-11-05T21:37:15.747042Z"
    },
    {
      "original": "🛸\n Поблизу узбережжя Одещини -  ворожий розвідувальний БпЛА, який може бути навідником  ворожих засобів ураження!\nЗалучено засоби для збиття.",
      "timestamp": "2025-11-05T21:37:15.747048Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-05T21:37:15.747057Z"
    },
    {
      "original": "🚀\nКАБи на Запорізьку область!",
      "timestamp": "2025-11-05T21:37:15.747061Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Запорізької області \n➡️\n курсом на Томаківку.\n🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Павлоград.\n🛵\n Кілька груп БпЛА на півночі, в центрі та півдні Харківщини!\n🛵\n Кілька груп БпЛА на сході Полтавщини \n➡️\n курсом на Полтаву. Карлівку.\n🛵\n Кілька БпЛА на півночі Чернігівщини \n➡️\n курсом на Ніжин, Седнів.",
      "timestamp": "2025-11-05T21:37:15.747080Z"
    },
    {
      "original": "🛵\n Група БпЛА з півдня \n➡️\n на північ Запорізької області!",
      "timestamp": "2025-11-05T21:37:15.747087Z"
    },
    {
      "original": "🛵\n БпЛА з півдня Чернігівщини \n➡️\n на Київщину!",
      "timestamp": "2025-11-05T21:37:15.747095Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з північного  сходу!",
      "timestamp": "2025-11-05T21:37:15.747102Z"
    },
    {
      "original": "🛵\n Кілька груп БпЛА на півночі та в центрі Дніпропетровщини \n➡️\n курсом на Дніпро, Кам'янське.\n🛵\n БпЛА на півночі Донеччини \n➡️\n курсом на Краматорськ.\n🛵\n БпЛА на сході Полтавщини \n➡️\n курсом на Харківщину.\n🛵\n Кілька БпЛА на заході та півдні Харківщини \n➡️\n курсом на південь.\n🛵\n БпЛА на Київщині. південніше Борисполя \n➡️\n курсом на Обухів.",
      "timestamp": "2025-11-05T21:37:15.747131Z"
    },
    {
      "original": "🛵\n БпЛА з Брянської обл., рф, \n➡️\n на північ Чернігівщини!",
      "timestamp": "2025-11-05T21:37:15.747138Z"
    },
    {
      "original": "🛸\n Поблизу узбережжя Одещини -  ворожий розвідувальний БпЛА, який може бути навідником  ворожих засобів ураження!\nЗалучено засоби для збиття.",
      "timestamp": "2025-11-05T21:37:15.747144Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-05T21:37:16.436068Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-05T21:37:16.436085Z"
    },
    {
      "original": "The Ukrainian GUR published footage of new FPV drone strikes on valuable Russian targets in Crimea. \nThe drones targeted:\nA command post of a Russian S-400 air defence system in a combat position.\nA 92N6E multifunctional radar + the autonomous power supply for the S-400 command post. \nAn AORL-1AS airfield surveillance radar.\nP-18 “Terek” general-purpose early warning radar.",
      "timestamp": "2025-11-05T21:37:16.436097Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-05T21:37:16.436101Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-05T21:37:16.436105Z"
    },
    {
      "original": "There is an increased threat of a large-scale, combined Russian missile attack on Ukraine in the next 5 days, not including Kh-101 cruise missiles launched from strategic aviation.\nThe attack would involve Iskander-M ballistic missiles, Iskander-K cruise missiles, and hundreds of Geran-2 drones. The highest threat is to Kyiv, Poltava, Zaporizhzhia and Dnipropetrovsk Oblasts, especially for gas and energy infrastructure. \nAs of now, nothing is certain, but there have been actions noted that suggest preparations for a large attack.",
      "timestamp": "2025-11-05T21:37:16.436122Z"
    },
    {
      "original": "Once this war is over, I think a lot of people are going to consider the fall of Pokrovsk as the \"turning point\" for why Russia won. \nThis is not the case. The fall of Pokrovsk will be just one thing in a chain of events that trend towards collapse for Ukraine, and there is still much more to come. Attritional warfare prioritises degrading your enemy's ability to fight, and the territory you gain in the meantime is - for the most part - a biproduct of successful attrition. \nThere wasn't really a turning point for this war, as Russia is the larger country, with superior capabilities, and the ability to keep up the fight far longer than Ukraine, meaning they are destined to win unless something drastic and revolutionary happens. There are many reasons for this, of which I have outlined in the past. \nPokrovsk is just the \"new Bakhmut\" - the city that the media focuses on. You could even consider it Zelensky's PR city. I don't think Pokrovsk will be forgotten like the 2023 Zaporizhzhia counteroffensive, or the 2024-2025 Kursk offensive, however, as it will probably be labelled as the turning point further down the line.",
      "timestamp": "2025-11-05T21:37:16.436130Z"
    },
    {
      "original": "Currently, there are 40 Tu-95MS strategic bombers stationed at Ukrainka Airbase, Amur Oblast. \n30 Tu-95MS are not used and have remained stationary for a long time.\n1 Tu-95MS is there purely for training purposes. \n7 Tu-95MS redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, and will be equipped with Kh-101 cruise missiles.\n2 Tu-95MS redeployed from Diaghilev Airbase, Ryazan Oblast, to Ukrainka Airbase, and will also be equipped with missiles.\nThe most interesting news is that 4 Tu-160s were previously stationed there, 1 of which was used for training purposes. On October 1, maintenance of 3 Tu-160s used for combat missions was carried out. \nSince then, 1 IL-76MD cargo plane landed there, carrying Kh-101 missiles, which were equipped to the 3 Tu-160s. The 3 Tu-160s equipped with missiles redeployed back to Engels-2 overnight and have since landed there.",
      "timestamp": "2025-11-05T21:37:16.436140Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-05T21:37:16.436146Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-05T21:37:16.436152Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nThe battle for Pokrovsk is approaching its end as the parts of the city begin to come under Russian control.\nIn the northern part of the city, Russian forces established control over new positions in the northernmost residential neighbourhoods, fully establishing themselves along the southern bank of the Hrishynka River. Additionally, they advanced from the area of School no. 14 and the northwestern industrial zone, to the remaining residential streets not yet under Russian control, capturing new positions towards the northern outskirts.\nIn the northeastern part of Pokrovsk, Russian forces consolidated in the southern part of the high-rise district and operationally encircled the remaining Ukrainian formations in the district. To the southeast, they made additional progress in the low-rise residential areas towards the eastern outskirts of the city, establishing control over most of the rest of the buildings there.\nThe most important news comes from the bottleneck of the Myrnohrad pocket. After entering the high-rise district and compromising it as a blocking position against attempts to physically cut off Myrnohrad, Russian forces advanced beyond northeastern Pokrovsk, past the cemetery, and to the highway, where they entrenched in the windbreaks. From there, they entered and captured the soft drinks factory and infiltrated into the northwestern part of Rivne.\nOn the northern end of the bottleneck, the Russians advanced from their positions near the pig farm and reached the high-rise intersection, establishing full control over it and the surrounding positions. They then went on to advance west down the road, where they have reached the next pig farm complex.\nCurrently, there is a ~1.3 km corridor of open fields and a small, disconnected residential area consisting of two short streets connecting the Myrnohrad pocket with the rest of the front. This area is entirely in the grey zone, and movement in and out of the pocket is now practically impossible. The vast majority of formations still in the pocket will either be killed or captured. \nMeanwhile, north of Pokrovsk, Russian forces began counterattacking against the Ukrainian infiltrations in northern Rodynske. They were able to quickly retake the northern low-rise residential area, and begin assaults on the Ukrainian soldiers entrenched in the three-story buildings. Extremely fierce fighting is ongoing here, with both sides making use of extensive fire power. Some Ukrainian soldiers have been encircled, while others still reside in the grey zone. \n+ ~4.57 in favour of Russia.",
      "timestamp": "2025-11-05T21:37:16.436163Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-05T21:37:16.436168Z"
    },
    {
      "original": "Take with a grain of salt but... Siversk \n🟠",
      "timestamp": "2025-11-05T21:37:16.436173Z"
    },
    {
      "original": "Can confirm. They entered from the south around 2 days ago.",
      "timestamp": "2025-11-05T21:37:16.436176Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-05T21:37:16.436180Z"
    },
    {
      "original": "Ukrainian Neptune cruise missiles have attacked the Oryol Thermal Power Plant again. At least one missile impacted, and a large fire is now burning there.",
      "timestamp": "2025-11-05T21:37:16.436183Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-05T21:37:16.436189Z"
    },
    {
      "original": "The IDF's Duvdevan Unit carried out raids on the Nablus Governorate of the West Bank today, arresting two Hamas-affiliated militants. \nOne fighter was arrested in the Balata Refugee Camp in the city of Nablus, and another was arrested in the nearby village of Masaken A'abeihya. The man in Balata Camp was seen being escorted into an armoured jeep before being withdrawn from the city. \nBoth militants arrested today were part of the local armed group \"Nablus Battalion\", which is mainly subordinate to the Palestinian Islamic Jihad's \"Saraya Al-Quds Brigades\", but also has known ties with Hamas. No resistance was put up by any other Nablus Battalion fighters in Balata Camp due to their degraded capabilities from frequent Israeli raids and arrests over the past two years.",
      "timestamp": "2025-11-05T21:37:16.436194Z"
    },
    {
      "original": "Map correction in Pokrovsk:\nSome Ukrainian forces remain entrenched in the high-rise buildings of the Dinas District in northeastern Pokrovsk. They are effectively cut off from the rest of the Myrnohrad pocket.",
      "timestamp": "2025-11-05T21:37:16.436198Z"
    },
    {
      "original": "Scenes from the Dinas District of Pokrovsk. Russian soldiers are currently clearing it. \nIt is widely considered to be the last Ukrainian stronghold in the city.",
      "timestamp": "2025-11-05T21:37:16.436202Z"
    },
    {
      "original": "Military Situation In Ukraine On November 5, 2025 (Maps Update)",
      "timestamp": "2025-11-05T21:37:17.031159Z"
    },
    {
      "original": "Military Situation In Ukraine On November 5, 2025 (Maps Update)",
      "timestamp": "2025-11-05T21:37:17.031173Z"
    },
    {
      "original": "Venezuela Approves Plans For ‘Armed Resistance’ As It Braces For U.S. Attack (Videos)\nVenezuelan President Nicolas Maduro on November 5 approved a proposal by his ruling party to initiate “armed resistance” if the United States attacks the country.\nThe U.S. has been escalating against Venezuela since last August, when it doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges.\n\"[The proposals] have been approved, and the United Socialist Party of Venezuela must immediately begin implementing them by developing operational plans for every street and community, so that our people — calmly, with restraint, yet with determination and courage — remain at the highest state of readiness,\" Maduro said at the congress of the United Socialist Party of Venezuela.\nMaduro added that he had received a document outlining \"a set of ideas to transition from an unarmed struggle to an armed one.\"\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031185Z"
    },
    {
      "original": "Venezuela Approves Plans For ‘Armed Resistance’ As It Braces For U.S. Attack (Videos)\nVenezuelan President Nicolas Maduro on November 5 approved a proposal by his ruling party to initiate “armed resistance” if the United States attacks the country.\nThe U.S. has been escalating against Venezuela since last August, when it doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges.\n\"[The proposals] have been approved, and the United Socialist Party of Venezuela must immediately begin implementing them by developing operational plans for every street and community, so that our people — calmly, with restraint, yet with determination and courage — remain at the highest state of readiness,\" Maduro said at the congress of the United Socialist Party of Venezuela.\nMaduro added that he had received a document outlining \"a set of ideas to transition from an unarmed struggle to an armed one.\"\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031195Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 5, 2025 (Map Update)",
      "timestamp": "2025-11-05T21:37:17.031199Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031209Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031218Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031229Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031239Z"
    },
    {
      "original": "AS POKROVSK FALLS, RUSSIAN OFFENSIVE INTENSIFIES ON NORTHERN FRONTS",
      "timestamp": "2025-11-05T21:37:17.031242Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031250Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-05T21:37:17.031256Z"
    }
  ],
  "script_run_time": "2025-11-05T21:37:17.032159Z"
}