{
  "messages": [
    {
      "original": "🛵\n Харківська  область  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-22T11:09:40.860198Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 26 ВОРОЖИХ БПЛА, ЩЕ 7 НЕ ДОСЯГЛИ ЦІЛЕЙ – ЛОКАЦІЙНО ВТРАЧЕНІ/ПОДАВЛЕНІ РЕБ        \n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 22 липня (із 23.00 21 липня) противник атакував 42-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Приморсько-Ахтарськ – рф., Чауда, Гвардійське - ТОТ Криму.\n💥\n За попередніми даними, станом на 09.00 протиповітряною обороною збито/подавлено 26 ворожих БпЛА типу Shahed (безпілотників інших типів) на півдні та сході країни.\n* Крім того, 7 БпЛА – локаційно втрачені/подавлені РЕБ.\nЗафіксовано влучання 9 БпЛА у 3 локаціях, падіння збитих (уламки) на 3 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-07-22T11:09:40.860230Z"
    },
    {
      "original": "🛵\n Донецька   область  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-22T11:09:40.860235Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-07-22T11:09:40.860240Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-22T11:09:40.860247Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-07-22T11:09:40.860252Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-07-22T11:09:40.860256Z"
    },
    {
      "original": "🛸\n Миколаївська область -  ворожий розвідувальний БпЛА.\n⚡\nЗалучено засоби для його збиття.",
      "timestamp": "2025-07-22T11:09:40.860262Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-07-22T11:09:40.860269Z"
    },
    {
      "original": "Це що, F-16? А поряд із ним — наш новий проєкт. \nF-16 — найскладніша західна техніка, на яку ми так довго чекали. «Повернись живим» за запитом Міністерства оборони України та з підтримкою державної компанії Укрнафта розробили, придбали та передали для Повітряних Сил Збройних Сил України перші в країні мобільні комплекси для обслуговування літаків нового зразка.\nІ все це — «Проєкт 61»\nВ умовах реальної війни, коли ворог полює на літаки й аеродроми, Повітряним Силам бракувало мобільності в питаннях обслуговування як самих F-16, так і їхнього авіаційного озброєння.\nПеред вами унікальна, самостійна та ефективна екосистема, яка спирається на реальні потреби України у цій війні:\n— мобільний комплекс планування місій, де проводиться передпольотний брифінг льотчиків та супровід бортів у ближній зоні;\n— два комплекси підготовки авіаційного озброєння, які прискорюють підготовку та перевірку боєприпасів, а також полегшують їх підвіску до літака.\n«Раніше для підвіски одного боєприпасу було необхідно від 10 до 12 осіб. Завдяки цьому комплексу, тепер це можливо реалізувати за допомогою трьох людей», — розповідає Сергій, представник «Офісу 61», який займається розвитком державної авіації.\nВтілити в життя це просте, але таке необхідне рішення допомогла Укрнафта, яка зробила внесок у 49 438 176,90 грн. Ця екосистема враховує передовий досвід Європи, спирається на реальні потреби України та допомагає літакам нового зразка реалізувати весь свій потенціал.",
      "timestamp": "2025-07-22T11:09:40.860279Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину та Донеччину.",
      "timestamp": "2025-07-22T11:09:40.860284Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський  р-н) та Запорізька область - ракетна небезпека!",
      "timestamp": "2025-07-22T11:09:40.860288Z"
    },
    {
      "original": "🛵\n Херсонська область  - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-07-22T11:09:40.860293Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА в акваторії Чорного моря курсом на Одещину! Залучено засоби для його збиття.",
      "timestamp": "2025-07-22T11:09:40.860297Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину!",
      "timestamp": "2025-07-22T11:09:40.860301Z"
    },
    {
      "original": "🛸\n🛸\n На південному сході Сумщини, на Чернігівщині (район н.п.Мена, н.п.Корюківка), на південному сході Запорізької області -  розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-07-22T11:09:40.860306Z"
    },
    {
      "original": "🛸\n \n🛵\n На південному сході від Харкова  ворожий БпЛА. Залучено засоби для його збиття. У разі оголошення тривоги прямуйте в укриття!",
      "timestamp": "2025-07-22T11:09:40.860312Z"
    },
    {
      "original": "🛸\n В напрямку Кривого рогу (Дніпропетровщина) з південного сходу ворожий розвідувальний БпЛА. Можлива робота ППО.",
      "timestamp": "2025-07-22T11:09:40.860317Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-22T11:09:40.860324Z"
    },
    {
      "original": "🛸\n🛵\n В напрямку Сум з північного сходу ворожий БПЛА. Можлива робота ППО. Перебувайте в укриттях.",
      "timestamp": "2025-07-22T11:09:40.860331Z"
    },
    {
      "original": "🛸\n🛸\n На північному сході від Чернігова та на південному сході від Кривого Рогу - розвідувальні БпЛА противника, які можуть бути потенційними навідниками ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-07-22T11:09:40.860336Z"
    },
    {
      "original": "Flying to Starokostyantyniv, Khmelnytskyi Oblast.",
      "timestamp": "2025-07-22T11:09:41.475244Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-22T11:09:41.475256Z"
    },
    {
      "original": "Further to Ivano-Frankivsk Oblast.",
      "timestamp": "2025-07-22T11:09:41.475260Z"
    },
    {
      "original": "2 impacts to the same target that the Kh-101s and Kalibrs hit earlier.",
      "timestamp": "2025-07-22T11:09:41.475263Z"
    },
    {
      "original": "I think one thing that a lot of people underestimate is how many civilians remain in the Pokrovsk area. Pokrovsk alone has thousands of residents still holding out, while Myrnohrad, Rodynske and Hryshyne's residents combined also number in the thousands. I'd estimate over 5,000 in total remain across the 4 settlements. \nThe last shops and convenience stores closed in Rodynske last week, giving away all of their stock to civilians, but only after the Russians broke through towards the city's eastern outskirts. As of roughly two months ago, a few local shops in Pokrovsk City Centre were still selling basic supplies including food, water, antibiotics, and other medicines, although it's possible that these have since finally closed considering the deteriorating situation on the flanks and intensified Russian bombardment. \nOn average, 1 civilian in Pokrovsk is killed daily from the Russian artillery, MLRS, drone and FAB bombardment. This is despite its population still numbering in the thousands, its proximity to the frontline, the heavy Ukrainian presence in the city, and its strategic importance to the Russians.\nPokrovsk - as far as I know - was more Anti-Russia than most cities in the Donbas, especially Kramatorsk, Slovyansk, Bakhmut and Donetsk City. Nevertheless, people choose to stay behind, usually because they are waiting for \"liberation\" or because they have grown up there and lived in the city for their whole lives. It's all they have ever known, so it makes it more difficult to leave to cities further west. \nAdditionally, many residents who were evacuated from cities such as Avdiivka moved to Pokrovsk and Myrnohrad, yet less than a year later these cities were practically on the frontlines and under heavy Russian bombardment. Many people, especially elderly, do not want to have to go through the struggle or uprooting their lives and relocating once, let alone twice within a year. \nToday, a large portion of Pokrovsk, Myrnohrad, Rodynske and Hryshyne's populations are elderly, although many are middle-aged or younger. Most men between the ages of 18 and 60 either escaped or were mobilised. Localised mobilisation efforts were still ongoing in Pokrovsk-Myrnohrad up until 1-2 weeks ago, which had previously been ramped up when extra police and TCC units from other regions were sent to bolster Donetsk's police and TCC force, although I expect these efforts have since halted considering recent events.",
      "timestamp": "2025-07-22T11:09:41.475271Z"
    },
    {
      "original": "The Lukyanovskaya Metro Station in Kyiv was damaged during last night's Geran-2 drone strikes on the city. The Artem Defence plant was the target here, as it is across the road from the metro station.",
      "timestamp": "2025-07-22T11:09:41.475274Z"
    },
    {
      "original": "Last night, Russian Geran-2 drones attacked Kharkiv City. At least 12 impacts were recorded, with large fires breaking out afterwards.",
      "timestamp": "2025-07-22T11:09:41.475277Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T11:09:41.475281Z"
    },
    {
      "original": "NASA FIRMS data shows that one of the targets of the Geran-2 drone attack on Kharkiv City was an industrial zone made up of a number of small enterprises in the eastern part of the city. FIRMS data shows that a fire is currently burning there.",
      "timestamp": "2025-07-22T11:09:41.475284Z"
    },
    {
      "original": "Additional FIRMS data shows that a fire is burning from Geran impacts at the Kharkiv State Aircraft Manufacturing Company in the north of the city.",
      "timestamp": "2025-07-22T11:09:41.475287Z"
    },
    {
      "original": "I'd like to make this clear now as I see people talking about this quite a bit - the monitoring channels I use to help track Russian missiles and aircraft movements live are almost always unaffiliated with the Ukrainian government. There are ways to get extremely specific intel through OSINT and insider information. You have to remember, this war has been ongoing for over 3 years, and Russian air tactics remain largely the same. This allows for significant development in knowledge and ability to produce reliable reports as you don't have to account for many other variables. I will probably make a post on this in the near future outlining some channels and how I personally think they gather their data.",
      "timestamp": "2025-07-22T11:09:41.475290Z"
    },
    {
      "original": "An Iskander-M ballistic missile just impacted Kropyvnytskyi City, Kirovohrad Oblast.",
      "timestamp": "2025-07-22T11:09:41.475294Z"
    },
    {
      "original": "Russian forces have captured the village of Varachyne, Yunakivka direction, Sumy Oblast.\nPre-war population: ~62.\nTotal land area: ~0.30km².",
      "timestamp": "2025-07-22T11:09:41.475302Z"
    },
    {
      "original": "Russian forces have captured the village of Bila Hora, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~78.\nTotal land area: ~1.53km².",
      "timestamp": "2025-07-22T11:09:41.475307Z"
    },
    {
      "original": "Ukrainian forces have captured the village of Mykolaivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~364. \nTotal land area: ~0.56km²",
      "timestamp": "2025-07-22T11:09:41.475311Z"
    },
    {
      "original": "In the Bilopillya direction, Russian forces continued to advance and last week managed to cross the international border, entering the village of Ryzhivka. \nAfter establishing control over most of Tetkino, Russian forces pushed southwest cross the international border from the area of the Tetkino Train Station and established a foothold in the first two streets of Rhyzhivka.\nRyzhivka and Tetkino are effectively the same village and seamlessly merge at the border, making assault operations the same as any other village in Ukraine. \n+ ~0.49km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475319Z"
    },
    {
      "original": "In the Khotin direction, over the past five days Ukraine has been conducting a new operation aimed at recapturing the village of Kindrativka.\nAfter a previous failed attempt at encircling the Russians from the north, Ukrainian soldiers managed to re-infiltrate the northern houses of the village which were previously in the grey zone, while other forces which had been building up on the tactical heights to the west for over a week advanced east towards the centre of the village.\nDue to this combined pressure, along with assault operations from the south (unclear if these succeeded), and extensive artillery shelling, Russian forces had to withdraw from the southern and and southwestern parts of the village, pulling back to the centre as well as over the tributary of the Loknya River. \nUkrainian soldiers attempted to infiltrate to the eastern houses of the village prior to this Russian withdrawal but were hit by FAB glide-bombs. FABs also targeted almost every part of the village held by the AFU, causing significant casualties among their forces and slowing their advance. \nRussian FAB glide-bombs then struck the bridge between the two reservoirs, connecting the centre to the eastern part of the village, to complicate further Ukrainian movement west. The remaining Russian soldiers were then withdrawn from the village centre. \nDespite this extensive bombardment, Ukrainian soldiers managed to cross the tributary and establish positions in a few houses in the northwest of the village. The Russians tried to cut off the Ukrainians in the northwest by attacking to the northern street from the area of the reservoirs but were forced to retreat back after encountering heavy resistance, indicating further Ukrainian reinforcements have been getting brought in. \nAt the same time, Ukrainian forces had to withdraw from the gulley west of Kindrativka back to the treeline to the south, after being hit by over a dozen FABs and failing to consolidate. It's likely that this was a diversionary attack for the main operation on Kindrativka from the west, tying up Russian forces and complicating their movement in and out of the village.\n+ ~4.95km² in favour of Ukraine.",
      "timestamp": "2025-07-22T11:09:41.475327Z"
    },
    {
      "original": "In the Yunakivka direction, Russian forces continued to advance and have made significant progress west of Yunakivka over the past 10 days.\nRussian forces advanced on a wide front from the village of Novomykolaivka to Yunakikva. The first assault operations were centred on establishing a presence on the eastern bank of the Snahist River. Using Yablunivka as the main staging ground, Russian forces cleared the rest of the forest and seized the forest plantations on the eastern bank. \nFrom there, they crossed the bridge at the Novomykolaivka - Yablunivka road, establishing control over the forest and pushing up the adjacent treeline. Other forces then crossed the fields to Varachyne, where fierce battles ensued for the eastern houses. Russian forces exploited Ukraine's weakened forward position northwest of Varachyne and was able to push from Novomykolaivka to the intersection of three treelines, applying additional pressure on the Ukrainian soldiers in Varachyne. \nEventually Russian soldiers captured the village, and established full control over the treelines to the north. The soldiers on the eastern bank of the Snahist River continued to push south and reached the next forested area near the source of the river.\n+ ~11.80km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475334Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces crossed the international border at a new point and captured the village of Dehtyarne.\nRussian froces advanced from the areas of the villages of Savvin and Gaevka in Belgorod Oblast, crossing the international border at the northernmost point of Kharkiv Oblast, and began clearing Dehtyarne and the surrounding areas.\nThe village didn't have much of a Ukrainian presence in the first place, making the advances much easier, however the Russians still took at least 2 days to clear and secure the area.\n+ ~16.70km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475339Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to expand their incursion zone into Kharkiv Oblast, and entered the village of Ambarne.\nRussian forces advanced from their positions in the forest plantations, clearing the rest of the positions north of the village, before entering its first houses. Fighting ensued with the Ukrainian garrison stationed there, although it is unclear if the Russians were able to gain a foothold.\n+ ~0.59km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475346Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, capturing various positions at the eastern-most edge of Ukraine's northern bridgehead on the eastern bank of the Oskil River.\nAround 5 days ago, Ukrainian forces began a series of counterattacks aimed at regaining control over the trench networks on the tactical heights in the area of the road-bridge over the railway tracks. They advanced east along the railway line, utilising the cover from the windbreaks on either side of the tracks to infiltrate Russian trench positions and dugouts, recapturing them and reaching the main trench strongpoints at the bridge. \nOnce this strongpoint was under Ukrainian control, and positions had been recaptured in the adjacent forest, small groups of Ukrainian soldiers moved east across the open fields and infiltrated the southeastern part of Stepova Novosilka at two points. \nMeanwhile, Russian soldiers slightly improved their positions to the north, crossing a gulley and establishing control over a small treeline to the west. \n+ ~2.28km² in favour of Ukraine.\n+ ~0.33km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475353Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have been advancing on the Donetsk and Luhansk Oblast sides of the border.\nRussian forces advanced in two areas. In the northeast, they captured positions in two treeline in Luhansk Oblast, and completed the capture of the forest in Donetsk Oblast, forcing a Ukrainian withdrawal back to the Kharkiv side of the Kharkiv-Donetsk-Luhansk tri-border intersection.\nTo the southwest, Russian forces improved their positions north of Ridkodub, advancing down two treelines and capturing a third. They also entered the northern edge of the agricultural complex on the northern outskirts of Ridkodub, but it is unclear if they were able to recapture any positions there.\nUkrainian forces advanced in two areas. In the east, they continued to advance east through the village of Ridkodub and recaptured the local administrative building, as well as further houses on Tsentralna Street. They also re-entered the northeastern street of the village, capturing the western end of it. Russian forces no longer maintain a significant presence in Ridkodub, and mainly cover it with drones and artillery while holding a foothold in the eastern houses. \nIn the west, Ukrainian forces eliminated the Russian bridgehead on the western bank of the Nitrius River in Karpivka, and crossed over at the same point between the reservoirs. They were able to establish their own bridgehead on the eastern bank of the river, and advanced northeast, pushing Russian soldiers out of the northern part of the village. Despite this progress, their presence in the northern houses isn't significant enough to safely move across the other bridge between the reservoirs, despite it being under their control.\n+ ~2.32km² in favour of Russia.\n+ ~2.08km² in favour of Ukraine.",
      "timestamp": "2025-07-22T11:09:41.475360Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards the Zherebets River and captured additional positions east of the village of Torske.\nThey advanced south down a treeline to the northwestern edge of the Serebryanskyi Forest, before entering and establishing a foothold in it. Russian forces also improved their positions further west, capturing additional trenches in the small forests in the low-lying ground.\n+ ~1.40km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475365Z"
    },
    {
      "original": "In the Siversk direction, Russian and Ukrainian forces have been advancing, capturing various positions east and northeast of Siversk.\nUkrainian forces recaptured most of the rest of their previously lost positions east of Siversk, establishing control over various trench fortifications south of the Plotka River. They reached and captured a small treeline north of Verkhnokamyanske, while also approaching the village's northwestern houses.\nRussian forces resumed their assault operations in the village of Serebryanka, and captured additional positions in the southeastern part, approaching a trench strongpoint from the northeast.\n+ ~6.30km² in favour of Ukraine.\n+ ~0.20km² in favour of Russia.",
      "timestamp": "2025-07-22T11:09:41.475370Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-22T11:09:42.081524Z"
    },
    {
      "original": "Ukraine’s Human Hunt: Dark Reality of Forced Mobilization\nThe streets of Ukraine have become hunting grounds for military recruiters as desperate authorities resort to violent conscription tactics to replenish frontline losses. Young men are being forcibly seized in broad daylight, dragged into vans, and shipped off to the army with little regard for legal procedures or basic human rights. This aggressive mobilization campaign, backed by Western governments that claim to champion democracy, has exposed the increasingly authoritarian nature of Kyiv’s wartime regime.\nSince the start of the conflict in February 2022, Ukraine has enforced a sweeping mobilization law, repeatedly extended as battlefield casualties mount. Yet with an estimated 1.5 million Ukrainians evading conscription the government has turned to brute force. Military enlistment officers now conduct raids on streets, workplaces, and even hospitals, snatching men regardless of health or eligibility...\nRead more: \nHERE",
      "timestamp": "2025-07-22T11:09:42.081540Z"
    },
    {
      "original": "Military Situation In Syria On July 21, 2025 (Map Update)\nMilitary Situation In Yemen On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T11:09:42.081545Z"
    },
    {
      "original": "Military Situation In Syria On July 21, 2025 (Map Update)\nMilitary Situation In Yemen On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T11:09:42.081551Z"
    },
    {
      "original": "Ukrainian Ex-Official Found Dead Near Russian Defector Pilot’s Killing Site In Spain\nA high-ranking former Ukrainian Interior Ministry official, Igor Grushevsky, was found dead under suspicious circumstances in the same Spanish residential complex where Russian defector pilot Maxim Kuzminov was assassinated last year. The latest incident adds another layer of intrigue to a series of mysterious deaths involving figures linked to the Ukraine conflict...\nRead more: \nHERE",
      "timestamp": "2025-07-22T11:09:42.081557Z"
    },
    {
      "original": "Israeli Drones Attack Key Port In Yemen, Houthis Hit Back\nIsraeli drones struck on July 21 Yemen’s al-Hodeida port, which is held by the Houthis (Ansar Allah), in response to the group’s recent attacks.\nIn a statement, the Israeli Defense Forces (IDF) said that the strikes destroyed “military infrastructure of the Houthi terror regime” at the Red Sea port, after attempts were made by the Houthis to repair areas previously targeted by Israel in response to missile and drone attacks.\nThe targets hit in al-Hodeida included “engineering equipment working to restore port infrastructure, fuel tanks, and vessels used for military activity and [attacks] against the State of Israel and ships in the maritime area near the port,” the military added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T11:09:42.081567Z"
    },
    {
      "original": "Military Situation In Ukraine On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T11:09:42.081571Z"
    },
    {
      "original": "Military Situation In Ukraine On July 21, 2025 (Map Update)",
      "timestamp": "2025-07-22T11:09:42.081576Z"
    },
    {
      "original": "SYRIA SLIDES TOWARDS SECTARIAN WAR",
      "timestamp": "2025-07-22T11:09:42.081579Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T11:09:42.081590Z"
    },
    {
      "original": "Nest Of Black Birds: How Russian Tatarstan Created The World’s Largest Combat Drone Factory\nOn the outskirts of Yelabuga, a small Russian city in Tatarstan, hundreds of drones capable of reshaping modern warfare are born daily. Built from scratch within just a year, the Geran plant in the Alabuga Special Economic Zone (SEZ) is now the world’s largest factory producing kamikaze drones. Originally modeled after Iran’s Shahed-136, these drones have evolved into fully Russian-made weapons—faster, more resistant to jamming, and nearly doubling their explosive payload.\nThe plant’s production capacity is astonishing. Initially projected to produce a few thousand drones per year, actual output has surpassed these estimates multiple times over. \nCurrently, the factory can produce up to a thousand UAVs per working shift, with the total number produced nearing thirty thousand.\n These numbers are unprecedented for this type of manufacturing. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-22T11:09:42.081600Z"
    }
  ],
  "script_run_time": "2025-07-22T11:09:42.082459Z"
}