{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-24T22:33:12.426659Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова з півночі та північного заходу.",
      "timestamp": "2025-12-24T22:33:12.426676Z"
    },
    {
      "original": "🛵\n БпЛА на сході і заході Харківщини, на сході Полтавщини курсом на Дніпропетровщину.",
      "timestamp": "2025-12-24T22:33:12.426682Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-24T22:33:12.426687Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на Запорізьку область (вектор - Новомиколаївка).",
      "timestamp": "2025-12-24T22:33:12.426692Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Сум з південного заходу.",
      "timestamp": "2025-12-24T22:33:12.426696Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-12-24T22:33:12.426701Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Кам'янське/м.Дніпро з півночі.",
      "timestamp": "2025-12-24T22:33:12.426710Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з північного заходу.",
      "timestamp": "2025-12-24T22:33:12.426715Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного сходу.",
      "timestamp": "2025-12-24T22:33:12.426720Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-24T22:33:12.426725Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/схід Дніпропетровщини.",
      "timestamp": "2025-12-24T22:33:12.426730Z"
    },
    {
      "original": "🛵\n БпЛА на заході Харківщини, курс - південний (Дніпропетровщина);\n🛵\n Дніпропетровщина: \n- БпЛА на сході області в напрямку на/повз Шахтарське, Межову, Письменне,\n- БпЛА в напрямку на/повз Дніпровське, Кам'янське, Магдалинівку в південно-західному напрямку (вектор - Криворізький р-н);\n🛵\n Запорізька область: БпЛА повз Запоріжжя на півдні західним курсом;\n🛵\n БпЛА на півдні Донеччини курсом на схід Дніпропетровщини;\n🛵\n БпЛА в акваторії Чорного моря, курс - довільний.",
      "timestamp": "2025-12-24T22:33:12.426743Z"
    },
    {
      "original": "🛵\n БпЛА  на півдні Миколаївщини, курс - Одещина.",
      "timestamp": "2025-12-24T22:33:12.426749Z"
    },
    {
      "original": "🛵\n БпЛА в Білгород-Дністровському районі Одещини курсом на південь Одеси із заходу.",
      "timestamp": "2025-12-24T22:33:12.426754Z"
    },
    {
      "original": "🛵\n БпЛА на м.Запоріжжя з півночі.",
      "timestamp": "2025-12-24T22:33:12.426758Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: \n- БпЛА на півдні від обласного центру повз Яворницьке в західному напрямку,\n- БпЛА повз Томаківку на півночі західним курсом (Запорізька обл.);\n🛵\n Одещина: БпЛА в напрямку Сарати зі сходу,\n🛵\n БпЛА в акваторії Чорного моря, курс - Одещина.\n🛸\n🛸\n Активність ворожих розвідувальних БпЛА на півночі та сході Сумщини.",
      "timestamp": "2025-12-24T22:33:12.426770Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку Сум з півночі та Путивля з північного сходу.",
      "timestamp": "2025-12-24T22:33:12.426776Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині з Дністровського лиману в напрямку н.п.Біляївка/Маяки.",
      "timestamp": "2025-12-24T22:33:12.426780Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Чорноморська (Одещина).",
      "timestamp": "2025-12-24T22:33:12.426787Z"
    },
    {
      "original": "Explosions in Shepetivka, Khmelnytskyi Oblast.",
      "timestamp": "2025-12-24T22:33:13.243040Z"
    },
    {
      "original": "The remaining 2 Tu-95MS carried out launch maneuvers from Arkhangelsk Oblast. \nIf these are real, they should enter Ukrainian airspace in the next 70-100 minutes.",
      "timestamp": "2025-12-24T22:33:13.243054Z"
    },
    {
      "original": "The remaining 2 Tu-95MS carried out launch maneuvers from Arkhangelsk Oblast.   If these are real, they should enter Ukrainian airspace in the next 70-100 minutes.",
      "timestamp": "2025-12-24T22:33:13.243058Z"
    },
    {
      "original": "These launches were likely simulated, meaning that the missile attack (or at least most of it) is now over. More than 30 missiles of various types were used. I will publish a full report + the consequences later on. \nIf you wish to support my work, you can do so here: \nhttps://buymeacoffee.com/amk_mapping\n. \nThank you for following along.",
      "timestamp": "2025-12-24T22:33:13.243064Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~14 Kh-101 cruise missiles launched from 7 Tu-95MS strategic bombers at their launch lines in southern Nizhny Novgorod Oblast.\n~6 Kh-101 cruise missiles launched from 3 Tu-95MS strategic bombers at their launch lines in Kalachyovksy District, Volgograd Oblast.\n~10 Kh-101 cruise missiles launched from 2 Tu-160M strategic bombers at their launch lines in southern Nizhny Novgorod Oblast.\n~4 Kinzhal hypersonic aeroballistic missiles launched from 4 MiG-31K fighters at their launch lines in the vicinity of Lipetsk City, Lipetsk Oblast.\n-----------------------\nUkrainian air defence work:\nAs of the time of writing, Ukrainian air defence is confirmed to have intercepted at least 9 Kh-101 cruise missiles.\n-----------------------\nThe main targets for this strike were Ukrainian energy infrastructure. The following was targeted:\n\"Zhytomyr\" 330 kV electrical substation, Zhytomyr Oblast (50.29100, 28.69980) by ~5 Kh-101s.\n\"Shepetivka\" 330 kV electrical substation, Khmelnytskyi Oblast (50.14639, 27.0579) by ~9 Kh-101s and ~4 Kinzhals.\nUnknown target in southern Khmelnytskyi Oblast by ~5 Kh-101s\nUnknown target near the Ivano-Frankivsk - Ternopil border by ~5 Kh-101s\n-----------------------\nKeep in mind, the numbers of missiles launched may be slightly higher than what I've listed, as the number of missiles detected is often lower than actual launches.",
      "timestamp": "2025-12-24T22:33:13.243081Z"
    },
    {
      "original": "Smoke was seen rising over Zhytomyr city following a series of Russian Kh-101 cruise missile strikes this morning. \nThe strikes targeted the city's 330 kV electrical substation, resulting in widespread power outages.",
      "timestamp": "2025-12-24T22:33:13.243085Z"
    },
    {
      "original": "This morning, a Russian Geran-2 drone struck the roof of an apartment building in Kyiv.\nJudging by the speed of the drone, the altitude change, and how it was tilting towards the end of its flight, it was likely under the influence of Ukrainian electronic warfare.\nAt least four civilians were injured.",
      "timestamp": "2025-12-24T22:33:13.243090Z"
    },
    {
      "original": "This morning, a Russian Geran-2 drone struck the roof of an apartment building in Kyiv.\nJudging by the speed of the drone, the altitude change, and how it was tilting towards the end of its flight, it was likely under the influence of Ukrainian electronic warfare.\nAt least four civilians were injured.",
      "timestamp": "2025-12-24T22:33:13.243095Z"
    },
    {
      "original": "Overnight, dozens of Russian Geran-2 drones attacked the city of Rivne. \nThe main target was the city's 330 kV electrical substation, where a large fire subsequently broke out. Widespread power outages are reported.",
      "timestamp": "2025-12-24T22:33:13.243099Z"
    },
    {
      "original": "Overnight, dozens of Russian Geran-2 drones attacked the city of Rivne. \nThe main target was the city's 330 kV electrical substation, where a large fire subsequently broke out. Widespread power outages are reported.",
      "timestamp": "2025-12-24T22:33:13.243103Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their offensive and have made significant progress over the last few days.\nFollowing a brief partial-stabilisation of the situation, Russian forces intensified their assault operations once again and collapsed the northern section of Ukraine's defence. They repelled the most recent Ukrainian counterattacks north of the Haichur River which were aimed at expanding their bridgehead and began pushing back from the area of the agricultural buildings, eventually eliminating Ukraine's bridgehead altogether. \nFrom there, building on their momentum, Russian forces crossed the Haichur River into the western part of Hulyaipole, establishing a foothold on Travnya 1st street in the area of the school and the intersection with Michurina Street. The bridgehead was subsequently connected with the older bridgehead to the northwest, forming a solid front against Ukrainian defences in the western part of the city. \nThese attacks across the Haichur River were done in coordination with assault operations in the city centre. Russian forces advanced from their bridgehead in the area of the hospital complex and captured the local high school, the police station, and the district museum. Once these main strongpoints were taken, they pushed further northwest to Luhova Street and linked up with the larger bridgehead in the western part of the city. They also further expanded their zone of control in the city centre, capturing additional 3-story apartment buildings and the city's administrative building. Attacks are now underway on the western part of the city centre in the direction of the northeastern edge of the Ukrainian stronghold in the high-rise blocks. \nTo the south, Russian forces managed to eliminate the Ukrainian pocket in the eastern part of Hulyaipole. It's unclear how many soldiers managed to escape the operational encirclement. From there, they captured rest of the southern low-rise residential streets, while other forces managed to consolidate in at least 9 high-rise buildings of the main stronghold. Additionally, the earlier Ukrainian counterattacks west of the high-rise blocks were repelled, however Russian progress has significantly slowed here. \n+ ~4.12 km² in favour of Russia.",
      "timestamp": "2025-12-24T22:33:13.243111Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovs'ke directions, Russian forces have intensified their assault operations, making significant progress over the last week.\nIn the north, following weeks of DRG infiltrations under the cover of fog and poor weather conditions, ordinary assault groups began taking up positions in multiple villages. Russian forces managed to consolidate in the remaining treelines and forested areas east of the Haichur and south of the Yanchur Rivers, which they used to accumulate in before crossing the Haichur River, infiltrating and quickly establishing control over the village of Pishchane.\nOther forces advanced west along the northern bank of the Yanchur River from the area of the Hulyaipole - Pokrovs'ke highway and captured the village of Ostapivske and the surrounding treelines. Other forces improved their positions southwest of Vidradne, capturing new treeline positions. From there, they pushed north from Ostapivske to the neighbouring village of Andriivka and consolidated in its southern streets. Assault operations were then carried out further north, allowing for the Russians to bring most of the settlement under their control. Fighting continues for the northern streets, which remain in the grey-zone.\nIn the south, following earlier infiltrations, Russian forces managed to consolidate in the treelines across the Haichur River west of Nove Zaporizhzhya. Other assault groups continued expanding their main bridgehead by advancing further north and linked up with this smaller bridgehead west of Nove Zaporizhzhya. \n+ ~24.33 km² in favour of Russia.",
      "timestamp": "2025-12-24T22:33:13.243117Z"
    },
    {
      "original": "In case you haven't noticed, Telegram keeps randomly turning off comments on certain posts. That's why I sometimes have to delete and then repost the same thing.",
      "timestamp": "2025-12-24T22:33:13.243120Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces intensified their assault operations and have made significant progress in recapturing previously lost positions over the last week.\nIn the west, Russian forces continued to advance and managed to consolidate along the road from Filiya, allowing for them to enter Novopavlivka from the southwest and link up with their formations which were previously operationally encircled there. A large grey-zone remains in part of southern Novopavlivka.\nTo the southeast, Russian forces began pushing the Ukrainians back from the fortifications south of Novopavlivka. They advanced from their positions east and west of the strongpoints north of the gulley, dislodging the Ukrainians from their positions there and beginning a push north towards the northern gulley. They were able to establish control over the forested areas there, while other forces consolidated in the treelines northeast of Filiya.\nIn the east, Russian forces advanced on a wide front northwest of Horikhove, pushing north up five parallel treelines and establishing control over the perpendicular treelines to the north. Other assault groups cleared the treelines northwest of Horikhove, further shrinking the Ukrainian salient east of Novopavlivka.\n+ ~18.60 km² in favour of Russia.",
      "timestamp": "2025-12-24T22:33:13.243127Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance west of Pokrovsk and have made new progress in three different areas.\nIn the southwest, Russian forces consolidated in the rest of the railway windbreaks between Udachne and Molodetske and began assault operations to the north, with the goal of outflanking the Pokrovsk Coal Mine, which was recently recaptured by Ukraine. They managed to advance north up the treeline west of Udachne, while other forces improved their positions in the forested gulley southwest of the mine.\nIn the northeast, Russian forces improved their positions along the railway line south of Hryshyne, capturing new positions in the windbreaks there, and established control over a treeline to the south. Other assault groups continued their incremental advance through Hryshyne and secured new positions in the residential streets south of the village centre.\n+ ~4.26 km² in favour of Russia.",
      "timestamp": "2025-12-24T22:33:13.243132Z"
    },
    {
      "original": "Boys, I assembled the giga-chads to give you a special Christmas gift.\nThank you AMK and History Legends for spending some time with me for Christmas. \nThank you legends at home for supporting me all year.\nEnjoy\nhttps://youtu.be/IugDI2G-BLw",
      "timestamp": "2025-12-24T22:33:13.243142Z"
    },
    {
      "original": "As usual with these peace plans, I won't really cover them.\nThis new 20-point plan proposed by Zelensky is based entirely on idealism and only serves as a way to label Russia as unwilling to negotiate. They know Russia won't accept this; the same way Russia knows Ukraine won't accept their demands. It's all informational and is one of the reasons why I constantly say this war will be fought to its conclusion. \nRussia is the stronger side and is the side which is currently winning. Attritional warfare doesn't care about morals, your feelings, or what's \"right\" and \"wrong\". The stronger side wins and the weaker side loses. It might suck, and it might be a horrible thing to accept for many, but that's just the reality of how this works. \nIt either side is truly trying to achieve a lasting peace, any realistic agreements need to take into account the battlefield reality, not what either side \"deserves\" to have. The actual reality on the ground is what influences negotiations, not what people claim is right or wrong morally.",
      "timestamp": "2025-12-24T22:33:13.243148Z"
    },
    {
      "original": "Merry Christmas everyone! \nIt's now the 25th of December for me in New Zealand, which is quite insane. To those who celebrate it, I hope you have a great time with your family on this holiday occasion. \nI'm looking forward to 2026 which I hope will be another great year of reporting for me. Thank you all for following and supporting, it means the world :)",
      "timestamp": "2025-12-24T22:33:13.243153Z"
    },
    {
      "original": "Unlike last year, no large-scale missile attack on Ukraine is expected this Christmas. \nHowever, preparations for the next series of strikes are ongoing: \nThe 4 MiG-31K fighters which took part in the most recent attack redeployed from Lipetsk-2 Airbase, Lipetsk Oblast to Savasleika Airbase, Nizhny Novgorod Oblast. They will be equipped with Kinzhal hypersonic aeroballistic missiles there. \nPart of southwestern Ryazan Oblast’s airspace in the area of the MiG-31K launch lines is currently closed, which means there is a threat of Kinzhal launches for the near future. \nThe Tu-95MS and Tu-160 strategic bombers which took part in the most recent attack are in the process of being equipped with Kh-101 cruise missiles at Engels-2 Airbase and then redeploying to the far east.\nThere is still an unprecedented accumulation of Geran-2 drones at launch sites surrounding Ukraine, and a large number of Iskander-M ballistic missiles and Iskander-K cruise missiles that are ready be used.\n3 Tu-22m3 strategic bombers carried out a scheduled training flight over the eastern Black Sea from Shaykovka Airbase, Kaluga Oblast. \n3 Tu-22m3 strategic bombers carried out a scheduled training flight from Olenya Airbase, Murmansk Oblast with the help of an Il-78M tanker for refueling.",
      "timestamp": "2025-12-24T22:33:13.243162Z"
    },
    {
      "original": "This afternoon, a Russian Tornado-S rocket struck the Kharkiv TEC-5 combined heat and power plant in Kharkiv City. A fire broke out afterwards.",
      "timestamp": "2025-12-24T22:33:13.243165Z"
    },
    {
      "original": "This afternoon, a Russian Tornado-S rocket struck the Kharkiv TEC-5 combined heat and power plant in Kharkiv City. A fire broke out afterwards.",
      "timestamp": "2025-12-24T22:33:13.243171Z"
    },
    {
      "original": "Military Situation In Ukraine On December 24, 2025 (Maps Update)",
      "timestamp": "2025-12-24T22:33:14.074246Z"
    },
    {
      "original": "Military Situation In Ukraine On December 24, 2025 (Maps Update)",
      "timestamp": "2025-12-24T22:33:14.074263Z"
    },
    {
      "original": "Russian Army Expands Bridgehead Across Haichur Amid Ukrainian Collapse In Huliaipole (Videos)\nOn December 24, the Russian military expanded its bridgehead across the Haichur River by capturing another settlement on the left bank.\nThe capture of the settlement, Zarechnoye, in Zaporozhye was announced by the Russian Ministry of Defense, which said that the 36th Separate Guards Motorised Brigade of the Vostok [East] Group of Forces' 29th Guards Combined Arms Army led the attack there.\nFurther south along the river, the Vostok Group of Forces is rapidly expanding its control within the key city of Huliaipole and Kiev forces are retreating.\nRussian troops broke through yet another Ukrainian defense line in the center of the city, this time along Petrovskoho Street.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074273Z"
    },
    {
      "original": "Russian Army Expands Bridgehead Across Haichur Amid Ukrainian Collapse In Huliaipole (Videos)\nOn December 24, the Russian military expanded its bridgehead across the Haichur River by capturing another settlement on the left bank.\nThe capture of the settlement, Zarechnoye, in Zaporozhye was announced by the Russian Ministry of Defense, which said that the 36th Separate Guards Motorised Brigade of the Vostok [East] Group of Forces' 29th Guards Combined Arms Army led the attack there.\nFurther south along the river, the Vostok Group of Forces is rapidly expanding its control within the key city of Huliaipole and Kiev forces are retreating.\nRussian troops broke through yet another Ukrainian defense line in the center of the city, this time along Petrovskoho Street.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074282Z"
    },
    {
      "original": "Ukraine Faces More Pressure In Kostiantynivka As Russian Troops Storm City In New Area (Videos)\nOn December 23 and 24, the Russian military stormed the key city of Kostiantynivka in Donetsk from a new direction, and made gains in three nearby areas, mounting more pressure on Kiev forces there.\nThe Yug [South] Group of Forces stormed the eastern part of Kostiantynivka after breaking through a Ukrainian defense line in the city’s outskirts. Russian troops advanced from their positions to the north of Predtechyne, to the east of the city, along a tree line before storming Sportyvna street. The troops captured a large residential area along the street, securing a presence there.\nMeanwhile to the south of Kostiantynivka, the Yug Group of Forces expanded its control by securing some four square kilometers to the west of Plescheevka. Russian troops advanced mainly in forested areas along the northern bank of the Kleban-Byk reservoir.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074291Z"
    },
    {
      "original": "Ukraine Faces More Pressure In Kostiantynivka As Russian Troops Storm City In New Area (Videos)\nOn December 23 and 24, the Russian military stormed the key city of Kostiantynivka in Donetsk from a new direction, and made gains in three nearby areas, mounting more pressure on Kiev forces there.\nThe Yug [South] Group of Forces stormed the eastern part of Kostiantynivka after breaking through a Ukrainian defense line in the city’s outskirts. Russian troops advanced from their positions to the north of Predtechyne, to the east of the city, along a tree line before storming Sportyvna street. The troops captured a large residential area along the street, securing a presence there.\nMeanwhile to the south of Kostiantynivka, the Yug Group of Forces expanded its control by securing some four square kilometers to the west of Plescheevka. Russian troops advanced mainly in forested areas along the northern bank of the Kleban-Byk reservoir.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074299Z"
    },
    {
      "original": "Russia Convicts 187 Foreign Mercenaries Fighting For Ukraine, Over 1,000 More Face Charges\n▪️\nRussian judicial authorities continue to sentence foreign citizens who fought on the side of the Armed Forces of Ukraine. According to the Russian Investigative Committee, \n1,036\n foreigners have so far been charged, with guilty verdicts already delivered against \n187\n of them. These figures were announced at an operational meeting in the Lugansk People's Republic, which discussed the investigation of crimes committed by Ukrainian armed formations.\n▪️\nOne of the most recent convicts is a \nColombian citizen, Blanco Lopez Oscar Mauricio\n. The 42-year-old mercenary was found guilty under the mercenarism statute. Court records show that in May 2024, he signed a contract with the 66th Separate Mechanized Brigade of the Armed Forces of Ukraine, received weapons, and was appointed as a rifleman-medic. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074312Z"
    },
    {
      "original": "Russia Convicts 187 Foreign Mercenaries Fighting For Ukraine, Over 1,000 More Face Charges\n▪️\nRussian judicial authorities continue to sentence foreign citizens who fought on the side of the Armed Forces of Ukraine. According to the Russian Investigative Committee, \n1,036\n foreigners have so far been charged, with guilty verdicts already delivered against \n187\n of them. These figures were announced at an operational meeting in the Lugansk People's Republic, which discussed the investigation of crimes committed by Ukrainian armed formations.\n▪️\nOne of the most recent convicts is a \nColombian citizen, Blanco Lopez Oscar Mauricio\n. The 42-year-old mercenary was found guilty under the mercenarism statute. Court records show that in May 2024, he signed a contract with the 66th Separate Mechanized Brigade of the Armed Forces of Ukraine, received weapons, and was appointed as a rifleman-medic. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074324Z"
    },
    {
      "original": "GULYAIPOLE'S FATE SEALED, RUSSIAN COMMAND SHIFTS FOCUS TO SLAVYANSK BREAKTROUGH",
      "timestamp": "2025-12-24T22:33:14.074328Z"
    },
    {
      "original": "Myrnohrad In Flames:  Russia Tightens Noose Around Ukrainian Garrison \nA critical situation is developing for Ukrainian troops in the Pokrovsk sector. According to member of Ukrainian Parliament, Roman Kostenko, Ukrainian units in Myrnohrad are under operational encirclement, making it impossible to deliver supplies. \nUnits of the \"Center\" grouping continue to destroy the encircled forces in Myrnohrad and are conducting clearing operations in the Rodynske area. \nIn Sumy, assault groups advanced more than 600 meters in several areas, including north of Sumy, putting pressure on the entire defense system in the region. As a result of these actions, a number of servicemen, including officers, were isolated and captured, which indicates the disorganization of Ukrainian units.\nAmid these successes, information has emerged about potential diplomatic initiatives.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074337Z"
    },
    {
      "original": "Myrnohrad In Flames:  Russia Tightens Noose Around Ukrainian Garrison \nA critical situation is developing for Ukrainian troops in the Pokrovsk sector. According to member of Ukrainian Parliament, Roman Kostenko, Ukrainian units in Myrnohrad are under operational encirclement, making it impossible to deliver supplies. \nUnits of the \"Center\" grouping continue to destroy the encircled forces in Myrnohrad and are conducting clearing operations in the Rodynske area. \nIn Sumy, assault groups advanced more than 600 meters in several areas, including north of Sumy, putting pressure on the entire defense system in the region. As a result of these actions, a number of servicemen, including officers, were isolated and captured, which indicates the disorganization of Ukrainian units.\nAmid these successes, information has emerged about potential diplomatic initiatives.\nRead more \nHERE",
      "timestamp": "2025-12-24T22:33:14.074346Z"
    }
  ],
  "script_run_time": "2025-12-24T22:33:14.075265Z"
}