{
  "messages": [
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-10-04T21:00:33.820978Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщину! Південно-східний напрямок!",
      "timestamp": "2025-10-04T21:00:33.820992Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Суми з півночі! \n🛵\n \"Шахеди\" у центрі Сумщини \n➡️\n курсом на південь. \n🛵\n Ворожі БпЛА на півночі Сумщини \n➡️\n курсом на південь.",
      "timestamp": "2025-10-04T21:00:33.821003Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n курсом на Шостку.",
      "timestamp": "2025-10-04T21:00:33.821013Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщину! Південно-східний напрямок!",
      "timestamp": "2025-10-04T21:00:33.821017Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-10-04T21:00:33.821022Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА \n➡️\n в напрямку Шевченкового.",
      "timestamp": "2025-10-04T21:00:33.821028Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-10-04T21:00:33.821032Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину!",
      "timestamp": "2025-10-04T21:00:33.821037Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Короп та Новгород-Сіверський.",
      "timestamp": "2025-10-04T21:00:33.821042Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n у напрямку Павлограда.",
      "timestamp": "2025-10-04T21:00:33.821050Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Короп та Новгород-Сіверський.",
      "timestamp": "2025-10-04T21:00:33.821056Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n повз Олишівку у напрямку Гончарівського.\n🛵\n Харківщина: БпЛА \n➡️\n через Балаклію.",
      "timestamp": "2025-10-04T21:00:33.821064Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n повз Олишівку у напрямку Гончарівського. \n🛵\n Харківщина: БпЛА \n➡️\n через Балаклію.",
      "timestamp": "2025-10-04T21:00:33.821074Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА \n➡️\n повз Вороніж.\n🛵\n Київщина: БпЛА \n➡️\n неподалік Чорнобиля.\n🛵\n Чернігівщина: БпЛА \n➡️\n курсом на Холми, Сосницю, Чернігів.",
      "timestamp": "2025-10-04T21:00:33.821085Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-10-04T21:00:33.821090Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА \n➡️\n повз Олишівку у напрямку Гончарівського. \n🛵\n Харківщина: БпЛА \n➡️\n через Балаклію.",
      "timestamp": "2025-10-04T21:00:33.821098Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини \n➡️\n курсом на Полтавщину.",
      "timestamp": "2025-10-04T21:00:33.821103Z"
    },
    {
      "original": "🛵\n Групи БпЛА із Харківщини \n➡️\n курсом на Полтавщину.",
      "timestamp": "2025-10-04T21:00:33.821109Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА залітають на Харківщину. Більшість тримають курс на Полтавщину.",
      "timestamp": "2025-10-04T21:00:33.821113Z"
    },
    {
      "original": "Швидкісна ціль на Запорізьку область!",
      "timestamp": "2025-10-04T21:00:33.821116Z"
    },
    {
      "original": "Швидкісна ціль на Запорізьку область!",
      "timestamp": "2025-10-04T21:00:33.821121Z"
    },
    {
      "original": "Дві цілі! Через Вільнянськ!",
      "timestamp": "2025-10-04T21:00:33.821125Z"
    },
    {
      "original": "🚀\n КАБ \n➡️\n на Запорізьку! Курс Оріхів!",
      "timestamp": "2025-10-04T21:00:33.821130Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА залітають на Харківщину. Більшість тримають курс на Полтавщину.",
      "timestamp": "2025-10-04T21:00:33.821136Z"
    },
    {
      "original": "🛵\n Групи БпЛА \n➡️\n у напрямку Полтави.",
      "timestamp": "2025-10-04T21:00:33.821142Z"
    },
    {
      "original": "🛵\n Херсонщина: БпЛА повз Верхній Рогачик \n➡️\n курсом на Нікополь.",
      "timestamp": "2025-10-04T21:00:33.821149Z"
    },
    {
      "original": "🛵\n Групи БпЛА \n➡️\n у напрямку Полтави.",
      "timestamp": "2025-10-04T21:00:33.821155Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n курсом на Кременчук, Нові Санжари, Диканьку, Полтаву!\n🛵\n Чернігівщина: БпЛА \n➡️\n на Чернігів, Ніжин, Семенівку.",
      "timestamp": "2025-10-04T21:00:33.821163Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА \n➡️\n курсом на Кременчук, Нові Санжари, Диканьку, Полтаву! \n🛵\n Чернігівщина: БпЛА \n➡️\n на Чернігів, Ніжин, Семенівку.",
      "timestamp": "2025-10-04T21:00:33.821171Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n курсом на Дніпро, Кривий Ріг, Кам'янське.",
      "timestamp": "2025-10-04T21:00:33.821176Z"
    },
    {
      "original": "The first Iskander disappeared. A second is following.",
      "timestamp": "2025-10-04T21:00:34.427202Z"
    },
    {
      "original": "Explosions were heard in Shostka",
      "timestamp": "2025-10-04T21:00:34.427211Z"
    },
    {
      "original": "3rd Iskander launch from Bryansk. Not in Ukrainian airspace yet.",
      "timestamp": "2025-10-04T21:00:34.427214Z"
    },
    {
      "original": "3rd Iskander launch from Bryansk. Not in Ukrainian airspace yet.",
      "timestamp": "2025-10-04T21:00:34.427218Z"
    },
    {
      "original": "Entering Ukrainian airspace, flying south to Shostka. These missiles are being launched from the vicinity of Bryansk City.",
      "timestamp": "2025-10-04T21:00:34.427221Z"
    },
    {
      "original": "Entering Ukrainian airspace, flying south to Shostka. These missiles are being launched from the vicinity of Bryansk City.",
      "timestamp": "2025-10-04T21:00:34.427224Z"
    },
    {
      "original": "Approaching Shostka",
      "timestamp": "2025-10-04T21:00:34.427227Z"
    },
    {
      "original": "Approaching Shostka",
      "timestamp": "2025-10-04T21:00:34.427231Z"
    },
    {
      "original": "Explosions in Shostka",
      "timestamp": "2025-10-04T21:00:34.427234Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued their assault operations south of the Vovcha River, and have recaptured previously lost positions in the western part of Vovchansk.\nAs a result of resumed attacks, Russian forces were able to advance to the Vovchansk Oil Extraction Plant, taking up positions in the buildings west of the railway line, as well as in the adjacent residential areas on and around Zaliznychna Street. From there, soldiers began infiltrating south along the railway line to rear of the main Ukrainian stronghold in the main part of the plant. \n+ ~0.23 km² in favour of Russia.",
      "timestamp": "2025-10-04T21:00:34.427240Z"
    },
    {
      "original": "Russian preparations for the next large-scale combined missile and drone attack on Ukraine are progressing. \n2 Tu-95MS strategic bombers were redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. They were equipped with Kh-101 cruise missiles at Ukrainka, and took part in training exercises over the Pacific near the Kuril Islands where launches of missiles were simulated with electronic warfare\n1 Tu-95MS redeployed from Engels-2 Airbase to Olenya Airbase, Murmansk Oblast. It has already been equipped with missiles.\n2 Tu-95MS and 1 Tu-160 have been carrying out daily training exercises from Engels-2 Airbase for the past 4 days in a row, where launches of Kh-101 missiles were simulated with electronic warfare\nAn An-124-100 \"Ruslan\" cargo plane landed at Engels-2 Airbase, likely carrying dozens of Kh-101 missiles for the 5 Tu-95s and 1 Tu-160 currently stationed there. \nAn IL-76MD cargo plane landed at Baltimore Airbase, Voronezh Oblast, likely carrying more Iskander-M ballistic missiles for OTRK installations in the region. \n1 IL-76MD cargo plane landed at Shaykovka Airbase, Kaluga Oblast. The cargo likely consists of Kh-22 cruise missiles for the Tu-22M3 strategic bombers stationed at Diaghilev Airbase, Ryazan Oblast, but it's possible that the cargo only included Geran-2/3 and Gerbera drones for launch sites in Bryansk and Smolensk Oblasts.\n1 An-26 cargo plane landed at Khalino Airbase, Kursk Oblast. The cargo consists of Geran-2/3 and Gerbera drones for the launch site at Khalino Airbase.\n1 An-26 cargo plane landed at Shatalovo Airbase, Smolensk Oblast. The cargo likely consists of Geran-2/3 and Gerbera drones for the launch site at Shaykovka Airbase, but it could also include Iskander-M ballistic missiles for the OTRK installations in Bryansk Oblast. \nMiG-31Ks are actively carrying out training missions from Savasleika Airbase, Nizhny Novgorod Oblast, without simulating launches of Kinzhal missiles.\nAccumulation of Geran-2/3 and Gerbera drones continues at most launch sites surrounding Ukraine, in addition to the arrival of new drones for future use.\nOverall, there is a high probability of a large-scale missile and drone attack in the next 3 days. 8 Tu-95MS and 1 Tu-160 are stationed at airbases near Ukraine, most/all of which are equipped or being equipped with missiles.",
      "timestamp": "2025-10-04T21:00:34.427252Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Nove Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~191.\nTotal land area: ~0.87km².",
      "timestamp": "2025-10-04T21:00:34.427260Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued their assault operations and have made further progress towards Pokrovske in two areas.\nIn the northeast, Russian forces continued to advance southwest of Sosnivka, and captured new treeline positions on the tactical heights. They then went on to push northwest towards the gulley, securing additional positions on the former Orestopil - Berestove Road.\nTo the southwest, Russian forces continued their assault operations in Verbove, and have established full control over the village. Since then, attacks have been carried out down the road west of the settlement, in the direction of Vyshneve.\n+ ~4.93 km² in favour of Russia.",
      "timestamp": "2025-10-04T21:00:34.427265Z"
    },
    {
      "original": "Russian preparations for the next large-scale combined missile and drone attack on Ukraine are progressing.   2 Tu-95MS strategic bombers were redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. They were equipped with Kh-101…",
      "timestamp": "2025-10-04T21:00:34.427271Z"
    },
    {
      "original": "There is activity on combat-related frequencies for Russian strategic aviation, suggesting that there is a high probability of a large-scale, combined missile attack on Ukraine tonight.\nMore info to come.",
      "timestamp": "2025-10-04T21:00:34.427275Z"
    },
    {
      "original": "There is activity on combat-related frequencies for Russian strategic aviation, suggesting that there is a high probability of a large-scale, combined missile attack on Ukraine tonight.  More info to come.",
      "timestamp": "2025-10-04T21:00:34.427280Z"
    },
    {
      "original": "There are very few Geran-2 drones in Ukrainian airspace right now. Due to the change in daylight hours, attacks are taking place later and later, meaning that drone launches will also take place later. Departures of Tu-95s are expected within the next three hours, however.",
      "timestamp": "2025-10-04T21:00:34.427283Z"
    },
    {
      "original": "Additional activity linked to Engels-2 Airbase has been detected. Departures of 1 Tu-160 and additional Tu-95MS from there are expected later on in the night.",
      "timestamp": "2025-10-04T21:00:34.427286Z"
    },
    {
      "original": "Launches of Geran-2 drones from Tsumbulova Test Site, Oryol Oblast, and Kacha Airbase, Crimea, have been recorded. \nThe ones from Tsumbulova are already approaching Ukrainian airspace.",
      "timestamp": "2025-10-04T21:00:34.427290Z"
    },
    {
      "original": "Additional launches of Geran-2 drones have been recorded from:\nKhalino Airbase, Kursk Oblast.\nMakiivka, Donetsk Oblast.\nCape Chauda, Crimea\nHvardiivske Airbase, Crimea\nShatalovo Airbase, Smolensk Oblast\nNavlya Test Site, Bryansk Oblast\n(not all of these are confirmed)",
      "timestamp": "2025-10-04T21:00:34.427298Z"
    },
    {
      "original": "There is a high risk of launches of Iskander-M ballistic missiles from Voronezh and Rostov Oblasts in the coming hours.",
      "timestamp": "2025-10-04T21:00:34.427301Z"
    },
    {
      "original": "Additional launches of Geran-2 drones have been recorded from:  Khalino Airbase, Kursk Oblast. Makiivka, Donetsk Oblast. Cape Chauda, Crimea Hvardiivske Airbase, Crimea Shatalovo Airbase, Smolensk Oblast Navlya Test Site, Bryansk Oblast  (not all of these…",
      "timestamp": "2025-10-04T21:00:34.427304Z"
    },
    {
      "original": "Launches of Geran-2 drones have now been reported from 10 directions, each with one launch.",
      "timestamp": "2025-10-04T21:00:34.427307Z"
    },
    {
      "original": "The airspace in the area of the Tu-95MS launch lines in Saratov Oblast has been closed for civilian aircraft.",
      "timestamp": "2025-10-04T21:00:34.427311Z"
    },
    {
      "original": "There are currently at least 60 Geran-2/Gebera drones detected in Ukrainian airspace.",
      "timestamp": "2025-10-04T21:00:34.427314Z"
    },
    {
      "original": "Launches of Geran-2/Gerbera drones have now taken place from all launch locations.\nRepeated launches have been reported from four of these locations. \n~64 drones detected in Ukrainian airspace.",
      "timestamp": "2025-10-04T21:00:34.427320Z"
    },
    {
      "original": "Trump Targeting Generals, Courting Domestic Turmoil: “War Against Enemies Within”\nQuantico’s historic event revealed a US President confronting his generals, demanding loyalty, and escalating rhetoric against internal “enemies,” fueling concern over domestic stability and US military cohesion.\nOn September 30, 2025, at Marine Corps Base Quantico in Virginia, an unusual scene unfolded — one that may signal the start of a deep military crisis in the United States. President Donald Trump, flanked by Defense Secretary Pete Hegseth, addressed nearly 800 generals, admirals, and senior enlisted advisors — summoned at short notice from global outposts, at considerable taxpayer expense, just as whispers of a government shutdown loomed. What was billed as an unusual military gathering quickly turned into a clash.\nHegseth, in a 45-minute tirade, lambasted “fat generals” and decried the Pentagon’s “decades of decay” under diversity initiatives, vowing an end to “dudes in dresses,”...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133253Z"
    },
    {
      "original": "Israeli Army Halts Gaza City Offensive After Hamas Decision To Accept Trump’s Peace Plan \nThe Israel Defense Forces (IDF) was ordered to halt its offensive to capture Gaza City on October 4, after United States President Donald Trump announced that his peace plan for the Strip was accepted by Hamas.\nTrump said late on October 3 that Hamas was “ready for a lasting PEACE” in the Strip after receiving the group’s positive response.\n“Israel must immediately stop the bombing of Gaza, so that we can get the hostages out safely and quickly!” Trump wrote on Truth Social.\nThe peace plan, announced by Trump on September 29, demands an immediate ceasefire, hostage release within 72 hours, and Hamas’s disarmament, with Israel withdrawing on several stages and Palestinian technocrats taking over under international oversight for up to five years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133272Z"
    },
    {
      "original": "Russian Army Pushes Forward Between Seversk And Liman (Videos)\nThe Russian military continued to advance between Seversk and Liman in the Donetsk direction by October 4, despite facing resistance from Kiev forces.\nVideo footage confirmed that the Yug [South] Group of Forces has taken over Fedorivka, located to the south of Fedorivka, although the capture of the settlement is yet to be officially announced by the Russian Ministry of Defense. Russian troops are likely still working to fully secure their new positions there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133281Z"
    },
    {
      "original": "Russian Army Pushes Forward Between Seversk And Liman (Videos)\nThe Russian military continued to advance between Seversk and Liman in the Donetsk direction by October 4, despite facing resistance from Kiev forces.\nVideo footage confirmed that the Yug [South] Group of Forces has taken over Fedorivka, located to the south of Fedorivka, although the capture of the settlement is yet to be officially announced by the Russian Ministry of Defense. Russian troops are likely still working to fully secure their new positions there.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133289Z"
    },
    {
      "original": "Military Situation In Syria On October 4, 2025 (Map Update)",
      "timestamp": "2025-10-04T21:00:35.133293Z"
    },
    {
      "original": "Disruption of Frontline Supplies: Russian Strikes on Ukraine's Key Infrastructure\nOn October 3–4, Russian forces struck energy facilities in Ukraine that support the operation of military-industrial complex enterprises and critical supply lines. Among the targets were energy facilities in the Sumy, Chernihiv, Kharkiv, and Dnipropetrovsk regions, as well as launch sites for long-range drones.\nFormer U.S. Air Force Vice Chief of Staff General Richard Newton announced an impending shift in Ukraine's approach to military operations — from active defense to more decisive offensive actions. He emphasized that Ukraine should receive Tomahawk cruise missiles, which would enable it to strike Russian targets at distances of up to 800 miles. In his opinion, \"This would allow the Ukrainian Armed Forces to strike Russian command posts, logistics centers, and oil infrastructure, which would change the nature of the war and give Kyiv a new strategic tool of influence.\" \n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133302Z"
    },
    {
      "original": "Disruption of Frontline Supplies: Russian Strikes on Ukraine's Key Infrastructure\nOn October 3–4, Russian forces struck energy facilities in Ukraine that support the operation of military-industrial complex enterprises and critical supply lines. Among the targets were energy facilities in the Sumy, Chernihiv, Kharkiv, and Dnipropetrovsk regions, as well as launch sites for long-range drones.\nFormer U.S. Air Force Vice Chief of Staff General Richard Newton announced an impending shift in Ukraine's approach to military operations — from active defense to more decisive offensive actions. He emphasized that Ukraine should receive Tomahawk cruise missiles, which would enable it to strike Russian targets at distances of up to 800 miles. In his opinion, \"This would allow the Ukrainian Armed Forces to strike Russian command posts, logistics centers, and oil infrastructure, which would change the nature of the war and give Kyiv a new strategic tool of influence.\" \n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133310Z"
    },
    {
      "original": "Military Situation In Ukraine On October 4, 2025 (Maps Update)",
      "timestamp": "2025-10-04T21:00:35.133317Z"
    },
    {
      "original": "Military Situation In Ukraine On October 4, 2025 (Maps Update)",
      "timestamp": "2025-10-04T21:00:35.133322Z"
    },
    {
      "original": "Russian Troops Strangle Kiev Forces In Kupyansk (Videos)\nThe Russian military’s offensive in Kupyansk gained momentum on October 4, but Kiev is still attempting to hold onto the key city.\nIn a major push, the Zapad [West] Group of Forces broke through Ukrainian defenses between the eastern part of Kupyansk and its eastern outskirts. This successful push in addition to recent advances in the western part of the city left Kiev forces cornered in a narrow strip in the center, mainly along the Privokzalnaya street connected to the southern entrance of the city.\nIntensive use of drones by Kiev forces has so far prevented the Russian military from completely besieging the remaining Ukrainian troops in Kupyansk. This will not go on for long, however.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133343Z"
    },
    {
      "original": "Russian Troops Strangle Kiev Forces In Kupyansk (Videos)\nThe Russian military’s offensive in Kupyansk gained momentum on October 4, but Kiev is still attempting to hold onto the key city.\nIn a major push, the Zapad [West] Group of Forces broke through Ukrainian defenses between the eastern part of Kupyansk and its eastern outskirts. This successful push in addition to recent advances in the western part of the city left Kiev forces cornered in a narrow strip in the center, mainly along the Privokzalnaya street connected to the southern entrance of the city.\nIntensive use of drones by Kiev forces has so far prevented the Russian military from completely besieging the remaining Ukrainian troops in Kupyansk. This will not go on for long, however.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-04T21:00:35.133352Z"
    }
  ],
  "script_run_time": "2025-10-04T21:00:35.134169Z"
}