{
  "messages": [
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-07-23T23:44:05.331508Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-07-23T23:44:05.331527Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-07-23T23:44:05.331533Z"
    },
    {
      "original": "🚀\nЧернігівська, Полтавська області - ракетна небезпека!",
      "timestamp": "2025-07-23T23:44:05.331538Z"
    },
    {
      "original": "🚀\n Швидкісна ціль на Сумщині, курс південно-західний.",
      "timestamp": "2025-07-23T23:44:05.331542Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-07-23T23:44:05.331547Z"
    },
    {
      "original": "🚀\nЧернігівська, Полтавська області - ракетна небезпека!",
      "timestamp": "2025-07-23T23:44:05.331551Z"
    },
    {
      "original": "📢\n Відбій загрози для Чернігівської та Полтавської областей.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-07-23T23:44:05.331558Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-07-23T23:44:05.331562Z"
    },
    {
      "original": "Чернігівська область - загроза ударних БпЛА!\n🛵\n БпЛА в північно-східній частині Чернігівщини, курс південно-західний.",
      "timestamp": "2025-07-23T23:44:05.331569Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-07-23T23:44:05.331574Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-07-23T23:44:05.331579Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Чернігівщини, курс південний/південно-західний.\n🛵\n БпЛА в акваторії Чорного моря, курс західний/північно-західний.",
      "timestamp": "2025-07-23T23:44:05.331589Z"
    },
    {
      "original": "🛵\n БпЛА на межі Миколаївщини та Одещини, курс північний.\n🛵\n БпЛА в акваторії Чорного моря, курсом на Білгород-Дністровський район.\n🛵\n БпЛА на межі Сумщини та Чернігівщини, курс південний.",
      "timestamp": "2025-07-23T23:44:05.331596Z"
    },
    {
      "original": "🛵\n БпЛА в північній частині Сумщини, курс південно-західний.\n🛵\n БпЛА в західній частині Харківщини, курс східний.\n🛵\n Декілька груп БпЛА в акваторії Чорного моря, постійно змінюють курс.\n🛵\n БпЛА в західній частині Одещини, курс південний.",
      "timestamp": "2025-07-23T23:44:05.331606Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Одеси з східного та західного напрямків! Перебувайте в укриттях!",
      "timestamp": "2025-07-23T23:44:05.331610Z"
    },
    {
      "original": "🛵\n БпЛА в західній частині Сумщини, курс південний.\n🛵\n БпЛА в східній частині Чернігівщини, курс південно-західний.\n🛵\n БпЛА в акваторії Чорного моря, змінюють курс на Одещину.",
      "timestamp": "2025-07-23T23:44:05.331618Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одеси!",
      "timestamp": "2025-07-23T23:44:05.331634Z"
    },
    {
      "original": "🛵\n БпЛА південніше Запоріжжя, курс північний.",
      "timestamp": "2025-07-23T23:44:05.331638Z"
    },
    {
      "original": "🛵\nОдеса - перебувайте в укриттях!",
      "timestamp": "2025-07-23T23:44:05.331645Z"
    },
    {
      "original": "🛵\n БпЛА в північній та східній частинах Полтавщини, курс південно-західний.",
      "timestamp": "2025-07-23T23:44:05.331649Z"
    },
    {
      "original": "🛵\n БпЛА південніше Запоріжжя, курс північний.",
      "timestamp": "2025-07-23T23:44:05.331654Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, capturing various positions at the eastern-most edge of Ukraine's northern bridgehead on the eastern bank of the Oskil River.\nAround 5 days ago, Ukrainian forces began a series of counterattacks aimed at regaining control over the trench networks on the tactical heights in the area of the road-bridge over the railway tracks. They advanced east along the railway line, utilising the cover from the windbreaks on either side of the tracks to infiltrate Russian trench positions and dugouts, recapturing them and reaching the main trench strongpoints at the bridge. \nOnce this strongpoint was under Ukrainian control, and positions had been recaptured in the adjacent forest, small groups of Ukrainian soldiers moved east across the open fields and infiltrated the southeastern part of Stepova Novosilka at two points. \nMeanwhile, Russian soldiers slightly improved their positions to the north, crossing a gulley and establishing control over a small treeline to the west. \n+ ~2.28km² in favour of Ukraine.\n+ ~0.33km² in favour of Russia.",
      "timestamp": "2025-07-23T23:44:05.953856Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have been advancing on the Donetsk and Luhansk Oblast sides of the border.\nRussian forces advanced in two areas. In the northeast, they captured positions in two treeline in Luhansk Oblast, and completed the capture of the forest in Donetsk Oblast, forcing a Ukrainian withdrawal back to the Kharkiv side of the Kharkiv-Donetsk-Luhansk tri-border intersection.\nTo the southwest, Russian forces improved their positions north of Ridkodub, advancing down two treelines and capturing a third. They also entered the northern edge of the agricultural complex on the northern outskirts of Ridkodub, but it is unclear if they were able to recapture any positions there.\nUkrainian forces advanced in two areas. In the east, they continued to advance east through the village of Ridkodub and recaptured the local administrative building, as well as further houses on Tsentralna Street. They also re-entered the northeastern street of the village, capturing the western end of it. Russian forces no longer maintain a significant presence in Ridkodub, and mainly cover it with drones and artillery while holding a foothold in the eastern houses. \nIn the west, Ukrainian forces eliminated the Russian bridgehead on the western bank of the Nitrius River in Karpivka, and crossed over at the same point between the reservoirs. They were able to establish their own bridgehead on the eastern bank of the river, and advanced northeast, pushing Russian soldiers out of the northern part of the village. Despite this progress, their presence in the northern houses isn't significant enough to safely move across the other bridge between the reservoirs, despite it being under their control.\n+ ~2.32km² in favour of Russia.\n+ ~2.08km² in favour of Ukraine.",
      "timestamp": "2025-07-23T23:44:05.953874Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards the Zherebets River and captured additional positions east of the village of Torske.\nThey advanced south down a treeline to the northwestern edge of the Serebryanskyi Forest, before entering and establishing a foothold in it. Russian forces also improved their positions further west, capturing additional trenches in the small forests in the low-lying ground.\n+ ~1.40km² in favour of Russia.",
      "timestamp": "2025-07-23T23:44:05.953881Z"
    },
    {
      "original": "In the Siversk direction, Russian and Ukrainian forces have been advancing, capturing various positions east and northeast of Siversk.\nUkrainian forces recaptured most of the rest of their previously lost positions east of Siversk, establishing control over various trench fortifications south of the Plotka River. They reached and captured a small treeline north of Verkhnokamyanske, while also approaching the village's northwestern houses.\nRussian forces resumed their assault operations in the village of Serebryanka, and captured additional positions in the southeastern part, approaching a trench strongpoint from the northeast.\n+ ~6.30km² in favour of Ukraine.\n+ ~0.20km² in favour of Russia.",
      "timestamp": "2025-07-23T23:44:05.953893Z"
    },
    {
      "original": "Following recent developments around Pokrovsk, Ukrainian source Deepstate is now characterising the overall Ukrainian manpower situation as \"catastrophic\".",
      "timestamp": "2025-07-23T23:44:05.953897Z"
    },
    {
      "original": "A few hours ago, a Ukrainian Mirage-2000 fighter jet crashed in Volyn Oblast. The Ukrainian Airforce confirmed the incident, stating that the pilot ejected and was later found in stable condition. No air threats were in place for Volyn Oblast at the time, and the crash apparently occurred due to equipment failure.\nThis is the first Mirage-2000 to be lost by Ukraine. They recently started carrying out combat missions in eastern Ukraine, with one carrying out a launch maneuver over Slovyansk, Donetsk Oblast yesterday.",
      "timestamp": "2025-07-23T23:44:05.953902Z"
    },
    {
      "original": "A few hours ago, a Ukrainian Mirage-2000 fighter jet crashed in Volyn Oblast. The Ukrainian Airforce confirmed the incident, stating that the pilot ejected and was later found in stable condition. No air threats were in place for Volyn Oblast at the time, and the crash apparently occurred due to equipment failure.\nThis is the first Mirage-2000 to be lost by Ukraine. They recently started carrying out combat missions in eastern Ukraine, with one carrying out a launch maneuver over Slovyansk, Donetsk Oblast yesterday.",
      "timestamp": "2025-07-23T23:44:05.953908Z"
    },
    {
      "original": "A good thread on the Kinzhal Aeroballistic missile. I agree with a lot of this, although I believe the actual speed is a little more than Mach 5, not due to delays in explosions but rather delays in detection due to them usually flying over border and lightly populated areas of Chernihiv Oblast. \nUsually, we don't know about it until it is either approaching Kyiv Oblast or already over the region - sometimes even only when the explosion is heard in Kyiv from the Mach Cone phenomenon. I think it's probably closer to Mach 6, but that's just speculation. \n@cym27s\n is a good person to follow. He's one of the two other main English-speaking missile trackers and does very similar work to me - but also at hours when I'm not online or asleep. Go get him to 9k followers, and also try to convince him to make a telegram channel lol.\nThread link: \nhttps://x.com/cym27s/status/1947592482172375112",
      "timestamp": "2025-07-23T23:44:05.953916Z"
    },
    {
      "original": "Russian forces have achieved a 6km breakthrough in the direction of the city of Dobropillya, and are now 12km northeast of Rodynske. It's unclear if consolidation has occurred in all areas, but Deepstate has corroborated reports by Russian sources that the Nove Shakhove - Shakhove road has been cut.",
      "timestamp": "2025-07-23T23:44:05.953920Z"
    },
    {
      "original": "I'd like to point something out regarding the recent DRG operations, and specifically the attached video showing a Russian sabotage operation deep inside Pokrovsk City.\nThis is nothing new - at least in the sense that these deep infiltrations behind the frontlines have been occurring for several months now. As I and many others have been pointing out for a long time, Ukrainian manpower problems will eventually reach a point where they are unable to contain Russian infantry. Right now, we are at the point where they cannot contain all DRGs and are failing to kill them within the required period of 12-24 hours. \nDRGs have been constantly slipping behind Ukrainian lines simply because there are no soldiers to stop them in some areas. They utilise cover from treelines, windbreaks and the more lightly damaged settlements to evade being spotted by drones, and then carry out sabotage operations on Ukrainian positions multiple kilometres behind the frontline on unaware soldiers and commanders in temporary deployment points. This is what I mean when I point out how relying on one thing to hold parts of the frontline (drones) is not a good tactic nor a good sign as it significantly simplifies Russian assault operation - they don't have to account for as many factors. \nYes, the number of DRG operations in the Pokrovsk direction has significantly increased, but the main reason we are seeing this is because of how much attention Pokrovsk is getting right now. This is a common occurrence in weak sections of the frontline, and even sometimes much more stable sectors such as the frontline northwest of Bakhmut.",
      "timestamp": "2025-07-23T23:44:05.953926Z"
    },
    {
      "original": "Yesterday, 3 Russian Tu-95MS strategic bombers redeployed from Engels-2 Airbase in Saratov Oblast to Ukrainka Airbase in Amur Oblast. These are three of the bombers which took part in the most recent combined missile attack on Ukraine. They have been equipped with Kh-101 cruise missiles and are now carrying out a large-scale training mission with 2-3 other Tu-95s which were already stationed at Ukrainka.",
      "timestamp": "2025-07-23T23:44:05.953929Z"
    },
    {
      "original": "Russian forces have captured the village of Novotoretske, Pokrovsk direction, Donetsk Oblast. \nPre-war population: ~520. \nTotal land area: ~2.67km²",
      "timestamp": "2025-07-23T23:44:05.953935Z"
    },
    {
      "original": "Russian forces have captured the village of Mayak, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~150.\nTotal land area: ~0.56km²",
      "timestamp": "2025-07-23T23:44:05.953939Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a tactical breakthrough in multiple directions, blooming outwards from the area of the Kazenyi Torets River.\nRussian forces initially began further expanding their bridgehead on the western bank of the river by spearheading an attack west down the treelines towards the south of Nykanorivka, capturing numerous positions there and in the forests to the southeast. Supporting attacks were made from the area of Mayak to secure the forested areas next to the reservoirs. \nRussian forces were also able to consolidate their positions in southern Mayak, using them to expand further north and seize the rest of the village. Assault operations are now ongoing on the neighbouring village of Pankivka, which is currently in the grey zone. Outflanking attacks have already taken place west of Pankivka, with Russian forces achieveing a localised breakthrough towards the village of Nove Shakhove, where they captured numerous positions in the treelines and forest plantation on the tactical heights, while forward units cut the Nove Shakhove - Shakhove  road and are now operating northeast of Nove Shakhove. Due to the fog of war, it is unclear if any positions were captured along the road itself, however. \nMeanwhile, east of the Kazenyi Torets River, Russian forces completed the capture of the village of Novotoretske by advancing northwest from their positions behind the tributary of the Kazenyi Torets River. Then, taking advantage of Ukraine's critical manpower situation, the Russians broke through Ukrainian positions northwards, advancing along the road to Volodymyrivka, before reaching and capturing the main part of the village just south of Shakhove. Other forces made further progress to the southeast in the treelines on the tactical heights, and the adjacent forest plantations in the low-lying ground. \nTo the east of these breakthroughs, Russian forces improved their positions west of the village of Popiv Yar, and captured parts of the treelines outside the chalk quarry. \nTo the southwest of these breakthroughs - in the direction of Rodynske - Russian forces completed the capture of the village of Fedorivka, reaching the eastern outskirts of Zatyshok and seized additional positions in the nearby forest and treelines. Soldiers which had already consolidated in the treelines east of the Krasnolymanskaya Mine, advanced north to one of the ventilation shafts for the mine, capturing it and therefore linking up with the forces from Fedorivka. \n+ ~31.54km² in favour of Russia.",
      "timestamp": "2025-07-23T23:44:05.953947Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces achieved a tactical breakthrough in multiple directions, blooming outwards from the area of the Kazenyi Torets River.  Russian forces initially began further expanding their bridgehead on the western bank…",
      "timestamp": "2025-07-23T23:44:05.953951Z"
    },
    {
      "original": "One of the biggest breakthroughs since Ukraine in Kherson Oblast in 2022.",
      "timestamp": "2025-07-23T23:44:05.953954Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have made new progress in multiple areas.\nRussian forces advanced in three areas. In the east, taking advantage of a large decrease in the size of the Ukrainian garrison holding Yablunivka, they intensified their attacks eastwards, breaking through Ukrainian positions and reaching the easternmost part of the village. As a result, the rest of the pocket south of the Bychok River was cleared from attacks from the south and west, a bridgehead was established north of the river in the northeastern part of Yablunivka, and the Russians completed its capture. \nThey then crossed the Kalynivka River, establishing a bridgehead in the central part of Oleksandro-Kalynove, cutting the village in half. Other forces from the south secured the western side of the village, linking up with the bridgehead, and improved their positions along a nearby treeline southeast of the settlement. The southeastern houses are currently in the grey zone, with Russian forces yet to clear them out. \nTo the northwest, Russian forces resumed their assault operations northwest of Yablunivka and captured a small forest. They also crossed a gulley, and established control over positions near the intersection of four treelines opposite their initial positions. \nIn the west, Russian forces advanced down both banks of the Poltavka River. They completed the capture of Popiv Yar, before moving north to the neighbouring village of Poltavka. The Russians were able to seize the western half of the village, establishing positions at the reservoir separating it from the eastern half, while also capturing further positions in the treelines and forest plantations south, southeast and southwest of Poltavka. Other forces advanced up the eastern bank of the Poltavka River, pushing north up a forested area to the southeastern outskirts of the village, and improved their positions in the forest plantation in the low-lying ground to the east. \n+ ~12.93km² in favour of Russia.",
      "timestamp": "2025-07-23T23:44:05.953961Z"
    },
    {
      "original": "Zelensky currently",
      "timestamp": "2025-07-23T23:44:05.953964Z"
    },
    {
      "original": "Kyiv Independent: \"Zelensky just betrayed Ukraine's democracy — and everyone fighting for it\"",
      "timestamp": "2025-07-23T23:44:05.953970Z"
    },
    {
      "original": "WOW it's almost as if people like me have been pointing out Zelensky isn't a good leader, but then automatically got accused of being Kremlin propagandists. \nThe blind and baseless talking points people rely on to maintain their narrative will continue crumble one by one.",
      "timestamp": "2025-07-23T23:44:05.953974Z"
    },
    {
      "original": "WOW it's almost as if people like me have been pointing out Zelensky isn't a good leader, but then automatically got accused of being Kremlin propagandists.   The blind and baseless talking points people rely on to maintain their narrative will continue crumble…",
      "timestamp": "2025-07-23T23:44:05.953977Z"
    },
    {
      "original": "But hey, as long as someone like Andrew Perptually Wrong admits that Zelensky is a terrible leader and individual it's all good... right?",
      "timestamp": "2025-07-23T23:44:05.953980Z"
    },
    {
      "original": "Ukraine Lost First French-Made Mirage Fighter Jet (Video)\nThe Ukrainian Air Force (UAF) acknowledged on July 22 that one of the Mirage-2000 fighter jets it received very recently from France crashed in the northwestern Ukrainian region of Volyn, marking the country’s first loss of this type of warplanes.\n\"On the evening of July 22, 2025, a Mirage-2000 fighter jet experienced a technical failure during a training mission,\" the air force said in a statement posted to Telegram.\nThe pilot promptly notified air traffic control and followed emergency procedures, successfully ejecting from the aircraft, it added.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.535956Z"
    },
    {
      "original": "Ukraine Lost First French-Made Mirage Fighter Jet (Video)\nThe Ukrainian Air Force (UAF) acknowledged on July 22 that one of the Mirage-2000 fighter jets it received very recently from France crashed in the northwestern Ukrainian region of Volyn, marking the country’s first loss of this type of warplanes.\n\"On the evening of July 22, 2025, a Mirage-2000 fighter jet experienced a technical failure during a training mission,\" the air force said in a statement posted to Telegram.\nThe pilot promptly notified air traffic control and followed emergency procedures, successfully ejecting from the aircraft, it added.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.535974Z"
    },
    {
      "original": "Iran Suspects Israel Was Behind Recent Wave Of Blasts - Report\nIranian officials suspect that Israel was behind a series of blasts that rocked the Islamic Republic over the past month, The New York Times reported on July 22.\nWhile officially the mysterious blasts hitting apartment buildings, oil facilities, and factories have been blamed on aging infrastructure, three Iranian officials, including a member of the Islamic Revolutionary Guards Corps, told the newspapers that they suspect these were acts of sabotage orchestrated by Israel.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.535983Z"
    },
    {
      "original": "Turkey Has Begun To Arm Syria’s New Army (Videos)\nSyria’s Islamist-led interim government has requested Turkey’s support to strengthen its defense capabilities, Turkish officials told the Associated Press on July 23.\nThe request came following sectarian violence over the past two weeks that increased tensions in Syria and drew intervention by Israel.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.535991Z"
    },
    {
      "original": "Turkey Has Begun To Arm Syria’s New Army (Videos)\nSyria’s Islamist-led interim government has requested Turkey’s support to strengthen its defense capabilities, Turkish officials told the Associated Press on July 23.\nThe request came following sectarian violence over the past two weeks that increased tensions in Syria and drew intervention by Israel.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.535998Z"
    },
    {
      "original": "In Video: Iranian Helicopter Confronts U.S. Destroyer In Gulf Of Oman\nA helicopter of the Iranian military confronted a United States destroyer in the Gulf of Oman today, warning it to stay out of waters claimed by Tehran, Iranian state TV reported on July 23.\nThe television said that the helicopter flew over the USS Fitzgerald, an Arleigh Burke-class missile destroyer, at about 10 a.m. local time after the vessel “attempted to approach the waters under the supervision” of Iran.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.536006Z"
    },
    {
      "original": "Military Situation In Ukraine On July 23, 2025 (Map Update)",
      "timestamp": "2025-07-23T23:44:06.536010Z"
    },
    {
      "original": "Military Situation In Ukraine On July 23, 2025 (Map Update)",
      "timestamp": "2025-07-23T23:44:06.536014Z"
    },
    {
      "original": "Military Situation In Palestine On July 23, 2025 (Map Update)",
      "timestamp": "2025-07-23T23:44:06.536018Z"
    },
    {
      "original": "War Monitor Says Over 1,300 Were Killed In Al-Suwayda Battle (18+ Videos)\nThe death toll from the battle in the southern Syrian governorate of al-Suwayda has exceeded 1,000, the Syrian Observatory for Human Rights (SOHR) reported on July 23.\nThe SOHR, which is based in London, said that the battle has so far claimed the lives of 1,339 people, including 196 Druze civilians who were executed by government forces.\nThe real death toll is expected to be much higher. Government and tribal forces were blamed for a wide range of war crimes against the Druze, from setting buildings on fire, to looting, abductions and summary executions. Videos of these crimes continue to surface online.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.536026Z"
    },
    {
      "original": "War Monitor Says Over 1,300 Were Killed In Al-Suwayda Battle (18+ Videos)\nThe death toll from the battle in the southern Syrian governorate of al-Suwayda has exceeded 1,000, the Syrian Observatory for Human Rights (SOHR) reported on July 23.\nThe SOHR, which is based in London, said that the battle has so far claimed the lives of 1,339 people, including 196 Druze civilians who were executed by government forces.\nThe real death toll is expected to be much higher. Government and tribal forces were blamed for a wide range of war crimes against the Druze, from setting buildings on fire, to looting, abductions and summary executions. Videos of these crimes continue to surface online.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.536034Z"
    },
    {
      "original": "ZELENSKY'S FINAL ACT: WAR IN UKRAINE BEGAN WITH MAIDAN, IT ENDS WITH MAIDAN",
      "timestamp": "2025-07-23T23:44:06.536038Z"
    },
    {
      "original": "◾\nA video became again relevant after Ukrainian recruitment officers beat to death 45-year-old József Sebesztén, an ethnic Hungarian from Beregove.\nIn 2023 Yevhen Karas the leader of Ukraine's Neo-Nazi terrorist organisation C14 (Combat 18 in Europe) spoke on how Nazis terrorised the ethnic Hungarian region of Transcarpathia:\n- there was a “Train of Friendship”, gathered nationalists, soccer ultras, we all went there. And we fucked up everyone then.\n◾\nFor years Ukrainian Nazis carried a terror campaign to \"ethnic cleansing\" the region of Hungarians. Now are the Ukrainian recruitment officers the ones continuing the job under Zelenskiy orders sending Hungarians to the meat grinders.\n◾\nFollow:\nhttps://t.me/European_dissident",
      "timestamp": "2025-07-23T23:44:06.536047Z"
    },
    {
      "original": "Russia’s Penicillin Acoustic-Thermal Recon System Is Performing Well Against Kiev Forces\nThe Penicillin acoustic-thermal artillery reconnaissance system has enabled Russian troops in the special military operation zone to strike back in seconds, a Rostec source told TASS on July 21.\n\"The Penicillin thermal sound reconnaissance complex, developed by our Rosel holding company, helps Russian fighters effectively conduct counter-battery warfare in their combat zone. With its help, military personnel identify enemy firing positions in seconds and give their artillery target indications for return fire. As a result, the barrel of the enemy cannon does not have time to cool down after firing, while a response is already coming from our side,\" the source said.\nThe Penicillin was developed to detect and locate artillery, mortars, multiple rocket launchers, anti-aircraft or tactical-missile firing positions with seismic and acoustic sensors.\nRead more: \nHERE",
      "timestamp": "2025-07-23T23:44:06.536056Z"
    },
    {
      "original": "Overview Of Military Situation in Ukraine, July 23, 2025\nIn the Sumy direction,\n Russian troops continue active offensive operations. Units of the Northern group of forces captured the settlement of Varachino, advanced in Yunakovka, and are engaged in intense combat clashes near Kondrativka, utilizing aviation and FPV drones. Russian units are expected to reach the H07 highway leading to the city of Sumy soon.\nIn Kharkiv direction\n, the RAF conducted a series of strikes on the cities of Kharkiv, Izyum, Derhachi, and Kupiansk, including with drones and missiles, primarily targeting Kharkiv’s Industrial District. AFU positions and infrastructure were hit. Near Vovchansk, Ukrainian counterattack attempts proved unsuccessful.\nIn the Kostiantynivka direction\n, north of Myrnograd, Russian forces have established control over Fedorivka, and have also advanced towards Nykanorivka and in the southwestern sector of Poltavka.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-23T23:44:06.536069Z"
    },
    {
      "original": "Overview Of Military Situation in Ukraine, July 23, 2025\nIn the Sumy direction,\n Russian troops continue active offensive operations. Units of the Northern group of forces captured the settlement of Varachino, advanced in Yunakovka, and are engaged in intense combat clashes near Kondrativka, utilizing aviation and FPV drones. Russian units are expected to reach the H07 highway leading to the city of Sumy soon.\nIn Kharkiv direction\n, the RAF conducted a series of strikes on the cities of Kharkiv, Izyum, Derhachi, and Kupiansk, including with drones and missiles, primarily targeting Kharkiv’s Industrial District. AFU positions and infrastructure were hit. Near Vovchansk, Ukrainian counterattack attempts proved unsuccessful.\nIn the Kostiantynivka direction\n, north of Myrnograd, Russian forces have established control over Fedorivka, and have also advanced towards Nykanorivka and in the southwestern sector of Poltavka.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-23T23:44:06.536080Z"
    }
  ],
  "script_run_time": "2025-07-23T23:44:06.537013Z"
}