{
  "messages": [
    {
      "original": "🛵\n БпЛА з Житомирщини курсом на північ Вінниччини.",
      "timestamp": "2025-12-26T19:32:56.047925Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Вінниччини, курс на н.п. Хмільник.",
      "timestamp": "2025-12-26T19:32:56.047942Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-12-26T19:32:56.047947Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку н.п.Літин на Вінниччині.",
      "timestamp": "2025-12-26T19:32:56.047952Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-12-26T19:32:56.047956Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку н.п.Бар на Вінниччині.",
      "timestamp": "2025-12-26T19:32:56.047961Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину з півночі.",
      "timestamp": "2025-12-26T19:32:56.047965Z"
    },
    {
      "original": "🚀\nРакетна небезпека в областях, де оголошена тривога!",
      "timestamp": "2025-12-26T19:32:56.047969Z"
    },
    {
      "original": "🛵\n БпЛА з півдня Рівненщини на Хмельниччину.",
      "timestamp": "2025-12-26T19:32:56.047974Z"
    },
    {
      "original": "🛵\n БпЛА на кордоні Вінниччини, продовжує рух в напрямку Молдови.",
      "timestamp": "2025-12-26T19:32:56.047978Z"
    },
    {
      "original": "🚀\n  КАБ курс на Харків.",
      "timestamp": "2025-12-26T19:32:56.047982Z"
    },
    {
      "original": "🛵\n БпЛА на Херсон зі сходу.",
      "timestamp": "2025-12-26T19:32:56.047987Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-12-26T19:32:56.047991Z"
    },
    {
      "original": "🚀\nПуски КАБ на схід Дніпропетровщини.",
      "timestamp": "2025-12-26T19:32:56.047999Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-26T19:32:56.048004Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Седнів.",
      "timestamp": "2025-12-26T19:32:56.048009Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині курсом на Путивль та Суми.",
      "timestamp": "2025-12-26T19:32:56.048017Z"
    },
    {
      "original": "🚀\nХарківська область - ракетна небезпека!",
      "timestamp": "2025-12-26T19:32:56.048025Z"
    },
    {
      "original": "🛵\n БпЛА з Донеччини на Дніпропетровщину (Синельниківський район).",
      "timestamp": "2025-12-26T19:32:56.048034Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в районі Славутича.",
      "timestamp": "2025-12-26T19:32:56.048046Z"
    },
    {
      "original": "2 missiles in Luhansk Oblast changed course to the south/southeast, flying past Rovenky to Rostov-on-Don",
      "timestamp": "2025-12-26T19:32:56.614355Z"
    },
    {
      "original": "2-4 missiles are flying to Temyruk, Krasnodar Krai. The port there was under attack from UAVs earlier. Russian air defence is working from Krasnodar Krai.\n2 missiles changed course to the east, flying past Novocherkassk, Rostov Oblast.",
      "timestamp": "2025-12-26T19:32:56.614364Z"
    },
    {
      "original": "Missile strikes were carried out on the Novoshakhtinsk Oil Refinery, Rostov Oblast.",
      "timestamp": "2025-12-26T19:32:56.614368Z"
    },
    {
      "original": "Missile strikes were carried out on the Novoshakhtinsk Oil Refinery, Rostov Oblast.",
      "timestamp": "2025-12-26T19:32:56.614372Z"
    },
    {
      "original": "The fire at the Novoshakhtinsk Oil Refinery is growing",
      "timestamp": "2025-12-26T19:32:56.614375Z"
    },
    {
      "original": "It seems to be all clear for Crimea and Krasnodar Krai. The missiles flying to attack Temryuk were likely all shot down.",
      "timestamp": "2025-12-26T19:32:56.614379Z"
    },
    {
      "original": "More from Novoshakhtinsk Oil Refinery, Rostov Oblast.\nRussian censorship sucks lol",
      "timestamp": "2025-12-26T19:32:56.614383Z"
    },
    {
      "original": "Approximate routes of the Storm Shadow cruise missiles used by Ukraine during this attack.\n~8 missiles were used in total, likely launched from 2 Su-24s near Kryvyi Rih, Dnipropetrovsk Oblast, and 2 Su-24s near Slovyansk, Donetsk Oblast.\n2 impacts were recorded to the Novoshakhtinsk Oil Refinery in Rostov Oblast. \nThe other 6 missiles were likely shot down (2 over Russian-controlled Kherson Oblast, 2 over Russian-controlled Luhansk Oblast, and 2 over the Sea of Azov).",
      "timestamp": "2025-12-26T19:32:56.614389Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued their assault operations and have made additional progress over the last 10 days.\nIn the west, Russian forces consolidated in the rest of Nove Shakhove following earlier infiltrations, allowing for them to accumulate and begin attacks on Vilne. They subsequently advanced north up three parallel treelines, capturing new positions there. Unsuccesful attacks were then then carried out on Vilne. \nIn the east, Russian forces began pushing northwest from the gulley west of Shakhove and captured new positions in the forested areas in the direction of the clay quarries. \n+ ~3.54 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614396Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued to rapidly advance over the last week, further collapsing Ukrainian defences. \nIn the west, Russian forces consolidated in the remaining parts of southern Prymorske dachas and continued advancing in southern Prymorske. They captured the entirety of the residential area south of the first gulley, while DRGs advanced further north to the second gulley and the village centre. The Russians then advanced west along the first gulley towards the pumping station, linking up with other assault groups who consolidated along the E-105 Highway. DRGs then infiltrated further along the highway and reached the large forest east of Prymorske.\nTo the east, Russian forces managed to consolidate in the treelines north of Stepnohirsk following earlier attacks and are attempting to infiltrate further north. They also captured the rest of the treeline stretching west from the solar field. \nIn the east, Russian forces consolidated in the treelines southwest of Lukyanivske following earlier attacks and began advancing further west down the treelines in the direction of Pavlivka. This was done in coordination with attacks along the treelines on the tactical heights north of Stepove. \n+ ~26.13 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614404Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces resumed their assault operations and have made new progress in two different areas.\nIn the west, Russian forces began pushing northwest from the area of Nesteryanka and captured a series of fortifications along six parallel treelines which had held since 2023. \nTo the east, Russian forces resumed their assault operations in Mala Tokmachka. They recaptured the railway station and positions in the nearby streets and began attacking the ruins of the prison. \n+ ~3.79 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614411Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance in Hulyaipole and are coming closer to completely capturing the city.\nIn the south, Ukrainian forces continued to incrementally withdraw from the 2023 fortifications due to the threat of encirclement, allowing for the Russians to secure additional positions in two different treelines. They also improved their positions in the nearby forest plantations.\nTo the north, Russian forces captured additional positions in the low-rise residential areas on Nova and Petrovskoho Streets. They also continued clearing the city centre and captured the remaining three-story apartment buildings there.\nTo the northwest, the Russians bypassed the rest of the city centre from the north and entrenched along the eastern part of Travnya 1st street, and in the surrounding areas. They also continued expanding their zone of control in the northwestern part of Hulyaipole, and broke through Ukrainian positions on Ally Onoshko Street towards the westernmost edge of the city.\n+ ~4.96 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614418Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance in Hulyaipole and are coming closer to completely capturing the city.  In the south, Ukrainian forces continued to incrementally withdraw from the 2023 fortifications due to the threat of encirclement…",
      "timestamp": "2025-12-26T19:32:56.614425Z"
    },
    {
      "original": "Russian forces now control approximately 83% of Hulyaipole.",
      "timestamp": "2025-12-26T19:32:56.614428Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued their assault operations and have advanced in three different areas.\nIn the west, Russian forces advanced in the northwestern part of Ivanivka and have begun attempts at consolidating in part of Ukraine's main defensive line to the north. They also improved their positions in the southern streets, reaching the village centre. Currently, the rest of Ivanivka is in the grey-zone, with both Russian and Ukrainian forces holding overlapping temporary positions throughout it in a very fluid and dynamic situation. \nIn the east, Russian forces continued to slowly advance southwest of Novopavlivka. They improved their positions north of the fortified forest and captured new positions in the forested areas there. \n+ ~1.99 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614435Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced over the last 10 days, with Ukrainian forces making significant progress in a series of coordinated counterattacks.\nNorth of Pokrovsk, Ukrainian forces launched a mechanised assault towards the northwestern outskirts of Pokrovsk. They managed to recapture the two pig farm complexes and a series of treeline positions, however the attack on the outskirts of the city, which involved Abrams tanks from the 425th Separate Assault Regiment \"Skala\", was ultimately repelled.\nIn Rodynske, Ukrainian forces have resumed their assault operations in the city. They advanced east from their strongpoints and entered the southeastern streets, outflanking Russian positions in the city centre. They cleared part of the low-rise residential area there and entrenched in the western part of the southeastern high-rise micro-district, which the Russians are now bombing with FAB glide-bombs. They also entrenched in a number of 3-story-buildings in western Rodynske.\nNortheast of Rodynske, Ukrainian forces have made significant progress over the last 10 days. They recaptured the southern part of Suhketske and broke through to the Krasnolymanskaya Mine, establishing full control over this crucial stronghold. Building on their momentum, they advanced further east to one of the ventilation shafts for the mine, capturing it and the surrounding areas. Russian forces subsequently carried out a massive, mechanised assault consisting of around 40 heavy and light vehicles of various types on the ventilation shaft, which was repelled with heavy losses. \nIn Myrnohrad, Russian forces continued finalising their clearing operations in the central and northern parts of the city. They managed to complete the capture of the city centre and secured the rest of the residential areas to the west. They also continued clearing the northern streets, consolidating in the low-rise residential streets south and southeast of the cemetery.\n+ ~10.84 km² in favour of Ukraine.\n+ ~0.79 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-26T19:32:56.614444Z"
    },
    {
      "original": "Russian forces have captured the village of Novomarkove, Rai-Oleksandrivka direction, Donetsk Oblast.\nPre-war population: ~63.\nTotal land area: ~0.65 km².\nThe fighting for Novomarkove lasted <10 days.",
      "timestamp": "2025-12-26T19:32:56.614450Z"
    },
    {
      "original": "Russian forces have recaptured the village of Varachyne, Khotin direction, Sumy Oblast.\nPre-war population: ~62.\nTotal land area: ~0.37 km².\nThe fighting for Varachyne lasted approximately 75 days.",
      "timestamp": "2025-12-26T19:32:56.614455Z"
    },
    {
      "original": "A Russian soldier is seen draping the flag of the 57th Brigade over the statue of Nestor Makhno in the city centre of Hulyaipole. \nCoordinates: 47.666078, 36.2529328",
      "timestamp": "2025-12-26T19:32:56.614459Z"
    },
    {
      "original": "David is so annoyed at me for reporting about the reality in Ukraine that he is now openly lying about me, beyond just speculative opinions. The only time I ever spoke to him through a call was in a public space prior to him blocking and condemning me. I have never had a private call with him, and the fact that he is lying to himself and others shows how desperate he is. \nIt seems like every couple of weeks he has another little meltdown, calling me Pro-Russian and the closest friend of @.squatsons. But what's funny is that he can't even get his info about me correct.\nDavid is an American boomer, indoctrinated since birth, who is now spouting his nonsense online to an ever-shrinking audience of comfort-media-consumers. He's someone that you should never take seriously, unless you like being lied to.\nBut don't worry, his grift will be over soon. Any form of reputation he still has will be lost once this war is over, as people realise that he has lied about everything. I have a whole catalogue of stupid things he's posted that have aged terribly and contradicted earlier statements he's made. Perhaps I should post them at some point?",
      "timestamp": "2025-12-26T19:32:56.614464Z"
    },
    {
      "original": "U.S. Launches Strikes In Nigeria In Response To Killing Of Christians (Video, Photos)\nPresident Donald Trump announced on December 25 that the United States military conducted “powerful and deadly” strikes against ISIS targets in northwestern Nigeria, well over a month after warning the West African nation over the issue.\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” Trump wrote on his Truth Social network.\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” the president continued.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205278Z"
    },
    {
      "original": "U.S. Launches Strikes In Nigeria In Response To Killing Of Christians (Video, Photos)\nPresident Donald Trump announced on December 25 that the United States military conducted “powerful and deadly” strikes against ISIS targets in northwestern Nigeria, well over a month after warning the West African nation over the issue.\n“Tonight, at my direction as Commander in Chief, the United States launched a powerful and deadly strike against ISIS Terrorist Scum in Northwest Nigeria, who have been targeting and viciously killing, primarily, innocent Christians, at levels not seen for many years, and even Centuries!” Trump wrote on his Truth Social network.\n“I have previously warned these Terrorists that if they did not stop the slaughtering of Christians, there would be hell to pay, and tonight, there was,” the president continued.\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205293Z"
    },
    {
      "original": "Over 20 Killed Or Wounded In Blast At Alawite Mosque In Syria’s Homs (18+ Videos)\nOver 20 people were killed or wounded in the central Syrian city of Homs on December 26 as a result of a blast inside a mosque in the Alawite-majority neighborhood of Wadi al-Dahab.\nIn a statement, the Syrian Ministry of Interior said that a “terrorist bombing” targeted the Ali bin Abi Talib Mosque during Friday prayers, adding that security forces were dispatched to the scene of the attack and an investigation was launched.\nThe state-run SANA news agency reported, citing a security official, that the blast was caused by “multiple explosive devices,” although the media director in Homs told Al-Jazeera that a single explosive device was planted inside the mosque.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205302Z"
    },
    {
      "original": "Over 20 Killed Or Wounded In Blast At Alawite Mosque In Syria’s Homs (18+ Videos)\nOver 20 people were killed or wounded in the central Syrian city of Homs on December 26 as a result of a blast inside a mosque in the Alawite-majority neighborhood of Wadi al-Dahab.\nIn a statement, the Syrian Ministry of Interior said that a “terrorist bombing” targeted the Ali bin Abi Talib Mosque during Friday prayers, adding that security forces were dispatched to the scene of the attack and an investigation was launched.\nThe state-run SANA news agency reported, citing a security official, that the blast was caused by “multiple explosive devices,” although the media director in Homs told Al-Jazeera that a single explosive device was planted inside the mosque.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205311Z"
    },
    {
      "original": "North Korea’s Kim Orders Expansion Of Missile Production During Visit To Key Facilities (Photos)\nNorth Korean leader Kim Jong Un ordered an expansion of the country’s missile and shell production capacity to meet the military’s growing need for the weapons during inspections of major munitions industry enterprises, state-run media reported on December 26.\nThe Korean Central News Agency (KCNA) reported that Kim, accompanied by senior officials, visited key munitions enterprises.\nOfficials briefed Kim on the achievements of the missile and shell production sector in 2025, including output in the fourth quarter, according to the news agency, which did not give details on the locations of the factories or reveal when the visit took palace.\n“It is necessary to reinforce the technical foundations of the relevant production enterprises in a balanced way to further expand the overall production capacity,” KCNA quoted Kim as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205321Z"
    },
    {
      "original": "North Korea’s Kim Orders Expansion Of Missile Production During Visit To Key Facilities (Photos)\nNorth Korean leader Kim Jong Un ordered an expansion of the country’s missile and shell production capacity to meet the military’s growing need for the weapons during inspections of major munitions industry enterprises, state-run media reported on December 26.\nThe Korean Central News Agency (KCNA) reported that Kim, accompanied by senior officials, visited key munitions enterprises.\nOfficials briefed Kim on the achievements of the missile and shell production sector in 2025, including output in the fourth quarter, according to the news agency, which did not give details on the locations of the factories or reveal when the visit took palace.\n“It is necessary to reinforce the technical foundations of the relevant production enterprises in a balanced way to further expand the overall production capacity,” KCNA quoted Kim as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205331Z"
    },
    {
      "original": "Russia Begins Delivering Heavy Drones To The Front Lines Amid Strikes On Ukrainian Logistics\nDuring the exchange of strikes on the night of December 26, Russian forces used, according to the Ukrainian Air Force, one Iskander-M ballistic missile and 99 attack drones, 73 of which were shot down/suppressed. \nRussia aims to paralyze the strategically important railway line from Ukraine to Poland (the Kyiv-Kovel line). This was stated by Ukrainian military radio technology specialist Serhii Beskrestnov, known by the call sign \"Flash.\" He notes that attacks on this artery are following one after another: two days ago, the strike hit a train; the day before yesterday, a railway bridge; and last night, a locomotive depot. He predicts further strikes on objects of this line and calls for their protection.\nSimultaneously, the Russian side announced the delivery to the front line of the first test batch of the newest heavy combat drones \"Berdysh,\" numbering about 100 units.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205340Z"
    },
    {
      "original": "Russia Begins Delivering Heavy Drones To The Front Lines Amid Strikes On Ukrainian Logistics\nDuring the exchange of strikes on the night of December 26, Russian forces used, according to the Ukrainian Air Force, one Iskander-M ballistic missile and 99 attack drones, 73 of which were shot down/suppressed. \nRussia aims to paralyze the strategically important railway line from Ukraine to Poland (the Kyiv-Kovel line). This was stated by Ukrainian military radio technology specialist Serhii Beskrestnov, known by the call sign \"Flash.\" He notes that attacks on this artery are following one after another: two days ago, the strike hit a train; the day before yesterday, a railway bridge; and last night, a locomotive depot. He predicts further strikes on objects of this line and calls for their protection.\nSimultaneously, the Russian side announced the delivery to the front line of the first test batch of the newest heavy combat drones \"Berdysh,\" numbering about 100 units.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205349Z"
    },
    {
      "original": "Ukraine Has Lost Nearly All of Huliaipole (Videos)\nOn December 26, the Russian military extended its control over most of the center and northern part of Huliaipole in Zaporozhye, and advanced in its eastern part, reducing the area under Ukrainian control to less than 20 percent of the city.\nVideos posted online confirmed that Russian troops from the Vostok [East] Group of Forces have reached the Nestor Makhno statues at the heart of Huliaipole – also known as Gulyaypole -, as well as the “I Love Huliaipole” sign in the northern part of the city.\nJust a day earlier, the troops broke through Ukrainian defenses in Sobornaya Street in the city center and captured the headquarters of Ukraine’s 102nd Territorial Defense Brigade. Kiev forces withdrew in a rush leaving behind everything, including their communication equipment, which explains their later collapse in the nearby areas.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205358Z"
    },
    {
      "original": "Ukraine Has Lost Nearly All of Huliaipole (Videos)\nOn December 26, the Russian military extended its control over most of the center and northern part of Huliaipole in Zaporozhye, and advanced in its eastern part, reducing the area under Ukrainian control to less than 20 percent of the city.\nVideos posted online confirmed that Russian troops from the Vostok [East] Group of Forces have reached the Nestor Makhno statues at the heart of Huliaipole – also known as Gulyaypole -, as well as the “I Love Huliaipole” sign in the northern part of the city.\nJust a day earlier, the troops broke through Ukrainian defenses in Sobornaya Street in the city center and captured the headquarters of Ukraine’s 102nd Territorial Defense Brigade. Kiev forces withdrew in a rush leaving behind everything, including their communication equipment, which explains their later collapse in the nearby areas.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205367Z"
    },
    {
      "original": "Elite Russian Drone Unit Eliminates Ukrainian Tank Gathering Near Kostiantynivka (Videos)\nThe Center for Advanced Unmanned Technologies “Rubicon” announced on December 26 that it has destroyed more than two dozen Ukrainian armored vehicles which were gathered in the Kostiantynivka direction in Donetsk in a well-planned special operation.\nThe gathering was near the city of Druzhkivka, a logistics and command hub of Kiev forces located right to the north of the city of Kostiantynivka where the Russian military’s Yug [South] Group of Forces is currently advancing.\nRubicon said that the gathering was discovered by one of its drone pilots on December 20, and was quickly targeted in an attack that went on for hours.\nRead more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205376Z"
    },
    {
      "original": "Elite Russian Drone Unit Eliminates Ukrainian Tank Gathering Near Kostiantynivka (Videos)\nThe Center for Advanced Unmanned Technologies “Rubicon” announced on December 26 that it has destroyed more than two dozen Ukrainian armored vehicles which were gathered in the Kostiantynivka direction in Donetsk in a well-planned special operation.\nThe gathering was near the city of Druzhkivka, a logistics and command hub of Kiev forces located right to the north of the city of Kostiantynivka where the Russian military’s Yug [South] Group of Forces is currently advancing.\nRubicon said that the gathering was discovered by one of its drone pilots on December 20, and was quickly targeted in an attack that went on for hours.\nRead more \nHERE",
      "timestamp": "2025-12-26T19:32:57.205384Z"
    }
  ],
  "script_run_time": "2025-12-26T19:32:57.206021Z"
}