{
  "messages": [
    {
      "original": "🛵\n  група БпЛА на Харківщині \n➡️\n курс на Дніпропетровщину.\n🛵\n БпЛА на Чернігівщині \n➡️\n в напрямку Київщини.",
      "timestamp": "2025-09-30T19:42:28.023149Z"
    },
    {
      "original": "🛵\n нова група БпЛА на Харківщині \n➡️\n курс південно-західний.",
      "timestamp": "2025-09-30T19:42:28.023184Z"
    },
    {
      "original": "🛵\n група БпЛА на Чернігівщині \n➡️\n курсом на Сумщину.\n🛵\n група БпЛА на Харківщині \n➡️\n курсом на Полтавщину та Дніропетровщину.\n🛵\n група БпЛА на Дніпропетровщині \n➡️\n в південно-західному напрямку.",
      "timestamp": "2025-09-30T19:42:28.023204Z"
    },
    {
      "original": "🛵\n🛵\n нова група БпЛА на Чернігівщині та Харківщині \n➡️\n курс південно-західний.",
      "timestamp": "2025-09-30T19:42:28.023213Z"
    },
    {
      "original": "🛵\n група БпЛА на Чернігівщині \n➡️\n курсом на південь.\n🛵\n група БпЛА на Харківщині \n➡️\n курсом на Полтавщину.\n🛵\n група БпЛА на Полтавщині \n➡️\n в західному напрямку.",
      "timestamp": "2025-09-30T19:42:28.023230Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщин ( Мена - Короп) \n➡️\n курсом на південно-західний напрямок.\n🛵\n БпЛА на півночі Харківщини \n➡️\n курсом на Харків.\n🛵\n група БпЛА на півдні від Сум \n➡️\n у західному напрямку.\n🛵\n  БпЛА на сході Полтавщині \n➡️\n у південно-західному напрямку.",
      "timestamp": "2025-09-30T19:42:28.023250Z"
    },
    {
      "original": "🛵\n Група ударних БпЛА на Харків, не ігноруйте сигнал повітряної тривоги, перебувайте в укриттях!",
      "timestamp": "2025-09-30T19:42:28.023256Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-09-30T19:42:28.023264Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі, в областях де оголошено повітряну тривогу.",
      "timestamp": "2025-09-30T19:42:28.023270Z"
    },
    {
      "original": "🛵\n БпЛА на Суми \n➡️\n з півночі.",
      "timestamp": "2025-09-30T19:42:28.023278Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей",
      "timestamp": "2025-09-30T19:42:28.023287Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-09-30T19:42:28.023292Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини \n➡️\n у південно-західному напрямку.\n🛵\n БпЛА на заході Харківщини \n➡️\n курсом на Полтавщину.\n🛵\n БпЛА на Суми  \n➡️\n з півночі.\n🛵\n  БпЛА на заході Полтавщині \n➡️\n курсом на Чернігівщину.",
      "timestamp": "2025-09-30T19:42:28.023311Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Сумщині, в районі н.п. Тростянець  \n➡️\n курсом на захід.",
      "timestamp": "2025-09-30T19:42:28.023317Z"
    },
    {
      "original": "🛵\n Ударний БпЛА на півдні Чернігівщини  \n➡️\n курсом на Київщину, Броварський район.",
      "timestamp": "2025-09-30T19:42:28.023323Z"
    },
    {
      "original": "🛵\n БпЛА на південь від Павлограда на Дніпропетровщині \n➡️\n курсом на захід",
      "timestamp": "2025-09-30T19:42:28.023329Z"
    },
    {
      "original": "🛵\n БпЛА на Бориспільський р-н Київщини.",
      "timestamp": "2025-09-30T19:42:28.023334Z"
    },
    {
      "original": "🛵\n  Уманський, Звенигородський райони Черкаської області загроза застосування ворожих БпЛА.",
      "timestamp": "2025-09-30T19:42:28.023338Z"
    },
    {
      "original": "🛵\n  БпЛА в районі Монастирище на Черкащині, курсом на Вінниччину.",
      "timestamp": "2025-09-30T19:42:28.023343Z"
    },
    {
      "original": "🛵\n Вінницький р-н Вінницька обл.\nзагроза застосування ударних БпЛА.",
      "timestamp": "2025-09-30T19:42:28.023348Z"
    },
    {
      "original": "Ukrainian Commander-in-chief Oleksandr Syrskyi has made a claim stating that Ukraine has recaptured around 175 km² and cleared an additional 195 km² from Russian DRGs in the \"Dobropillya Counteroffensive\".  \nI can personally confirm that approximately 110 km² were recaptured by Ukrainian forces, not including areas cleared by DRGs or areas since recaptured by Russian forces.",
      "timestamp": "2025-09-30T19:42:28.642913Z"
    },
    {
      "original": "A Ukrainian FPV drone strike from the 59th assault brigade shot down a Russian Mi-28 helicopter in the Pokrovsk direction.",
      "timestamp": "2025-09-30T19:42:28.642927Z"
    },
    {
      "original": "POV of the Ukrainian FPV drone strike on a Russian Mi-8 helicopter.",
      "timestamp": "2025-09-30T19:42:28.642932Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it. \nThe plan includes the following main points:\n1: Gaza will be a \"terror-free\" zone, meaning that militants from Hamas, and organisations fighting alongside Hamas such as the PIJ, PFLP, DFLP, Al-Aqsa Martyrs Brigades, etc, would have to leave the strip.\n2. Gaza will be \"redeveloped for the benefit of the people of Gaza\". \n3. The war will immediately end in all sectors, including artillery and air bombardment. IDF forces will withdraw to the yellow line shown on the map. (Please note that the current control line shown on Trump's map is completely wrong). A staged withdrawal will begin once conditions are met. \n4. 72 hours later, all hostages, alive and deceased, will be handed over to Israel.\n5. After the hostages are released, Israel will release 250 life sentence prisoners, as well as 1700 Gazans who were detained after October 7th, 2023, including all women and children. Additionally, for every Israeli hostage whose body is released, Israel will release the bodies of 15 deceases Gazans. \n6. After the hostage exchanges, all Hamas members who commit to \"peaceful co-existence\" and to decommission their weapons will be allowed safe passage out of the Gaza Strip to receiving countries. It is unknown if this will include members from other, Hamas-aligned organisations in Gaza. \n7. Full aid will then be sent to the Gaza Strip without interference, through the UN and its agencies, the red crescent, and other international institutions not associated with either party. The Rafah Border Crossing will also be opened, which the map below shows would be under IDF occupation.\n8. Gaza will be governed under a temporary, transitional government. It will be made up of \"qualified Palestinians\" and international experts and supervised by a new international transitional body headed by Trump. \n9. The Palestinian Authority will undergo a reform program. Once it has completed this, it will regain control over the Gaza Strip.\n10. No one will be forced to leave Gaza, but those who wish to can move to and from the strip.\n11. All military-related infrastructure in the Gaza Strip will be demolished and not rebuilt. \n12. The UN will work with Arab and international partners to develop a temporary International Stabilisation Force to immediately deploy to Gaza. It will train and provide support to Palestinian police forces in Gaza, as well as help secure Gaza's borders. \n13. The IDF will remain in the small perimeter zone shown on the map until Gaza is properly secured from any resurgence. \n14. An \"interfaith dialogue\" process will be established to change the mindsets of Palestinians and Israelis towards peace and co-existence. \n15. While Gaza is redeveloping and the PA is carrying out its reform program, there is a possibility for the recognition of a Palestinian state.",
      "timestamp": "2025-09-30T19:42:28.642961Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment.   The…",
      "timestamp": "2025-09-30T19:42:28.642966Z"
    },
    {
      "original": "The Ukrainian Navy reports that four Neptune cruise missiles were used to strike Karachev, Bryansk Oblast, rather than ATACMs.",
      "timestamp": "2025-09-30T19:42:28.642970Z"
    },
    {
      "original": "The White Houe has released the U.S. peace plan for Gaza. Netanyahu has agreed to this plan, and Hamas has stated that they are looking over it.   The plan includes the following main points:  1: Gaza will be a \"terror-free\" zone, meaning that militants from…",
      "timestamp": "2025-09-30T19:42:28.642974Z"
    },
    {
      "original": "Hamas and PIJ have denounced the U.S. peace plan as an \"American-Israeli agreement\" and a \"recipe for the continuation of aggression against the Palestinian people\". \nHamas stated that the plan is vague and not guaranteed, and that they will not accept any proposal that does not include self-determination for the Palestinian people.",
      "timestamp": "2025-09-30T19:42:28.642979Z"
    },
    {
      "original": "Russian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.47 km².",
      "timestamp": "2025-09-30T19:42:28.642986Z"
    },
    {
      "original": "⚡️\n🇺🇸\n🇵🇸\n🇮🇱\n \nNYT:\n A New York Times/Siena poll shows American sympathies have shifted, with 35% siding with Palestinians and 34% with Israel. \nSix in ten voters say Israel should end its campaign even if hostages remain in captivity or Hamas survives, while a majority now oppose sending further US military or economic aid.\nPro-Palestinian sentiment among Democrats has surged with 54% now supporting Israel while Republicans remain largely supportive of Israel at 64%.\n@wfwitness",
      "timestamp": "2025-09-30T19:42:28.643001Z"
    },
    {
      "original": "⚡️\n🇺🇸\n🇵🇸\n🇮🇱\n NYT: A New York Times/Siena poll shows American sympathies have shifted, with 35% siding with Palestinians and 34% with Israel.   Six in ten voters say Israel should end its campaign even if hostages remain in captivity or Hamas survives, while a…",
      "timestamp": "2025-09-30T19:42:28.643011Z"
    },
    {
      "original": "It will be interesting to see how much this affects the 2028 elections. Democrats may have to take a less pro-Israel stance if trump doesn’t do anything drastic push moderates away from him.",
      "timestamp": "2025-09-30T19:42:28.643015Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-09-30T19:42:28.643019Z"
    },
    {
      "original": "Russia is continuing their strikes on the Ukrainian crossings between the western suburbs of Kherson, and  Korobelnyi Island. In the first video, we can see how two barges were lined up to provide a secondary crossing.",
      "timestamp": "2025-09-30T19:42:28.643023Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.\nUkrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high ground overlooking the village. They also began attacks over the Nitrius River to the rear of Hlushchenkove, supported by attacks from Novyi Myr towards the treelines along the Donetsk - Kharkiv regional border. \nUkrainian forces also resumed assault operations along the Donetsk - Luhansk Regional border towards the forest plantations southwest of Hrekivka, and have entered the forest west of Hrekivka. To the southwest, the Ukrainians continued to attack east through Ridkodub towards the agricultural buildings and the eastern houses, and across the Nitrius River into northeastern Karpivka, but for now Russia is holding their ground. \nMeanwhile, Russian forces continued to slowly advance around Novomykhailivka. They were able to recapture most of the rest of the village and entered the forest to the west from the south, which the Ukrainians are simultaneously attempting to infiltrate from the north. They also cleared the rest of the forests on approach to the gulley north of Novomykhailivka.\nAdditionally, Russian forces are carrying out attacks from Hrekivka towards the Luhansk - Kharkiv regional border, and from the treelines southwest of Hrekivka towards the next large forest. In the southwest, they are attempting to advance into the rear of Ridkodub from which the Ukrainians are attacking, as well as across one of the dams over the Nitrius River at the northern edge of Karpivka. \n+ ~5.85 km² in favour of Ukraine. \n+ ~2.69 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643034Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.  Ukrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high…",
      "timestamp": "2025-09-30T19:42:28.643038Z"
    },
    {
      "original": "In the Borova direction, high-intensity fighting continues, with both Russian and Ukrainian forces making slow progress.  Ukrainian forces managed to recapture most of the positions Russia took north of Hlushchenkove last month, securing parts of the high…",
      "timestamp": "2025-09-30T19:42:28.643042Z"
    },
    {
      "original": "For example, this \npost\n was in a delayed format, allowing for more clear and precise info.",
      "timestamp": "2025-09-30T19:42:28.643049Z"
    },
    {
      "original": "If I do choose to go with a delayed format, this will only be temporary.  My goal with this account has always been to provide some of the most accurate and unbiased updates possible, as personally, I am so sick of skewed reporting from most outlets - both mainstream and alternative. \nI spend much longer than people think on checking, double-checking, cross-referencing, researching, and verifying reports, but I worry this isn't currently enough to reach my own personal standards for accuracy. Already, there have been some updates I simply haven't felt comfortable publishing, even if I use the same steps for other updates.",
      "timestamp": "2025-09-30T19:42:28.643056Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to make significant progress, capturing numerous new key positions on a wide front.\nIn the north, after repelling Ukrainian attacks into Shandryholove, Russian forces advanced beyond the Nitrius River and captured the forested areas at the base of a gulley, and began their attacks towards the forests to the south. They were also able to secure the treeline running north of the gulley, connecting this bridgehead with the larger front further north.\nTo the south, after consolidating in the agricultural complex, Russian forces pushed into the northern part of the forest north of Novoselivka, and began attacking west towards the larger forest. Other forces advanced over the Nitrius River, and established control over all of northern Novoselivka. These assault groups began pushing north to the first forest, squeezing the Ukrainians out from their positions against the western bank of the large reservoir. From there, they began pushing further west through the forests, with extensive FPV drone strikes working on the Ukrainian positions, supply routes, and distribution points ahead of them. Further south, assault operations began towards the centre of Novoselivka, where the grey zone has expanded. \nIn the southeast, Russian forces continued to incrementally advance south down the Shandryholove - Drobysheve Road, and have now branched off onto the perpendicular treeline on the northern approaches to Drobysheve. Further east, after prolonged heavy fighting, the Russians broke through the remaining Ukrainian positions in the forests east of Derylove, and with help from forces in the western houses of the settlement, managed to squeeze the Ukrainians out of the centre, before occupying the positions in the forest plantations directly south of the village. \nAdditionally, Russian forces began a coordinated effort to secure the northeastern approaches to Drobysheve. Attacks were carried out towards the next treeline over from Derylove. Once this was occupied, they began storming Ukrainian strongpoints in the forested gulley from the west, and the foothold from the northeast, where heavy battles are still ongoing. \n+ ~9.19 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643066Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards Lyman from the east, making important progress in and around Zarichne.\nIn the south, Russian forces continued to push west through the forest south of Zarichne, and reached its western edge. The newly captured positions in this forest were then used as staging grounds to advance to, and capture positions in the southern houses of Zariche. These positions have since been linked up to the initial Russian bridgehead over the Zherebets River in southeastern Zarichne, resulting in large parts of the grey zone being cleared and a salient forming. Ukrainian forces are still moving in and out of the grey zone via the industrial zone in the southwest of the village, but Russia's grip on this area is becoming increasingly tight.\nFurther north, Russian forces finally cleared out the rest of northern Zarichne, and occupied the Ukrainian positions in the agricultural buildings on the western outskirts. From there, they began pushing northwest through the forests up the gulley and have almost cut off the Ukrainian garrison in Myrne. Attacks were also carried out up the western bank of the Zherebets River, as well to the trenches on the northern edge of Myrne. \nIn the northwest, Russian forces resumed their assault operations towards Stavky from the northeast and were able to capture new positions in three separate treelines.\n+ ~9.51 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643073Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to make significant progress, and have collapsed a section of Ukraine's defensive line outside Siversk.\nIn the east, Russian forces continued to infiltrate through the fields towards Dronivka, and were able to consolidate in the mine. From there, they are infiltrating towards the chalk quarry east of Dronivka. As a result of this, Ukraine was forced to withdraw from the village of Serebryanka, and is now holding a defence from three sides in Dronivka. Russian forces have also recaptured the rest of Serebryanka, as well as the surrounding positions, and are now trying to permanently establish themselves in the chalk quarry. \nThe Russians were also able to fully secure the northern bank of the Siverskyi Donets River, aligning the front along the Donetsk - Luhansk Regional Border, and officially ending the battles for the Severodonetsk District of Luhansk Oblast which have been ongoing since the first days of the war. \nTo the west, Russian forces marginally advanced towards Dronivka from the west, securing new positions in the forest on the western bank of the Siverskyi Donets River. \nIn the west, Russian forces continued their offensive on Yampil. They were able to consolidate control over additional positions in the eastern part of the village, including at the railway station, and are continuing their attacks beyond the village centre (which is currently in the grey zone). They were also able to advance further west through the forests, establishing control over the railway crossing and surrounding areas.\n+ ~24.46 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643081Z"
    },
    {
      "original": "On the western flank of Kostyantynivka, Russian forces continued their offensive north towards the city of Druzhkivka, and have made additional progress along the tactical heights and in the low-lying ground.\nRussian forces pushed further north along the Poltavka River, and have established control over new positions in the forest plantations surrounding the reservoir. Further west, they crossed a gulley and secured the forest plantations on its northern edge, while other forces pushed north along the treelines on the tactical heights to the northeast.\n+ ~6.12 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643086Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to quickly advance and have broken through Ukrainian positions towards Verbove.\nAfter capturing Kalynivske, Russian forces began pushing west along the road to Verbove under heavy air and artillery cover, quickly capturing Ukrainian positions there and in the treelines on the tactical heights to the south. From there, they entered eastern Verbove with little resistance and occupied at least half of the village, including the agricultural buildings. The intensity of FAB glide-bomb strikes in this area is increasing, with Ukrainian temporary deployment points and fortifications constantly being struck.\nAdditionally, Russian forces advanced north from their positions west of Berezove, and captured the one-house \"village\" of Stepove. They then pushed further and established control over the treeline to the north, as well as the treelines east of Stepove. \nTo the northeast, Russian forces advanced further north up the gulley leading to southwestern Sosnivka, and cleared out the rest of the salient here. \n+ ~17.81 km² in favour of Russia.",
      "timestamp": "2025-09-30T19:42:28.643093Z"
    },
    {
      "original": "A short time ago, Israeli forces infiltrated the village of Koayiah in southern Syria from their buffer zone around the Golan Heights. \nUnder the cover of reconnaissance drones, they advanced down the road through the village of Ma'ariya, and established control over Koayiah up to the bridge leading to the neighbouring settlement of Baiyt Irah. \nSeveral vehicles have been deployed, and two checkpoints were set up - one of which is on the Koayiah - Aabdyn Road, controlling movement in and out of Koayiah.",
      "timestamp": "2025-09-30T19:42:28.643098Z"
    }
  ],
  "script_run_time": "2025-09-30T19:42:29.093627Z"
}