{
  "messages": [
    {
      "original": "🚀\n Пуски КАБ на Донеччину",
      "timestamp": "2025-12-02T09:39:59.971877Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 39 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 2 грудня (з 18:00 1 грудня) противник атакував 62-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Міллерово, Приморсько-Ахтарськ – рф, Чауда - ТОТ АР Криму та Донецька, понад 35 із них – \"шахеди\".\nПовітряний напад відбивали зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 39 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 20 ударних БпЛА на 8 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n \n🇺🇦\nРазом – до перемоги!",
      "timestamp": "2025-12-02T09:39:59.971921Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину",
      "timestamp": "2025-12-02T09:39:59.971928Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину!",
      "timestamp": "2025-12-02T09:39:59.971933Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на півночі Сумщини в районі Зноб-Новгородськогою\n🛵\n🛸\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Васильківку.\n🛵\n \n🛸\n БпЛА на півночі Донеччини в районі Добропілля, Новомиколаївки.",
      "timestamp": "2025-12-02T09:39:59.971949Z"
    },
    {
      "original": "⚠\nУВАГА!\n🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-02T09:39:59.971959Z"
    },
    {
      "original": "🚀\n КАБи на схід Харківщини, північ Донеччини!",
      "timestamp": "2025-12-02T09:39:59.971965Z"
    },
    {
      "original": "🛵\n БпЛА на південному заході Чернігівщини \n➡️\n курсом на Київщину.",
      "timestamp": "2025-12-02T09:39:59.971973Z"
    },
    {
      "original": "🛵\n БпЛА з Бєлгородської обл., рф \n➡️\n на північ Харківщини!",
      "timestamp": "2025-12-02T09:39:59.971980Z"
    },
    {
      "original": "🚀\n КАБи на схід Харківщини!",
      "timestamp": "2025-12-02T09:39:59.971985Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу \n➡️\n на Харків. Чугуїв.\n🛵\n БпЛА на сході Київщини \n➡️\n курсом на Бориспіль!",
      "timestamp": "2025-12-02T09:39:59.971995Z"
    },
    {
      "original": "🚀\n КАБи на Запорізьку область!",
      "timestamp": "2025-12-02T09:39:59.972015Z"
    },
    {
      "original": "🛵\n БпЛА зі сходу \n➡️\n на Харків. Чугуїв. \n🛵\n БпЛА на сході Київщини \n➡️\n курсом на Бориспіль!",
      "timestamp": "2025-12-02T09:39:59.972026Z"
    },
    {
      "original": "🛵\n БпЛА на Чугуїв зі сходу!\n🛵\n БпЛА на Обухів зі сходу!",
      "timestamp": "2025-12-02T09:39:59.972033Z"
    },
    {
      "original": "🚀\n КАБи на Запорізьку область!",
      "timestamp": "2025-12-02T09:39:59.972039Z"
    },
    {
      "original": "⚠\nУВАГА!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-02T09:39:59.972047Z"
    },
    {
      "original": "🚀\n КАБи на схід Харківщини!",
      "timestamp": "2025-12-02T09:39:59.972051Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини, південь Сумщини!",
      "timestamp": "2025-12-02T09:39:59.972056Z"
    },
    {
      "original": "🚀\n КАБи на Запорізьку область!",
      "timestamp": "2025-12-02T09:39:59.972061Z"
    },
    {
      "original": "🚀\n КАБи на Запорізьку область!",
      "timestamp": "2025-12-02T09:39:59.972065Z"
    },
    {
      "original": "🛵\n БпЛА на Білу Церкву з південного заходу!",
      "timestamp": "2025-12-02T09:39:59.972070Z"
    },
    {
      "original": "The other 3 Tu-95MS redeployed back to Belaya Airbase, Irkutsk Oblast.",
      "timestamp": "2025-12-02T09:40:00.576245Z"
    },
    {
      "original": "Somehow I missed this, but 1 An-124-100 cargo plane landed at Belaya Airbase yesterday, delivering Kh-101 cruise missiles for the 3 Tu-95MS.\nThus, 7 Tu-95MS are now confirmed to be equipped with missiles in the far east.",
      "timestamp": "2025-12-02T09:40:00.576264Z"
    },
    {
      "original": "Footage showing damage to the backside of the office building. The Iskander seemingly hit the front of the building, facing towards the highway.  Coordinates: 48.444089, 35.070738",
      "timestamp": "2025-12-02T09:40:00.576269Z"
    },
    {
      "original": "The target of the Russian Iskander strike on Dnipro was the 3D printing company \"3D Pechatʹ Dnepr\", which makes parts for Ukrainian UAVs. \nThis is evidenced by their Instagram profile showcasing some of their products, which include FPV drones used by the Ukrainian military.",
      "timestamp": "2025-12-02T09:40:00.576276Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published footage showing FP-2 drone strikes on Russian storage facilities for Geran-2 drones in Crimea.\nThe strikes were carried out on the facility at 45.145825, 35.733434, from which Geran-2 drones are transported to the launch sites around 15 km away at Cape Chauda. \nBased on the footage, only 2 of the 4 drones shown were successful in hitting their targets. The SOF also claimed that they hit the actual launch sites, but this was not shown in the published footage.",
      "timestamp": "2025-12-02T09:40:00.576283Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published footage showing FP-2 drone strikes on Russian storage facilities for Geran-2 drones in Crimea.  The strikes were carried out on the facility at 45.145825, 35.733434, from which Geran-2 drones are transported…",
      "timestamp": "2025-12-02T09:40:00.576288Z"
    },
    {
      "original": "Around half an hour ago, launches of Geran-2 drones took place from Cape Chauda, confirming the facility is still in use.",
      "timestamp": "2025-12-02T09:40:00.576292Z"
    },
    {
      "original": "As of now: no major changes.  Gerbera reconnaissance drones have been scouting out targets in Kyiv and Zhytomyr Oblasts - 2 of the regions I warned about earlier.   No major launches of Geran-2 drones to suggest an imminent missile attack have been recorded…",
      "timestamp": "2025-12-02T09:40:00.576296Z"
    },
    {
      "original": "So far, launches of Geran-2 drones have been carried out from the following locations:\n- Cape Chauda, Crimea.\n- Navlya Test Site, Bryansk Oblast.\n- Tsumbulova Test Site, Oryol Oblast.\n- Millerovo Airbase, Rostov Oblast.\n- Khalino Airbase, Kursk Oblast (x2) (Not confirmed yet)\nSo far, no mass launches of Geran-2 drones have been recorded which would indicate an upcoming missile attack, but this could all change very quickly. \nI will continue to monitor.",
      "timestamp": "2025-12-02T09:40:00.576308Z"
    },
    {
      "original": "This evening, at least five Russian Geran-2 drones attacked an unknown target in the industrial zone in the Inhulskyi Distrct of Mykolaiv City.",
      "timestamp": "2025-12-02T09:40:00.576313Z"
    },
    {
      "original": "This evening, at least five Russian Geran-2 drones attacked an unknown target in the industrial zone in the Inhulskyi Distrct of Mykolaiv City.",
      "timestamp": "2025-12-02T09:40:00.576319Z"
    },
    {
      "original": "Russian forces have captured the village of Vasyukivka, southern flank of Siversk, Donetsk Oblast.\nPre-war population: ~601.\nTotal land area: ~1.99 km².\nThe fighting for Vasyukivka lasted approximately 8 months, 24 days.",
      "timestamp": "2025-12-02T09:40:00.576329Z"
    },
    {
      "original": "Russian forces have captured the village of Predtechyne, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~377.\nTotal land area: ~0.87 km².\nThe fighting for Predtechyne lasted approximately 4 months.",
      "timestamp": "2025-12-02T09:40:00.576337Z"
    },
    {
      "original": "No missile attack tonight, btw.",
      "timestamp": "2025-12-02T09:40:00.576341Z"
    },
    {
      "original": "Random, but i need to give a thanks to AMK Mapping. without him, i wouldn’t have 830 subs nor would i even have a platform. The man has promoted my shit to his channel out of pity for my inability to be original",
      "timestamp": "2025-12-02T09:40:00.576346Z"
    },
    {
      "original": "Random, but i need to give a thanks to AMK Mapping. without him, i wouldn’t have 830 subs nor would i even have a platform. The man has promoted my shit to his channel out of pity for my inability to be original",
      "timestamp": "2025-12-02T09:40:00.576350Z"
    },
    {
      "original": "Guys, go get \nHudson War Mapping\n to 1,000 subscribers. He's a good friend of mine, a moderator in the chat, and genuinely a great guy.\nMy channel initially grew due to the help of other, larger profiles, and I like to return the favour from time to time.",
      "timestamp": "2025-12-02T09:40:00.576356Z"
    },
    {
      "original": "The IDF claimed that - in a targeted assassination airstrike - it killed Hasan Khudari, the logistics coordinator of the Palestinian Islamic Jihad's \"Nukhba\" special forces unit in the Gaza Battalion.\nHasan Khudari took part in the October 7 attacks on Israel, coordinating logistics for the elite \"Nukhba\" PIJ unit based in Gaza City. This unit is subordinate to the PIJ's \"Gaza Battalion\" (by far their most combat capable battalion).",
      "timestamp": "2025-12-02T09:40:00.576361Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇷🇺\nGovernor of the Oryol region Klychkov reports that Ukrainian drones targeted an oil facility in the Livensky district of the region causing a massive fire to break out.\nHe reports that fire fighters are at the site of the fire. No casualties from the strike have been reported. \n@wfwitness",
      "timestamp": "2025-12-02T09:40:00.576372Z"
    },
    {
      "original": "⚡️\n🇺🇦\n🇷🇺\nUkrainian drones also targeted Gudermes, in Ichkeria, this evening. \nReportedly a facility for Akhmat units was targeted.\n \n@wfwitness",
      "timestamp": "2025-12-02T09:40:00.576382Z"
    },
    {
      "original": "Despite claims by the Russian Ministry of Defence, Vovchansk is not yet fully captured by Russian forces, but it will be soon.\nClashes are continuing on the southeastern outskirts of the city where some pockets of Ukrainian resistance remain. We will likely receive confirmation of the city's capture in the next few days.",
      "timestamp": "2025-12-02T09:40:00.576386Z"
    },
    {
      "original": "As a part of preparations for the upcoming combined missile attack on Ukraine, a Russian Gerbera reconnaissance drone is currently scouting out the Trypillya Thermal Power Plant in Kyiv Oblast.",
      "timestamp": "2025-12-02T09:40:00.576389Z"
    },
    {
      "original": "Over the last month, the total area in Zaporizhzhia Oblast still controlled by Ukraine has decreased by approximately 5.1%.",
      "timestamp": "2025-12-02T09:40:00.576393Z"
    },
    {
      "original": "🇷🇺\n🇹🇷\n🇺🇦\n❗️\n — The Russian tanker MIDVOLGA-2, carrying sunflower oil to Georgia, reported an attack about 80 miles off Turkey’s Black Sea coast, inside Turkey’s EEZ.\n➡️\n No injuries were reported, and the ship continued toward Sinop. \n➡️\n This marks the third attack in the area within a few days, and Turkish authorities are assessing what happened.\n@TabZLIVE",
      "timestamp": "2025-12-02T09:40:00.576405Z"
    },
    {
      "original": "Ukraine Is Slowly, But Surly, Losing Battles In Kostiantynivka And Krasny Liman (Videos)\nOn December 1, the Russian military broke through Ukrainian defenses to the north of the city of Kostiantynivka and expanded its control to the south of the city of Krasny Liman in Donetsk.\nThe Yug [South] Group of Forces broke through Ukrainian defenses to the north of Kostiantynivka and captured Klinovoye, according to the Russian Ministry of Defense. The settlement is located just four kilometers to the east of the main road leading to the northern entrance of the city.\nBefore advancing towards the key road, the Yug Group of Forces will likely work to expand their control around Klinovoye. Bezim’yane, Popasne and Virolyubivka, all located to the south and southeast of the settlement, will likely come under attack soon.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161131Z"
    },
    {
      "original": "Ukraine Is Slowly, But Surly, Losing Battles In Kostiantynivka And Krasny Liman (Videos)\nOn December 1, the Russian military broke through Ukrainian defenses to the north of the city of Kostiantynivka and expanded its control to the south of the city of Krasny Liman in Donetsk.\nThe Yug [South] Group of Forces broke through Ukrainian defenses to the north of Kostiantynivka and captured Klinovoye, according to the Russian Ministry of Defense. The settlement is located just four kilometers to the east of the main road leading to the northern entrance of the city.\nBefore advancing towards the key road, the Yug Group of Forces will likely work to expand their control around Klinovoye. Bezim’yane, Popasne and Virolyubivka, all located to the south and southeast of the settlement, will likely come under attack soon.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161150Z"
    },
    {
      "original": "A Buffer by Design: Why Ukraine's Partition is Becoming Inevitable\nViktor Orbán has once again stated that Ukraine must return to the status of a “buffer state,” which, according to him, it historically was. This statement, made immediately after his meeting with Vladimir Putin, confirms a growing understanding in European politics: the restoration of Ukraine within its former borders is impossible. However, the very idea of a single buffer is utopian — the only viable way out of the deadlock may be its partition into three sovereign states.\nTo understand the flaw in this logic, one need only examine Orbán’s own detailed proposal. \n“The only possible long-term solution is for the post-war order to be based on the fundamental principle that Ukraine becomes the buffer state it once was. Russia retains the territory agreed upon at an international peace conference, and everything west of that line—up to NATO's eastern border—constitutes the territory of the Ukrainian state...\"\n👉\n Read more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161163Z"
    },
    {
      "original": "Military Situation In Ukraine On December 1, 2025 (Maps Update)",
      "timestamp": "2025-12-02T09:40:01.161168Z"
    },
    {
      "original": "Military Situation In Ukraine On December 1, 2025 (Maps Update)",
      "timestamp": "2025-12-02T09:40:01.161172Z"
    },
    {
      "original": "Defeat In Stepnogorsk: Russia Deals Another Blow To Ukraine’s Forces In Zaporizhzhia\nThe Russian military has defeated and besieged Kiev forces with Stepnogorsk in Zaporizhzhia. Ukraine defenses collapsed to the north of Kostiantynivka in Donetsk. \nMeanwhile, peace talks shift to Russia as Ukrainian President Volodymyr Zelensky claims “tough issues” need to be worked out.\nRead more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161180Z"
    },
    {
      "original": "Defeat In Stepnogorsk: Russia Deals Another Blow To Ukraine’s Forces In Zaporizhzhia\nThe Russian military has defeated and besieged Kiev forces with Stepnogorsk in Zaporizhzhia. Ukraine defenses collapsed to the north of Kostiantynivka in Donetsk. \nMeanwhile, peace talks shift to Russia as Ukrainian President Volodymyr Zelensky claims “tough issues” need to be worked out.\nRead more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161188Z"
    },
    {
      "original": "A BATTLEFIELD TURNING POINT: RUSSIAN GAINS RESHAPE THE SOUTHERN FRONT",
      "timestamp": "2025-12-02T09:40:01.161192Z"
    },
    {
      "original": "Russia Has Armed Geran Drones With Air-To-Air Missiles (Video, Photos) \nRussia has apparently developed an interceptor version of the Geran-2 drone that can be armed with an R-60M short-range air-to-air missile.\nThe existence of this version was revealed by Ukrainian media, which shared on December 1 footage showing an attempt to intercept one such drone and photos showing its wreckage. The drone was armed with one R-60M. The missile is placed in an inverted standard APU-60-I launcher on top of the drone.\nRead more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161204Z"
    },
    {
      "original": "Russia Has Armed Geran Drones With Air-To-Air Missiles (Video, Photos) \nRussia has apparently developed an interceptor version of the Geran-2 drone that can be armed with an R-60M short-range air-to-air missile.\nThe existence of this version was revealed by Ukrainian media, which shared on December 1 footage showing an attempt to intercept one such drone and photos showing its wreckage. The drone was armed with one R-60M. The missile is placed in an inverted standard APU-60-I launcher on top of the drone.\nRead more \nHERE",
      "timestamp": "2025-12-02T09:40:01.161212Z"
    }
  ],
  "script_run_time": "2025-12-02T09:40:01.162147Z"
}