{
  "messages": [
    {
      "original": "🚀\n Пуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-29T10:54:09.900923Z"
    },
    {
      "original": "🛵\n БпЛА із західного напрямку Донеччини, курс на північ.",
      "timestamp": "2025-12-29T10:54:09.900940Z"
    },
    {
      "original": "🛵\n БпЛА на північно-східному напрямку Чернігівщини, курс на південь.",
      "timestamp": "2025-12-29T10:54:09.900946Z"
    },
    {
      "original": "🛵\n БпЛА на н.п.Холми на Чернігівщині.",
      "timestamp": "2025-12-29T10:54:09.900951Z"
    },
    {
      "original": "🛵\n БпЛА на н.п.Корюківка на Чернігівщині.",
      "timestamp": "2025-12-29T10:54:09.900955Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 21 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 29 грудня (з 21:00 28 грудня) противник атакував 25-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Міллєрово – рф., Гвардійське - ТОТ АР Криму, Донецьк - ТОТ, близько 15 із них ‘’шахеди”.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 08:30, протиповітряною обороною збито/подавлено 21 ворожий БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання чотирьох ударних БпЛА на двох локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги.",
      "timestamp": "2025-12-29T10:54:09.900974Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова.",
      "timestamp": "2025-12-29T10:54:09.900978Z"
    },
    {
      "original": "🛵\n БпЛА  на н.п.Новодонецьке на Донеччині.",
      "timestamp": "2025-12-29T10:54:09.900983Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-29T10:54:09.900992Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курс на північ Запоріжжя.",
      "timestamp": "2025-12-29T10:54:09.900997Z"
    },
    {
      "original": "🛫\nАктивність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-29T10:54:09.901003Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-29T10:54:09.901007Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Київщину (Броварський район).",
      "timestamp": "2025-12-29T10:54:09.901011Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область та Донеччину.",
      "timestamp": "2025-12-29T10:54:09.901016Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-29T10:54:09.901020Z"
    },
    {
      "original": "🛸\n \n🛵\n БпЛА на півночі Харківщини курсом на Дергачі.",
      "timestamp": "2025-12-29T10:54:09.901026Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини курсом на захід.",
      "timestamp": "2025-12-29T10:54:09.901030Z"
    },
    {
      "original": "🛵\n Дніпро - БпЛА зі сходу у напрямку міста.",
      "timestamp": "2025-12-29T10:54:09.901034Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини курсом на Березну.",
      "timestamp": "2025-12-29T10:54:09.901039Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-29T10:54:09.901043Z"
    },
    {
      "original": "In the Khotin and Yunakivka directions, Russian forces intensified their assault operations and have made significant progress over the last week.\nIn the west, Russian forces resumed their assault operations south of Kostyantynivka, recapturing positions in the gulleys east of the road to Khotin. Attacks are now underway towards the northern outskirts of Kindrativka. \nTo the southeast, Russian forces continued to advance in Andriivka, where they consolidated in the northern part of the village. Fighting is ongoing for its southwestern houses. \nTo the east, Russian forces managed to consolidate in the last parts of Varachyne and continued advancing southeast through the treelines from Oleksiivka. They also secured new positions in the fortified forests southwest of Yablunivka and improved their positions in the treelines south of Varachyne. Ukrainian forces carried out unsuccessful counterattacks in the direction of Varachyne. \nTo the southeast, Russian forces managed to break through Ukrainian defences in the vicinity of the highway west of Yunakivka, capturing new positions in the direction of Khrapivshchyna. Additionally, following earlier attacks, Russian forces managed to consolidate in a number of positions in the two treelines southwest of Yunakivka. Fighting is ongoing for areas further southwest.\nIn the east, Russian forces restarted their assault operations in the direction of Sadky. They managed to re-enter a forest west of the international border, capturing part of it, and consolidated in additional forested positions along the international border. \n+ ~20.59 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631597Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued to advance and have captured new positions in two different areas.\nIn the west, Russian forces restarted their assault operations in the village of Starytsya. They advanced west from their positions in the eastern part of the village and recaptured positions in the area of the agricultural buildings.\nIn the east, Russian forces continued incrementally advancing through Vovchanski-Khutory, bypassing the centre of the village from the south and capturing new positions in the residential streets there.\n+ ~1.06 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631621Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to advance, making new progress in the direction of Kolodyazne.\nBuilding on their earlier success, Russian forces continued to shrink the Ukrainian salient south of Dvorichanske. They captured the rest of the forest west of Kamyanka and entrenched along the Bolohivka - Krasne Pershe Road. \nOther assault groups attacked from the north, capturing new treeline positions and establishing control over part of a nearby forest. \n+ ~3.47 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631639Z"
    },
    {
      "original": "In the Kupyansk direction, Ukrainian forces continued their counterattacks north of Kupyansk, capturing new positions in the direction of the Oskil River.\nUkrainian forces consolidated in the forests west of the R-79 Highway and began attacking further east along the road to Zapadne. They managed to recapture positions in the treelines there and established control over the gas pumping station and the nearby forest plantations. Other forces infiltrated the forest south of Zapadne.\n+ ~3.84 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631647Z"
    },
    {
      "original": "In the Kupyansk direction, over the last 10 days Ukrainian forces continued their counterattacks, making significant progress on both banks of the Oskil River.\nIn the east, Ukrainian forces cleared the eastern edge of Kurylivka from Russian DRGs once again and began pushing back towards the highway. They advanced northeast through the treelines, and southeast through the forested gulleys, securing the poorly consolidated Russian positions. Russian forces are now attempting to attack Ukrainian positions in the area of the highway once again. Additionally, Ukrainian forces recaptured the southeastern part of Petropavlivka and secured the forest plantations to the south.\nTo the northwest, Ukrainian forces cleared the central part of Petropavlivka from Russian DRGs and recaptured the eastern houses of the village. From there, they pushed further north and recaptured large parts of northern Petropavlivka, reaching the southern bank of the tributary of the Hnylytsya River. \nTo the west, Ukrainian forces began a series of coordinated efforts aimed at recapturing the eastern part of Kupyansk. After bringing in reinforcements to the southeastern part of the city, Ukrainian assault groups began pushing north up the eastern bank of the Oskil river, past the highway, recapturing large parts of the low-rise residential areas as well as the milk processing factory. Heavy fighting is ongoing for the Kupyansk Sugar Factory. \nOther assault groups re-entered the large industrial zone east of the railway line, quickly recapturing the vast majority of it. This was done in coordination with attacks from the east in Kurylivka, which allowed for the Ukrainians to also push the Russians out of this village and consolidate in large parts of the adjacnet forests.\nIn southwestern Kupyansk, Ukrainian forces captured additional streets south of the central market and established control over the Kupyansk Motor Transport College. Fighting is ongoing for the neighbouring machine-building plant. \nIn central Kupyansk, Ukrainian forces secured the remaining low-rise residential streets west of the city centre and captured the museum and a number of high-rise buildings. Fighting is ongoing for the city's administrative building. \nIn northwestern Kupyansk, Ukrainian forces continued their clearing operations against small groups of encircled Russian soldiers. They were able to capture new positions in the low-rise residential streets and secured most of the apartment buildings making up the \"comb\" stronghold.\n+ ~24.30 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631658Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces have launched a series of counterattacks, making new progress in two different areas.\nIn the north, following earlier Russian advances, Ukrainian forces cleared the northern-most part of Bohuslavka and began attacking into the neighbouring village of Zahryzove. They managed to consolidate in the southern part of the village, before attacking further north and securing the central, western, and eastern streets. \nIn the south, following an earlier Russian pipeline operation, Ukrainian FPV drone operators managed to kill a significant portion of the Russian soldiers who exited the pipe near the highway northeast of Novoplatonivka. Assault groups then cleared the northern outskirts of the village from Russian DRGs and recaptured the section of the highway, including a large trench fortification. \n+ ~8.83 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631666Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced in different areas of Donetsk and Luhansk Oblasts.\nIn the northeast, Russian forces restarted their assault operations in western Luhansk Oblast. They advanced west along a treeline northwest of Novojehorivka and outflanked Ukrainian positions from the west by advancing south down the forest plantations in the direction of Tverdokhlibove. This allowed for them to secure the groves to the east.\nTo the south, Russian forces continued advancing towards the Donetsk-Luhansk regional border. They were able to break through Ukrainian positions north of the Lomovaty Forest, capturing new positions in the forests west of the reservoir. They also managed to improve their positions in the treeline and forest plantations east of the reservoir.\nTo the southwest, Ukrainian forces recaptured the treelines and forest plantations north of Hrekivka and re-entered the village. Fighting is ongoing and a large grey-zone has formed in the settlement.\nTo the west, Russian forces captured the rest of a forest west of Hrekivka and gained a foothold in the forest to the north. They also captured new treeline positions to the west. Additionally, the Russians resumed their assault operations in the forest west of Novomykhalivka following earlier unsuccesful attacks.\nIn the southwest, at some point recently, Ukrainian forces managed to clear the eastern bank of the Nitrius River southeast of Hlushchenkove and recaptured the lightly-manned positions in the forested areas northwest of Ridkodub. They also managed to consolidate in the remaining treelines southwest of Novyi Myr. \nMeanwhile, Russian forces resumed their attacks in Ridkodub. They managed to recapture the local school which has been in the grey-zone for some time due to Ukrainian glide-bomb strikes, and captured additional positions along Tsentralna street.\n+ ~6.34 km² in favour of Ukraine.\n+ ~6.20 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631677Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced at various different points.\nIn the southeast, Russian forces captured additional positions in the western part of the Pynkiv Yar Gulley, and continued advancing through the treelines to the west. DRGs continue infiltrating towards the northern outskirts of the city, while other DRGs broke into the city centre of Lyman from the area of School No. 2.\nTo the northwest, Russian forces resumed their assault operations northwest of the town of Drobysheve, where they recaptured positions in the large forest there.\nTo the west, Ukrainian forces managed to clear the western part of Yarova from Russian DRGs, pushing them back beyond the railway line and resecuring the road to Drobysheve.\nTo the north, Russian forces resumed their assault operations in the Sviati Hory National Park and captured new positions in the direction of the Sosnove - Oleksandrivka Road. \n+ ~2.54 km² in favour of Russia.\n+ ~0.90 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631695Z"
    },
    {
      "original": "On the southwestern flank of Kostyantynivka, Russian forces continued their assault operations and have made new progress in two different areas.\nIn the west, following earlier infiltrations, Russian forces managed to consolidate in the treelines west of Stepanivka, forcing the Ukrainians back into the village.\nIn the east, Russian forces continued their attacks along the highway in small groups and managed to consolidate in additional trenches in the direction of the highway intersection.\n+ ~2.83 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631711Z"
    },
    {
      "original": "In the Dobropillya direciton, Russian forces continued to advance, completing the capture of Myrnohrad and making new progress elsewhere.\nIn Myrnohrad, following extensive clearing operations, Russian forces established control over the remaining low-rise residential streets in the northwestern part of the city. They also captured the remaining high-rise buildings in the northeast, thereby establishing full control over the city.\nTo the northwest, Russian forces launched a new series of assault operations in Rodynske following recent Ukrainian counterattacks. They managed to clear the western part of the southeastern high-rise micro-district and establish control over parts of the southern low-rise residential area. \nAdditionally, they broke through Ukrainian defences in the city centre, capturing most of the rest of the three-story buildings and dislodging the Ukrainians from practically all of their strongpoints there. Fighting is ongoing with the remaining pockets of resistance in the northern and southwestern parts of the city. \nTo the east, Russian forces managed to recapture the  Krasnolymanskaya Mine and the nearby forested area. Other assault groups advanced north up the treeline east of the mine and entered the ventilation shaft, where fighting is ongoing. \n+ ~3.39 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631720Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-12-29T10:54:10.631723Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-12-29T10:54:10.631727Z"
    },
    {
      "original": "10 km away, flying to Tokari from the northeast",
      "timestamp": "2025-12-29T10:54:10.631730Z"
    },
    {
      "original": "Approximate path",
      "timestamp": "2025-12-29T10:54:10.631733Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-12-29T10:54:10.631736Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued to advance and have made important progress in and around Novopavlivka\nIn the east, Russian forces continued pushing north through the treelines south of Novopavlivka, capturing new positions east and west of the highway. Other assault groups continued expanding their zone of control within the town, capturing new positions in the southern and southeastern streets, approaching the town centre.\nIn the west, Russian forces managed to complete the capture of the fortified forests northwest of Filiya, securing the last section to the east of Ivanivka.\n+ ~7.20 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631743Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance and have captured the city of Hulyaipole.\nIn the southeast, following the fall of the city centre and large parts of the western streets, Russian forces advanced further west down the highway and captured the industrial zone. Other forces cleared the remaining residential streets in the northwest of the city. Additionally, Russian forces advanced beyond the city and captured treeline positions to the southwest and continued incrementally advancing through the 2022 fortifications to the south.\nIn the northwest, Russian forces continued to expand their bridgehead on the western bank of the Haichur River. They improved their positions in the treelines west of Dobropillya, while DRGs infiltrated past the railway line and into the treelines further west. Other assault groups began advancing north up the treelines to Kosivtseve, and entered the village, where fighting is ongoing.\n+ ~12.68 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T10:54:10.631752Z"
    },
    {
      "original": "Russian forces have captured the city of Hulyaipole, Hulyaipole direction, Zaporizhzhia Oblast.  Pre-war population: ~14,600. Total land area: ~25.10 km².  The fighting for Hulyaipole lasted approximately 32 days.",
      "timestamp": "2025-12-29T10:54:10.631761Z"
    },
    {
      "original": "Following the fall of Hulyaipole, I expect the next step of the Russian offensive (which initially started from Vuhledar and is \"wrapping around\" the southern Ukrainian defences) will be to capture the highest point of the tactical heights west of the city in the area of Zaliznychne.\nThe fall of Hulyaipole and most of the positions east of the Haichur River means that Russia has effectively reached the end of the unfavourable terrain they have been advancing through since Velyka Novosilka, and opens up opportunities to advance parallel with the tactical heights instead.\nThis can only be done once Russia establishes a large bridgehead west of the Haichur River, beyond the two tactical bridgeheads they currently hold in the area of Hulyaipole and Kosivtseve. Once this is able to encompass those tactical heights at Zaliznychne and at Ternuvate, the path to outflank the fortress city of Orikhiv from the north will open.",
      "timestamp": "2025-12-29T10:54:10.631769Z"
    },
    {
      "original": "Following the fall of Hulyaipole, I expect the next step of the Russian offensive (which initially started from Vuhledar and is \"wrapping around\" the southern Ukrainian defences) will be to capture the highest point of the tactical heights west of the city…",
      "timestamp": "2025-12-29T10:54:10.631773Z"
    },
    {
      "original": "Another thing that I should mention is that the current movements from Stepnohirsk in the direction of the Konka River suggest that the Russians are going to attempt to outflank Orikhiv from both sides.\nThe terrain here for Ukraine is incredibly unfavourable, and the only thing that prevented a Russian advance into Orikhiv was the extensive fortifications between the city and the infamous village of Robotyne. \nThis may be part of the reason why Ukraine has brought in reinforcements to the Zaliznychne area, west of Hulyaipole - to prevent the Russians from securing the highest point of the tactical heights and beginning their outflanking maneuver from the east.",
      "timestamp": "2025-12-29T10:54:10.631793Z"
    },
    {
      "original": "As usual, I won't comment on the Zelensky-Trump meeting. It's all theatre, there will be no peace deal. \nI continue to assess that none of the sides are prepared to negotiate in good faith, even if they say otherwise publicly. \nStop falling for the same tricks over and over again!",
      "timestamp": "2025-12-29T10:54:10.631800Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing FP-2 drone strikes on Russian rear targets.\nStrikes were carried on a Geran-2 storage facility near the city of Makiivka, Donetsk Oblast, and a repair unit for the Russian 1435th Motor Rifle Regiment near Antratsyt, Luhansk Oblast.",
      "timestamp": "2025-12-29T10:54:10.631804Z"
    },
    {
      "original": "Military Situation In Ukraine On December 28, 2025 (Maps Update)",
      "timestamp": "2025-12-29T10:54:11.399342Z"
    },
    {
      "original": "Military Situation In Ukraine On December 28, 2025 (Maps Update)",
      "timestamp": "2025-12-29T10:54:11.399354Z"
    },
    {
      "original": "China Tested State-Of-Art Hypersonic Anti-Ship Ballistic Missile (Video)\nChina Military Bugle, an official social media account under the People’s Liberation Army News Media Center, on December 28 showing the successful launch of a YJ-20 hypersonic anti-ship ballistic missile.\nThe state-of-the-art missile was fired from the Type 055 destroyer Wuxi of the People’s Liberation Army Navy during a “finalization test,” according to the outlet.\nA finalization test is a term commonly used by Chinese state media to describe the final major trial or evaluation of a weapon system before concluding the design phase and approving it for full-scale production and operational deployment.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399366Z"
    },
    {
      "original": "China Tested State-Of-Art Hypersonic Anti-Ship Ballistic Missile (Video)\nChina Military Bugle, an official social media account under the People’s Liberation Army News Media Center, on December 28 showing the successful launch of a YJ-20 hypersonic anti-ship ballistic missile.\nThe state-of-the-art missile was fired from the Type 055 destroyer Wuxi of the People’s Liberation Army Navy during a “finalization test,” according to the outlet.\nA finalization test is a term commonly used by Chinese state media to describe the final major trial or evaluation of a weapon system before concluding the design phase and approving it for full-scale production and operational deployment.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399375Z"
    },
    {
      "original": "Military Situation In Syria On December 28, 2025 (Map Update)",
      "timestamp": "2025-12-29T10:54:11.399379Z"
    },
    {
      "original": "Mass Protests By Syrian Alawites In Coastal Heartland Turn Deadly (Videos)\n \nTens of thousands of Alawites took to the streets on the Syrian coast, the heartland of the community, and in several parts of the country’s central region on December 28, two days after a mosque bombing killed eight people.\nThe protests came after calls from prominent spiritual leader Ghazal Ghazal, head of the Islamic Alawite Council in Syria and Abroad, who a day earlier urged people to “show the world that the Alawite community cannot be humiliated or marginalized.”\nProtesters carried pictures of Ghazal along with banners expressing support for him, while chanting calls for a federal system in Syria. They also raised the flag of the Alawite State, which was established on the coast between 1920 and 1936 as a part of the French mandate at the time.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399390Z"
    },
    {
      "original": "Mass Protests By Syrian Alawites In Coastal Heartland Turn Deadly (Videos)\n \nTens of thousands of Alawites took to the streets on the Syrian coast, the heartland of the community, and in several parts of the country’s central region on December 28, two days after a mosque bombing killed eight people.\nThe protests came after calls from prominent spiritual leader Ghazal Ghazal, head of the Islamic Alawite Council in Syria and Abroad, who a day earlier urged people to “show the world that the Alawite community cannot be humiliated or marginalized.”\nProtesters carried pictures of Ghazal along with banners expressing support for him, while chanting calls for a federal system in Syria. They also raised the flag of the Alawite State, which was established on the coast between 1920 and 1936 as a part of the French mandate at the time.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399399Z"
    },
    {
      "original": "Russian Army Deepens Ukraine’s Wound In Zaporizhzhia (Videos)\nOn December 28, the Russian military expanded its control around the key city of Huliapole and near the settlement of Stepnohirsk, keeping the pressure on Kiev forces in Zaporizhzhia.\nThe Vostok [East] Group of Forces advanced west and south of Huliapole, which was captured a day earlier. Russian troops secured a total of 4,4 square kilometers. This rapid advance shows that Ukrainian troops have not recovered from the defeat they took in the city.\nTo the north of Huliapole, the Vostok Group of Forces expanded its control and stormed Zelene, which is located on the left bank of the Haichur River.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399408Z"
    },
    {
      "original": "Russian Army Deepens Ukraine’s Wound In Zaporizhzhia (Videos)\nOn December 28, the Russian military expanded its control around the key city of Huliapole and near the settlement of Stepnohirsk, keeping the pressure on Kiev forces in Zaporizhzhia.\nThe Vostok [East] Group of Forces advanced west and south of Huliapole, which was captured a day earlier. Russian troops secured a total of 4,4 square kilometers. This rapid advance shows that Ukrainian troops have not recovered from the defeat they took in the city.\nTo the north of Huliapole, the Vostok Group of Forces expanded its control and stormed Zelene, which is located on the left bank of the Haichur River.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399417Z"
    },
    {
      "original": "Israeli Army Receives First ‘Iron Beam’ Laser System (Photos) \nThe Israeli Defense Forces (IDF) had taken delivery of the first operational Iron Beam high-power laser interception system, the Israeli Ministry of Defense announced.\nDefense Minister Israel Katz called the delivery “a historic occasion,” saying in a statement that “the first time in the world that a high-power laser interception system has reached operational maturity,” adding that it “changes the rules of the game and sends a clear message to all our enemies… do not test us.”\nRead more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399425Z"
    },
    {
      "original": "Israeli Army Receives First ‘Iron Beam’ Laser System (Photos) \nThe Israeli Defense Forces (IDF) had taken delivery of the first operational Iron Beam high-power laser interception system, the Israeli Ministry of Defense announced.\nDefense Minister Israel Katz called the delivery “a historic occasion,” saying in a statement that “the first time in the world that a high-power laser interception system has reached operational maturity,” adding that it “changes the rules of the game and sends a clear message to all our enemies… do not test us.”\nRead more \nHERE",
      "timestamp": "2025-12-29T10:54:11.399432Z"
    },
    {
      "original": "Krasnopol Strikes: Summary Of Russian Combat Footage From December 28, 2025\nOn December 28, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-29T10:54:11.399439Z"
    },
    {
      "original": "Krasnopol Strikes: Summary Of Russian Combat Footage From December 28, 2025\nOn December 28, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-29T10:54:11.399445Z"
    }
  ],
  "script_run_time": "2025-12-29T10:54:11.400319Z"
}