{
  "messages": [
    {
      "original": "🛸\n  Ворожі розвідувальні БпЛА \n➡️\n у Запорізькій, Чернігівській, Харківській областях. Залучено засоби для збиття!",
      "timestamp": "2025-08-20T13:48:34.694324Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n на півночі Сумщини. Курс \n➡️\n на Чернігівщину.",
      "timestamp": "2025-08-20T13:48:34.694352Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному та південно-східному напрямках зберігається!\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-20T13:48:34.694367Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО БАЛІСТИЧНУ РАКЕТУ ТА 62 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 20 серпня (із 19.30 19 серпня) противник атакував 2-ма балістичними ракетами Іскандер-М (із ТОТ Криму), а також та 93-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Шаталово, Брянськ, Міллерово, Приморсько-Ахтарськ – рф., Чауда – ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено балістичну ракету Іскандер-М та 62 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання ворожої ракети та ударних БпЛА на 20 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-20T13:48:34.694399Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-20T13:48:34.694406Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Чернігівщині поблизу н.п. Березна. Залучено засоби для збиття. Даний безпілотник може бути навідником ворожих засобів ураження!",
      "timestamp": "2025-08-20T13:48:34.694414Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-08-20T13:48:34.694425Z"
    },
    {
      "original": "☄️\n Харківщина - загроза застосування балістичного озброєння!",
      "timestamp": "2025-08-20T13:48:34.694433Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-20T13:48:34.694440Z"
    },
    {
      "original": "🚀\n Запорізька область та Дніпропетровщина  (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-20T13:48:34.694448Z"
    },
    {
      "original": "🛸\n Чернігівщина - ворожі розвідувальні БпЛА на околицях Ніжина! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-08-20T13:48:34.694457Z"
    },
    {
      "original": "⚠\nУвага!\nРакетна небезпека по всій території України!\nЗліт МіГ-31К!",
      "timestamp": "2025-08-20T13:48:34.694468Z"
    },
    {
      "original": "⚠\nУвага! Ракетна небезпека по всій території України! Зліт МіГ-31К!",
      "timestamp": "2025-08-20T13:48:34.694473Z"
    },
    {
      "original": "📢\n Відбій загрози МіГ-31К по областях.",
      "timestamp": "2025-08-20T13:48:34.694477Z"
    },
    {
      "original": "🛵\n Харківщина - загроза ударних БпЛА.",
      "timestamp": "2025-08-20T13:48:34.694482Z"
    },
    {
      "original": "🛸\n На півночі Запорізької області - ворожий розвідувальний БпЛА в напрямку Дніпропетровщини! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-20T13:48:34.694486Z"
    },
    {
      "original": "🛸\n На північному сході Київської області - ворожий  БпЛА.\n⚡\n  Залучено засоби для їх збиття.",
      "timestamp": "2025-08-20T13:48:34.694495Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному  напрямку!\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-20T13:48:34.694501Z"
    },
    {
      "original": "🛵\n \n🛸\n На півночі Чернігівщини ворожі БпЛА \n➡️\n курс південно-західний.",
      "timestamp": "2025-08-20T13:48:34.694510Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на східному  напрямку!\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-20T13:48:34.694516Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину та Сумщину.",
      "timestamp": "2025-08-20T13:48:34.694520Z"
    },
    {
      "original": "Iskander launch from Crimea",
      "timestamp": "2025-08-20T13:48:35.254635Z"
    },
    {
      "original": "No updates on the MiG. Waiting on the Iskander to be detected.",
      "timestamp": "2025-08-20T13:48:35.254647Z"
    },
    {
      "original": "The Iskander is likely flying to Dnipro/Kryvyi Rih. Still not detected in the airspace.",
      "timestamp": "2025-08-20T13:48:35.254651Z"
    },
    {
      "original": "Iskander in the Nikopol area, flying to Kryvyi Rih",
      "timestamp": "2025-08-20T13:48:35.254655Z"
    },
    {
      "original": "The MiG-31K is flying through Lipetsk Oblast.",
      "timestamp": "2025-08-20T13:48:35.254658Z"
    },
    {
      "original": "The MiG-31K is flying through Lipetsk Oblast.",
      "timestamp": "2025-08-20T13:48:35.254661Z"
    },
    {
      "original": "The MiG is flying near the launch lines near Lipetsk City. Western course.",
      "timestamp": "2025-08-20T13:48:35.254664Z"
    },
    {
      "original": "Iskander in the Nikopol area, flying to Kryvyi Rih",
      "timestamp": "2025-08-20T13:48:35.254667Z"
    },
    {
      "original": "The Iskander disappeared",
      "timestamp": "2025-08-20T13:48:35.254670Z"
    },
    {
      "original": "2 MiG-31Ks are now confirmed to be airborne. Both in the Lipetsk area.",
      "timestamp": "2025-08-20T13:48:35.254674Z"
    },
    {
      "original": "The Iskander was a misidentification on the Ukrainian Airforce's part. No repeated launches recorded yet. Possibly an S-300/400 air defence missile.",
      "timestamp": "2025-08-20T13:48:35.254677Z"
    },
    {
      "original": "2 MiG-31Ks are now confirmed to be airborne. Both in the Lipetsk area.",
      "timestamp": "2025-08-20T13:48:35.254680Z"
    },
    {
      "original": "The MiGs are circling in the area of Lipetsk City, near the launch lines.",
      "timestamp": "2025-08-20T13:48:35.254683Z"
    },
    {
      "original": "Correction: only one MiG is operating near Lipetsk. The other is still in the area of Savasleika Airbase.",
      "timestamp": "2025-08-20T13:48:35.254690Z"
    },
    {
      "original": "Unconfirmed reports of a cruise missile in Belarusian airspace, flying south past Pinsk. A tactical aircraft of an unknown type was recorded there earlier.",
      "timestamp": "2025-08-20T13:48:35.254693Z"
    },
    {
      "original": "Unconfirmed reports of a cruise missile in Belarusian airspace, flying south past Pinsk. A tactical aircraft of an unknown type was recorded there earlier.",
      "timestamp": "2025-08-20T13:48:35.254696Z"
    },
    {
      "original": "Unidentified missile to Lutsk from the northeast",
      "timestamp": "2025-08-20T13:48:35.254699Z"
    },
    {
      "original": "The missile disappeared. It was definitely a cruise missile.",
      "timestamp": "2025-08-20T13:48:35.254702Z"
    },
    {
      "original": "Both MiG-31Ks are returning to Savasleika Airbase",
      "timestamp": "2025-08-20T13:48:35.254705Z"
    },
    {
      "original": "Not me getting Pekka on my Instagram reels feed…\nThis guy was outed as a pedo last year after people found out he ran a CP website btw. I think he’s trying to eliminate the competition.",
      "timestamp": "2025-08-20T13:48:35.254709Z"
    },
    {
      "original": "⚡️\n🇨🇳\n🇺🇦\n🇷🇺\n Russian Foreign Minister Lavrov confirmed that Russia proposed China as a security guarantor for Ukraine: \n\"The Russian Federation agrees that Ukraine's security guarantees should be ensured on an equal basis with the participation of countries such as China, the USA, the UK, and France.\"\n@wfwitness",
      "timestamp": "2025-08-20T13:48:35.254719Z"
    },
    {
      "original": "⚡\n🇺🇦\n🇷🇺\n Ukraine seen from space yesterday.\nThe fire caused by the Russian attack on the Krementchuck oil refinery caused a large trail of black smoke, pushed south by the wind, it reached southern Ukraine. The fire was extinguished during the afternoon.\nFurther south, another trail of smoke can be seen, much smaller but still large. This is the fuel train that was ambushed by Ukrainian FPV drones later on the morning.\n@wfwitness",
      "timestamp": "2025-08-20T13:48:35.254727Z"
    },
    {
      "original": "⚡\n🇺🇦\n🇷🇺\n Ukraine seen from space yesterday.  The fire caused by the Russian attack on the Krementchuck oil refinery caused a large trail of black smoke, pushed south by the wind, it reached southern Ukraine. The fire was extinguished during the afternoon.  Further…",
      "timestamp": "2025-08-20T13:48:35.254732Z"
    },
    {
      "original": "Thank god 90% of the missiles that attacked the oil refinery were intercepted",
      "timestamp": "2025-08-20T13:48:35.254735Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate:  The IDF is continuing its large operation aimed at securing the Zeitoun Neighbourhood of Gaza City, and has made progress into the more \"dangerous\" parts of the neighbourhood.  After securing the school and destroyed…",
      "timestamp": "2025-08-20T13:48:35.254739Z"
    },
    {
      "original": "For the record, the Israeli operation to occupy Gaza City that everyone is talking and speculating about already began weeks ago, with the beginning of the attacks on the Zeitoun Neighbourhood. The scale and speed of demolitions and clearings there is unprecedented. \nIn fact, they already control and have flattened large parts of the eastern Al-Tuffah and Shujaiyya Neighbourhoods, so we can expect relatively quick success in some areas. Five divisions are expected to take part in the rest of the operation.",
      "timestamp": "2025-08-20T13:48:35.254743Z"
    },
    {
      "original": "U.S. Officials Admit Failure In Stopping Arms Shipments To Yemen’s Houthis\nThe Houthis (Ansar Allah) are still arming themselves with help from Iran and efforts by the United States and its allies to cut the group’s supply lines have been ineffective, Al-Arabiya reported on August 19, citing U.S. officials.\nRecent weeks saw forces loyal to the internationally-recognized Yemeni government, which is allied to the U.S., seizing two weapons shipments en-route to the Houthis, one from Iran loaded with advanced anti-aircraft and anti-ship missiles, and another from China containing advanced drones...\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997242Z"
    },
    {
      "original": "1,000 To 19 Somber Exchange: Unspoken Language of War’s Toll\nIn the grim arithmetic of modern conflict, few events speak more plainly than the exchange of the fallen. On August 19th, Russia and Ukraine conducted another such transfer of bodies, a stark procedure that lays bare the brutal realities of the war’s human cost. The terms of the exchange were profoundly asymmetrical: Ukraine received the bodies of one thousand of its soldiers, while Russia recovered nineteen...\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997256Z"
    },
    {
      "original": "Military Situation in Palestine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T13:48:35.997261Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T13:48:35.997268Z"
    },
    {
      "original": "Battle for Pokrovsk’s Northern Flank: Ukrainian Counterattacks Stall\nDespite renewed diplomatic efforts to initiate a peace process, the intensity of combat on the Ukrainian fronts remains undiminished. The Pokrovsk urban agglomeration is still one of the most fiercely contested battlefields. The nature of the fighting, characterized by Russian tactics employing small assault groups in a strategy of “total infiltration” deep into Ukrainian defensive positions, has made it difficult to delineate clear front lines or zones of control. This ambiguity is actively exploited by Kyiv’s propaganda units, which frequently announce media victories that often bear little resemblance to the situation on the ground. In reality, the position of the Ukrainian army in this sector remains increasingly precarious...\nRead more:\n HERE",
      "timestamp": "2025-08-20T13:48:35.997275Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T13:48:35.997279Z"
    },
    {
      "original": "Military Situation In Ukraine On August 19, 2025 (Map Update)",
      "timestamp": "2025-08-20T13:48:35.997283Z"
    },
    {
      "original": "ISKANDER OVER UKRAINE PUSHES ZELENSKY TO PEACE IN WASHINGTON",
      "timestamp": "2025-08-20T13:48:35.997287Z"
    },
    {
      "original": "Zelensky's Strategy. Kiev Is Betting On Dragging Out Negotiations\nVladimir Zelensky's visit to the White House showed that he had learned from his previous unsuccessful visit to Washington. The Ukrainian leader chose to avoid direct confrontation with Donald Trump in front of the cameras. The European leaders who arrived in the US capital to support Zelensky also avoided a confrontational tone. \nTheir statements to the press seemed rather vague and meaningless. Based on these statements, one might conclude that all parties want a peaceful settlement and that there has been \"incredible progress\" in the negotiations. Yet we still do not see any concrete achievements. It's clear that the Ukrainian president won't make any concessions to the Kremlin. This means that the war will continue — through Kiev's fault.\nThere is no doubt that Donald Trump intends to end the war in Ukraine. Vladimir Zelensky is equally certain in his desire to continue the fighting...\nRead more \nHERE",
      "timestamp": "2025-08-20T13:48:35.997296Z"
    },
    {
      "original": "Trump’s Diplomatic Shake-Up Gives China Advantage In Asia-Pacific\nFor a month now, a series of layoffs has been occurring at the United States State Department. This move, along with other measures implemented by President Donald Trump in foreign policy, could reduce the role of the US in the Asia-Pacific while strengthening China’s position in the region.\nPlanned since the beginning of Trump’s presidency, the State Department’s civil service layoffs were implemented last month. The layoffs included more than 1,300 employees. The State Department explained that the move was aimed at streamlining the federal bureaucracy and for the “effective use of taxpayer dollars.”\n“The problem is not a lack of money or dedicated talent, but rather a system where everything takes too much time, costs too much money, involves too many individuals, and all too often ends up failing the American people,” a State Department statement said...”\nRead more \nHERE",
      "timestamp": "2025-08-20T13:48:35.997304Z"
    },
    {
      "original": "Syria Confirms Rare High-Level Meeting With Israel\nThe Syrian Arab News Agency confirmed on August 20 that the country’s foreign minister held a rare meeting with an Israeli delegation in the French capital, Paris, a day earlier.\nIn a statement, the state-run news agency said that Foreign Minister Asaad Hassan al-Shaibani met with Israeli officials to discuss “de-escalation and non-interference in Syria's internal affairs, reaching understandings that support stability in the region, monitoring the ceasefire in al-Suwayda governorate, and reactivating the 1974 agreement.”\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997311Z"
    },
    {
      "original": "U.S. Griffon Aerospace Unveils Shahed Drone Copy (Photos)\nThe United States’ Griffon Aerospace on August 19 unveiled the MQM-172 Arrowhead, an unmanned aerial system that appears to be an exact copy of Iran’s Shahed-136 drone.\nIn a statement shared by Daniel Beck, Airworthiness Manager and Program Manager at Griffon Aerospace, the Alabama-based company described the Arrowhead as a purpose-built system intended to offer unmatched flexibility across multiple mission profiles.\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997318Z"
    },
    {
      "original": "U.S. Griffon Aerospace Unveils Shahed Drone Copy (Photos)\nThe United States’ Griffon Aerospace on August 19 unveiled the MQM-172 Arrowhead, an unmanned aerial system that appears to be an exact copy of Iran’s Shahed-136 drone.\nIn a statement shared by Daniel Beck, Airworthiness Manager and Program Manager at Griffon Aerospace, the Alabama-based company described the Arrowhead as a purpose-built system intended to offer unmatched flexibility across multiple mission profiles.\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997325Z"
    },
    {
      "original": "Ukrainian Saboteurs Attempted To Land In Crimea, Got Hunted By Russian Drones (Video)\nThe Russian Navy, with support from the Rubikon advanced unmanned technology center, foiled over the night of August 19 and 20 an attempt by Ukrainian reconnaissance and sabotage to land on the shores of the Crimean Peninsula.\nIn a post on Telegram, Rubikon said that the group sailed off on boats from the port of Zhelezny, but were quickly detected by a Z-20 reconnaissance drone. Soon after, one of the boats was targeted with a Lancet loitering munition from a distance of 72 kilometers.\nRead more: \nHERE",
      "timestamp": "2025-08-20T13:48:35.997332Z"
    }
  ],
  "script_run_time": "2025-08-20T13:48:35.998145Z"
}