{
  "messages": [
    {
      "original": "🚀\n Пуски КАБ на Донеччину.",
      "timestamp": "2025-12-20T20:00:27.187298Z"
    },
    {
      "original": "🛵\n БпЛА на південь від н.п. Білгород-Дністровський, курс в Чорне море.",
      "timestamp": "2025-12-20T20:00:27.187317Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину зі сходу.\n🛵\n Безпілотник на заході Донеччини, курс на Дніпропетровщину.",
      "timestamp": "2025-12-20T20:00:27.187324Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Дніпропетровщину.",
      "timestamp": "2025-12-20T20:00:27.187329Z"
    },
    {
      "original": "🚀\n Пуски КАБ на сході Запорізької області, в напрямку півдня Дніпропетровщини.",
      "timestamp": "2025-12-20T20:00:27.187336Z"
    },
    {
      "original": "🛵\n Ударні БпЛА з акваторії Чорного моря в напрямку Одеси та області.",
      "timestamp": "2025-12-20T20:00:27.187341Z"
    },
    {
      "original": "🛵\n Ударні БпЛА з акваторії Чорного моря в напрямку Одеси та області.",
      "timestamp": "2025-12-20T20:00:27.187346Z"
    },
    {
      "original": "На н.п. Білгород-Дністровський та на Маяки.",
      "timestamp": "2025-12-20T20:00:27.187349Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку лінії розмежування Одещини та Миколаївщини.",
      "timestamp": "2025-12-20T20:00:27.187354Z"
    },
    {
      "original": "🚀\n Пуски КАБ на сході Запорізької області, в напрямку півдня Дніпропетровщини.\n🛵\n БпЛА на півдні Дніпропетровщини, курс на Херсонщину.",
      "timestamp": "2025-12-20T20:00:27.187360Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, в напрямку Кривого Рогу.",
      "timestamp": "2025-12-20T20:00:27.187366Z"
    },
    {
      "original": "🛵\n Безпілотник на Херсонщині, курс на обласний центр.",
      "timestamp": "2025-12-20T20:00:27.187371Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини.",
      "timestamp": "2025-12-20T20:00:27.187377Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Одещини.\n🛵\n БпЛА з Херсонщини, курсом на  Чорне моря.",
      "timestamp": "2025-12-20T20:00:27.187383Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на н.п. Південне та Чорноморське на Одещині.",
      "timestamp": "2025-12-20T20:00:27.187388Z"
    },
    {
      "original": "🛵\n Нові БпЛА на півночі Сумщини, курс на південь.",
      "timestamp": "2025-12-20T20:00:27.187393Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північному та східному напрямках!",
      "timestamp": "2025-12-20T20:00:27.187399Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Донеччину та Харківщину зі сходу.",
      "timestamp": "2025-12-20T20:00:27.187403Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині, в напрямку Миколаївщини.\n🛵\n БпЛА на Чернігівщині, на схід від н.п. Ічня, курс на  Київщину.",
      "timestamp": "2025-12-20T20:00:27.187409Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п. Сергіївка та Одеса.",
      "timestamp": "2025-12-20T20:00:27.187414Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Миколаївщини на Кіровоградщину.",
      "timestamp": "2025-12-20T20:00:27.187420Z"
    },
    {
      "original": "Ukrainian drone(s) have struck a Russian \"Hunter\" Patrol and Guard Ship. \nNo details yet. The Ukrainian SOF has only published this image.",
      "timestamp": "2025-12-20T20:00:27.708197Z"
    },
    {
      "original": "Trump is expected to issue his statement shortly.",
      "timestamp": "2025-12-20T20:00:27.708209Z"
    },
    {
      "original": "Iskander launch from Crimea",
      "timestamp": "2025-12-20T20:00:27.708213Z"
    },
    {
      "original": "Iskander launch from Crimea",
      "timestamp": "2025-12-20T20:00:27.708220Z"
    },
    {
      "original": "Aerial target detected, flying to Pivdenne/Dobroslav, Odesa Oblast.",
      "timestamp": "2025-12-20T20:00:27.708224Z"
    },
    {
      "original": "Aerial target detected, flying to Pivdenne/Dobroslav, Odesa Oblast.",
      "timestamp": "2025-12-20T20:00:27.708227Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-20T20:00:27.708230Z"
    },
    {
      "original": "Flying past Pivdenne to Dobroslav",
      "timestamp": "2025-12-20T20:00:27.708234Z"
    },
    {
      "original": "Explosions in Dobroslav, Odesa Oblast",
      "timestamp": "2025-12-20T20:00:27.708237Z"
    },
    {
      "original": "So far today, 6 Iskander-M ballistic missiles have been used against Odesa Oblast. \n4 have targeted the Dobroslav area.\n2 have targeted the Mayaky Bridge.\nThis is in addition to numerous Geran-2 drone strikes.",
      "timestamp": "2025-12-20T20:00:27.708243Z"
    },
    {
      "original": "Trump is expected to issue his statement shortly.",
      "timestamp": "2025-12-20T20:00:27.708246Z"
    },
    {
      "original": "Trump has begun speaking now.",
      "timestamp": "2025-12-20T20:00:27.708249Z"
    },
    {
      "original": "Trump has begun speaking now.",
      "timestamp": "2025-12-20T20:00:27.708252Z"
    },
    {
      "original": "Nothing interesting. The speech is unrelated to Venezuela.",
      "timestamp": "2025-12-20T20:00:27.708256Z"
    },
    {
      "original": "🇺🇦\n \nDeep State on the dire situation of Gulyaypole:\nThe Ukrainian military resource Deep State reports on the risk of losing Gulyaypole due to management problems and internal sabotage in the 102nd Territorial Defense Brigade. According to DS, some officers are persuading fighters to abandon their positions without authorization, while the units are not aware of the current situation of their neighbors, which leads to disorientation and additional losses.",
      "timestamp": "2025-12-20T20:00:27.708263Z"
    },
    {
      "original": "🇺🇦\n Deep State on the dire situation of Gulyaypole:  The Ukrainian military resource Deep State reports on the risk of losing Gulyaypole due to management problems and internal sabotage in the 102nd Territorial Defense Brigade. According to DS, some officers…",
      "timestamp": "2025-12-20T20:00:27.708267Z"
    },
    {
      "original": "The 102nd brigade has mostly been withdrawn to the rear now due to heavy losses from the encirclements east of Hulyaipole, lack of coordination, constant Russian bombardment, and low-quality fortifications. \nThe issues in this unit have been known for some time, and the casualties they suffered prior to the Russian entry into Hulyaipole had meant they couldn't perform properly. This is the main reason why defences are collapsing there right now. The higher command is blame.",
      "timestamp": "2025-12-20T20:00:27.708271Z"
    },
    {
      "original": "Deepstate published satellite imagery showing the ruins of eastern Siversk. Around 300-400 civilians remained in the city for the nearly 4 years of fighting.",
      "timestamp": "2025-12-20T20:00:27.708275Z"
    },
    {
      "original": "4 have targeted the Dobroslav area.",
      "timestamp": "2025-12-20T20:00:27.708278Z"
    },
    {
      "original": "2 of the Iskanders which I previously thought targeted Dobroslav, Odesa Oblast, actually hit port infrastructure near Pivdenne.\nAt least 7 civilians were killed and 15 others injured.",
      "timestamp": "2025-12-20T20:00:27.708282Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-20T20:00:27.708287Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-20T20:00:27.708292Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-20T20:00:27.708297Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-20T20:00:27.708302Z"
    },
    {
      "original": "What will the mental gymnastics be this time?",
      "timestamp": "2025-12-20T20:00:27.708308Z"
    },
    {
      "original": "It seems that Russia’s next large-scale, combined missile attack on Ukraine has been delayed, as no significant strategic bomber movement has been recorded for the last two days.\nIn my opinion, this is due to the prioritisation of smaller, more targeted attacks on Odesa Oblast with Geran-2 drones, Grom-E1 rocket glide-bombs, and Iskander-M ballistic missiles. \nAdditionally, the preparation of a number of Tu-22m3 strategic bombers is underway. Two of them, each equipped with 2 Kh-32 cruise missiles, redeployed from Belaya Airbase, Irkutsk Oblast, to Engels-2 Airbase, Saratov Oblast. 2 other Tu-22m3 bombers stationed at Engels-2 Airbase are also equipped with 1 Kh-32 missile each. \nIt’s also likely that two Buyan-M corvettes were equipped with Kalibr cruise missiles at Kaspiysk Naval Base, Republic of Dagestan, in the Caspian Sea. They can launch a maximum of 16 Kalibrs. \nHowever, 2 days ago, 1 Tu-160 and 1 Tu-95MS strategic bomber redeployed from Engels-2 Airbase to Ukrainka Airbase, Amur Oblast. There, they will likely be equipped with Kh-101 cruise missiles.\nRemember, another 4 Tu-95MS are already equipped with missiles at Olenya Airbase, Murmansk Oblast, ready for use. \nAs for Iskanders, deliveries of Iskander-M ballistic missiles and possibly Iskander-K cruise missiles were carried out to OTRK installations in Voronezh and Rostov Oblast.\nMass accumulation of Geran-2 and Gerbera drones continues at all major launch sites surrounding Ukraine.",
      "timestamp": "2025-12-20T20:00:27.708317Z"
    },
    {
      "original": "Russian forces have launched a new incursion across the international border into Sumy Oblast, quickly capturing the villages of Hrabovske and Vysoke. Attacks are now underway, with the Russians attempting to penetrate deeper into the region.\nAs usual with these sorts of incursions, the goal is not to take large swaths of territory. The goal is to stretch Ukrainian forces even thinner, worsening the issues coming from their manpower shortages.\nIf Ukraine decides to redeploy units away from one direction to this new area in order to reinforce the lines, halt, and possibly even push back Russian forces, the area which they are redeployed from will be significantly weakened, making it easier for the Russians to make progress in.\nThis is all part of what I like to call Russia's \"Whack-a-mole\" tactic, which softens up the lines, and exploits the successful attrition being dealt to Ukraine right now. It puts Ukraine in a difficult spot, as if they choose not to redeploy here, the incursion zone could continue to expand and become even more difficult and costly to deal with later on. \nEssentially, they are trying to put out more fires than they can possibly deal with - and Russia keeps setting new ones. The main reason why they can't deal with all of the fires at once is because of manpower shortages, which are only continuing to get worse.\nExpect more maneuvers like this in different places from Russian forces in the future.",
      "timestamp": "2025-12-20T20:00:27.708324Z"
    },
    {
      "original": "Pokrovsk Sector: Russian Army Expels Ukrainian Forces From Rodynske And Assaults Hrishyne\nComplete control of Rodynske has been established in the Pokrovsk sector. Fierce fighting continues in Hrishyne. In the Dobropillia salient, units have regained control of a section of the highway near Zolotyi Kolodiaz. \nThe December European Union summit was characterized by western media as a series of major political defeats.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.326973Z"
    },
    {
      "original": "Pokrovsk Sector: Russian Army Expels Ukrainian Forces From Rodynske And Assaults Hrishyne\nComplete control of Rodynske has been established in the Pokrovsk sector. Fierce fighting continues in Hrishyne. In the Dobropillia salient, units have regained control of a section of the highway near Zolotyi Kolodiaz. \nThe December European Union summit was characterized by western media as a series of major political defeats.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.326990Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From December 19, 2025\nOn December 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-20T20:00:28.326998Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From December 19, 2025\nOn December 19, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-20T20:00:28.327005Z"
    },
    {
      "original": "Massive U.S. Attack On ISIS In Syria Leaves More Questions Than Answers (Videos)\nDozens of United States strikes hit ISIS targets in Syria late on December 19 in what was described by Washington as a response to the recent attack in the city of Palmyra that claimed the lives of three Americans.\nIn a statement, the U.S. Central Command (CENTCOM) announced that its forces struck more than 70 targets at multiple locations across central Syria with fighter jets, attack helicopters, and artillery.\nThe U.S. strikes were questionable in many ways. First, they appear to be a part of the Trump administration’s efforts to hold ISIS responsible for what happened in Palmyra, despite the fact that all evidence indicates that a radical member of Syrian security forces carried out the attack with no involvement from the terrorist group.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327014Z"
    },
    {
      "original": "Massive U.S. Attack On ISIS In Syria Leaves More Questions Than Answers (Videos)\nDozens of United States strikes hit ISIS targets in Syria late on December 19 in what was described by Washington as a response to the recent attack in the city of Palmyra that claimed the lives of three Americans.\nIn a statement, the U.S. Central Command (CENTCOM) announced that its forces struck more than 70 targets at multiple locations across central Syria with fighter jets, attack helicopters, and artillery.\nThe U.S. strikes were questionable in many ways. First, they appear to be a part of the Trump administration’s efforts to hold ISIS responsible for what happened in Palmyra, despite the fact that all evidence indicates that a radical member of Syrian security forces carried out the attack with no involvement from the terrorist group.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327023Z"
    },
    {
      "original": "1,000 For 26: Heavy Ukrainian Losses Revealed By New Exchange Of Bodies \nRussia and Ukraine on December 19 announced that they have conducted another exchange of bodies as part of agreements reached earlier this year in Turkey.\n“As part of the Istanbul agreements, the bodies of 1,000 fallen Ukrainian soldiers have been handed over to Ukraine,” Russian presidential aide Vladimir Medinsky wrote on Telegram, adding that Kyiv returned the bodies of 26 Russian servicemen to Moscow.\nOn the other side, Ukraine’s Coordination Headquarters for the Treatment of Prisoners of War also announced the exchange, saying it received the bodies of 1,003 of its servicemen.\nThe general ratio of bodies exchanged is now around 36 to 1, meaning the remains of 36 Ukrainian soldiers were exchanged for the remains of a single Russian soldier.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327031Z"
    },
    {
      "original": "U.S. ‘Scorpion Strike’ Unit Launched Its First ‘Shahed’ Drone (Video)\nThe United States Navy has test-launched a Low-Cost Uncrewed Combat Attack System (LUCAS) long-range suicide drone from the Independence class Littoral Combat Ship (LCS) USS Santa Barbara in the Middle East.\nThe test, which took place on December 16, two weeks after the United States Central Command (CENTCOM) announced that it had established Task Force Scorpion Strike (TFSS) in the region, armed with the LUCAS drones.\nPersonnel from U.S. Naval Forces Central Command’s (NAVCENT) Task Force 59 conducted the rocket-assisted launch of the LUCAS drone from the stern flight deck of the USS Santa Barbara, according to a statement released by CENTCOM two days after the test.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327040Z"
    },
    {
      "original": "Military Situation In Syria On December 20, 2025 (Map Update)",
      "timestamp": "2025-12-20T20:00:28.327044Z"
    },
    {
      "original": "Russian Army Opens New Front In Sumy, Gains High Ground After Storming Two Towns (Videos)\nOn December 20, the Russian military launched a surprise attack in Ukraine’s Sumy, crossing the border in a new area some 45 kilometers to the southeast of the region’s capital.\nThe attack, which is being led by the Sever [East] Group of Forces, appears to be a part of wider efforts by the Russian military to establish a security zone along the border with Ukraine. These efforts gained momentum following the failed Ukrainian attack on Russia’s Kursk, which borders Sumy, last year.\nThe 34th Separate Guards Mountain Motor Rifle Brigade began the new attack by breaking through Ukrainian defenses in Vysoke, one of the highest points along the border, then capturing the settlement. This was officially confirmed by the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327053Z"
    },
    {
      "original": "Russian Army Opens New Front In Sumy, Gains High Ground After Storming Two Towns (Videos)\nOn December 20, the Russian military launched a surprise attack in Ukraine’s Sumy, crossing the border in a new area some 45 kilometers to the southeast of the region’s capital.\nThe attack, which is being led by the Sever [East] Group of Forces, appears to be a part of wider efforts by the Russian military to establish a security zone along the border with Ukraine. These efforts gained momentum following the failed Ukrainian attack on Russia’s Kursk, which borders Sumy, last year.\nThe 34th Separate Guards Mountain Motor Rifle Brigade began the new attack by breaking through Ukrainian defenses in Vysoke, one of the highest points along the border, then capturing the settlement. This was officially confirmed by the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-20T20:00:28.327061Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-20T20:00:28.327065Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-20T20:00:28.327069Z"
    }
  ],
  "script_run_time": "2025-12-20T20:00:28.327844Z"
}