{
  "messages": [
    {
      "original": "🛵\n БпЛА наближається до Кременчука із заходу;\n🛵\n БпЛА наближається до Кривого Рогу з півдня.",
      "timestamp": "2025-11-26T15:56:35.733677Z"
    },
    {
      "original": "🛵\n БпЛА у Чорному морі у напрямку Південного;\n🛵\n БпЛА у напрямку Кременчука зі сходу;\n🛵\n БпЛА в р-ні. Батурина (Чернігівщина) курс південний;\n🛵\n БпЛА у напрямку Павлограду зі сходу, також БпЛА північно-східніше Павлограду курс на північний захід.",
      "timestamp": "2025-11-26T15:56:35.733696Z"
    },
    {
      "original": "🛵\n Декілька БпЛА в р-ні. Херсону, вектор руху Кривий Ріг.",
      "timestamp": "2025-11-26T15:56:35.733701Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Кривого Рогу з півдня.",
      "timestamp": "2025-11-26T15:56:35.733706Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у напрямку Дніпра зі сходу.",
      "timestamp": "2025-11-26T15:56:35.733710Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу з південного сходу.",
      "timestamp": "2025-11-26T15:56:35.733714Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на сході Дніпропетровщини курсом на захід.",
      "timestamp": "2025-11-26T15:56:35.733718Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 72 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 26 листопада (з 19:00 25 листопада) противник атакував двома балістичними ракетами Іскандер-М (пуски із Ростовської області - рф), та 90-та ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Приморсько-Ахтарськ, – рф, Гвардійське - ТОТ АР Крим, близько 55 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\nЗа попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 72 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання ракет та 10 ударних БпЛА на 10 локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги.",
      "timestamp": "2025-11-26T15:56:35.733736Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T15:56:35.733743Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-26T15:56:35.733751Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Харківщину.",
      "timestamp": "2025-11-26T15:56:35.733755Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-11-26T15:56:35.733760Z"
    },
    {
      "original": "Український пілот про ефективність Mirage2000/Ukrainian Pilot on the Effectiveness of the Mirage2000\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nФранцузьких Mirage 2000 в Повітряних Силах України не багато, тому зустріти цей літак на оперативному аеродромі – справжня удача для нашої знімальної групи, ще й під час виконання пілотом реального бойового завдання.\nЛьотчик Mirage 2000 та авіаційні техніки розповіли про ефективність французького літака на полі бою та необхідність подальшої міжнародної  підтримки України у боротьбі проти агресора.\nhttps://youtu.be/WsFGyKRVbUY?si=dJGZxvKg2_5mp8TY",
      "timestamp": "2025-11-26T15:56:35.733772Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-11-26T15:56:35.733776Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.\n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T15:56:35.733784Z"
    },
    {
      "original": "🛵\n Сумщина: декілька груп БпЛА \n➡️\n на Кролевець.  \n🛵\n Група БпЛА \n➡️\n на межі Полтавщини та Харківщини.",
      "timestamp": "2025-11-26T15:56:35.733799Z"
    },
    {
      "original": "🛵\n Через Сумщину БпЛА \n➡️\n у напрямку Чернігівщини.",
      "timestamp": "2025-11-26T15:56:35.733804Z"
    },
    {
      "original": "🛵\n Чернігівщина:\n- БпЛА повз Батурин \n➡️\n курсом на південь.\n- БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T15:56:35.733812Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.",
      "timestamp": "2025-11-26T15:56:35.733816Z"
    },
    {
      "original": "🛵\n Чернігівщина: - БпЛА повз Батурин \n➡️\n курсом на південь. - БпЛА на півночі Чернігівщини \n➡️\n курсом на північ.",
      "timestamp": "2025-11-26T15:56:35.733822Z"
    },
    {
      "original": "🛵\n Чернігівщина: нові групи БпЛА з півночі \n➡️\n курсом на Холми, Короп.\n🛵\n Сумщина: БпЛА \n➡️\n у напрямку Ямполя.",
      "timestamp": "2025-11-26T15:56:35.733830Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-26T15:56:35.733834Z"
    },
    {
      "original": "BREAKING: Ukrainian air assault forces have cleared the centre of Pokrovsk and are liberating the city, according to.... the Ukrainian air assault forces.\nSee the problem here?",
      "timestamp": "2025-11-26T15:56:36.517023Z"
    },
    {
      "original": "A short time ago, Kharkiv Oblast came under attack from Russian ballistic missiles.\n4 S-300 missiles in ground-to-ground mode were launched from Belgorod Oblast. 3 impacted a target in the vicinity of Kharkiv City, and the fourth impacted within Kharkiv's city limits.",
      "timestamp": "2025-11-26T15:56:36.517035Z"
    },
    {
      "original": "A short time ago, Kharkiv Oblast came under attack from Russian ballistic missiles.\n4 S-300 missiles in ground-to-ground mode were launched from Belgorod Oblast. 3 impacted a target in the vicinity of Kharkiv City, and the fourth impacted within Kharkiv's city limits.",
      "timestamp": "2025-11-26T15:56:36.517040Z"
    },
    {
      "original": "Satellite imagery reveals that the Ukrainian strikes on aircraft plant in Taganrog, Rostov Oblast destroyed an A-60 airborne laser laboratory aircraft, and an A-100LL long-range radar detection and control aircraft.\nBoth of these aircraft were not in service, and there were already reports from May 2025 that the entire A-100 program would be closed. \nAdditionally, the final assembly workshop received damage. \nImage credit",
      "timestamp": "2025-11-26T15:56:36.517048Z"
    },
    {
      "original": "Overnight, at least four Russian Geran-2 drones impacted Zaporizhzhia City. The strikes targeted the Ural Barracks, which is one of the main Ukrainian military bases in the city.",
      "timestamp": "2025-11-26T15:56:36.517052Z"
    },
    {
      "original": "Overnight, at least four Russian Geran-2 drones impacted Zaporizhzhia City. The strikes targeted the Ural Barracks, which is one of the main Ukrainian military bases in the city.",
      "timestamp": "2025-11-26T15:56:36.517055Z"
    },
    {
      "original": "Russian forces have captured the village of Maiske, northeastern flank of Kostyantynivka, Donetsk Oblast.\nPre-war population: ~104.\nTotal land area: ~0.57 km².\nThe fighting for Maiske lasted approximately 8 days.",
      "timestamp": "2025-11-26T15:56:36.517060Z"
    },
    {
      "original": "Following an increase in attacks from Palestinian armed groups, the IDF has announced a new, large-scale military operation in the northern part of the West Bank.\nIsraeli forces have been deployed to the cities of Tubas and Qabatiya, where they are carrying out operations aimed at arresting Palestinian militants from local armed groups affiliated with the Palestinian Islamic Jihad and Hamas. \nEarlier, clashes took place in the village of Marka, near the city of Jenin, as well as in Balata Refugee Camp in the city of Nablus, during which two militants were killed by Israeli soldiers. \nThe IDF already effectively occupies the cities of Tulkarm and Jenin following their earlier military operation which began in January 2025, which largely forced Palestinian armed groups across the northern West Bank to scatter to the surrounding towns and villages. It is from here where they have been attempting to regroup and continue their sporadic attacks, which likely prompted this new military operation.",
      "timestamp": "2025-11-26T15:56:36.517065Z"
    },
    {
      "original": "Following an increase in attacks from Palestinian armed groups, the IDF has announced a new, large-scale military operation in the northern part of the West Bank.\nIsraeli forces have been deployed to the cities of Tubas and Qabatiya, where they are carrying out operations aimed at arresting Palestinian militants from local armed groups affiliated with the Palestinian Islamic Jihad and Hamas. \nEarlier, clashes took place in the village of Marka, near the city of Jenin, as well as in Balata Refugee Camp in the city of Nablus, during which two militants were killed by Israeli soldiers. \nThe IDF already effectively occupies the cities of Tulkarm and Jenin following their earlier military operation which began in January 2025, which largely forced Palestinian armed groups across the northern West Bank to scatter to the surrounding towns and villages. It is from here where they have been attempting to regroup and continue their sporadic attacks, which likely prompted this new military operation.",
      "timestamp": "2025-11-26T15:56:36.517070Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate. \nThe IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from their homes and converting them into military positions. \nMajor roads have been closed, with Palestinian movement in this area being heavily limited. A curfew has also been imposed on the entirety of the Tubas Governorate as Israeli soldiers begin to carry out raids.",
      "timestamp": "2025-11-26T15:56:36.517075Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian command post and equipment accumulation point near the village of Otradne, Kharkiv Oblast.\nThe strike took place around 34 km from Kupyansk.",
      "timestamp": "2025-11-26T15:56:36.517078Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡\n- \"I urge people not to rush to conclusions that the war in Ukraine will end soon,\" - Dmitri Peskov, Kremlin Spokesman.",
      "timestamp": "2025-11-26T15:56:36.517084Z"
    },
    {
      "original": "🇷🇺\n🇺🇦\n⚡\n- \"I urge people not to rush to conclusions that the war in Ukraine will end soon,\" - Dmitri Peskov, Kremlin Spokesman.",
      "timestamp": "2025-11-26T15:56:36.517091Z"
    },
    {
      "original": "I cannot believe that people genuinely think THIS round of peace negotiations will end the war.",
      "timestamp": "2025-11-26T15:56:36.517094Z"
    },
    {
      "original": "I’ve said it every time before and I’ll say it again: this peace plan will amount to nothing. \nNone of the sides in this war (US, Ukraine, Russia) have a plan which they will all agree to, and the U.S. is trying to continue extend the war’s longevity by delaying the inevitable. \nIt is in US foreign interests to keep Russia and Ukraine fighting. Extend Russia, focus on china, combat and topple opposers to their hegemonic ambitions one by one - not all at once.",
      "timestamp": "2025-11-26T15:56:36.517099Z"
    },
    {
      "original": "Stop buying into the hopium and engagement farming posts from people who have no idea what they are talking about and don't understand the goals of Russia and the US. \nMark my words, in 3 months time, everyone will have forgotten about the \"28 point peace plan\".",
      "timestamp": "2025-11-26T15:56:36.517103Z"
    },
    {
      "original": "A coup has taken place in Guinea-Bissau, where unidentified gunmen arrested President Embalo and seized the National Electoral Commission building in the capital of Bissau.\nAn election took place in Guinea-Bissau on Sunday, where Embalo claimed victory with 65% of the vote",
      "timestamp": "2025-11-26T15:56:36.517107Z"
    },
    {
      "original": "4 Russian Tu-22m3 strategic bombers have been equipped with Kh-22 cruise missiles at Engels-2 Airbase, Saratov Oblast, and have since redeployed to Olenya Airbase, Murmansk Oblast. \nAdditionally, 1 Tu-160M strategic bomber redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase. Another IL-76MD cargo plane has also landed at Engels-2 Airbase, carrying Kh-101 cruise missiles.\nActivity on frequencies used by strategic bombers at Ukrainka Airbase suggest that either training or redeployments will be carried out tonight. If redeployments take place to Engels-2, there will be an increased threat of another large-scale, combined Russian missile and drone attack on Ukraine in the coming days.",
      "timestamp": "2025-11-26T15:56:36.517112Z"
    },
    {
      "original": "Smoke is seen rising from a tire service facility in the city of Dobropillya, Donetsk Oblast, following Russian Geran-2 drone strikes today.\nCoordinates: 48.450151, 37.100155 (~11 km from the frontline).",
      "timestamp": "2025-11-26T15:56:36.517115Z"
    },
    {
      "original": "Military Situation In Ukraine On November 25, 2025 (Maps Update)",
      "timestamp": "2025-11-26T15:56:37.292056Z"
    },
    {
      "original": "Military Situation In Ukraine On November 25, 2025 (Maps Update)",
      "timestamp": "2025-11-26T15:56:37.292068Z"
    },
    {
      "original": "Encircled With No Hope: Revelations Of Ukrainian Servicemen Who Surrendered In Pokrovsk And Mirnograd\nThe operation to encircle the Ukrainian garrison in the Mirnograd and Pokrovsk areas culminated in Russian forces establishing full control over the approaches to these settlements. Ukrainian units were isolated, deprived of any possibility of retreat or resupply, creating conditions for mass surrender.\nSeveral prisoners of war, including Ivan Dzyuba, Ivan and Sergey Kostetskiy from the 38th Separate Marine Brigade, among other soldiers, provided crucial testimony about the tactical and logistical impossibility of fulfilling combat missions, as well as the critical state of morale and command.\nIvan Dzyuba reported that his unit had occupied approximately seven positions, all of which were destroyed by Russian forces. He noted a lack of clear orders, with command instructions boiling down to \"hold position\" and \"wait,\" after which communication and control were lost. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292078Z"
    },
    {
      "original": "Encircled With No Hope: Revelations Of Ukrainian Servicemen Who Surrendered In Pokrovsk And Mirnograd\nThe operation to encircle the Ukrainian garrison in the Mirnograd and Pokrovsk areas culminated in Russian forces establishing full control over the approaches to these settlements. Ukrainian units were isolated, deprived of any possibility of retreat or resupply, creating conditions for mass surrender.\nSeveral prisoners of war, including Ivan Dzyuba, Ivan and Sergey Kostetskiy from the 38th Separate Marine Brigade, among other soldiers, provided crucial testimony about the tactical and logistical impossibility of fulfilling combat missions, as well as the critical state of morale and command.\nIvan Dzyuba reported that his unit had occupied approximately seven positions, all of which were destroyed by Russian forces. He noted a lack of clear orders, with command instructions boiling down to \"hold position\" and \"wait,\" after which communication and control were lost. \n👉\n Read more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292087Z"
    },
    {
      "original": "LEFT TO THEIR FATE: MIRNOGRAD GARRISON FORSAKEN AS UKRAINE'S RESERVES MOVE SOUTH",
      "timestamp": "2025-11-26T15:56:37.292090Z"
    },
    {
      "original": "The Fall Of Vovchansk: Russian Troops Entrench Themselves In Depth Of Ukraine’s Defenses \nThe Russian Ministry of Defense has confirmed its control over Ivanopolye. In the Kharkiv sector, Russian units have begun mop-up operations after taking control of Vovchansk. \nMeanwhile, negotiations between Russian and American delegations regarding the updated U.S. administration's peace plan have begun in Abu Dhabi.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292097Z"
    },
    {
      "original": "The Fall Of Vovchansk: Russian Troops Entrench Themselves In Depth Of Ukraine’s Defenses \nThe Russian Ministry of Defense has confirmed its control over Ivanopolye. In the Kharkiv sector, Russian units have begun mop-up operations after taking control of Vovchansk. \nMeanwhile, negotiations between Russian and American delegations regarding the updated U.S. administration's peace plan have begun in Abu Dhabi.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292105Z"
    },
    {
      "original": "Iran’s Revolutionary Guards Vows Revenge For Hezbollah Military Chief\nIran’s Islamic Revolutionary Guard Corps (IRGC) on November 24 called for “revenge” for the assassination of Hezbollah’s military chief of staff Haytham Ali Tabatabai, increasing the chances of a new war with Israel.\nThe commander was killed a day earlier in an Israeli strike that targeted the southern suburbs of the Lebanese capital, Beirut.\nTabatabai was the most senior member of Hezbollah to be killed by the Israeli Defense Forces (IDF) since a ceasefire in Lebanon brokered by the United States entered into effect nearly a year ago. In the group’s command and control chain, he was considered second only to Secretary-General Naim Qassem.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292112Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292119Z"
    },
    {
      "original": "Deadly Clashes, Drone Strikes In Al-Suwayda Highlight Fragile Peace In Syria \nAnother round of clashes broke out between government forces and Druze fighters across the front in the southern Syrian governorate of al-Suwayda late on November 25, with both sides sustaining casualties.\nA checkpoint manned by security forces near the town of Barad in the western al-Suwayda countryside came under attack. The Syrian Ministry of Interior held “unlawful groups” - the government term for Druze armed groups in the governorate - responsible for the attack, which it said claimed the life of a security officer and left two others wounded.\nActivities based in al-Suwayda later reported a series of drone strikes by government forces that mainly targeted civilian vehicles moving between the towns of Salim and Atil in the northern countryside of the governorate.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292129Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292137Z"
    },
    {
      "original": "Israeli Army Boast About Killing 20 In Gaza Within Week Amid Ceasefire (Video, Photos)\nThe Israeli Defense Forces (IDF) announced that it killed four Palestinian fighters and captured two others in the southern Gaza Strip on November 26, amid a ceasefire brokered by the United States.\nIsraeli troops monitoring surveillance cameras spotted the six fighters after they emerged from tunnels in Rafah, the IDF said in a statement, adding that Israeli Air Force then carried out an airstrike against the fighters, and troops of the Nahal Brigade were dispatched to the area.\nDozens of fighters from the Hamas Movement are believed to be trapped in Rafah. The group has so far shown commitment to the peace plan proposed by the U.S. President Donald Trump, which put the ceasefire in place early in October. It has already released all the living hostages, and in the process of handing over all the remains of the hostages who were killed. Still, Israel has refused to allow the trapped fighters to withdraw.\nRead more \nHERE",
      "timestamp": "2025-11-26T15:56:37.292144Z"
    },
    {
      "original": "Military Situation In Syria On November 26, 2025 (Map Update)",
      "timestamp": "2025-11-26T15:56:37.292148Z"
    }
  ],
  "script_run_time": "2025-11-26T15:56:37.292886Z"
}