{
  "messages": [
    {
      "original": "🛵\n БпЛА на півночі Миколаївщини \n➡️\n курсом на Криворізький район.",
      "timestamp": "2025-10-24T06:45:22.486689Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Миколаївщини \n➡️\n курсом на Кіровоградщину.",
      "timestamp": "2025-10-24T06:45:22.486706Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Кіровоградщини, курсом на захід, на н.п. Новоукраїнка-Помічна.",
      "timestamp": "2025-10-24T06:45:22.486711Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півдня.",
      "timestamp": "2025-10-24T06:45:22.486716Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n на північно-західний напрямок.\n🛵\n БпЛА на заході Сумщини \n➡️\n курсом на північ.",
      "timestamp": "2025-10-24T06:45:22.486725Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Павлограду зі сходу.\n🛸\n🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-24T06:45:22.486732Z"
    },
    {
      "original": "🛵\n  Ударний БпЛА на Харківщині \n➡️\n на південь від н.п. Малинівка, курсом на схід.",
      "timestamp": "2025-10-24T06:45:22.486737Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-24T06:45:22.486745Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n на північно-західний напрямок.\n🛵\n БпЛА на заході Сумщини \n➡️\n курсом на південь.\n🛵\n БпЛА на сході Харківщини \n➡️\n на південно-західний напрямок.",
      "timestamp": "2025-10-24T06:45:22.486756Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Харківщини \n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-10-24T06:45:22.486762Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину та Донеччину.",
      "timestamp": "2025-10-24T06:45:22.486766Z"
    },
    {
      "original": "🛵\n БпЛА на сході від Павлограду на Дніпропетровщині, курсом на Харківщину.",
      "timestamp": "2025-10-24T06:45:22.486771Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півдні Харківщини, курсом  на північ.",
      "timestamp": "2025-10-24T06:45:22.486775Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на північ від Харкова, курсом на захід.",
      "timestamp": "2025-10-24T06:45:22.486783Z"
    },
    {
      "original": "🛵\n Ударні БпЛА на сході Дніпропетровщини \n➡️\n курсом на південь та на захід.\n🛵\n Ударні БпЛА на заході Сумщини \n➡️\n курсом на південь.\n🛵\n Ударні БпЛА в центрі Харківщини \n➡️\nкурсом на південь.",
      "timestamp": "2025-10-24T06:45:22.486795Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півночі.",
      "timestamp": "2025-10-24T06:45:22.486801Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Дніпропетровщини \n➡️\n курсом на північ, на Харківщину.\n🛵\n БпЛА на заході та в центрі Харківщини \n➡️\n на північно-східний напрямок.",
      "timestamp": "2025-10-24T06:45:22.486809Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Харкова з півдня.",
      "timestamp": "2025-10-24T06:45:22.486813Z"
    },
    {
      "original": "🛵\n  Ударні БпЛА на Харківщині:\n- на заході від Харкова, курсом на північ;\n- на схід від н.п. Близнюки, курсом на північ.",
      "timestamp": "2025-10-24T06:45:22.486819Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 72 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 24 жовтня (з 19:00 23 жовтня) противник атакував 128 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Брянськ, Приморсько-Ахтарськ – рф, Чауда, Гвардійське – ТОТ АР Крим, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 72 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 47 ударних БпЛА на 10 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-24T06:45:22.486837Z"
    },
    {
      "original": "Apparently 6 soldiers is now a mass surrender lmao. \nAlso, for those who for some stupid reason only look at Deepstate's maps, Kucheriv Yar was never encircled, but rather stormed from the northeast.",
      "timestamp": "2025-10-24T06:45:23.104797Z"
    },
    {
      "original": "Apparently 6 soldiers is now a mass surrender lmao.   Also, for those who for some stupid reason only look at Deepstate's maps, Kucheriv Yar was never encircled, but rather stormed from the northeast.",
      "timestamp": "2025-10-24T06:45:23.104813Z"
    },
    {
      "original": "The victory threshold for Ukraine continues to get lower and lower...",
      "timestamp": "2025-10-24T06:45:23.104818Z"
    },
    {
      "original": "Russian forces have re-established control over Sichneve, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~160.\nTotal land area: ~0.75km².",
      "timestamp": "2025-10-24T06:45:23.104823Z"
    },
    {
      "original": "I present to you, the \"Monster Tank\":\nIt recently took part in a Russian mechanised assault in the Siversk direction, and tanked more than 25 FPV drone hits before finally being disabled. The surviving infantry are now trying to consolidate in the treelines.",
      "timestamp": "2025-10-24T06:45:23.104827Z"
    },
    {
      "original": "I present to you, the \"Monster Tank\":  It recently took part in a Russian mechanised assault in the Siversk direction, and tanked more than 25 FPV drone hits before finally being disabled. The surviving infantry are now trying to consolidate in the treelines.",
      "timestamp": "2025-10-24T06:45:23.104832Z"
    },
    {
      "original": "This video should also give a good idea of the sheer density of FPV drones on the battlefield, especially in places like Siversk where the Ukrainians have very strong defences. There are drones literally everywhere, and all movement within 10km of the frontline is instantly spotted.",
      "timestamp": "2025-10-24T06:45:23.104836Z"
    },
    {
      "original": "Russian KAB glide-bombs are once again striking the bridge to Korobelnyi Island in an attempt to destroy it. So far it remains standing. \nAlso, on a sidenote, the claims of Russian soldiers landing and consolidating on the island are completely false. Don't fall for it.",
      "timestamp": "2025-10-24T06:45:23.104840Z"
    },
    {
      "original": "⚡\n🇱🇧\n🇮🇱\n Reports of Israeli airstrikes in southern Lebanon.\n@wfwitness",
      "timestamp": "2025-10-24T06:45:23.104847Z"
    },
    {
      "original": "In the Orikhiv direction, Russian forces are advancing through Mala Tokmachka, attempting to take full control over the village. \nFollowing the earlier mechanised assaults, Russian soldiers were able to scatter throughout the eastern and central parts of the village and begin pushing west. So far, they have been able to consolidate in additional parts of the eastern streets, but infiltrations have occurred 2.3 km west of that. Large amounts of soldiers from at least three different regiments have accumulated here, and are attempting to push further.  \n+ ~1.51 km² in favour of Russia.",
      "timestamp": "2025-10-24T06:45:23.104852Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance west of the Yanchur River, further expanding their bridgehead in two different areas.\nMost of the progress was made in the south, where Russian forces continued pushing west along the Malynivka - Hulyaipole Road. With heavy fighting, they were able to capture a 2.3 km-long stretch of it and begin advancing further towards the villages of Vesele and Zelenyi Hai. At the same time, other forces cleared the northern and southern banks of the small reservoir and pushed northwest up to the road. Additionally, the Russians captured new positions along four parallel treelines north of the road, on the tactical heights. \nIn the north, Russian forces continued to advance further west from the northern part of Poltavka. Here, they captured additional positions along two separate treelines in the low-lying ground and began attacks towards the small reservoir further west. \n+ ~5.30 km² in favour of Russia.",
      "timestamp": "2025-10-24T06:45:23.104858Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovsk'e directions, Russian forces continued to advance east of the Yanchur River, making new progress in three different areas.\nIn the north, after breaking through to Pryvillya, Russian forces began securing their northern flank. Under heavy artillery and drone cover, they began advancing on the village of Vyshneve from two directions and captured a gulley and the section of road between Vyshneve and Verbove. For the past ten days, Vyshneve has been under intense FAB, artillery, and MLRS bombardment. \nFurther south, Russian forces continued securing the southern flank of their breakthrough to Pryvillya. Here, they were able to last section of the tactical heights, and advanced into the treelines in the low-lying ground northeast of Krasnohirske. They also continued pushing west of Novohryhorivka, capturing additional forest plantations west of the reservoir. \nIn the south, Russian forces were able to enter Pavlivka, which was largely abandoned by the Ukrainians in favour of safer positions south of the Yanchur River. The Russians were able to consolidate control over the whole village and captured new positions in the treelines to the southeast. \n+ ~12.22 km² in favour of Russia.",
      "timestamp": "2025-10-24T06:45:23.104866Z"
    },
    {
      "original": "In the Novopavlivka and Prosyana directions, Russian forces continued to advance, making significant progress north of the Vovcha River.\nIn the west, Russian forces rapidly expanded their bridgehead over the Vovcha River in Ivanivka, reaching the centre of the village. Other forces crossed the river further west, entrenching and accumulating infantry in a forest, before advancing into the western part of Ivanivka. From there, they infiltrated the forest further west in the direction of Havrylivka. \nRussian forces then bypassed the rest of the village, and advanced uphill to the north, capturing new treeline positions and consolidating in a forested gulley. They also pushed into the forest north of Ivanivka, and advanced up the treeline, reaching the rear of Novopavlivka. Other forces were able to capture the forest plantations on the tactical heights northeast of Ivanivka. \nTo the east, Russian forces continued their assault operations towards Novopavlivka from the south. They were able to gain a foothold in the next forest northwest of Filiya, while other forces crossed the Solena River, breaking through Ukraine's main layered defence line here by establishing control over positions in the forest. \nTo the southeast, Russian forces continued clearing the Donetsk - Dnipropetrovsk Regional Border area. They advanced further into Dnipropetrovsk from this direction and captured new positions in three separate treelines. Ukrainian forces are beginning their withdrawal from the salient north of Dachne to prevent being encircled. \nTo the northeast, Russian forces recaptured positions south of the reservoir (southeast of Kotlyarivka), and advanced along a treeline towards the Donetsk-Dnipropetrovsk border from the east. \n+ ~22.35 km² in favour of Russia.",
      "timestamp": "2025-10-24T06:45:23.104874Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance in Pokrovsk City, making new progress primarily south of the railway line.\nIn the west, following infiltrations over the railway line, Russian forces were able to consolidate in roughly 40% of the northwestern industrial zone and begin attacks further north/northwest. They also crossed the tracks a new point, capturing new positions in the eastern buildings of the industrial zone.\nTo the southeast, Russian forces consolidated further in the Pervomaika District, and secured positions in the city centre via Prokofieva and Zaliznychna Streets. It is from here that they operate at the railway station and surrounding areas.\nIn the southern part of Pokrovsk, Russian forces finally cleared the forests on the outskirts of the city, along with Yuvileynyy Park, and captured the rest of the Market District and southeastern part of the Pervomaika District.\nIn the southeastern part of Pokrovsk, the Russians advanced further north through the Sobachivka District, reaching the city centre via Samarska Street. They were also able to significantly expand their zone of control in the rest of the district and are approaching the eastern outskirts of the city.\nTo the southeast, Russian forces continued to advance in Novopavlivka. They secured the centre of the village and are now advancing through the northeastern houses.\n+ ~4.23 km² in favour of Russia.",
      "timestamp": "2025-10-24T06:45:23.104883Z"
    },
    {
      "original": "Kherson City came under combined attack from Russian Geran-2 drones and MLRS last night. At least 3 Gerans impacted the Dniprovskyi District of the city, while MLRS struck the Korabelnyi District.",
      "timestamp": "2025-10-24T06:45:23.104887Z"
    },
    {
      "original": "Kherson City came under combined attack from Russian Geran-2 drones and MLRS last night. At least 3 Gerans impacted the Dniprovskyi District of the city, while MLRS struck the Korabelnyi District.",
      "timestamp": "2025-10-24T06:45:23.104891Z"
    },
    {
      "original": "Approximately 25 Russian Geran-2 drones attacked the town of Pomichna, Kirovohrad Oblast, last night. The target was town's locomotive depot, as evidenced by NASA FIRMS data. Explosions were heard for an hour straight, and fires were seen burning afterwards.",
      "timestamp": "2025-10-24T06:45:23.104894Z"
    },
    {
      "original": "Approximately 25 Russian Geran-2 drones attacked the town of Pomichna, Kirovohrad Oblast, last night. The target was town's locomotive depot, as evidenced by NASA FIRMS data. Explosions were heard for an hour straight, and fires were seen burning afterwards.",
      "timestamp": "2025-10-24T06:45:23.104897Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones hit a target at the industrial zone in northern Chernihiv City last night. A fire could be seen burning from the rest of the city. \nNo additional details were published by officials.",
      "timestamp": "2025-10-24T06:45:23.104901Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones hit a target at the industrial zone in northern Chernihiv City last night. A fire could be seen burning from the rest of the city. \nNo additional details were published by officials.",
      "timestamp": "2025-10-24T06:45:23.104905Z"
    },
    {
      "original": "Multiple Russian Geran-2 drones hit a target at the industrial zone in northern Chernihiv City last night. A fire could be seen burning from the rest of the city.   No additional details were published by officials.",
      "timestamp": "2025-10-24T06:45:23.104913Z"
    },
    {
      "original": "Additionally, at least 4 Gerans struck a target in the area of Slavutych, Kyiv Oblast during the night. There is currently no information on what was hit.",
      "timestamp": "2025-10-24T06:45:23.104916Z"
    },
    {
      "original": "Military Situation In Ukraine On October 23, 2025 (Maps Update)",
      "timestamp": "2025-10-24T06:45:23.638182Z"
    },
    {
      "original": "Military Situation In Ukraine On October 23, 2025 (Maps Update)",
      "timestamp": "2025-10-24T06:45:23.638194Z"
    },
    {
      "original": "Russian Army Strikes Crossings On Siverskyi Donets River As It Approaches Krasny Liman \nOn October 23, the Russian military approached the key city of Krasny Liman in the Donetsk direction, and struck several Ukrainian crossings on the nearby Siverskyi Donets River.\nTo the northeast of Krasny Liman, the Yug [South] Group of Forces reached Stavky. Fierce fighting with Kiev forces is now reportedly taking place inside the settlement. Russian troops also advanced towards the city from the east, capturing a large swath of land to the west of Zarichne in recent days.\n“The Russian Armed Forces have straightened the engagement line and improved their tactical position in the Stavky-Kirovsk sector of the Krasny Liman direction in the Donetsk People’s Republic. Ukrainian militants continue holding on to the strategic heights near Stavky despite casualties,” military expert Andrey Marochko told TASS.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638205Z"
    },
    {
      "original": "Russian Army Strikes Crossings On Siverskyi Donets River As It Approaches Krasny Liman \nOn October 23, the Russian military approached the key city of Krasny Liman in the Donetsk direction, and struck several Ukrainian crossings on the nearby Siverskyi Donets River.\nTo the northeast of Krasny Liman, the Yug [South] Group of Forces reached Stavky. Fierce fighting with Kiev forces is now reportedly taking place inside the settlement. Russian troops also advanced towards the city from the east, capturing a large swath of land to the west of Zarichne in recent days.\n“The Russian Armed Forces have straightened the engagement line and improved their tactical position in the Stavky-Kirovsk sector of the Krasny Liman direction in the Donetsk People’s Republic. Ukrainian militants continue holding on to the strategic heights near Stavky despite casualties,” military expert Andrey Marochko told TASS.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638214Z"
    },
    {
      "original": "SYRIA IS ABOUT TO EXPLODE",
      "timestamp": "2025-10-24T06:45:23.638218Z"
    },
    {
      "original": "The Siege Of Krasny Lyman In Ukraine: Russian Army Tightens The Noose Around The City\nRussian units have disrupted Ukrainian logistics near the Drobyshevo settlement on the Krasny Lyman axis. The Ukrainian command is transferring reserves south of Vovchansk. \nHungarian Prime Minister Viktor Orbán has sharply criticized the European Union’s policy towards Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638226Z"
    },
    {
      "original": "The Siege Of Krasny Lyman In Ukraine: Russian Army Tightens The Noose Around The City\nRussian units have disrupted Ukrainian logistics near the Drobyshevo settlement on the Krasny Lyman axis. The Ukrainian command is transferring reserves south of Vovchansk. \nHungarian Prime Minister Viktor Orbán has sharply criticized the European Union’s policy towards Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638233Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine's Power System. The West And Kyiv Announce New Anti-Russian Sanctions\nOn October 22-23, the conflict between Russia and Ukraine continued with mutual strikes, although their intensity was lower than in previous days. According to the Ukrainian Air Force, the Russian side used 130 UAVs, 92 of which were claimed to have been shot down. \nDonald Trump announced he was scrapping the idea of a Budapest summit with Vladimir Putin, describing the decision as a tactical pause rather than a complete breakdown in dialogue. A key point was that this statement came after Rutte presented him with a European-Ukrainian 12-point \"peace plan,\" which included a ceasefire along the current lines, security guarantees for Ukraine, a path to EU membership, and increased economic pressure on Moscow. Analysts note that Trump's team likely concluded that arriving at a meeting with Putin with a plan that Moscow had already preemptively rejected would be a futile endeavor.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638252Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine's Power System. The West And Kyiv Announce New Anti-Russian Sanctions\nOn October 22-23, the conflict between Russia and Ukraine continued with mutual strikes, although their intensity was lower than in previous days. According to the Ukrainian Air Force, the Russian side used 130 UAVs, 92 of which were claimed to have been shot down. \nDonald Trump announced he was scrapping the idea of a Budapest summit with Vladimir Putin, describing the decision as a tactical pause rather than a complete breakdown in dialogue. A key point was that this statement came after Rutte presented him with a European-Ukrainian 12-point \"peace plan,\" which included a ceasefire along the current lines, security guarantees for Ukraine, a path to EU membership, and increased economic pressure on Moscow. Analysts note that Trump's team likely concluded that arriving at a meeting with Putin with a plan that Moscow had already preemptively rejected would be a futile endeavor.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-24T06:45:23.638260Z"
    },
    {
      "original": "Geran Strikes: Summary Of Russian Combat Footage From October 23, 2025\nOn October 23, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-24T06:45:23.638266Z"
    },
    {
      "original": "Geran Strikes: Summary Of Russian Combat Footage From October 23, 2025\nOn October 23, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-24T06:45:23.638272Z"
    }
  ],
  "script_run_time": "2025-10-24T06:45:23.639104Z"
}