{
  "messages": [
    {
      "original": "🛵\n Кременчук - БпЛА у напрямку міста!",
      "timestamp": "2025-09-08T03:28:46.655665Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-09-08T03:28:46.655682Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку Білгород-Дністровського району Одещини.",
      "timestamp": "2025-09-08T03:28:46.655688Z"
    },
    {
      "original": "🛵\n БпЛА з Кіровоградщини та Полтавщини на Черкащину.\n🛵\n БпЛА на Донеччині (Покровський район).\n🛵\n БпЛА в акваторії Чорного моря в напрямку півдня Одещини.",
      "timestamp": "2025-09-08T03:28:46.655696Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Черкащини на Київщину (Білоцерківський район).",
      "timestamp": "2025-09-08T03:28:46.655700Z"
    },
    {
      "original": "🛵\n Миколаїв - ударний БпЛА з півдня у напрямку міста!",
      "timestamp": "2025-09-08T03:28:46.655705Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Черкащини на Київщину (Білоцерківський район).",
      "timestamp": "2025-09-08T03:28:46.655709Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА на Київщині курсом на Обухів.",
      "timestamp": "2025-09-08T03:28:46.655713Z"
    },
    {
      "original": "🛵\n Ударний БпЛА з акваторії Чорного моря курсом на Чорноморське.",
      "timestamp": "2025-09-08T03:28:46.655720Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА на сході Дніпропетровщини (Павлоградський район).\n🛵\n БпЛА на сході Харківщини курсом на Донеччину.",
      "timestamp": "2025-09-08T03:28:46.655728Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини на Чернігівщину.\n🛵\n БпЛА на межі Дніпропетровщини та Запорізької області.\n🛵\n БпЛА на Харківщині курсом на Балаклію.\n🛵\n БпЛА на Донеччині.",
      "timestamp": "2025-09-08T03:28:46.655738Z"
    },
    {
      "original": "🛵\n Група БпЛА з Черкащини на Київщину.",
      "timestamp": "2025-09-08T03:28:46.655742Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА з Чернігівщини на Київщину.",
      "timestamp": "2025-09-08T03:28:46.655747Z"
    },
    {
      "original": "🛵\n Павлоград - БпЛА у напрямку міста!",
      "timestamp": "2025-09-08T03:28:46.655751Z"
    },
    {
      "original": "🛵\n Група БпЛА курсом на Глеваху.\n🛵\n Група БпЛА курсом на Обухів.",
      "timestamp": "2025-09-08T03:28:46.655757Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Васильків.",
      "timestamp": "2025-09-08T03:28:46.655761Z"
    },
    {
      "original": "🛵\n БпЛА з півдня у напрямку Києва!",
      "timestamp": "2025-09-08T03:28:46.655765Z"
    },
    {
      "original": "🛵\n БпЛА з півдня у напрямку Києва!",
      "timestamp": "2025-09-08T03:28:46.655769Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-09-08T03:28:46.655773Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-08T03:28:46.655777Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-08T03:28:46.655781Z"
    },
    {
      "original": "🛵\n Група БпЛА на Чернігівщині у південно-західному напрямку.",
      "timestamp": "2025-09-08T03:28:46.655786Z"
    },
    {
      "original": "A combined missile and drone attack was carried out on Kremenchuk, Poltava Oblast, last night. At least 30 Geran-2 drones and as many as 4 Iskander-K cruise missiles impacted various targets.\nAmong the targets hit was the Kremenchuk Railway Depot and its electrical substation (49.087513, 33.452945). Multiple large fires are now burning there.\nAdditionally, as seen in the first video, 2 Russian Geran-2 drones impacted the middle section of the Kryukovsky Bridge over the Dnipro River. Minor damage was recorded.",
      "timestamp": "2025-09-08T03:28:47.194588Z"
    },
    {
      "original": "A combined missile and drone attack was carried out on Kremenchuk, Poltava Oblast, last night. At least 30 Geran-2 drones and as many as 4 Iskander-K cruise missiles impacted various targets.\nAmong the targets hit was the Kremenchuk Railway Depot and its electrical substation (49.087513, 33.452945). Multiple large fires are now burning there.\nAdditionally, as seen in the first video, 2 Russian Geran-2 drones impacted the middle section of the Kryukovsky Bridge over the Dnipro River. Minor damage was recorded.",
      "timestamp": "2025-09-08T03:28:47.194601Z"
    },
    {
      "original": "New footage showing two Russian Iskander-K cruise missile strikes on a warehouse complex in Kyiv, this morning. The complex is already burning, and what appears to be an interceptor missile can be seen self-destructing on approach.",
      "timestamp": "2025-09-08T03:28:47.194606Z"
    },
    {
      "original": "The city of Kryvyi Rih, Dnipropetrovsk Oblast, was attacked by 6 Iskander-M ballistic missiles and over a dozen Geran-2 drones last night. Strong explosions rocked the city, and fires were recorded burning afterwards. \nThe main targets were industrial enterprises, but the exact targets are unknown.",
      "timestamp": "2025-09-08T03:28:47.194610Z"
    },
    {
      "original": "The city of Kryvyi Rih, Dnipropetrovsk Oblast, was attacked by 6 Iskander-M ballistic missiles and over a dozen Geran-2 drones last night. Strong explosions rocked the city, and fires were recorded burning afterwards. \nThe main targets were industrial enterprises, but the exact targets are unknown.",
      "timestamp": "2025-09-08T03:28:47.194615Z"
    },
    {
      "original": "Starokostyantyniv Airbase in Khmelnytskyi Oblast was also targeted by at least 20 Gerans, but naturally there are no videos or photos.",
      "timestamp": "2025-09-08T03:28:47.194618Z"
    },
    {
      "original": "Thank God for Ukraine's massively effective air defence shooting down 747 drones last night. But seriously, why is it only Ukraine's government that people are inclined to believe when it comes to unsubstantiated wartime claims... the government that has a long history of lies?",
      "timestamp": "2025-09-08T03:28:47.194621Z"
    },
    {
      "original": "Russian forces have captured the village of Novoselivka, Pokrovske direction, Dnipropetrovsk Oblast.\nPre-war population: ~295.\nTotal land area: ~0.92 km².",
      "timestamp": "2025-09-08T03:28:47.194626Z"
    },
    {
      "original": "A combined missile and drone attack was carried out on Kremenchuk, Poltava Oblast, last night. At least 30 Geran-2 drones and as many as 4 Iskander-K cruise missiles impacted various targets.  Among the targets hit was the Kremenchuk Railway Depot and its…",
      "timestamp": "2025-09-08T03:28:47.194630Z"
    },
    {
      "original": "Close-up of the damage to the bridge in Kremenchuk after it was hit by two Russian Geran-2 drones yesterday. The damage is minor, as the drones hit the top part of the frame.",
      "timestamp": "2025-09-08T03:28:47.194633Z"
    },
    {
      "original": "Close-up of the damage to the bridge in Kremenchuk after it was hit by two Russian Geran-2 drones yesterday. The damage is minor, as the drones hit the top part of the frame.",
      "timestamp": "2025-09-08T03:28:47.194637Z"
    },
    {
      "original": "Kyiv and the region is currently under a large-scale Russian Geran-2 drone attack. The Trypillia Thermal Power Plant is the main target.",
      "timestamp": "2025-09-08T03:28:47.194640Z"
    },
    {
      "original": "Soon.....",
      "timestamp": "2025-09-08T03:28:47.194643Z"
    },
    {
      "original": "What section of the frontline would you like me to make a long form analysis on, and why? I recently did one on the future of Pokrovske-Prosyana, and how that could influence the battle of Hulyaipole.",
      "timestamp": "2025-09-08T03:28:47.194646Z"
    },
    {
      "original": "Around 20 Geran-2 drones are currently flying over Chernihiv and Poltava, heading towards Kyiv, most likely aiming for Trypillia again",
      "timestamp": "2025-09-08T03:28:47.194649Z"
    },
    {
      "original": "Yesterday, a UAV launched by the Houthis in Yemen impacted Ramon International Airport in southern Israel. Damage was recorded to the passenger hall, and the airport temporarily suspended all flights. Two civilians were injured as a result. \nTo my knowledge, this is the second Houthi UAV to impact its target in Israel, after the impact in Tel Aviv last year.",
      "timestamp": "2025-09-08T03:28:47.194653Z"
    },
    {
      "original": "Yesterday, a UAV launched by the Houthis in Yemen impacted Ramon International Airport in southern Israel. Damage was recorded to the passenger hall, and the airport temporarily suspended all flights. Two civilians were injured as a result. \nTo my knowledge, this is the second Houthi UAV to impact its target in Israel, after the impact in Tel Aviv last year.",
      "timestamp": "2025-09-08T03:28:47.194657Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continue to rapidly advance and have made significant progress over the past 5 days. \nSouth of the Vorona River, after recapturing Vorone and consolidating in the village and surrounding areas, Russian forces resumed their assault operations with the goal of reaching Sosnivka. This was done by attacking in two places. The main assaults were carried out from Komyshuvakha and positions to the north. Here, Russian forces advanced from the village to the outskirts of Ternove, and along the heights to the gulley running southeast from Sosnivka, securing full control over the heights and establishing themselves in the low-lying ground. \nWith the Ukrainians now behind the gulley and unable to effectively counterattack, Russian reinforcements were brought into Vorone, which began attacking from their newly consolidated positions to the Khoroshe Tract, capturing it, and breaking into the northeastern houses of Sosnivka. At the same time, Russian forces entered Sosnivka from the southeast after capturing the eastern edge of the gulley and quickly captured the majority of the village. Currently the northwestern houses are in the grey-zone. Ukrainian soldiers trying to enter it in small groups. \nMeanwhile, north of the Vorona River, Russian forces advanced from their newly consolidated positions northeast of Vorone, advancing northwest along the heights to the southern edge of Novoselivka. They were able to quickly enter the village and establish control over the southern streets, while other forces from the gulley to the north captured the northern houses, bringing the settlement under full Russian control. Additionally, as a result of these advances, the Ukrainians had to abandon the village of Sichneve to avoid being encircled and retreated more than 6 km west to positions north of Sosnivka. \n+ ~33.20 km² in favour of Russia.",
      "timestamp": "2025-09-08T03:28:47.194663Z"
    }
  ],
  "script_run_time": "2025-09-08T03:28:47.588795Z"
}