{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T09:58:32.685023Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-22T09:58:32.685051Z"
    },
    {
      "original": "🛵\n БпЛА на сході Сумщини, курс південно-західний.",
      "timestamp": "2025-10-22T09:58:32.685058Z"
    },
    {
      "original": "🛵\n Суми - БпЛА у напрямку міста!",
      "timestamp": "2025-10-22T09:58:32.685065Z"
    },
    {
      "original": "🛵\n Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-22T09:58:32.685070Z"
    },
    {
      "original": "🛵\n БпЛА на межі Чернігівщини та Сумщини, курс південно-західний.",
      "timestamp": "2025-10-22T09:58:32.685075Z"
    },
    {
      "original": "🛸\nНа сході Сумщини - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження.",
      "timestamp": "2025-10-22T09:58:32.685082Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Берестинський та Лозівський райони), курс південний.",
      "timestamp": "2025-10-22T09:58:32.685087Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-22T09:58:32.685094Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Корюківський р-н), курс північно-східний.",
      "timestamp": "2025-10-22T09:58:32.685103Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини,курс південно-західний.",
      "timestamp": "2025-10-22T09:58:32.685113Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-22T09:58:32.685118Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-22T09:58:32.685127Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Чернігівський  р-н), курс південно-західний.",
      "timestamp": "2025-10-22T09:58:32.685133Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-22T09:58:32.685139Z"
    },
    {
      "original": "🛵\n🛸\nНа півдні Миколаївщини - ворожий  БпЛА!",
      "timestamp": "2025-10-22T09:58:32.685145Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині,курс північно-західний.",
      "timestamp": "2025-10-22T09:58:32.685150Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Ізюмський р-н), курс на Донеччину.",
      "timestamp": "2025-10-22T09:58:32.685154Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на Херсонщині. Даний безпілотник може бути навідником ворожих засобів ураження.",
      "timestamp": "2025-10-22T09:58:32.685163Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 349 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 22 жовтня (з 19:00 21 жовтня) противник завдав комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного та наземного базування. Загалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 433 засоби повітряного нападу – 28 ракет (15 із них – «балістика») та 405 БпЛА різних типів:\n- 405 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Міллерово, Орел, Приморсько-Ахтарськ – рф, Чауда – ТОТ АР Крим (близько 250 із них – «шахеди»);\n- 11 балістичних ракет Іскандер-М/KN-23 (райони пусків: Брянська, Ростовська обл. – рф, ТОТ Донецької обл.);\n- 9 крилатих ракет Іскандер-К (райони пусків: Курська, Воронезька обл. – рф, ТОТ АР Крим);\n- 4 аеробалістичних ракет Х-47М2 «Кинджал» із повітряного простору Ростовської обл. – рф;\n- 4 керованих авіаційних ракет Х-59/69 (район пусків: ТОТ Запорізької обл.).\n❗️\nОсновний напрямок удару – Київщина. Також постраждали Дніпропетровщина, Запоріжжя, Черкащина, Чернігівщина та Одещина. \nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\nЗа попередніми даними, станом на 12.30, протиповітряною обороною збито/подавлено 349 повітряних цілей:\n- 333 ворожих БпЛА типу Shahed, Гербера (безпілотники інших типів);\n- 8 крилатих ракет Іскандер-К;\n- 6 балістичних ракет Іскандер-М/KN-23;\n- 2 керовані авіаційні ракети Х-59/69.\nНаразі зафіксовано прямі влучання 12 ракет та 55 ударних БпЛА на 26 локаціях та падіння збитих (уламки) на 19 локаціях. Крім того, 17 БпЛА не досягли цілей (локаційно втрачені), інформація уточнюється. На жаль, є загиблі та постраждалі.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-22T09:58:32.685194Z"
    },
    {
      "original": "It seems the Kinzhals are actually being launched from new launch lines in southwestern Astrakhan Oblast, which is why they are taking longer to reach Ukrainian airspace. One more should be flying to Luhansk Oblast now.",
      "timestamp": "2025-10-22T09:58:33.522070Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace.",
      "timestamp": "2025-10-22T09:58:33.522084Z"
    },
    {
      "original": "The 2 MiG-31Ks are flying towards Vologdonsk, Rostov Oblast on a northwestern course.",
      "timestamp": "2025-10-22T09:58:33.522088Z"
    },
    {
      "original": "Ukrainian channels claim that the last Kinzhal launch failed. Air raid alerts are being lifted.",
      "timestamp": "2025-10-22T09:58:33.522091Z"
    },
    {
      "original": "The MiG-31Ks returned to Akhtubinsk Airbase, Astrkhan Oblast.",
      "timestamp": "2025-10-22T09:58:33.522095Z"
    },
    {
      "original": "Last night, another large-scale, combined missile and drone attack was carried out on Ukraine.\nMissiles launched:\n~7 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.\n~2 Iskander-M ballistic missiles launched from OTRK installations near Taganrog, Rostov Oblast.\n~4 S-300 (ground-to-ground) missiles launched from near Kurchatov, Kursk Oblast.\n~5 Iskander-K cruise missiles launched from OTRK installations near Khalino Airbase, Kursk Oblast.\n~4 Iskander-K cruise missiles launched from OTRK installations near Millerovo Airbase, Rostov Oblast. \n~2 Iskander-K cruise missiles launched from OTRK installations in western Crimea. \n~1 Kh-59/69 cruise missile launched from a Su-57 fighter at the launch lines in eastern Kursk Oblast.\n~4 Kh-59/69 cruise missiles launched from Su-34 fighters at the launch lines near Melitopol, Zaporizhzhia Oblast. \n~4 Kinzhal aeroballistic hypersonic missiles launched from 4 MiG-31Ks at the launch lines in Limansky District, Astrakhan Oblast. \nInterceptions rates are currently unknown, but some of the Iskander-M ballistic missiles launched to Kyiv were definitely shot down. \nThe main targets for this strike were once again Ukrainian energy infrastructure. The following was hit:\nKyiv CHP-5 Power Station, Kyiv Oblast (50.39317, 30.569477).\nKaniv Hydroelectric Power Plant, Cherkasy Oblast (49.76409, 31.46889).\nKremenchuk Hydroelectric Power Plant, Poltava Oblast (49.07585, 33.25104).\nDnipro Hydroelectric Power Plant, Zaporizhzhia Oblast (47.86934, 35.08132). \nKamianske Hydroelectric Power Plant, Dnipropetrovsk Oblast (48.54581, 34.54035). \nHoncharivske Training Ground, Chernihiv Oblast (51.3002, 30.91111).\nUnknown target(s) near Bilopillya, Sumy Oblast.\nAdditional places targeted by Geran-2 drones, but not by missiles, include:\nKonotop, Sumy Oblast.\nIzmail, Odesa Oblast.\nKarlivka, Poltava Oblast.\nBrovary, Kyiv Oblast.\nAdditionally, several KAB glide-bombs also impacted Zaporizhzhia City last night. \nKeep in mind, the numbers of missiles launched are slightly higher than what I've listed, as the number of missiles detected was lower than actual launches.",
      "timestamp": "2025-10-22T09:58:33.522124Z"
    },
    {
      "original": "Last night, another large-scale, combined missile and drone attack was carried out on Ukraine.  Missiles launched:  ~7 Iskander-M ballistic missiles launched from OTRK installations northwest of Klintsy, Bryansk Oblast.  ~2 Iskander-M ballistic missiles launched…",
      "timestamp": "2025-10-22T09:58:33.522128Z"
    },
    {
      "original": "4 out of 5 operational Hydroelectric Power Plants were hit by Russian missiles last night...",
      "timestamp": "2025-10-22T09:58:33.522131Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Kyiv's CHP-5 Power Plant.",
      "timestamp": "2025-10-22T09:58:33.522135Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Kyiv's CHP-5 Power Plant.",
      "timestamp": "2025-10-22T09:58:33.522139Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Kyiv's CHP-5 Power Plant.",
      "timestamp": "2025-10-22T09:58:33.522142Z"
    },
    {
      "original": "Scenes from the combined missile and drone strike on Kyiv's CHP-5 Power Plant.",
      "timestamp": "2025-10-22T09:58:33.522145Z"
    },
    {
      "original": "Ukrainian UAVs attacked a substation in Trubchevsk, Bryansk Oblast, last night. A large fire is now burning there resulting the town and surrounding areas being left without power.",
      "timestamp": "2025-10-22T09:58:33.522149Z"
    },
    {
      "original": "Ukrainian UAVs attacked a substation in Trubchevsk, Bryansk Oblast, last night. A large fire is now burning there resulting the town and surrounding areas being left without power.",
      "timestamp": "2025-10-22T09:58:33.522152Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saransk Mechanical Plant in Saransk Oblast. Only one impact is confirmed, but a fire was seen burning afterwards. \nThe Saransk Mechanical Plant produces straight-flow valves for compressors, detonating mechanisms for explosives and munitions, as well as other consumer goods.",
      "timestamp": "2025-10-22T09:58:33.522156Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Saransk Mechanical Plant in Saransk Oblast. Only one impact is confirmed, but a fire was seen burning afterwards. \nThe Saransk Mechanical Plant produces straight-flow valves for compressors, detonating mechanisms for explosives and munitions, as well as other consumer goods.",
      "timestamp": "2025-10-22T09:58:33.522160Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the city of Makhachkala, Republic of Dagestan, Russia. At least two impacts were recorded, including one at NPZ LLC Dagnotech, and another in a residential area.\nNPZ LLC Dagnotech specialises in the production of \nEuro-4 and Euro-5 compliant gasoline and diesel, refined oil products such as lubricant, and base oils.",
      "timestamp": "2025-10-22T09:58:33.522164Z"
    },
    {
      "original": "This morning, Ukrainian UAVs attacked the city of Makhachkala, Republic of Dagestan, Russia. At least two impacts were recorded, including one at NPZ LLC Dagnotech, and another in a residential area.\nNPZ LLC Dagnotech specialises in the production of \nEuro-4 and Euro-5 compliant gasoline and diesel, refined oil products such as lubricant, and base oils.",
      "timestamp": "2025-10-22T09:58:33.522169Z"
    },
    {
      "original": "Ukrainian SBU drones targeted an airfield in Kherson Oblast used to house Russian light aircraft involved in shooting down long-range UAVs, after Russian TV leaked the positions of the aircraft 5 days ago. 2 aircraft were hit by drones.",
      "timestamp": "2025-10-22T09:58:33.522172Z"
    },
    {
      "original": "Once again, the so-called \"experts\" are posting the usual statistical slop.  \"Russia advanced X amount last year, so it will take them 500 years to take all of Ukraine!\"  I cannot believe people still fall for this shit. Advances in a war of attrition are…",
      "timestamp": "2025-10-22T09:58:33.522175Z"
    },
    {
      "original": "Here is what a Ukrainian Senior Lieutenant has to say about The Economist's \"analysis\" on Russia's potential in Ukraine. \nBut don't worry, at this rate it will take another 100 years for Russia to win. Whatever keeps you safe and happy in your little bubble.",
      "timestamp": "2025-10-22T09:58:33.522179Z"
    },
    {
      "original": "Interesting Russian movements happening right now.\nAt least 1 Tu-95MS and 2 Tu-22M3s strategic bombers are flying south from Olenya Airbase, Murmansk Oblast, towards Saratov Oblast. They should arrive at any potential launch lines in the next 30 minutes.\nIf they intend to carry out a missile strike, it would be at a very odd time. Also, Tu-22M3s and Tu-95s don't usually fly together during combat sorties, but the Tu-22s may split off in the near future. \nI will continue to monitor the situation.",
      "timestamp": "2025-10-22T09:58:33.522184Z"
    },
    {
      "original": "Russian Army Advances Deep In Kupyansk And Other Parts Of Kharkiv (Videos)\nOn October 21, the Russian military advanced in several areas in the Kharkiv direction, most notably in the city of Kupyansk, despite facing resistance from Kiev forces.\nThe Sever [North] Group of Forces expanded its control in Vovchansk, capturing new territories to the west of the settlement. Russian troops reached Synelnykove, with preliminary reports indicating that the settlement was being stormed.\nMoving more to the south in Kharkiv, the Zapad [West] Group of Forces made additional gains in Kupyansk. Russian troops advanced some one kilometer into the southern part of the city, reaching the Yubileyny neighborhood and capturing some high-rise buildings there.\nRead more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323432Z"
    },
    {
      "original": "Russian Army Advances Deep In Kupyansk And Other Parts Of Kharkiv (Videos)\nOn October 21, the Russian military advanced in several areas in the Kharkiv direction, most notably in the city of Kupyansk, despite facing resistance from Kiev forces.\nThe Sever [North] Group of Forces expanded its control in Vovchansk, capturing new territories to the west of the settlement. Russian troops reached Synelnykove, with preliminary reports indicating that the settlement was being stormed.\nMoving more to the south in Kharkiv, the Zapad [West] Group of Forces made additional gains in Kupyansk. Russian troops advanced some one kilometer into the southern part of the city, reaching the Yubileyny neighborhood and capturing some high-rise buildings there.\nRead more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323451Z"
    },
    {
      "original": "Continued Exchange Of Strikes Against A Backdrop Of Diplomatic Deadlock\nOn October 20-21, the Russian armed forces carried out massive strikes on Ukrainian military and critical infrastructure objects. The attacks targeted energy and transportation hubs supporting the AFU, warehouses housing strike drones, and temporary deployment points for Ukrainian units and foreign mercenaries. In Kharkiv, a hit by a long-range air-dropped bomb was recorded, which aligns with reports of Russia ramping up the industrial production of such munitions.\nAgainst this backdrop, according to some experts, the rhetoric of several European leaders and Ukrainian President Zelensky, who formally support the idea of a ceasefire across the entire front line, in practice suggests the opposite. Their statements about the inevitable tightening of sanctions against Russia following any truce are interpreted as an attempt to reduce the already low likelihood of Vladimir Putin agreeing to such a step...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323461Z"
    },
    {
      "original": "Continued Exchange Of Strikes Against A Backdrop Of Diplomatic Deadlock\nOn October 20-21, the Russian armed forces carried out massive strikes on Ukrainian military and critical infrastructure objects. The attacks targeted energy and transportation hubs supporting the AFU, warehouses housing strike drones, and temporary deployment points for Ukrainian units and foreign mercenaries. In Kharkiv, a hit by a long-range air-dropped bomb was recorded, which aligns with reports of Russia ramping up the industrial production of such munitions.\nAgainst this backdrop, according to some experts, the rhetoric of several European leaders and Ukrainian President Zelensky, who formally support the idea of a ceasefire across the entire front line, in practice suggests the opposite. Their statements about the inevitable tightening of sanctions against Russia following any truce are interpreted as an attempt to reduce the already low likelihood of Vladimir Putin agreeing to such a step...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323470Z"
    },
    {
      "original": "DEEP STRIKES AND STRATEGIC ENCIRCLEMENT: POLTAVA BOMBING AND THE IMPENDING SIEGE OF POKROVSK",
      "timestamp": "2025-10-22T09:58:34.323474Z"
    },
    {
      "original": "The Capture Of Malaya Tokmachka: Russia’s 58th Army Expands Its Bridgehead In Zaporozhye\nRussian units in Pokrovsk have cut off the M-30 highway near the industrial zone. The 58th Army has established control over a significant portion of Malaya Tokmachka. \nThe EU and Ukraine are developing a 12-point conflict resolution plan.\nRead more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323482Z"
    },
    {
      "original": "The Capture Of Malaya Tokmachka: Russia’s 58th Army Expands Its Bridgehead In Zaporozhye\nRussian units in Pokrovsk have cut off the M-30 highway near the industrial zone. The 58th Army has established control over a significant portion of Malaya Tokmachka. \nThe EU and Ukraine are developing a 12-point conflict resolution plan.\nRead more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323489Z"
    },
    {
      "original": "SIGINT System Hit: Summary Of Russian Combat Footage From October 21, 2025\nOn October 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-22T09:58:34.323496Z"
    },
    {
      "original": "SIGINT System Hit: Summary Of Russian Combat Footage From October 21, 2025\nOn October 21, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-22T09:58:34.323503Z"
    },
    {
      "original": "Germany Pays The Price For Blindly Following Biden Admin In Ukraine Crisis\nGermany is experiencing a serious economic crisis with no prospect of a short-term solution, especially as the economy is expected to grow by only around 0.2% to 1.3% in 2025 after contracting by 0.2% in 2024, following a decline of 0.3% in 2023. This recovery is compensatory and the country would not even be in a crisis if Berlin did not blindly follow the Joe Biden administration into the Ukraine conflict.\nAlthough Germany was experiencing economic difficulties before Russia launched its Special Military Operation in February 2022, the boomerang effect of anti-Russia sanctions has turned the economic situation into a crisis, with Europe’s once economic powerhouse now losing in competition with China.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-22T09:58:34.323511Z"
    }
  ],
  "script_run_time": "2025-10-22T09:58:34.324468Z"
}