{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-27T15:53:02.675869Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-27T15:53:02.675895Z"
    },
    {
      "original": "🛵\n  БпЛА на Харків з півдня.",
      "timestamp": "2025-11-27T15:53:02.675901Z"
    },
    {
      "original": "⚠\nУВАГА!\nПовітряна тривога в Одеській області через роботу розвідувального БпЛА  в акваторії Чорного моря, курсом на Одещину.",
      "timestamp": "2025-11-27T15:53:02.675907Z"
    },
    {
      "original": "🛵\n  БпЛА на Харківщині, поблизу н.п. Барвінкове, курс на схід та н.п. Близнюки, курс на північ.",
      "timestamp": "2025-11-27T15:53:02.675911Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Дніпропетровщини, курс на Донеччину.",
      "timestamp": "2025-11-27T15:53:02.675916Z"
    },
    {
      "original": "🛵\n  БпЛА на північ від н.п. Краснопавлівка на Харківщині, курс на північ.",
      "timestamp": "2025-11-27T15:53:02.675921Z"
    },
    {
      "original": "🛵\n  БпЛА на північ від н.п. Богодухів на Харківщині, курс на південь.",
      "timestamp": "2025-11-27T15:53:02.675925Z"
    },
    {
      "original": "🛵\n  БпЛА на межі Харківщини та Полтавщини, курс південний.\n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний.",
      "timestamp": "2025-11-27T15:53:02.675932Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Дніпропетровщини, курс західний/північно-західний.",
      "timestamp": "2025-11-27T15:53:02.675936Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-27T15:53:02.675941Z"
    },
    {
      "original": "🛵\n  БпЛА на Харківщині, повз Краснопавлівку, курс південно-східний.",
      "timestamp": "2025-11-27T15:53:02.675945Z"
    },
    {
      "original": "🛵\n  БпЛА на Слов'янськ з півночі.",
      "timestamp": "2025-11-27T15:53:02.675950Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Чернігівщини, курс на південь.",
      "timestamp": "2025-11-27T15:53:02.675956Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-27T15:53:02.675960Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-27T15:53:02.675968Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину, курсом на південь Дніпропетровщини.",
      "timestamp": "2025-11-27T15:53:02.675972Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину  зі сходу.",
      "timestamp": "2025-11-27T15:53:02.675977Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Чернігівщини, курс на захід та південь.",
      "timestamp": "2025-11-27T15:53:02.675981Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі.",
      "timestamp": "2025-11-27T15:53:02.675985Z"
    },
    {
      "original": "🇮🇶\n🇮🇶\n💥\n❗️\n — All operations at the Khor Mor gas field have been suspended following the drone strike, which has been confirmed by the KRG Ministry of Natural Resources and Energy.\n@TabZLIVE",
      "timestamp": "2025-11-27T15:53:03.470094Z"
    },
    {
      "original": "The military operation in the northern part of the West Bank seems to be focused on the Tubas Governorate.   The IDF has deployed to the city of Tubas, along with Tamun, Aqaba, Tayasir, and the Fara'a Refugee Camp. They have begun evacuating families from…",
      "timestamp": "2025-11-27T15:53:03.470105Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank. \nIn the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant and seized a number of other explosive devices in his car.\nIn the city of Tubas, the local armed group \"Tubas Battalion\" claimed that it detonated multiple IEDs against IDF military vehicles and fired on Israeli soldiers with small arms. \nIn the towns of Tamun and Aqaba, a large-scale arrest campaign has been carried out. The mayor of Tamun is among those arrested.\nIn addition, the IDF carried out raids on the towns of Al-Yamoun and Jaba",
      "timestamp": "2025-11-27T15:53:03.470112Z"
    },
    {
      "original": "Earlier today, 2 Russian IL-76MD cargo planes landed at Rostov Airbase. The cargo consists of Iskander-M ballistic missiles, which will be delivered by road to OTRK installations near the city of Taganrog, Rostov Oblast.\nThere is an increased threat of Iskander launches from here over the next 36 hours.",
      "timestamp": "2025-11-27T15:53:03.470116Z"
    },
    {
      "original": "Multiple Ukrainian UAVs (Likely FP-1/2 drones) have impacted the \"Novoaidarska\" 110 kV electrical substation in Luhansk Oblast. Partial power outages are reported in the town of Novoaidar. \nCoordinates: 48.94245, 39.01565",
      "timestamp": "2025-11-27T15:53:03.470120Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack.\nIn general, for both sides it’s very hard to move without being spotted, even in the forest, because of the total prevalence of drones on both sides. In particular, Ukrainian drones are the ones mostly preventing Russian successes.\nIt looks like the Ukrainian command understands that fighting in the forest is much more convenient than fighting for Lyman city, which confirms my suspicions of the fact that urban warfare is not convenient anymore against infiltration tactics.",
      "timestamp": "2025-11-27T15:53:03.470125Z"
    },
    {
      "original": "In Lyman forest the situation finally got a bit easier. Either the Russians understood that it will be very hard to move further from their current positions, or they started saving up resources for a bigger attack. In general, for both sides it’s very hard…",
      "timestamp": "2025-11-27T15:53:03.470129Z"
    },
    {
      "original": "Also important to keep in mind is that currently, supply for Ukrainian forces trying to cross the Siverskyi Donets River into Lyman is hell.\nDespite that, significant Ukrainian reinforcements appear to have deployed there.",
      "timestamp": "2025-11-27T15:53:03.470133Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T15:53:03.470138Z"
    },
    {
      "original": "At least 15 Russian Geran-2 drones have attacked targets in Dnipropetrovsk Oblast.\nImpacts were recorded in the vicinity of the Shakhtarske Mine, in the towns of Chaplyne and Petropavlivka, and in the village of Chumaky. \nAdditional strikes in Dnipropetrovsk Oblast are possible later on in the night.",
      "timestamp": "2025-11-27T15:53:03.470143Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-27T15:53:03.470151Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack targeted the city of Chornomorsk, Odesa Oblast.\nApproximately 16 drones took part in the attack, all of which targeted the \"Temp\" 110 kV railway substation.\nCoordinates: 46.318178, 30.639338",
      "timestamp": "2025-11-27T15:53:03.470156Z"
    },
    {
      "original": "The IDF military operation, dubbed \"Operation Five Stones\" continues in the northern West Bank.   In the town of Qabatiya, a Palestinian fighter affiliated with Hamas threw an IED at Israeli infantry. Israeli soldiers responded with fire, killing the militant…",
      "timestamp": "2025-11-27T15:53:03.470159Z"
    },
    {
      "original": "Israel's new military operation in the northern West Bank continues into its second day.\nThe IDF continues carrying out raids in settlements they deployed to earlier, and have also begun raiding the city of Qalqiya, Nablus, the eastern suburbs of Tulkarm, and the village of Kafr Thulth.\nAdditional widespread arrests have been made in various different settlements, and road closures remain in place, limiting Palestinian movement. IDF military bulldozers also demolished additional streets in the town of Tamun. \nThe centre of these operations remain in the city of Tubas, where hundreds of IDF soldiers have been deployed.",
      "timestamp": "2025-11-27T15:53:03.470176Z"
    },
    {
      "original": "The professional think tank with so-called experts working for it has resorted to the linear warfare argument.\nThey are openly lying about how attritional wars are fought, but people will just eat it up.",
      "timestamp": "2025-11-27T15:53:03.470180Z"
    },
    {
      "original": "Several Israeli airstrikes have targeted southern Lebanon. \nExplosions were heard in Al-Mahmoudiya, Al-Jarmaq, Nahr Nabaa Tasa, and Jabal Al-Rafie",
      "timestamp": "2025-11-27T15:53:03.470184Z"
    },
    {
      "original": "Several Israeli airstrikes have targeted southern Lebanon. \nExplosions were heard in Al-Mahmoudiya, Al-Jarmaq, Nahr Nabaa Tasa, and Jabal Al-Rafie",
      "timestamp": "2025-11-27T15:53:03.470188Z"
    },
    {
      "original": "Several Israeli airstrikes on the Bekaa Valley, northeastern Lebanon.",
      "timestamp": "2025-11-27T15:53:03.470191Z"
    },
    {
      "original": "Repeated Israeli airstrikes on southern Lebanon.",
      "timestamp": "2025-11-27T15:53:03.470195Z"
    },
    {
      "original": "Repeated Israeli airstrikes on southern Lebanon.",
      "timestamp": "2025-11-27T15:53:03.470198Z"
    },
    {
      "original": "Russian forces have captured the village of Shakhove, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~899.\nTotal land area: ~2.29 km².\nThe 2nd battle for Shakhove lasted approximately 1 month, 10 days.",
      "timestamp": "2025-11-27T15:53:03.470203Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 26, 2025\nOn November 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205592Z"
    },
    {
      "original": "Iskander Strike: Summary Of Russian Combat Footage From November 26, 2025\nOn November 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205606Z"
    },
    {
      "original": "The Drone Incident In Moldova: Provocation Or Real Threat?\nIn late November, an incident in Moldova attracted the attention of officials and the public. A drone marked with a \"Z\" was discovered on the roof of a private house in the Florești district, identified by Moldovan authorities as a Russian UAV \"Gerbera.\" According to a statement from the Republic's Ministry of Defense, the device fell from an altitude of one and a half kilometers during a Russian attack on targets in Ukraine. Notably, however, neither the drone itself nor the building's roof sustained any damage.\nLocal residents reacted to the event with skepticism. A resident of the village of Cuhureștii de Jos told journalists:\n\"This is some kind of show, if you ask me. I know this drone has been lying on that roof for two weeks. We have such 'strong' guards that they didn't even notice a drone lying on the roof.\"\nThese words cast doubt on the official version of the drone's recent fall.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205618Z"
    },
    {
      "original": "The Drone Incident In Moldova: Provocation Or Real Threat?\nIn late November, an incident in Moldova attracted the attention of officials and the public. A drone marked with a \"Z\" was discovered on the roof of a private house in the Florești district, identified by Moldovan authorities as a Russian UAV \"Gerbera.\" According to a statement from the Republic's Ministry of Defense, the device fell from an altitude of one and a half kilometers during a Russian attack on targets in Ukraine. Notably, however, neither the drone itself nor the building's roof sustained any damage.\nLocal residents reacted to the event with skepticism. A resident of the village of Cuhureștii de Jos told journalists:\n\"This is some kind of show, if you ask me. I know this drone has been lying on that roof for two weeks. We have such 'strong' guards that they didn't even notice a drone lying on the roof.\"\nThese words cast doubt on the official version of the drone's recent fall.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205627Z"
    },
    {
      "original": "Violence Persists In Sudan As Battles Heat Up And Diplomacy Fails (18+ Videos)\nMore than a month after the massacre in el-Fasher, which reportedly claimed the lives of more than 2,500 people, the power struggle in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) is still ongoing and efforts by the United States to resolve the conflict appears to be failing.\nAfter being widely blamed for the massacre in el-Fasher, the provincial capital of North Darfur, the RSF launched an investigation into the killings and arrested some of the perpetrators. Despite these measures, violence attributed to the paramilitary group has not gone down.\nA gruesome video showing a child whipping a man who appeared to be in a state of distress surfaced online on November 22. The child was reportedly forced to do this by an RSF member, allegedly his own father. The video was apparently taken somewhere in North Darfur.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205637Z"
    },
    {
      "original": "Violence Persists In Sudan As Battles Heat Up And Diplomacy Fails (18+ Videos)\nMore than a month after the massacre in el-Fasher, which reportedly claimed the lives of more than 2,500 people, the power struggle in Sudan between the Sudanese Armed Forces (SAF) and the Rapid Support Forces (RSF) is still ongoing and efforts by the United States to resolve the conflict appears to be failing.\nAfter being widely blamed for the massacre in el-Fasher, the provincial capital of North Darfur, the RSF launched an investigation into the killings and arrested some of the perpetrators. Despite these measures, violence attributed to the paramilitary group has not gone down.\nA gruesome video showing a child whipping a man who appeared to be in a state of distress surfaced online on November 22. The child was reportedly forced to do this by an RSF member, allegedly his own father. The video was apparently taken somewhere in North Darfur.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205646Z"
    },
    {
      "original": "Devastating Attack Halts Work At Key Iraqi Gas Field Operated By UAE (Videos)\nThe Khor Mor gas field, one of the largest in the northern Iraqi semi-autonomous region of Kurdistan, came under attack late on November 26, with a halt in production and power cuts reported later.\nInitially, it was said that Khor Mor was attacked by suicide drones. Later however, the United Arab Emirates’ energy company Dana Gas, which operates the gas field, revealed that the attack was carried out using rockets.\nThe Kurdistan region’s natural resources ministry and electricity ministry issued a joint statement confirming that the attack occurred at 11:30 p.m. local time [2030 GMT]. Teams from both ministries are currently coordinating with Dana Gas to monitor the situation and mitigate the impact, the statement added.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205655Z"
    },
    {
      "original": "Devastating Attack Halts Work At Key Iraqi Gas Field Operated By UAE (Videos)\nThe Khor Mor gas field, one of the largest in the northern Iraqi semi-autonomous region of Kurdistan, came under attack late on November 26, with a halt in production and power cuts reported later.\nInitially, it was said that Khor Mor was attacked by suicide drones. Later however, the United Arab Emirates’ energy company Dana Gas, which operates the gas field, revealed that the attack was carried out using rockets.\nThe Kurdistan region’s natural resources ministry and electricity ministry issued a joint statement confirming that the attack occurred at 11:30 p.m. local time [2030 GMT]. Teams from both ministries are currently coordinating with Dana Gas to monitor the situation and mitigate the impact, the statement added.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205664Z"
    },
    {
      "original": "Military Situation In Ukraine On November 27, 2025 (Maps Update)",
      "timestamp": "2025-11-27T15:53:04.205668Z"
    },
    {
      "original": "Military Situation In Ukraine On November 27, 2025 (Maps Update)",
      "timestamp": "2025-11-27T15:53:04.205672Z"
    },
    {
      "original": "Israel Says Deal With Syria ‘Not On Track,’ Claims Houthis, Islamic Jihad Are Active There\nIsrael has apparently begun to shift its policy in Syria, moving towards a more hostile stance on the country’s new Islamist-led Interim Government.\nSince the fall of the regime of President Bashar al-Assad last year, Israel has been very open about its suspicions of the country’s new Islamist rulers. Hours after the fall of the regime, the Israeli military occupied the buffer zone adjacent to the Golan Heights in southern Syria. It later went on to launch hundreds of strikes with the aim of destroying the country’s military capabilities.\nTensions mounted with Turkey, the main backer of the Syrian government, over these moves, especially when Israeli strikes hit bases where Ankara planned to deploy troops earlier this year.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-27T15:53:04.205681Z"
    }
  ],
  "script_run_time": "2025-11-27T15:53:04.206423Z"
}