{
  "messages": [
    {
      "original": "Декілька груп БпЛА на північному заході Харківщини рухаються у бік Полтави.",
      "timestamp": "2025-08-02T05:56:26.561367Z"
    },
    {
      "original": "Повторний пуск КАБ в бік Херсона.",
      "timestamp": "2025-08-02T05:56:26.561381Z"
    },
    {
      "original": "⚠️\n⚠️\nСпостерігається підвищена активність розвідувальних БпЛА у Сумській області в районі Охтирки та Кирилівки.",
      "timestamp": "2025-08-02T05:56:26.561389Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря рухаються в напрямку Одещини.",
      "timestamp": "2025-08-02T05:56:26.561394Z"
    },
    {
      "original": "⚠\nУвага! Слов'янськ, Краматорськ! \n🛵\n У вашому напрямку ворожі БпЛА! Перебувайте в укриттях!",
      "timestamp": "2025-08-02T05:56:26.561401Z"
    },
    {
      "original": "🛵\n Чернігівська область - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-08-02T05:56:26.561406Z"
    },
    {
      "original": "🛵\n Чернігівщина: БпЛА повз Новгород-Сіверський. Курс південно-західний.",
      "timestamp": "2025-08-02T05:56:26.561410Z"
    },
    {
      "original": "🛵\n БпЛА із акваторії Чорного моря \n➡️\n курс на Очаків!",
      "timestamp": "2025-08-02T05:56:26.561416Z"
    },
    {
      "original": "🛵\n Миколаївська  область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-02T05:56:26.561420Z"
    },
    {
      "original": "Очаків - в укриття!",
      "timestamp": "2025-08-02T05:56:26.561423Z"
    },
    {
      "original": "🛵\n Дніпропетровська область (Павлоградський, Синельниківський р-ни) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-08-02T05:56:26.561428Z"
    },
    {
      "original": "🚀\nХерсонська область - ракетна небезпека!",
      "timestamp": "2025-08-02T05:56:26.561432Z"
    },
    {
      "original": "🚀\n \n🚀\nДонецька область  - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-02T05:56:26.561438Z"
    },
    {
      "original": "КАБи на Донеччину.",
      "timestamp": "2025-08-02T05:56:26.561441Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на сході та північному сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-02T05:56:26.561449Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжі!",
      "timestamp": "2025-08-02T05:56:26.561458Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-02T05:56:26.561465Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-08-02T05:56:26.561469Z"
    },
    {
      "original": "📢\n Відбій загрози балістики.",
      "timestamp": "2025-08-02T05:56:26.561473Z"
    },
    {
      "original": "🛵\n Одеська, Миколаївська області - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-02T05:56:26.561477Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given for more serious infractions such as posting uncensored gore, nudity, etc. Just use common sense and don't be a jerk, and you will be fine. \nThere will still be free-speech and people are welcome to voice their opinions whether you are Pro-Russian, Pro-Ukraine, Neutral, or anything else, but it must be done in a respectful manner. You are allowed to criticize admins, but within obvious limits. \nWhen you have a channel with many conflicting perspectives, you need stricter moderation, or otherwise it falls apart. I aim for the chat to become more productive, but also not formal. Appeals will be in DMs.",
      "timestamp": "2025-08-02T05:56:26.968186Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given…",
      "timestamp": "2025-08-02T05:56:26.968196Z"
    },
    {
      "original": "Rules are now pinned in the chat. \nhttps://t.me/AMK_Mapping_Chat/139040",
      "timestamp": "2025-08-02T05:56:26.968201Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-02T05:56:26.968204Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-02T05:56:26.968207Z"
    },
    {
      "original": "Explosion heard in Sderot",
      "timestamp": "2025-08-02T05:56:26.968211Z"
    },
    {
      "original": "1 rocket was reportedly intercepted.",
      "timestamp": "2025-08-02T05:56:26.968214Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-02T05:56:26.968228Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-02T05:56:26.968240Z"
    },
    {
      "original": "Russian forces have captured the village of Sukhetske, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~39.\nTotal land area: ~0.32km².",
      "timestamp": "2025-08-02T05:56:26.968248Z"
    },
    {
      "original": "Russian forces have captured the village of Nykanorivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~250.\nTotal land area: ~1.35km².",
      "timestamp": "2025-08-02T05:56:26.968252Z"
    },
    {
      "original": "Russian forces have captured the village of Troyanda, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~80.\nTotal land area: ~0.20km².",
      "timestamp": "2025-08-02T05:56:26.968257Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance and have made significant progress in the direction of Pishchane. \nFollowing a series of Ukrainian counterattacks, Russian forces cleared the houses in western Stepova Novosilka which Ukraine had previously infiltrated, and pushed back down to railway line to the strongpoints in the area of the road bridge. These fortifications were subsequently captured, forcing a Ukrainian withdrawal further west, and a Russian advance further down the windbreaks on either side of the railway tracks. These positions are all on the tactical heights.\nAdditional pushes were made to the northwest, with Russian forces attacking down the treelines along the tactical heights, where they captured further positions north of the highway to Kupyansk in the treelines and forest plantations there.\n+ ~10.80km² in favour of Russia.",
      "timestamp": "2025-08-02T05:56:26.968262Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces counterattacked and regained some positions in Luhansk Oblast.\nUkrainian forces advanced from the southern forest west of Hrekivka, and cleared the adjacent treelines. They then moved south down the perpendicular treelines on the tactical heights, pushing along the western bank of the tributary of the Zherebets River, and pressuring the rear of the Russian garrison in Hrekivka. \n+ ~0.99km² in favour of Ukraine.",
      "timestamp": "2025-08-02T05:56:26.968267Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to make incremental progress east of the Nitrius River, and have re-established a bridgehead on its western bank.\nRussian forces advanced in three areas. In the northwest, they cleared the pocket east of the Nitrius River, and advanced back over one of the dams, establishing a foothold on the western bank in previously lost positions in southwestern Karpivka.\nTo the southeast, Russian forces continued to expand their zone of control west of Zelena Dolnya, and captured new positions on two opposite tactical heights, and in the forest plantations lining the gulley. They were also able to establish a foothold in the next set of forest plantations, northeast of Shandryholove. \nIn the east, Russian forces resumed their assault operations after being pushed out of Kolodyazi, and re-entered the village, capturing most of the industrial zone and part of the residential area in the centre of the settlement.\n+ ~7.31km² in favour of Russia.",
      "timestamp": "2025-08-02T05:56:26.968273Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces have achieved another localised breakthrough and have cut the railway line from Dobropillya. \nRussian continued to push from the Fedorivka-Boikivka area and captured numerous positions in the forests and treelines on the tactical heights to the west. They advanced into and quickly captured Zatyshok, before immediately pushing southwest to Sukhetske which was also captured. Other positions in the surrounding areas were seized, and a general push to the railway line was made, resulting in a ~2.7km long section of it and the trench lines running parallel to it coming under Russian control.\nRussian DRGs then began moving into northern Rodynske, carrying out operations in both the dachas and the northern residential areas. As a result northern Rodynske is currently in the grey zone. Additionally, by exploiting a gap in the trench lines, Russian forces began advancing towards the train station, although it's unclear if they achieved any success. \nTo the north, the Russian were able to complete the capture of Nykanorivka by pushing outwards from their foothold in the southern houses, and from the newly captured positions in the forests to the east. They then went on to establish control over the forests west and north of the village, and began attacking the freight train station at Dorozhnje. DRGs have already begun infiltrating the city of Bilytske from the east\nAdditionally, Russian forces cleared the rest of the salient west of Razine, recapturing the treeline positions there, and entered the eastern part of Chervonyi Lyman. \n+ ~26.40km² in favour of Russia.",
      "timestamp": "2025-08-02T05:56:26.968280Z"
    },
    {
      "original": "Russian forces have broken through to the northeastern outskirts of Siversk again, and captured an important trench strongpoint. \nThey have had more success so far than any of their previous failed attempts at entering the city, and the fighting has significantly intensified. It's possible that an attempt to capture Siversk is underway.",
      "timestamp": "2025-08-02T05:56:26.968284Z"
    },
    {
      "original": "1 Russian Tu-22M3 strategic bomber is airborne from Shaykovka Airbase in Kaluga Oblast, flying to the launch lines in the Black Sea. It is currently over Rostov Oblast.",
      "timestamp": "2025-08-02T05:56:26.968287Z"
    },
    {
      "original": "1 Russian Tu-22M3 strategic bomber is airborne from Shaykovka Airbase in Kaluga Oblast, flying to the launch lines in the Black Sea. It is currently over Rostov Oblast.",
      "timestamp": "2025-08-02T05:56:26.968290Z"
    },
    {
      "original": "Correction: Its flying over southern Crimea, heading for the launch lines southwest of Sevastopol.",
      "timestamp": "2025-08-02T05:56:26.968293Z"
    },
    {
      "original": "Correction: Its flying over southern Crimea, heading for the launch lines southwest of Sevastopol.",
      "timestamp": "2025-08-02T05:56:26.968298Z"
    },
    {
      "original": "2 bombers, not 1",
      "timestamp": "2025-08-02T05:56:26.968301Z"
    },
    {
      "original": "2 bombers, not 1",
      "timestamp": "2025-08-02T05:56:26.968304Z"
    },
    {
      "original": "They made a U-turn at Feodosia and are now flying back past Cape Chauda on a northeastern course, being escorted by 2 Su-35s.",
      "timestamp": "2025-08-02T05:56:26.968307Z"
    },
    {
      "original": "They made a U-turn at Feodosia and are now flying back past Cape Chauda on a northeastern course, being escorted by 2 Su-35s.",
      "timestamp": "2025-08-02T05:56:26.968310Z"
    },
    {
      "original": "They appear to be flying to Mozdok Airbase, North Ossetia.",
      "timestamp": "2025-08-02T05:56:26.968313Z"
    }
  ],
  "script_run_time": "2025-08-02T05:56:27.349912Z"
}