{
  "messages": [
    {
      "original": "🛵\n Київ - перебувайте в укриттях, на місто ударний безпілотник з півночі.",
      "timestamp": "2025-10-07T10:19:21.406406Z"
    },
    {
      "original": "🛵\n БпЛА у Фастівський район Київської області.",
      "timestamp": "2025-10-07T10:19:21.406422Z"
    },
    {
      "original": "🛵\n Ударні БпЛА у Лозівський район Харківської області.",
      "timestamp": "2025-10-07T10:19:21.406427Z"
    },
    {
      "original": "🛵\n Білоцерківський район Київщини загроза застосування ударних БпЛА.",
      "timestamp": "2025-10-07T10:19:21.406432Z"
    },
    {
      "original": "🛵\n БпЛА на Київ з півдня, перебувайте в укриттях!",
      "timestamp": "2025-10-07T10:19:21.406436Z"
    },
    {
      "original": "🛵\n Житомирщина - загроза застосування ударних БпЛА.",
      "timestamp": "2025-10-07T10:19:21.406443Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА на півдні від Запоріжжя! Залучено засоби для його збиття.",
      "timestamp": "2025-10-07T10:19:21.406447Z"
    },
    {
      "original": "🛵\n  БпЛА на півдні Харківщини \n➡️\n курсом на схід.",
      "timestamp": "2025-10-07T10:19:21.406453Z"
    },
    {
      "original": "🛵\n Вінницький, Хмільницький райони Вінниччини - загроза застосування ударних БпЛА.",
      "timestamp": "2025-10-07T10:19:21.406459Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Чернігівщини, курсом на південь",
      "timestamp": "2025-10-07T10:19:21.406464Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 88 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 7 жовтня (з 18.00 06 жовтня) противник атакував двома балістичними ракетами Іскандер-М/KN-23 із Ростовської області - рф, 152-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Курськ, Шаталово, Приморсько-Ахтарськ – рф, Чауда - ТОТ Криму, близько 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 88 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі та сході країни.\nЗафіксовано влучання двох ракет та 52-х ударних БпЛА на 10 локаціях, а також падіння збитих (уламки) на 2 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки! \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-10-07T10:19:21.406483Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Житомирщини на Вінниччину.",
      "timestamp": "2025-10-07T10:19:21.406487Z"
    },
    {
      "original": "🛵\n БпЛА з Вінниччини на Житомирщину.\n🛵\n Група БпЛА на сході Чернігівщини у південному напрямку.",
      "timestamp": "2025-10-07T10:19:21.406493Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку.",
      "timestamp": "2025-10-07T10:19:21.406497Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південного напрямку.",
      "timestamp": "2025-10-07T10:19:21.406501Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-07T10:19:21.406512Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-07T10:19:21.406517Z"
    },
    {
      "original": "🛵\n  БпЛА на півдні Житомирщини курсом на північ.\n🛵\n  Декілька груп БпЛА на Чернігівщині курсом на Чернігів, Ніжин.",
      "timestamp": "2025-10-07T10:19:21.406523Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-07T10:19:21.406527Z"
    },
    {
      "original": "Суми - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-07T10:19:21.406531Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Донеччини на Харківщину (Лозівський район).",
      "timestamp": "2025-10-07T10:19:21.406535Z"
    },
    {
      "original": "Another Iskander launch from Crimea",
      "timestamp": "2025-10-07T10:19:22.065042Z"
    },
    {
      "original": "Smoke is rising over Kherson",
      "timestamp": "2025-10-07T10:19:22.065054Z"
    },
    {
      "original": "Another Iskander launch from Crimea",
      "timestamp": "2025-10-07T10:19:22.065057Z"
    },
    {
      "original": "No repeated launches took place.",
      "timestamp": "2025-10-07T10:19:22.065060Z"
    },
    {
      "original": "Russian artillery shelling is now targeting Kherson, after the ballistic missile strike. A reconnaissance drone is operating there too.",
      "timestamp": "2025-10-07T10:19:22.065063Z"
    },
    {
      "original": "I've said this about \"leaks\" supposedly showing Ukrainian casualties, and I'll say it about these ones too:\nA sheet of paper claiming to show something, without any form of proof, is not evidence of 282,000 Russian casualties in 2025. This, just like the ones about Ukraine, just seem like part of the information war. \nIf you believe this \"leak\", but not leaks about Ukrainian casualties, you are delusional.",
      "timestamp": "2025-10-07T10:19:22.065069Z"
    },
    {
      "original": "Russian forces have captured the village of Fedorivka, southern flank of Siversk, Donetsk Oblast.\nPre-war population: ~410. \nTotal land area: ~0.94 km².",
      "timestamp": "2025-10-07T10:19:22.065076Z"
    },
    {
      "original": "On this day, 2 years ago, one of the world's most heavily armed guerilla armies, alongside several other militant factions, launched an invasion of Israel from the Gaza Strip. Approximately 6,000 rockets were launched in the first week of the war, completely overwhelming one of the world's strongest air defence networks, while hundreds of hostages were taken back into Gaza. Over 1,000 Israelis were killed, in an effort not only targeting the Israeli military, but also as many civilians as possible.\nTwo years later, tens of thousands of Palestinian civilians lie dead, in a genocide and ethnic cleansing that is only just beginning to be recognised. Most buildings in the Gaza Strip have either been flattened or are heavily damaged. The health sector continues to operate at a bare minimum due to constant attacks and restraints on aid and fuel. \nHamas and its allied factions are a shadow of their former selves. Incredibly degraded from constant Israeli attacks, most of their original fighters are dead, wounded, or captured, with untrained and young recruits making up the majority of their ranks. \nBut arguably the most significant events that resulted from this surprise attack was the spillover. Israel has since attacked Lebanon, Syria, Iran, the West Bank, and Qatar, resulting in rising tensions across the region, and the beginning of a systematic (and successful) effort at dismantling Iran's \"axis of resistance\", which now lies in ruin. \nOn the other hand, Israel's image on the world stage has changed drastically. 20 new countries have recognised a Palestinian state, while widespread condemnation and global awareness was brought to Israel, and Israel's actions. \nToday, peace negotiations are once again underway, despite failures in all the previous ones. Even if Israel secures what they want in Gaza, it will be interesting to see if this will have any effect on the events to follow.",
      "timestamp": "2025-10-07T10:19:22.065084Z"
    },
    {
      "original": "A before and after of Northern Gaza, two years since October 7.",
      "timestamp": "2025-10-07T10:19:22.065087Z"
    },
    {
      "original": "Possible Iskander launch from Crimea",
      "timestamp": "2025-10-07T10:19:22.065091Z"
    },
    {
      "original": "Iskander on Pavlohrad, Dnipropetrovsk Oblast",
      "timestamp": "2025-10-07T10:19:22.065094Z"
    },
    {
      "original": "Iskander on Pavlohrad, Dnipropetrovsk Oblast",
      "timestamp": "2025-10-07T10:19:22.065097Z"
    },
    {
      "original": "30 seconds",
      "timestamp": "2025-10-07T10:19:22.065100Z"
    },
    {
      "original": "Explosion in Pavlohrad",
      "timestamp": "2025-10-07T10:19:22.065103Z"
    },
    {
      "original": "Explosion in Pavlohrad",
      "timestamp": "2025-10-07T10:19:22.065106Z"
    },
    {
      "original": "Correction: The explosion occurred in Vilnyansk, Zaporizhzhia Oblast",
      "timestamp": "2025-10-07T10:19:22.065109Z"
    },
    {
      "original": "The near-exact trajectory of the Iskander-M ballistic missile. \nVilnyansk was targeted by long-range Smerch/Tornado-S MLRS yesterday.",
      "timestamp": "2025-10-07T10:19:22.065113Z"
    },
    {
      "original": "Russian forces have captured the village of Novovasylivske, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~73.\nTotal land area: ~0.33 km².",
      "timestamp": "2025-10-07T10:19:22.065117Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n NEW: \nHebrew media reports a 'security incident' in Gaza, with Israeli casualties evacuated to 'Soroka' and 'Sheba' hospitals. At least two soldiers have been reported as 'seriously injured.'\n@Middle_East_Spectator",
      "timestamp": "2025-10-07T10:19:22.065127Z"
    },
    {
      "original": "Those high rise buildings in Pokrovsk are not only still in decent condition and positions can be estabilished there, but they also have very good basements below them where they can hide extremely effectively and accumulate safely.\nCivilians still remaining in the city are also a big problem, as there are cases where they help hide Russian soldiers.\nSo, if they were to gain a stable foothold in Shakhtarsky, it would be very hard to knock them out of there",
      "timestamp": "2025-10-07T10:19:22.065132Z"
    },
    {
      "original": "Those high rise buildings in Pokrovsk are not only still in decent condition and positions can be estabilished there, but they also have very good basements below them where they can hide extremely effectively and accumulate safely. Civilians still remaining…",
      "timestamp": "2025-10-07T10:19:22.065135Z"
    },
    {
      "original": "By the sounds of it, there is a fairly large grey zone in southern Pokrovsk. Most of Lazurnyi District is under Russian control, but Shakhtarskyi and Sonyachnyy Districts are mixed. \nThe current Russian foothold is not critical for the Ukrainians, but rather the infiltration of units further north towards the highway is. If those groups can be eliminated in the coming days, then the situation will greatly improve for Ukraine. Otherwise, the Russians will be able to made much more progress through the high-rise blocks and begin clearing the low-rise residential areas towards the city centre.",
      "timestamp": "2025-10-07T10:19:22.065139Z"
    },
    {
      "original": "Genuinely, why is it that Ukraine had to name dozens of their settlements the EXACT SAME NAME!!!\n> \"Russia captured Stepove!\" \n> \"Which one??\"\nNow we have what is probably the 20th Vesele coming up in Zaporizhzhia Oblast. Who named these, and why are they so unoriginal??",
      "timestamp": "2025-10-07T10:19:22.065144Z"
    },
    {
      "original": "Genuinely, why is it that Ukraine had to name dozens of their settlements the EXACT SAME NAME!!!  > \"Russia captured Stepove!\"  > \"Which one??\"  Now we have what is probably the 20th Vesele coming up in Zaporizhzhia Oblast. Who named these, and why are they…",
      "timestamp": "2025-10-07T10:19:22.065148Z"
    },
    {
      "original": "Also, as you may notice, just south of this new Vesele is the 50th Zelenyi Hai. Fascinating.",
      "timestamp": "2025-10-07T10:19:22.065151Z"
    },
    {
      "original": "Israel Killed Hezbollah Air Defense Commander, The Strike Exposed Serious Security Issues \nIsrael on October 6 assassinated a senior commander of Hezbollah air defense array in a strike that exposed some of the serious security issues that the group continues to face.\nThe commander, Hassan Atwi, was killed alongside his wife, Zainab Raslan, in a drone strike targeting their car in Zebdine, on the outskirts of Nabatieh in southern Lebanon, the heartland of Hezbollah.\nIn a statement, the Israeli Defense Forces (IDF) said that Atwi was a “significant source of knowledge” in Hezbollah, and led efforts to rebuild infrastructure and procure equipment for the air defense array. The military added that he also maintained contacts with Iranian officials who supplied Hezbollah with air defense systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-07T10:19:22.878994Z"
    },
    {
      "original": "Israel Killed Hezbollah Air Defense Commander, The Strike Exposed Serious Security Issues \nIsrael on October 6 assassinated a senior commander of Hezbollah air defense array in a strike that exposed some of the serious security issues that the group continues to face.\nThe commander, Hassan Atwi, was killed alongside his wife, Zainab Raslan, in a drone strike targeting their car in Zebdine, on the outskirts of Nabatieh in southern Lebanon, the heartland of Hezbollah.\nIn a statement, the Israeli Defense Forces (IDF) said that Atwi was a “significant source of knowledge” in Hezbollah, and led efforts to rebuild infrastructure and procure equipment for the air defense array. The military added that he also maintained contacts with Iranian officials who supplied Hezbollah with air defense systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879010Z"
    },
    {
      "original": "\"Exclusively Ukrainian Weapons\": Zelensky Demands West Speed Up Aid Amid Mutual Strikes\nRussia and Ukraine exchanged large-scale strikes on each other's infrastructure and military targets on October 5-6. The Russian side continued to strike Ukrainian energy and fuel-logistics facilities, while Ukraine carried out a massive drone raid, during which, according to Russian data, 251 drones were shot down, predominantly over Crimea and the Black Sea waters.\nIn the context of these events, Ukrainian President Volodymyr Zelenskyy hinted at the expansion of domestic production capabilities, stating: \"In recent days, to hit targets on Russian territory, Ukraine has been using exclusively Ukrainian products, and these are not just drones.\" He called on Western partners to allocate more funds for scaling up production.\nSimultaneously, Zelenskyy criticized some European partners for the slow allocation of funds under the PURL program for weapons procurement...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879020Z"
    },
    {
      "original": "\"Exclusively Ukrainian Weapons\": Zelensky Demands West Speed Up Aid Amid Mutual Strikes\nRussia and Ukraine exchanged large-scale strikes on each other's infrastructure and military targets on October 5-6. The Russian side continued to strike Ukrainian energy and fuel-logistics facilities, while Ukraine carried out a massive drone raid, during which, according to Russian data, 251 drones were shot down, predominantly over Crimea and the Black Sea waters.\nIn the context of these events, Ukrainian President Volodymyr Zelenskyy hinted at the expansion of domestic production capabilities, stating: \"In recent days, to hit targets on Russian territory, Ukraine has been using exclusively Ukrainian products, and these are not just drones.\" He called on Western partners to allocate more funds for scaling up production.\nSimultaneously, Zelenskyy criticized some European partners for the slow allocation of funds under the PURL program for weapons procurement...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879028Z"
    },
    {
      "original": "Escalation In Northern Syria Reaches Aleppo City With Kurdish Forces Bracing For Battle (Videos)\nTensions between Syria’s Islamist-led Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) have reached the northern city of Aleppo, with reports suggesting that both sides were preparing for a possible battle there.\nGovernment forces and SDF have been exchanging strikes near the town of Deir Hafer, which is located some 40 kilometers to the east of Aleppo, for the last few weeks.\nLarge reinforcements were deployed on both sides of the front there in recent days.\nWhile a battle was expected to start near Deir Hafter, Aleppo itself became the focal point of the tensions on October 6 after government forces blocked all entrances to the Kurdish-majority neighborhoods of Sheikh Maqsoud and Ashrafieh, which are controlled by the SDF.\nRead more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879037Z"
    },
    {
      "original": "Escalation In Northern Syria Reaches Aleppo City With Kurdish Forces Bracing For Battle (Videos)\nTensions between Syria’s Islamist-led Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) have reached the northern city of Aleppo, with reports suggesting that both sides were preparing for a possible battle there.\nGovernment forces and SDF have been exchanging strikes near the town of Deir Hafer, which is located some 40 kilometers to the east of Aleppo, for the last few weeks.\nLarge reinforcements were deployed on both sides of the front there in recent days.\nWhile a battle was expected to start near Deir Hafter, Aleppo itself became the focal point of the tensions on October 6 after government forces blocked all entrances to the Kurdish-majority neighborhoods of Sheikh Maqsoud and Ashrafieh, which are controlled by the SDF.\nRead more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879047Z"
    },
    {
      "original": "FROM LVIV TO THE FRONT LINE: INTENSIFIED RUSSIAN STRIKES TARGET UKRAINE'S CORE",
      "timestamp": "2025-10-07T10:19:22.879050Z"
    },
    {
      "original": "Breakthrough In Pokrovsk: Russian Assault Troops Clear Shakhtersky And Solnechny Districts\nThe operational-strategic group «Dnepr» has been disbanded. The Pokrovsk-Mirnograd agglomeration is now almost completely encircled.\nThe Otradnoye settlement in the Kharkiv region has been captured. Clearing operations have been completed in the village of Kleban-Byk on the Konstantinovka axis.\nRead more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879057Z"
    },
    {
      "original": "Breakthrough In Pokrovsk: Russian Assault Troops Clear Shakhtersky And Solnechny Districts\nThe operational-strategic group «Dnepr» has been disbanded. The Pokrovsk-Mirnograd agglomeration is now almost completely encircled.\nThe Otradnoye settlement in the Kharkiv region has been captured. Clearing operations have been completed in the village of Kleban-Byk on the Konstantinovka axis.\nRead more \nHERE",
      "timestamp": "2025-10-07T10:19:22.879064Z"
    },
    {
      "original": "Artillery Targeted: Summary Of Russian Combat Footage From October 6, 2025 \nOn October 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-07T10:19:22.879071Z"
    },
    {
      "original": "Artillery Targeted: Summary Of Russian Combat Footage From October 6, 2025 \nOn October 6, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-07T10:19:22.879077Z"
    }
  ],
  "script_run_time": "2025-10-07T10:19:22.879886Z"
}