{
  "messages": [
    {
      "original": "🛵\n🛸\n БпЛА на півдні Миколаївщини, курс на північ.\n🛵\n Ворожі БпЛА на сході Херсонщини, курс західний.",
      "timestamp": "2025-09-15T20:58:46.070270Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Дніпропетровщину (Синельниківський р-н).",
      "timestamp": "2025-09-15T20:58:46.070287Z"
    },
    {
      "original": "🛵\n БпЛА на Херсонщині, курсом на Миколаївщину.",
      "timestamp": "2025-09-15T20:58:46.070292Z"
    },
    {
      "original": "🛸\n На сході та півночі Харківщини розвідувальні БпЛА противника.\n⚡\n Залучено засоби для збиття.",
      "timestamp": "2025-09-15T20:58:46.070298Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину.",
      "timestamp": "2025-09-15T20:58:46.070303Z"
    },
    {
      "original": "🛵\n БпЛА на межі Миколаївщини та Херсонщини, курс північно-західний.",
      "timestamp": "2025-09-15T20:58:46.070307Z"
    },
    {
      "original": "🛵\n Кіровоградська область (Кропивницький р-н) - загроза застосування ворогом ударних БпЛА з півдня.",
      "timestamp": "2025-09-15T20:58:46.070311Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Ізюмський р-н), курс західний.",
      "timestamp": "2025-09-15T20:58:46.070316Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область!",
      "timestamp": "2025-09-15T20:58:46.070320Z"
    },
    {
      "original": "🛵\n Нова група ворожих БпЛА з Херсонщини в напрямку Миколаївщини.",
      "timestamp": "2025-09-15T20:58:46.070324Z"
    },
    {
      "original": "🛵\nгрупа ворожих БпЛА з акваторії Чорного моря в напрямку Одещини\\Миколаївщини.",
      "timestamp": "2025-09-15T20:58:46.070328Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на півдні Кіровоградської області,курс північно-західний.",
      "timestamp": "2025-09-15T20:58:46.070338Z"
    },
    {
      "original": "🛵\n Одеська область -загроза застосування ворогом ударних БпЛА з акваторії Чорного моря.",
      "timestamp": "2025-09-15T20:58:46.070344Z"
    },
    {
      "original": "🛵\n Чернігівщина (Корюківський р-н) -  БпЛА південно-західним курсом.",
      "timestamp": "2025-09-15T20:58:46.070348Z"
    },
    {
      "original": "🛵\n БпЛА на сході Миколаївщини, курсом на Кіровоградщину.",
      "timestamp": "2025-09-15T20:58:46.070352Z"
    },
    {
      "original": "🛵\n БпЛА на межі Одеської та Миколаївської областей, курс  північно-західний.",
      "timestamp": "2025-09-15T20:58:46.070356Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область!",
      "timestamp": "2025-09-15T20:58:46.070360Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Донеччини, курс  Харківська область.",
      "timestamp": "2025-09-15T20:58:46.070365Z"
    },
    {
      "original": "⚠\nКраматорськ! Слов'янськ! \n🛵\n До вас ворожі БпЛА . Перебувайте в укриттях!",
      "timestamp": "2025-09-15T20:58:46.070370Z"
    },
    {
      "original": "🛸\n В районі Сум - ворожий розвідувальний БпЛА! Можлива робота ППО",
      "timestamp": "2025-09-15T20:58:46.070374Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to quickly advance in Dnipropetrovsk Oblast and have captured the village of Ternove. \nAfter breaking through to and capturing Novomykolaivka, Russian forces began advancing towards Berezove from the south and captured the treelines on approach to the village. They also captured the treelines on the heights north of Zaporizke and began bypassing Ternove from the west. Once other forces captured the treelines near the gulley north of Ternove and began pushing southwest towards the treelines north of Berezove, Ukraine was forced to abandon the village. \n+ ~17.40 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844835Z"
    },
    {
      "original": "In the Prosyana direction, Russian forces continue to advance and have recaptured most of their previously lost positions. \nRussian forces pushed further west from the Tolstoi area and captured the rest of the orchards after Ukrainian forces withdrew to Andriivka Klevstove. \nFurther north, after Ukrainian forces failed to retake the southern part of Zelenyi hai, Russian forces pushed north again and recaptured the rest of the residential part of the village. Ukraine still holds the agricultural complex west of the settlement. The Russians then went on to advance southwest through the treelines to northern Andriivka-Klevstove and entered the village from there, as well as from the east.  As a result, most of the village is either under Russian control or in the grey zone, while the highway running into was captured.\n+16.20 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844850Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and have broken through to the edge of Kostyantynivka. \nRussian forces established control over further treeline positions on the tactical heights southeast of Predtechyne, before advancing west down the treeline to the Yahidka Dachas. Ukrainian forces withdrew with little resistance to the Santurynivka District of Kostyantynivka, allowing for the Russians to establish control over these dachas. Consolidation efforts are ongoing. \n+ ~5.96 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844856Z"
    },
    {
      "original": "Here is the interactive Ukraine map link for those who haven't visited my Linktree page in the channel description. All updates are visible there before I post about them.\nEdit: Oh wow, I just saw the map thumbnail with the old frontlines...\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=48.508957095828315%2C37.75815629381896&z=15",
      "timestamp": "2025-09-15T20:58:46.844861Z"
    },
    {
      "original": "The IDF is continuing its systematic efforts to destroy the remaining tower blocks in Gaza City. This video shows an airstrike on a residential building in the Al-Rimal neighborhood.",
      "timestamp": "2025-09-15T20:58:46.844864Z"
    },
    {
      "original": "Another small Geran-2 drone attack on Ukraine tonight. Less than 40 drones, many of which were Gerberas, attacked targets in western Dnipropetrovsk Oblast, Donetsk Oblast, southern Kharkiv Oblast, northern Chernihiv Oblast, and possibly Poltava Oblast.",
      "timestamp": "2025-09-15T20:58:46.844868Z"
    },
    {
      "original": "Zaporizhzhia City is under heavy MLRS shelling. At least 15 explosions have been heard.",
      "timestamp": "2025-09-15T20:58:46.844871Z"
    },
    {
      "original": "The Ukrainian GUR published footage showing an FPV drone from their UAV unit striking a Russian Buk-M3 medium-range air defence system near the village of Oleksandrivka, Zaporizhzhia Oblast.",
      "timestamp": "2025-09-15T20:58:46.844874Z"
    },
    {
      "original": "Zaporizhzhia City is under heavy MLRS shelling. At least 15 explosions have been heard.",
      "timestamp": "2025-09-15T20:58:46.844877Z"
    },
    {
      "original": "Fires are now burning in the southern outskirts of Zaporizhzhia City after it was hit by 15 rockets.",
      "timestamp": "2025-09-15T20:58:46.844881Z"
    },
    {
      "original": "Fires are now burning in the southern outskirts of Zaporizhzhia City after it was hit by 15 rockets.",
      "timestamp": "2025-09-15T20:58:46.844888Z"
    },
    {
      "original": "Around 98% of Ukrainian long-range UAVs get shot down by Russian air defence / EW. Ukraine often launches hundreds at a time just for a couple to get through. \nThe drones that do get through (usually only 1 or 2 each day), and that hit refineries do minor damage as evidenced by footage and satellite imagery, due to how refineries are built, and the drones' small warheads. \nThe damage done is then repaired within months due to how robust refineries are. This leads to only a temporary loss. \nMeanwhile, the figures on Russian refining capabilities always get skewed to show total amount per refinery (per year), and not what is actually lost... which is only part of the refining capabilities for part of a year.\nAt the same time, everyone seems to be ignoring the hundreds of Russian Geran-2 drone STRIKES (not launches, strikes) per week that are hitting targets of military significance and contributing massively to the overall war of attrition.\nBut don't worry... just 50 more days and Russia will collapse.",
      "timestamp": "2025-09-15T20:58:46.844895Z"
    },
    {
      "original": "On the northern flank of Siversk, Russian forces continued to advance in the area of the Serebryanskyi Forest, developing their offensive towards Yampil.\nRussian forces advanced in three areas. In the east, they continued to push along the northern bank of the Siverskyi Donets River, and advanced for around 900 metres towards the Donetsk-Luhansk regional border.\nFurther west, the Russians continued to attack towards the Ostrich farm on the northern outskirts of Yampil. The farm is now in the grey zone, as they begin bypassing it towards the railway station and railway bridge. \nTo the northwest, Russian forces physically cut the Yampil - Zarichne Road, establishing control over new positions in the forests there.\n+ ~2.83 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844901Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance in and around Zarichne, and have made additional progress towards connecting their bridgehead to the main Lyman front. \nIn the north, Russian forces improved their positions south of Kolodyazi, capturing new positions along two parallel treelines. They also captured additional positions in the forest west of Myrne, forcing the Ukrainians to withdraw back into the village.\nIn the south, Russian forces cleared the rest of central Zarichne, and connected with their bridgehead in the north of the village via Poshtova and Mayakovskoho Streets. Ukrainian forces are attempting to counterattack from the agricultural buildings on the western outskirts of the village, through the grey zone towards the centre.\nIn the southern part of Zarichne, after reaching the western outskirts, the Russians began pushing south down five residential streets towards the industrial zone in an attempt to squeeze Ukrainian forces out of the southern part of the settlement. \n+ ~2.52 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844907Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their general push south towards Lyman, and have made significant progress over the past five days.\nRussian forces advanced on a wide front from Kolodyazi to Derylove. They pushed south down the gulley towards Stavky, capturing new positions in the forested areas, and expanding their zone of control further west. In the direction of Derylove, Russian forces captured new treeline positions on the tactical heights, while other forces entered the Derylove gulley, establishing control over its eastern forests, beginning the efforts to dislodge the remaining Ukrainian soldiers from the gulley. \nTo the west, Russian forces captured the rest of the southern part of Shandryholove and crossed a tributary of the Nitrius River at one of the dams, establishing a foothold in the northern part of the treeline directly west of Derylove. \nTo the north, after consolidating along the Drobysheve - Shandryholove Road, the Russians began attacking north up Hutchenka Street, and west from the forest plantations, capturing the southern part of Shandryholove and pushing the Ukrainians to the centre of the village.\n+ ~15.01 km² in favour of Russia.",
      "timestamp": "2025-09-15T20:58:46.844914Z"
    },
    {
      "original": "In the Borova direction, both Russian and Ukrainian forces have advanced, with Russian forces continuing to expand their bridgehead west of the Nitrius River. \nAfter establishing a foothold at the base of the tactical heights, Russian forces advanced along the gulley to the forests, capturing new positions in the direction of the village of Korovii yar. They also improved their positions along the treeline northwest of Serednje. \nTo the north, Ukrainian forces counterattacked at some point over the past few weeks and recaptured the southwestern part of Karpivka, pushing the Russians back over the Nitrius River. \n+ ~5.75 km² in favour of Russia.\n+ ~1.14 km² in favour of Ukraine.",
      "timestamp": "2025-09-15T20:58:46.844920Z"
    },
    {
      "original": "According to Z Committee, Russian forces allegedly crossed the border in Kharkov oblast and neared the village of Odradne (Otradnoye).",
      "timestamp": "2025-09-15T20:58:46.844927Z"
    },
    {
      "original": "According to Z Committee, Russian forces allegedly crossed the border in Kharkov oblast and neared the village of Odradne (Otradnoye).",
      "timestamp": "2025-09-15T20:58:46.844931Z"
    },
    {
      "original": "Just south of the previous incursion where around 33 km² was taken.",
      "timestamp": "2025-09-15T20:58:46.844934Z"
    },
    {
      "original": "Russian Geran-2 drones attacked the city of Druzhkivka, Donetsk Oblast a short time ago. The number of impacts is currently unknown.\nIn the hours prior to the strikes, the city was under FPV drone and MLRS attacks.",
      "timestamp": "2025-09-15T20:58:46.844938Z"
    },
    {
      "original": "Russian Geran-2 drones attacked the city of Druzhkivka, Donetsk Oblast a short time ago. The number of impacts is currently unknown.\nIn the hours prior to the strikes, the city was under FPV drone and MLRS attacks.",
      "timestamp": "2025-09-15T20:58:46.844942Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 14, 2025\nOn September 14, multiple videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-15T20:58:47.569622Z"
    },
    {
      "original": "Summary Of Russian Combat Footage From September 14, 2025\nOn September 14, multiple videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click\n \nHERE",
      "timestamp": "2025-09-15T20:58:47.569638Z"
    },
    {
      "original": "Russia Ramps Up Drone Production Amid NATO No-Fly Zone Plans And Starlink Disruptions\nThe strikes on September 14–15 were relatively low: Russian air defenses shot down six Ukrainian drones overnight and four in daylight, mostly in Belgorod. Russia launched 84 Geran/Herbera drones and three missiles, with 59 drones downed. A significant factor was the disruption of Starlink system operations along the entire front line, which Ukrainian military personnel complained about.\nMeanwhile, international observers note a significant increase in the production of Russian attack drones: according to The New York Times, Russia is currently capable of producing approximately 30,000 attack drones per year, and the total number of Russian drones launched against Ukraine in 2025 has reached 34,000. These drones feature improved guidance systems, enhanced resistance to electronic warfare, and new types of munitions. Russia employs drones in group waves, plotting complex routes...\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569646Z"
    },
    {
      "original": "Russia Ramps Up Drone Production Amid NATO No-Fly Zone Plans And Starlink Disruptions\nThe strikes on September 14–15 were relatively low: Russian air defenses shot down six Ukrainian drones overnight and four in daylight, mostly in Belgorod. Russia launched 84 Geran/Herbera drones and three missiles, with 59 drones downed. A significant factor was the disruption of Starlink system operations along the entire front line, which Ukrainian military personnel complained about.\nMeanwhile, international observers note a significant increase in the production of Russian attack drones: according to The New York Times, Russia is currently capable of producing approximately 30,000 attack drones per year, and the total number of Russian drones launched against Ukraine in 2025 has reached 34,000. These drones feature improved guidance systems, enhanced resistance to electronic warfare, and new types of munitions. Russia employs drones in group waves, plotting complex routes...\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569654Z"
    },
    {
      "original": "Su-34s Reportedly Built For Algeria Got Advanced Missile Warning System \nNewly-built Su-34 fighter bombers that are believed to be intended for Algeria have been apparently equipped with an advanced missile warning system.\nOne of the Su-34s in question first appeared last May, flying close to the Novosibirsk Aircraft Production Association Plant where this type of warplane is manufactured.\nThe fighter bomber’s brown camouflage scheme was compared to that used in some of the older Su-24 fighter bombers in service with the Algerian Air Force (AAF). At the time, the Fighterbomber channel on Telegram, which reports on the Russian aerospace industry, said that the bomber was being prepared for delivery to a foreign customer, further fueling suspicion that a Su-34 deal for Algeria was moving forward.\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569662Z"
    },
    {
      "original": "Su-34s Reportedly Built For Algeria Got Advanced Missile Warning System \nNewly-built Su-34 fighter bombers that are believed to be intended for Algeria have been apparently equipped with an advanced missile warning system.\nOne of the Su-34s in question first appeared last May, flying close to the Novosibirsk Aircraft Production Association Plant where this type of warplane is manufactured.\nThe fighter bomber’s brown camouflage scheme was compared to that used in some of the older Su-24 fighter bombers in service with the Algerian Air Force (AAF). At the time, the Fighterbomber channel on Telegram, which reports on the Russian aerospace industry, said that the bomber was being prepared for delivery to a foreign customer, further fueling suspicion that a Su-34 deal for Algeria was moving forward.\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569671Z"
    },
    {
      "original": "Syria To Get Nothing From Upcoming Deal With Israel\nIsrael told Syria during their ongoing talks that it intends to maintain control over the peak of Mount Hermon, Hebrew media reported on September 14.\nMount Hermon was captured by the Israeli military along with the entire buffer zone adjacent to the occupied Syrian Golan Heights just a few hours after the fall of the regime of former Syrian President Bashar al-Assad last December. Soon after, nine Israeli posts were established there, including two on the peak of the strategic mountain, which oversaw most of the country’s southern region up to Damascus, in addition to much of southern Lebanon, the heartland of Hezbollah.\nIsraeli officials who spoke to Channel 12 described the posts on the mountain’s peak as “an indispensable strategic asset.”\nDamascus rejected the Israeli demand, calling Israel’s military presence on Syrian territories an “occupation that must end.”\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569679Z"
    },
    {
      "original": "Military Situation In Israel-Palestine On September 15, 2025 (Map Update)",
      "timestamp": "2025-09-15T20:58:47.569683Z"
    },
    {
      "original": "Increasing Crime In EU’s Unofficial Capital And NATO HQ Demonstrates Collapse Of Western Order\nThe increasing crime and militarization of security in Belgium demonstrate the progressive collapse of the Western order. This militarization extends for reasons beyond the fight against drug trafficking and increasing crime, and serves as a warning against mass illegal migration. Although crime in Brussels, the unofficial capital of the European Union and headquarters of NATO, saw a decline by 2011, it rose rapidly again in 2020 and 2023, coinciding with the mass arrival of illegal immigrants to Europe in 2015, leaving the country’s authorities no choice but to finally announce a crackdown.\nBelgian Minister of Security and Home Affairs Bernard Quintin announced a new security plan last week that includes the deployment of soldiers alongside police in the country’s major cities, with special attention to areas considered sensitive, such as metro stations and troubled neighborhoods.\nRead more \nHERE",
      "timestamp": "2025-09-15T20:58:47.569690Z"
    },
    {
      "original": "Military Situation In Ukraine On September 15, 2025 (Maps Update)",
      "timestamp": "2025-09-15T20:58:47.569694Z"
    },
    {
      "original": "Military Situation In Ukraine On September 15, 2025 (Maps Update)",
      "timestamp": "2025-09-15T20:58:47.569698Z"
    },
    {
      "original": "KYIV LAUNCHES HUNDREDS OF DRONES AT RUSSIA AMID BATTLEFIELD SETBACKS AND MYSTERIOUS STARLINK DISRUPTIONS",
      "timestamp": "2025-09-15T20:58:47.569702Z"
    }
  ],
  "script_run_time": "2025-09-15T20:58:47.570592Z"
}