{
  "messages": [
    {
      "original": "🛵\n БпЛА в р-ні. Макошиного  (Чернігівщина), курсом на північ.",
      "timestamp": "2025-12-08T11:09:15.111337Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 131 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 8 грудня (з 18.00 07 грудня) противник атакував 149-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Курськ, Приморсько-Ахтарськ, Міллєрово– рф., Донецьк та Чауда - ТОТ АР Крима, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 131 ворожий БпЛА типу Shahed, Гербера і дрони інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 16 ударних БпЛА на 11 локаціях, а також падіння збитих (уламки) на 4 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-12-08T11:09:15.111369Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на сході Сумщини, курс північно-західний",
      "timestamp": "2025-12-08T11:09:15.111374Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини в напрямку Запоріжжя.",
      "timestamp": "2025-12-08T11:09:15.111378Z"
    },
    {
      "original": "🛵\n БпЛА в Чугуївському районі Харківської області, напрямок Чугуїв.",
      "timestamp": "2025-12-08T11:09:15.111382Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-12-08T11:09:15.111386Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини на Дніпропетровщину, вектор на Павлоград.",
      "timestamp": "2025-12-08T11:09:15.111390Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину!",
      "timestamp": "2025-12-08T11:09:15.111394Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-12-08T11:09:15.111409Z"
    },
    {
      "original": "🚀\n КАБи на Харківщину!",
      "timestamp": "2025-12-08T11:09:15.111413Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Суми зі сходу.",
      "timestamp": "2025-12-08T11:09:15.111417Z"
    },
    {
      "original": "🚀\n КАБи на Запоріжжя!",
      "timestamp": "2025-12-08T11:09:15.111421Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Чернігів.",
      "timestamp": "2025-12-08T11:09:15.111425Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини, повз н.п.Богодухів курс південно-західний.",
      "timestamp": "2025-12-08T11:09:15.111431Z"
    },
    {
      "original": "🚀\n КАБи на Запоріжжя!",
      "timestamp": "2025-12-08T11:09:15.111436Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини курсом на Чернігів.",
      "timestamp": "2025-12-08T11:09:15.111440Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Суми.",
      "timestamp": "2025-12-08T11:09:15.111444Z"
    },
    {
      "original": "🛵\n БпЛА в Лозівському районі Харківщини, напрямок н.п.Лозова.",
      "timestamp": "2025-12-08T11:09:15.111448Z"
    },
    {
      "original": "🚀\n КАБи на Запоріжжі в напрямку м.Запоріжжя!",
      "timestamp": "2025-12-08T11:09:15.111452Z"
    },
    {
      "original": "🛵\n БпЛА на сході Сумщини ( Сумський район), курс західний.",
      "timestamp": "2025-12-08T11:09:15.111456Z"
    },
    {
      "original": "Russian forces have captured the village of Orikhovo-Vasylivka, southern flank of Siversk, Donetsk Oblast.  Pre-war population: ~227. Total land area: ~1.10 km².  The fighting for Orikhovo-Vasylivka lasted approximately 1 year, 27 days.",
      "timestamp": "2025-12-08T11:09:15.926143Z"
    },
    {
      "original": "Due to the fall of Orikhovo-Vasylivka and the somewhat sudden Russian advances in the direction of Kramatorsk, Ukrainian forces have blown up the dam in the nearby village of Pryvillya.\nCoordinates: 48.724099, 37.861442",
      "timestamp": "2025-12-08T11:09:15.926157Z"
    },
    {
      "original": "Of the missiles, 1 Kinzhal was intercepted by a Patriot system.",
      "timestamp": "2025-12-08T11:09:15.926161Z"
    },
    {
      "original": "Pro-Russians must be the only group to complain about a 99% success rate for their missiles getting through. \nI’ll never forget the cope about  \nevery single Iskander interception video supposedly being AI.",
      "timestamp": "2025-12-08T11:09:15.926165Z"
    },
    {
      "original": "Pro-Russians must be the only group to complain about a 99% success rate for their missiles getting through.   I’ll never forget the cope about   every single Iskander interception video supposedly being AI.",
      "timestamp": "2025-12-08T11:09:15.926169Z"
    },
    {
      "original": "Well, an edited version of one the videos has been posted so I can share it here. \nThis video shows Kinzhal debris falling just short of the oil refinery.\nObviously the Ukrainian airforce claim is false. One Kinzhal was shot down, not two.",
      "timestamp": "2025-12-08T11:09:15.926173Z"
    },
    {
      "original": "Well, an edited version of one the videos has been posted so I can share it here.   This video shows Kinzhal debris falling just short of the oil refinery.  Obviously the Ukrainian airforce claim is false. One Kinzhal was shot down, not two.",
      "timestamp": "2025-12-08T11:09:15.926176Z"
    },
    {
      "original": "This video recorded at exactly 1:30 am shows one Geran hitting (on the left), one Kinzhal hitting (centre) and two Iskanders with cluster warheads hitting (on the right).\nI wonder where the second Kinzhal went? \n😁",
      "timestamp": "2025-12-08T11:09:15.926183Z"
    },
    {
      "original": "Footage showing the moment of two Russian Grom-E1 rocket-powered glide-bombs striking the Pechenihy Dam. Earlier, what was reportedly a Banderol jet-drone impacted it.\nThe road over this dam is one of the primary supply routes for the entire section of the frontline between Vovchansk and Kupyansk. \nCoordinates: 49.88231, 36.98045",
      "timestamp": "2025-12-08T11:09:15.926188Z"
    },
    {
      "original": "Footage showing the moment of two Russian Grom-E1 rocket-powered glide-bombs striking the Pechenihy Dam. Earlier, what was reportedly a Banderol jet-drone impacted it.\nThe road over this dam is one of the primary supply routes for the entire section of the frontline between Vovchansk and Kupyansk. \nCoordinates: 49.88231, 36.98045",
      "timestamp": "2025-12-08T11:09:15.926193Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt. \nECOWAS has since announced that they are deploying their \"Standby Force\" to assist the Benin Government.",
      "timestamp": "2025-12-08T11:09:15.926198Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt. \nECOWAS has since announced that they are deploying their \"Standby Force\" to assist the Benin Government.",
      "timestamp": "2025-12-08T11:09:15.926202Z"
    },
    {
      "original": "The Nigerian Airforce carried out airstrikes on the Togbin military barracks in the city of Cotonou, Benin, targeting rebels who carried out the earlier failed coup attempt.   ECOWAS has since announced that they are deploying their \"Standby Force\" to assist…",
      "timestamp": "2025-12-08T11:09:15.926205Z"
    },
    {
      "original": "Local sources reported that a ground assault was carried out on the Togbin Barracks a few hours ago, which was held by approximately 30 armed men, including one of the coup leaders. The complex has since been deserted, and a large number of weapons have reportedly been seized.",
      "timestamp": "2025-12-08T11:09:15.926208Z"
    },
    {
      "original": "Violent clashes have broken out along the Thai-Cambodia border, with both sides engaged in mutual artillery shelling and small-arms battles.\nThe Thai Royal Air Force has carried out at least 8 airstrikes against Cambodian positions, while Cambodian artillery shelling has killed at least one Thai soldiers.",
      "timestamp": "2025-12-08T11:09:15.926212Z"
    },
    {
      "original": "Two Russian Geran-2 drone strikes on the Chernihiv Power Plant in Chernihiv City.",
      "timestamp": "2025-12-08T11:09:15.926215Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Tykhe, Pokrovsk'e direction, Dnipropetrovsk Oblast.\nPre-war population: ~125.\nTotal land area: ~0.63 km².",
      "timestamp": "2025-12-08T11:09:15.926220Z"
    },
    {
      "original": "Russian forces have recaptured the village of Dorozhnje, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~96.\nTotal land area: ~0.47 km².",
      "timestamp": "2025-12-08T11:09:15.926224Z"
    },
    {
      "original": "Russian forces have captured the village of Rivne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~667.\nTotal land area: ~0.70 km².\nThe fighting for Rivne lasted approximately 1 months, 4 days.",
      "timestamp": "2025-12-08T11:09:15.926228Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Thailand’s Burapha Task Force announces they have launched operations to “reclaim sovereign territory” on the Sa Kaeo border. \nThey claim Cambodian forces were in maximum combat readiness along the border, moving personnel and heavy weapons into fortified positions and closely monitoring Thailand.\n@wfwitness",
      "timestamp": "2025-12-08T11:09:15.926235Z"
    },
    {
      "original": "To add to this: I believe russia could improve by making a more concerted effort to consolidate in towns before pushing past them. Almost like what they failed to do in the early stages of the SMO on a much smaller scale. Perhaps a dedicated brigade/task force could follow behind the main assault group and mop up properly",
      "timestamp": "2025-12-08T11:09:15.926238Z"
    },
    {
      "original": "To add to this: I believe russia could improve by making a more concerted effort to consolidate in towns before pushing past them. Almost like what they failed to do in the early stages of the SMO on a much smaller scale. Perhaps a dedicated brigade/task force…",
      "timestamp": "2025-12-08T11:09:15.926241Z"
    },
    {
      "original": "It only ever seems to be certain directions where this happens too.",
      "timestamp": "2025-12-08T11:09:15.926244Z"
    },
    {
      "original": "⚡️\n🇹🇭\n🇰🇭\n Smoke can be seen near the Sa Kaeo border following Thailand’s announcement of launching operations in the area. \n@wfwitness",
      "timestamp": "2025-12-08T11:09:15.926250Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces intensified their assault operations, making substantial progress over the last few days.\nIn the southeast, Russian forces broke through Ukrainian defences east of Kamyanske, advancing northeast up both banks of the river. Other forces cleared the western houses of Stepove, and levelled the frontline northwest of the village. \nFrom there, a general push north was carried out, with Russian forces advancing downhill to the gulleys, and consolidating further northwest in coordination with the push up the northern bank of the river. Russian soldiers then infiltrated from their newly captured positions, advancing uphill towards the gulley west of Pavlivka, while others pushed northwest across another gulley into the former Mining and Processing Plant. Additionally, some Russian soldiers infiltrated from eastern Stepnohirsk towards the Solar field in coordination with the push to the Mining and Processing Plant, threatening to encircle the remaining Ukrainian strongpoints in the fields to the south. \nTo the northwest, Russian forces continued their assault operations in Stepnohirsk. They were able to capture Molodizhna and Radianska Streets and consolidate in the first high-rise buildings of the town centre. They also consolidated in the residential areas northeast and northwest of the central high-rise buildings and are clearing the remaining areas of Stepnohirsk still in the grey zone. \n+ ~18.75 km² in favour of Russia.",
      "timestamp": "2025-12-08T11:09:15.926255Z"
    },
    {
      "original": "In the Orikhiv direction, some time over the last few weeks Ukrainian forces carried out a series of successful counterattacks in Mala Tokmachka, recapturing most of the village.\nFollowing the earlier Russian advances and the arrival of Ukrainian reinforcements from Orikhiv, Ukrainian forces managed to regain the initiative and begin pushing back through the settlement. After heavy fighting, they were able to clear the forward Russian positions in the western streets, and due to a lack of Russian manpower in the village, reached the centre, entering the prison and local school. Fighting is still ongoing for the central part of the village. \n+ ~10.10 km² in favour of Ukraine.",
      "timestamp": "2025-12-08T11:09:15.926261Z"
    },
    {
      "original": "Recruitment In Force: The Downside Of Ukrainian Mobilization\nThe\n situation in Ukraine grows more complicated with each passing month. Living in constant fear is pushing people to take radical measures. Reports of successful cases of forceful resistance to state authorities are becoming increasingly frequent, reflecting a shift in public attitude. People are beginning to feel supported within their communities, and a spirit of spontaneous solidarity—where strangers step in to help one another—is gaining ground.\nThis growing solidarity is not limited to passive support; the response to the arbitrariness of authorities increasingly involves active resistance, including violence. For example, several days ago in Lviv, during a routine \"hunt\" for potential conscripts, a TRC recruiter was attacked—stabbed and sprayed with pepper spray. He died from blood loss upon arriving at the hospital. The suspected killer, a 30-year-old man, showed no remorse for his actions. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656566Z"
    },
    {
      "original": "Recruitment In Force: The Downside Of Ukrainian Mobilization\nThe\n situation in Ukraine grows more complicated with each passing month. Living in constant fear is pushing people to take radical measures. Reports of successful cases of forceful resistance to state authorities are becoming increasingly frequent, reflecting a shift in public attitude. People are beginning to feel supported within their communities, and a spirit of spontaneous solidarity—where strangers step in to help one another—is gaining ground.\nThis growing solidarity is not limited to passive support; the response to the arbitrariness of authorities increasingly involves active resistance, including violence. For example, several days ago in Lviv, during a routine \"hunt\" for potential conscripts, a TRC recruiter was attacked—stabbed and sprayed with pepper spray. He died from blood loss upon arriving at the hospital. The suspected killer, a 30-year-old man, showed no remorse for his actions. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656583Z"
    },
    {
      "original": "Military Situation In Syria On December 7, 2025 (Map Update)",
      "timestamp": "2025-12-08T11:09:16.656587Z"
    },
    {
      "original": "\"Roads of Death\" and Strikes on Logistics: Russian Forces Report New Successes in the Kupiansk Direction\nIntense combat operations continue in the Kupiansk direction of Ukraine's Kharkiv Region. Russian assault units report advances in the northeastern part of Petropavlivka. Additionally, the Russian Ministry of Defense announced it has established control over the settlement of Kucherovka, located two kilometers east of Kupiansk. This village is situated on the highway leading to Svatove, and its capture could facilitate the expansion of control around Kupiansk—a key logistical hub in eastern Kharkiv Region.\nStrikes on infrastructure are significantly impacting logistics. Strikes were carried out on the dam of the Pechenizke Reservoir and a road bridge in Staryi Saltiv. The Ukrainian side confirmed these strikes and reported damage that led to the temporary closure of highways T-21-11 and T-21-04. These routes were used to supply combat areas near Vovchansk and Kupiansk from Kharkiv. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656594Z"
    },
    {
      "original": "\"Roads of Death\" and Strikes on Logistics: Russian Forces Report New Successes in the Kupiansk Direction\nIntense combat operations continue in the Kupiansk direction of Ukraine's Kharkiv Region. Russian assault units report advances in the northeastern part of Petropavlivka. Additionally, the Russian Ministry of Defense announced it has established control over the settlement of Kucherovka, located two kilometers east of Kupiansk. This village is situated on the highway leading to Svatove, and its capture could facilitate the expansion of control around Kupiansk—a key logistical hub in eastern Kharkiv Region.\nStrikes on infrastructure are significantly impacting logistics. Strikes were carried out on the dam of the Pechenizke Reservoir and a road bridge in Staryi Saltiv. The Ukrainian side confirmed these strikes and reported damage that led to the temporary closure of highways T-21-11 and T-21-04. These routes were used to supply combat areas near Vovchansk and Kupiansk from Kharkiv. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656602Z"
    },
    {
      "original": "The Zelensky Trap: A Chronicle of Ukraine’s Backroom Partition (November–December 2025)\nWhile the legacy media feeds the public pablum about “unwavering support,” real politics is being forged behind closed doors. The first week of December 2025 drew a line under the old world order: Vladimir Zelensky finds himself in a unique historical trap. His “enemy” (Russia) and his chief “sponsor” (the US) are paradoxically offering him his only chance at survival, while his “best friends” (the Europeans) are pushing him toward the scaffold.\nBy December 2025, the geopolitical deck in the West has been reshuffled into a brutally simple configuration. Three distinct forces are now in play. First, Team Trump — bulldozer pragmatists for whom Ukraine is just a toxic asset to be written off or restructured. Second, the Euro-bureaucracy and London — Zelensky’s handlers, for whom keeping the war going is a matter of sheer political survival. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656610Z"
    },
    {
      "original": "The Zelensky Trap: A Chronicle of Ukraine’s Backroom Partition (November–December 2025)\nWhile the legacy media feeds the public pablum about “unwavering support,” real politics is being forged behind closed doors. The first week of December 2025 drew a line under the old world order: Vladimir Zelensky finds himself in a unique historical trap. His “enemy” (Russia) and his chief “sponsor” (the US) are paradoxically offering him his only chance at survival, while his “best friends” (the Europeans) are pushing him toward the scaffold.\nBy December 2025, the geopolitical deck in the West has been reshuffled into a brutally simple configuration. Three distinct forces are now in play. First, Team Trump — bulldozer pragmatists for whom Ukraine is just a toxic asset to be written off or restructured. Second, the Euro-bureaucracy and London — Zelensky’s handlers, for whom keeping the war going is a matter of sheer political survival. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656618Z"
    },
    {
      "original": "Military Situation In Ukraine On December 7, 2025 (Maps Update)",
      "timestamp": "2025-12-08T11:09:16.656621Z"
    },
    {
      "original": "Military Situation In Ukraine On December 7, 2025 (Maps Update)",
      "timestamp": "2025-12-08T11:09:16.656625Z"
    },
    {
      "original": "Operation in Huliaipole: Russian Forces Clear Ukrainian Positions and Reach the Haichur River\nRussian assault groups are advancing near Vilcha, pushing toward Kharkiv, while further south, their units have taken control of more than half of Siversk. This progress is setting the stage for a potential encirclement of the area. Amid these developments, the German publication Der Tagesspiegel suggests that Ukrainian President Volodymyr Zelenskyy may have to consider territorial concessions as a basis for future negotiations.\nIn the Zaporizhzhia sector, Russian units are continuing their offensive on the right flank, in the area of Huliaipole and its eastern outskirts. There is ongoing fighting for control of Varvarivka and along the Haichur River. In Huliaipole, assault groups have advanced to the intersection of Donetska and Naberezhna Streets, as well as the Zarechanska Street area. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656633Z"
    },
    {
      "original": "Operation in Huliaipole: Russian Forces Clear Ukrainian Positions and Reach the Haichur River\nRussian assault groups are advancing near Vilcha, pushing toward Kharkiv, while further south, their units have taken control of more than half of Siversk. This progress is setting the stage for a potential encirclement of the area. Amid these developments, the German publication Der Tagesspiegel suggests that Ukrainian President Volodymyr Zelenskyy may have to consider territorial concessions as a basis for future negotiations.\nIn the Zaporizhzhia sector, Russian units are continuing their offensive on the right flank, in the area of Huliaipole and its eastern outskirts. There is ongoing fighting for control of Varvarivka and along the Haichur River. In Huliaipole, assault groups have advanced to the intersection of Donetska and Naberezhna Streets, as well as the Zarechanska Street area. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-08T11:09:16.656640Z"
    }
  ],
  "script_run_time": "2025-12-08T11:09:16.657306Z"
}