{
  "messages": [
    {
      "original": "🛵\n БпЛА на Сумщині",
      "timestamp": "2025-11-13T19:29:06.869214Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в напрямку на/повз Вороніж з північного сходу.",
      "timestamp": "2025-11-13T19:29:06.869231Z"
    },
    {
      "original": "🛵\n БпЛА на сході Одещини в напрямку на/повз н.п.Іванівка з північного сходу.",
      "timestamp": "2025-11-13T19:29:06.869236Z"
    },
    {
      "original": "🛵\n БпЛА на сході Одещини в напрямку на/повз н.п.Іванівка з північного сходу.",
      "timestamp": "2025-11-13T19:29:06.869241Z"
    },
    {
      "original": "🛵\n БпЛА  в напрямку Одеси з півночі.",
      "timestamp": "2025-11-13T19:29:06.869246Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку Березни зі сходу.",
      "timestamp": "2025-11-13T19:29:06.869250Z"
    },
    {
      "original": "🛵\n БпЛА на межі Херсонщини і Миколаївщини, курс - південний (вектор - Херсон);\n🛵\n БпЛА на Харківщині, в напрямку на/повз Златопіль з північного заходу.",
      "timestamp": "2025-11-13T19:29:06.869256Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-13T19:29:06.869261Z"
    },
    {
      "original": "🛵\n БпЛА по межі Херсонщини і Миколаївщини в південному напрямку.",
      "timestamp": "2025-11-13T19:29:06.869265Z"
    },
    {
      "original": "🛵\n БпЛА повз на/повз Богодухів в південному напрямку.",
      "timestamp": "2025-11-13T19:29:06.869271Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході від Миколаєва в північно-східному напрямку.",
      "timestamp": "2025-11-13T19:29:06.869276Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини, курс -західний.",
      "timestamp": "2025-11-13T19:29:06.869280Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході Херсонщини, курс - Миколаївщина.",
      "timestamp": "2025-11-13T19:29:06.869285Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Сумщини в напрямку на/повз н.п.Боромля/Тростянець.",
      "timestamp": "2025-11-13T19:29:06.869291Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-13T19:29:06.869300Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-13T19:29:06.869305Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на сході Дніпропетровщини біля н.п.Межова, Петропавлівка, Шахтарське.",
      "timestamp": "2025-11-13T19:29:06.869310Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку на/повз Новгород-Сіверський з північного сходу.",
      "timestamp": "2025-11-13T19:29:06.869315Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на сході Дніпропетровщини біля н.п.Межова, Петропавлівка, Шахтарське.",
      "timestamp": "2025-11-13T19:29:06.869320Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курс - південь Харківщини.",
      "timestamp": "2025-11-13T19:29:06.869324Z"
    },
    {
      "original": "🛵\n БпЛА з ТОТ на північ Херсонщини, курс - північний/північно-західний.",
      "timestamp": "2025-11-13T19:29:06.869329Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-13T19:29:06.869336Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-13T19:29:06.869340Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T19:29:07.692806Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T19:29:07.692818Z"
    },
    {
      "original": "Over the last week, local Palestinian armed groups affiliated with the Palestinian Islamic Jihad's Saraya Al-Quds Brigades claimed responsibility for two attacks in the West Bank.\nOn November 4, the \"Tulkarm Brigade\" stated that their fighters fired on a newly established Israeli outpost with small arms near the border with Israel west of the city of Tulkarm. This is the first recorded presence of Palestinian militants in the area of Tulkarm City in some time. IDF troops effectively occupy the city, which previously served as a stronghold for multiple armed groups.\nOn November 11, the \"Nablus Brigade\" stated that their fighters fired on an Israeli military vehicle with small arms near the \"Alon Moreh\" settlement east of Nablus. An increase in insurgent activity has been recorded in the Nablus area over the past month, which has seen very little activity recently due to frequent and sustained IDF raids.\nNo Israeli casualties were reported in either of these incidents.\nAdditionally, the Saraya Al-Quds Brigades announced the death of a fighter from the local armed group \"Tubas Battalion\" after he was killed by IDF troops in the Al-Fara'a Refugee Camp.",
      "timestamp": "2025-11-13T19:29:07.692826Z"
    },
    {
      "original": "I'm having issues with my computer, so I won't be able to post map updates from Ukraine today. All updates are live on my interactive map as usual, and I will try to make long-form posts about them as soon as possible.\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=48.38420505740439%2C37.273749674799895&z=12",
      "timestamp": "2025-11-13T19:29:07.692831Z"
    },
    {
      "original": "🇺🇦\n⚡️\n — Ukraine has suspended Justice Minister German Galushchenko amid an energy-sector corruption investigation. \n➡️\n His duties have been taken over by Deputy Minister for European Integration Lyudmyla Sugak. \n➡️\n Galushchenko, who served as energy minister for four years, is accused of receiving “personal benefits” from Timur Mindich in exchange for influence over energy-sector funds.\n@TabZLIVE",
      "timestamp": "2025-11-13T19:29:07.692842Z"
    },
    {
      "original": "This morning, three Russian Geran-2 drones struck a target in the Kholodnohirs'kyi District of Kharkiv City.",
      "timestamp": "2025-11-13T19:29:07.692846Z"
    },
    {
      "original": "Consequences of the morning Russian Geran-2 drone strikes on a warehouse facility in Kharkiv City.",
      "timestamp": "2025-11-13T19:29:07.692849Z"
    },
    {
      "original": "I’m seeing a lot of “Pro-Ukraine” accounts calling for mass mobilisation of more Ukrainian men today. \nTo those people advocating for this, think for a second - would you go and volunteer yourself? Would you go and fight alongside the country you claim to support so much? \nOr are you happy with just sitting at home in your comfortable, peaceful country advocating for the killing of hundreds of thousands. Because that’s what it would mean - mass mobilisation of additional Ukrainians would be condemning a significant portion of them to their deaths. They will die for a war that cannot be won. \nAll the while you have the audacity to claim that this is a good idea, while not being prepared to do anything yourself other than lie on Twitter for money and engagement. \nPeople like this are some of the most fucking vile, disgusting humans on this planet, and I truly hope that their statements will come back to haunt them once this war is over. \nYou do not support Ukraine. You are only anti-Russia. You have blood on your hands.",
      "timestamp": "2025-11-13T19:29:07.692857Z"
    },
    {
      "original": "Im happy to announce i will be doing an interview with AMK Mapping soon. Hopefully early next week at the latest, itll be uploaded to my youtube channel. We will be discussing what couldve happened if the invasion took place in 2014, as well as the origins of this conflict to begin with, before going into the future and what it holds. \nhttps://www.youtube.com/@hudsonwarmap",
      "timestamp": "2025-11-13T19:29:07.692861Z"
    },
    {
      "original": "Russian forces have captured the village of Yablukove, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~48.\nTotal land area: ~0.11 km².",
      "timestamp": "2025-11-13T19:29:07.692866Z"
    },
    {
      "original": "Russian forces have captured the village of Rivnopillya, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~268.\nTotal land area: ~0.92 km².",
      "timestamp": "2025-11-13T19:29:07.692871Z"
    },
    {
      "original": "Russian forces have captured the village of Sukhyi Yar, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~237.\nTotal land area: ~0.49 km².",
      "timestamp": "2025-11-13T19:29:07.692875Z"
    },
    {
      "original": "For those wondering, Pokrovsk has already effectively fallen. Only a couple of streets remain, meaning that any future progress within the city will be mostly symbolic.",
      "timestamp": "2025-11-13T19:29:07.692878Z"
    },
    {
      "original": "Last night, Ukrainian Flamingo cruise missiles attacked the Oryol Thermal Power plant in Oryol Oblast. \nThe number of missiles used is unknown, but it is known that 1 missile impacted and 1 was intercepted.",
      "timestamp": "2025-11-13T19:29:07.692882Z"
    },
    {
      "original": "Last night, Ukrainian Flamingo cruise missiles attacked the Oryol Thermal Power plant in Oryol Oblast. \nThe number of missiles used is unknown, but it is known that 1 missile impacted and 1 was intercepted.",
      "timestamp": "2025-11-13T19:29:07.692886Z"
    },
    {
      "original": "Russian forces have captured the village of Danylivka, Hulyaipole direction, Dnipropetrovsk Oblast.\nPre-war population: ~355.\nTotal land area: ~0.97 km².",
      "timestamp": "2025-11-13T19:29:07.692891Z"
    },
    {
      "original": "Russian forces have captured the village of Danylivka, Hulyaipole direction, Dnipropetrovsk Oblast.  Pre-war population: ~355. Total land area: ~0.97 km².",
      "timestamp": "2025-11-13T19:29:07.692894Z"
    },
    {
      "original": "As a result of this advance, Russian forces have now physically cut the Hulyaipole - Pokrovsk'e Highway. \nCurrently, there is only one usable paved road left leading into Hulyaipole, which is less than 6 km from the frontline, meaning it is under constant Russian drone surveillance.",
      "timestamp": "2025-11-13T19:29:07.692898Z"
    },
    {
      "original": "The day AI becomes completely unbiased will be scary for many.",
      "timestamp": "2025-11-13T19:29:07.692901Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nAs battles continue for the last streets of Pokrovsk, the defence of the besieged city of Myrnohrad has begun to falter. Russian forces are also advancing elsewhere, while the Ukrainians continue their push through Rodynske.\nWest of Pokrovsk, Russian forces continued their relatively quick advance through the fields between the two railway lines. They were able to make additional progress north of Kotlyne, capturing new treeline positions on the tactical heights, and advancing further north towards the second railway line. They also completed the capture of the dachas on the southeastern outskirts of Hryshyne and established control over new treeline positions on approach to the village. \nIn Pokrovsk City, Russian forces continue attempts at consolidating in the northwestern-most street of the city, as well as the adjacent dachas. Ukrainian drone operators are attempting to prevent them from establishing this bridgehead over the Hrishynka River. Meanwhile, fighting continues on the eastern edge of Pokrovsk.\nSouth of Myrnohrad, Russian forces consolidated in the second large trench fortification north of Lysivka and entered northern Sukhyi Yar. In coordination with attacks carried out from the south and east, the Russians were able to complete the capture of the village. \nIn southern Myrnohrad, as a result of recent assault operations, Russian forces managed to entrench in the first high-rise buildings of the Zapadny District. They also improved their positions further in the low-rise residential streets to the south. \nIn northern Myrnohrad, Russian forces broke through towards the centre of the city along the T-504 Highway, capturing new parts of the low-rise residential areas. They also advanced further in the northern high-rise buildings, establishing control over most of the remaining buildings north of Mukhamadyeyeva Street.\nIn Rodynske, Ukrainian forces were able to achieve some progress in the southwestern part of the city, capturing new positions in 3 blocks of 4-story buildings, as well as the treeline to the west. They are now attempting to break through the city centre to the southeastern high-rise microdistrict. A large grey zone has formed there.",
      "timestamp": "2025-11-13T19:29:07.692910Z"
    },
    {
      "original": "Iskander on Zaporizhzhia",
      "timestamp": "2025-11-13T19:29:07.692913Z"
    },
    {
      "original": "Iskander on Zaporizhzhia",
      "timestamp": "2025-11-13T19:29:07.692916Z"
    },
    {
      "original": "Disappeared. Probably mixed up with MLRS.",
      "timestamp": "2025-11-13T19:29:07.692922Z"
    },
    {
      "original": "Russian Army Closes In On Haichur River, Huliapole After New Breakthrough (Video)\nOn November 13, the Russian military advanced closer to the Ukrainian defense line along the Haichur River between Dnepropetrovsk and Zaporozhye which leads to the key city of Huliapole.\nAdvancing along the Yanchur River in Dnepropetrovsk, the 5th Guards Tank Brigade of the 36th Guards Combined Arms Army, a part of the Vostok [East] Group of Forces, captured Danylivka from Kiev forces. The capture of the settlement, the last one on the western bank of the Yancher before the area where the river splits away from the Haichur, was confirmed by the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558338Z"
    },
    {
      "original": "Ukraine’s Bloody Shield: How The Ukrainian Military Is Killing Its Own Citizens Fleeing The Conflict \nWhy are the Ukrainian authorities using their own civilians as human shields? How the Ukrainian military hunts down civilians trying to leave the combat zone. The Kyiv government is covering up the killing of ‘insufficiently loyal’ civilians.\nLast week, the Kyiv regime once again demonstrated its cynical attitude towards its own population. In the Kharkiv region, a Ukrainian drone struck two civilians attempting to leave the frontline area and reach Russian rear positions on the road leading from the village of Kruglyakovka to Berestovoye.\nReconnaissance footage confirms that the drone did not discover the people by chance. Instead, the drone operator circled over the pair for a long time in an attempt to force them back into the danger zone. When they refused, the unarmed Ukrainian civilians were killed.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558358Z"
    },
    {
      "original": "Ukraine’s Bloody Shield: How The Ukrainian Military Is Killing Its Own Citizens Fleeing The Conflict \nWhy are the Ukrainian authorities using their own civilians as human shields? How the Ukrainian military hunts down civilians trying to leave the combat zone. The Kyiv government is covering up the killing of ‘insufficiently loyal’ civilians.\nLast week, the Kyiv regime once again demonstrated its cynical attitude towards its own population. In the Kharkiv region, a Ukrainian drone struck two civilians attempting to leave the frontline area and reach Russian rear positions on the road leading from the village of Kruglyakovka to Berestovoye.\nReconnaissance footage confirms that the drone did not discover the people by chance. Instead, the drone operator circled over the pair for a long time in an attempt to force them back into the danger zone. When they refused, the unarmed Ukrainian civilians were killed.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558368Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 13, 2025 (Map Update)",
      "timestamp": "2025-11-13T19:29:08.558376Z"
    },
    {
      "original": "Russian Army Captures Town Near Vovchansk, Expands Control In Kupyansk \nOn November 13, the Russian military captured a settlement to the west of Vovchansk and expanded its control in the western part of the city of Kupyansk in Kharkiv.\nThe Russian Ministry of Defense said that Synelnykove was captured by the Sever [North] Group of Forces. The settlement was the focal point of intense battles with Kiev forces that went on for weeks. From there, Russian troops could advance to Liman, Tsehelne, and Prilypka.\nMore importantly, the capture of Synelnykove secures the recent gains by the Sever Group of Forces in the southwestern part of Vovchansk.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558385Z"
    },
    {
      "original": "Russian Army Captures Town Near Vovchansk, Expands Control In Kupyansk \nOn November 13, the Russian military captured a settlement to the west of Vovchansk and expanded its control in the western part of the city of Kupyansk in Kharkiv.\nThe Russian Ministry of Defense said that Synelnykove was captured by the Sever [North] Group of Forces. The settlement was the focal point of intense battles with Kiev forces that went on for weeks. From there, Russian troops could advance to Liman, Tsehelne, and Prilypka.\nMore importantly, the capture of Synelnykove secures the recent gains by the Sever Group of Forces in the southwestern part of Vovchansk.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558394Z"
    },
    {
      "original": "Sukhoi Su-30 Multirole Fighter; The Versatile Backbone of Russian and Allied Air Forces\n▪️\nThe \nSukhoi Su-30\n is a twin-engine multirole fighter and one of Russia’s most successful fourth-generation aircraft. With its high maneuverability, extended operational range, and capability to perform a wide array of aerial missions, it has become the backbone of the air forces of several nations. \n▪️\nDerived from the design of the Su-27, the Su-30 has been developed in multiple variants and serves as a complementary platform to more advanced fighters like the Su-35. Its ability to conduct air-to-air and air-to-surface operations, reconnaissance, and aerial support has made it a popular choice in the global defense market.\nVideo: Su-30 fighter jet performs the Cobra maneuver, a favorite maneuver of Russian fighters\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558406Z"
    },
    {
      "original": "Sukhoi Su-30 Multirole Fighter; The Versatile Backbone of Russian and Allied Air Forces\n▪️\nThe \nSukhoi Su-30\n is a twin-engine multirole fighter and one of Russia’s most successful fourth-generation aircraft. With its high maneuverability, extended operational range, and capability to perform a wide array of aerial missions, it has become the backbone of the air forces of several nations. \n▪️\nDerived from the design of the Su-27, the Su-30 has been developed in multiple variants and serves as a complementary platform to more advanced fighters like the Su-35. Its ability to conduct air-to-air and air-to-surface operations, reconnaissance, and aerial support has made it a popular choice in the global defense market.\nVideo: Su-30 fighter jet performs the Cobra maneuver, a favorite maneuver of Russian fighters\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558417Z"
    },
    {
      "original": "Military Situation In Ukraine On November 13, 2025 (Maps Update)",
      "timestamp": "2025-11-13T19:29:08.558421Z"
    },
    {
      "original": "Military Situation In Ukraine On November 13, 2025 (Maps Update)",
      "timestamp": "2025-11-13T19:29:08.558425Z"
    },
    {
      "original": "Russian Army Gets More Upgraded TOS-1A Thermobaric Rocket Launchers \nUralvagonzavod, a part of the Russian state-owned Rostec defense conglomerate, has delivered a batch of upgraded TOS-1A “Solntsepyok” thermobaric rocket systems to the Russian military.\nThe delivery came on the occasion of the Day of the Russian military’s Troops of Radiological, Chemical and Biological Defence (RHBZ) on November 13, the press service of Rostec said in a statement, noting that the new systems were equipped with “a modernized anti-drone complex.”\n“Prior to delivery, in order to assess the quality and compliance with the requirements of the regulatory and technical documentation, the products were subjected to operational acceptance testing. According to the test results, the products demonstrated high quality and compliance with the tactical and technical characteristics and requirements of the delivery specifications,” the press service quoted a manufacturer representative as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-13T19:29:08.558436Z"
    }
  ],
  "script_run_time": "2025-11-13T19:29:08.559209Z"
}