{
  "messages": [
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з південного сходу.",
      "timestamp": "2025-11-17T14:54:56.982659Z"
    },
    {
      "original": "🛸\n На західних околицях м.Запоріжжя ворожий БпЛА, ймовірно, розвідувальний. Залучено засоби для збиття.",
      "timestamp": "2025-11-17T14:54:56.982675Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на північному сході від н.п.Барвінкове (Харківщина) курсом на Донеччину.",
      "timestamp": "2025-11-17T14:54:56.982681Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА з Донеччини курсом на Харківщину (вектор - північ Лозовський р-н).",
      "timestamp": "2025-11-17T14:54:56.982687Z"
    },
    {
      "original": "Швидкісна ціль на Запорізьку область (вектор - Нікополь (Дніпропетровщина).",
      "timestamp": "2025-11-17T14:54:56.982691Z"
    },
    {
      "original": "Швидкісна ціль в напрямку м.Запоріжжя.",
      "timestamp": "2025-11-17T14:54:56.982694Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині на північному заході від н.п. Лиманівка/Лозова, курс - південно-західний.",
      "timestamp": "2025-11-17T14:54:56.982699Z"
    },
    {
      "original": "🛵\n БпЛА  на Харківщині курсом на/повз Лозову з північного заходу.",
      "timestamp": "2025-11-17T14:54:56.982704Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски КАБ на Донеччину/схід Дніпропетровщини.",
      "timestamp": "2025-11-17T14:54:56.982713Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА  в напрямку Сум/н.п.Степанівка з південного заходу.",
      "timestamp": "2025-11-17T14:54:56.982719Z"
    },
    {
      "original": "🛵\n \n🛸\n Ворожий БпЛА на Дніпропетровщині в напрямку Павлограда з південного сходу.",
      "timestamp": "2025-11-17T14:54:56.982734Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-17T14:54:56.982739Z"
    },
    {
      "original": "🛸\n На Херсонщині - розвідувальний БпЛА противника, який може бути потенційним навідником  ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-11-17T14:54:56.982744Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-11-17T14:54:56.982749Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-11-17T14:54:56.982753Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-11-17T14:54:56.982762Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-11-17T14:54:56.982766Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину/схід Дніпропетровщини.",
      "timestamp": "2025-11-17T14:54:56.982770Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-17T14:54:56.982777Z"
    },
    {
      "original": "🚀\nПуски  КАБ на Сумщину.",
      "timestamp": "2025-11-17T14:54:56.982781Z"
    },
    {
      "original": "Do I prepare a Venezuela map?",
      "timestamp": "2025-11-17T14:54:57.775347Z"
    },
    {
      "original": "Hmmm",
      "timestamp": "2025-11-17T14:54:57.775357Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to advance south of the Vovcha River and have almost fully secured the section of its southern bank between Orestopil and Novoselivka.\nAfter capturing the village of Orestopil, Russian forces continued to advance in the salient to the southeast. They crossed the Vorona River from Sosnivka and advanced northwest up the treelines towards the Vovcha River. Other assault groups continued advancing west along the southern bank of the Vovcha, and began attempts at entering the forest east of Velykomykhailivka. \nRussian forces also crossed the Vorona River at a point further west, advancing down a treeline east of Orestopil and reaching the southern bank of the Vovcha directly south of Velykomykhailivka, therefore levelling the frontline between Orestopil and the positions west of Novoselivka.\n+ ~5.34 km² in favour of Russia.",
      "timestamp": "2025-11-17T14:54:57.775365Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nRussian focus has shifted away from the last points in Pokrovsk still in the grey-zone to the surrounding areas, where they are attempting to eliminate the rest of the Myrnohrad pocket and make progress in other crucial sectors.\nWest of Pokrovsk, Russian forces continued to push north through the fields on the tactical heights, and have advanced up five parallel treelines, reaching their northern ends. Additionally, some soldiers are trying to infiltrate the small forest west of Hryshyne, however it's unlikely that they were able to consolidate there. The Ukrainian command has brought in new reinforcements to Hryshyne, where they are now probing Russian positions in the dachas on the southeastern outskirts of the village. This is significantly complicating further Russian progress in the area.\nIn northern Pokrovsk, Russian assault groups managed to consolidate in the agricultural complex north of the Hrishynka River, and in the first houses of the city's northernmost street and adjacent dachas. Small assault groups continue to operate in this area but are unable to bring it under full control due to the constant presence of Ukrainian soldiers, who have brought in significant reinforcements. \nNorth of Pokrovsk, due to a lack of Ukrainian manpower here, Russian forces managed to consolidate in the first pig farm complex along the road towards Hryshyne as well as along the treeline running parallel with the road. They continue to operate in the area of the second pig farm, without consolidation yet. \nIn the southern part of the Myrnohrad pocket, Russian forces began advancing east from Novopavlivka to the nearby trench fortifications. Other forces broke through Ukrainian positions in southern Myrnohrad and advanced through the low-rise residential streets, reaching the southwestern outskirts of the city. This forced a Ukrainian withdrawal from the southern part of the pocket, allowing for the Russians to establish control over numerous trench fortifications and treelines, as well as two sets of railway windbreaks. \nIn the rest of Myrnohrad, Russian forces continue attempts at expanding their zone of control south of the high-rise buildings of the Zapadny District, pushing through the grey-zone in the low-rise residential areas. They are also trying to further expand their foothold in the southeastern part of the Zapadny District and are carrying out assault operations in the northeastern high-rise blocks of the city, in the direction of the local school and kindergarten.\nIn Rodynske, Russian forces regained the initiative in the city, re-establishing control over the eastern part of the city centre. Violent battles are now ongoing for the central-most block of Rodynske, where Ukrainian forces are attempting to counterattack from the area of the administrative building to the northwest. Additionally, other Russian assault groups managed to push the Ukrainians back from some of the three-story buildings on Chervonolymanska Street, and are attempting to push north to Myru Street, where Ukrainian soldiers are heavily entrenched. \n+ ~16.99 km² in favour of Russia.",
      "timestamp": "2025-11-17T14:54:57.775375Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces continued to advance towards Shakhove from the north, approaching the Nove Shakhove - Shakhove road. \nThey advanced east along the forest plantations on either side of a gulley, reaching a dam next to a reservoir and the remaining Russian positions west of Shakhove. Other assault groups advanced southeast and south from the clay quarries, through the forests and down the Hruzke - Shakhove Road, recapturing positions there and reaching the northern approaches to Shakhove.\n+ ~3.60 km² in favour of Ukraine.",
      "timestamp": "2025-11-17T14:54:57.775380Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance in the area of Ivanopillya, and have entered the village at a new point.\nAfter securing most of the southern part of the village, as well as the positions to the east, Russian forces managed advance up the highway to the graveyard and consolidate in the treeline to the west. From there, they entered the northern part of Ivanopillya, where attempts are underway at entrenching in the street just west of the graveyard. \n+ ~0.85 km² in favour of Russia.",
      "timestamp": "2025-11-17T14:54:57.775385Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to slowly advance in the area of Synelnykove, and have entered the main part of the village. \nFollowing earlier failed attempts at capturing positions in the northern part of Synelnykove, Russian forces began attacks from the forests to the west, into the western street of the village. As a result, they were able to establish control over it, allowing for other assault groups to enter the settlement from the north, and capture the houses there too.\n+ ~0.37 km² in favour of Russia.",
      "timestamp": "2025-11-17T14:54:57.775390Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.\nAt least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation at 45.35423, 28.80395, resulting in a large fire breaking out and widespread power outages for Izmail and the surrounding areas.",
      "timestamp": "2025-11-17T14:54:57.775394Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.\nAt least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation at 45.35423, 28.80395, resulting in a large fire breaking out and widespread power outages for Izmail and the surrounding areas.",
      "timestamp": "2025-11-17T14:54:57.775398Z"
    },
    {
      "original": "Last night, a combined Russian missile and drone attack was carried out on Kharkiv Oblast.\n2 Iskander-M ballistic missiles impacted target in the centre of Balakliya, somewhere near 49.45555, 36.83722, while at least 5 Geran-2 drones targeted energy infrastructure in the vicinity of the city. Widespread power outages were reported in the entirety Balakliya and the surrounding settlements. 1 civilian was killed, and 7 others were injured. [Media 1 & 2]\nAt least 6 Gerans targeted energy infrastructure near Izyum. Widespread power outages were reported in the entirety of the city and surrounding settlements. \nAt least 6 Gerans impacted an unknown target in Lozova, possibly the railway station. \nAdditionally, one Molniya FPV drone struck a target in the Kholodnohirs'kyi District of Kharkiv City",
      "timestamp": "2025-11-17T14:54:57.775405Z"
    },
    {
      "original": "Last night, a combined Russian missile and drone attack was carried out on Kharkiv Oblast.\n2 Iskander-M ballistic missiles impacted target in the centre of Balakliya, somewhere near 49.45555, 36.83722, while at least 5 Geran-2 drones targeted energy infrastructure in the vicinity of the city. Widespread power outages were reported in the entirety Balakliya and the surrounding settlements. 1 civilian was killed, and 7 others were injured. [Media 1 & 2]\nAt least 6 Gerans targeted energy infrastructure near Izyum. Widespread power outages were reported in the entirety of the city and surrounding settlements. \nAt least 6 Gerans impacted an unknown target in Lozova, possibly the railway station. \nAdditionally, one Molniya FPV drone struck a target in the Kholodnohirs'kyi District of Kharkiv City",
      "timestamp": "2025-11-17T14:54:57.775411Z"
    },
    {
      "original": "Overnight, a combined Russian missile and drone attack was carried out on Sumy Oblast. \nOne Iskander-M ballistic missile launched from Kursk Oblast, along with 2-3 Geran-2 drones impacted a target near the village of Boromlya, Sumy Oblast. \nAdditionally, at least five Geran-2 drones attacked a target northeast of Sumy City, in the area of Khomyne [attached video].",
      "timestamp": "2025-11-17T14:54:57.775416Z"
    },
    {
      "original": "In the evening, at least 8 Russian Geran-2 drones attacked an unknown target in the cities of Novohorod-Siverskyi and Mena, Chernihiv Oblast",
      "timestamp": "2025-11-17T14:54:57.775419Z"
    },
    {
      "original": "In the evening, at least 8 Russian Geran-2 drones attacked an unknown target in the cities of Novohorod-Siverskyi and Mena, Chernihiv Oblast",
      "timestamp": "2025-11-17T14:54:57.775427Z"
    },
    {
      "original": "Additionally, during the attacks on Dnipropetrovsk Oblast, one Iskander-M ballistic missile launched from the vicinity of Yeysk, Krasnodar Krai, impacted the town of Mykolaivka. A strong explosion was reported and heard from neighbouring cities.",
      "timestamp": "2025-11-17T14:54:57.775431Z"
    },
    {
      "original": "Following the Russian KAB strikes on energy infrastructure west of Mykolaivka, Donetsk Oblast, at least three Russian Geran-2 drones attacked an unknown target in the city of Slovyansk.\nSeveral Geran strikes were also once again recorded close to the frontline in Pokrovsk'e, Dnirpopetrovsk Oblast. A few drones also attacked the city of Pavlohrad.",
      "timestamp": "2025-11-17T14:54:57.775434Z"
    },
    {
      "original": "Last night, a massive Russian Geran-2 drone attack was carried out on the city of Izmail, Odesa Oblast.  At least 35 drones took part, flying in two large groups of 20 and 15. Around 12 were shot down. ~23 drones impacted the \"Etalon\" 110 kV electrical substation…",
      "timestamp": "2025-11-17T14:54:57.775438Z"
    },
    {
      "original": "Additionally, the Izmail port was struck by as many as a dozen drones, rather than all of them targeting the substation.",
      "timestamp": "2025-11-17T14:54:57.775441Z"
    },
    {
      "original": "Sounding the alarms \n😱\nEdit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-17T14:54:57.775447Z"
    },
    {
      "original": "Sounding the alarms \n😱\n  Edit: I don't know why comments keep getting randomly turned off. I'm not doing that.",
      "timestamp": "2025-11-17T14:54:57.775454Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-17T14:54:57.775457Z"
    },
    {
      "original": "Lmao",
      "timestamp": "2025-11-17T14:54:57.775460Z"
    },
    {
      "original": "This is what happens when you lie to your audience for nearly four years straight, while believing the opposite of what you say behind closed doors.",
      "timestamp": "2025-11-17T14:54:57.775463Z"
    },
    {
      "original": "Military Situation In Ukraine On November 16, 2025 (Maps Update)",
      "timestamp": "2025-11-17T14:54:58.596962Z"
    },
    {
      "original": "Military Situation In Ukraine On November 16, 2025 (Maps Update)",
      "timestamp": "2025-11-17T14:54:58.596974Z"
    },
    {
      "original": "Ukraine's Deserter Numbers Near The Size Of Its Active-Duty Army\nA troubling trend continues in Ukraine, marked by mass unauthorized abandonment of military units and desertion. According to Roman Kostenko, Secretary of the Verkhovna Rada Committee on National Security, the number of soldiers who have gone AWOL is approaching the total strength of the entire Ukrainian army.\nHe notes that approximately 80% of mobilized individuals \"simply flee from training centers,\" and the country is not taking effective measures to return these servicemen or to create conditions that would compel them to fulfill their duty. Millions of draft evaders are in hiding, observing from the sidelines, unwilling to participate in the conflict. Furthermore, the number of individuals mobilized in October was approximately 26,500, of whom 21,000 deserted, resulting in a net reinforcement of only about 5,000 personnel. This comes as monthly casualties (killed and wounded) are estimated at 20,000-25,000 servicemen...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.596986Z"
    },
    {
      "original": "Ukraine's Deserter Numbers Near The Size Of Its Active-Duty Army\nA troubling trend continues in Ukraine, marked by mass unauthorized abandonment of military units and desertion. According to Roman Kostenko, Secretary of the Verkhovna Rada Committee on National Security, the number of soldiers who have gone AWOL is approaching the total strength of the entire Ukrainian army.\nHe notes that approximately 80% of mobilized individuals \"simply flee from training centers,\" and the country is not taking effective measures to return these servicemen or to create conditions that would compel them to fulfill their duty. Millions of draft evaders are in hiding, observing from the sidelines, unwilling to participate in the conflict. Furthermore, the number of individuals mobilized in October was approximately 26,500, of whom 21,000 deserted, resulting in a net reinforcement of only about 5,000 personnel. This comes as monthly casualties (killed and wounded) are estimated at 20,000-25,000 servicemen...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.596994Z"
    },
    {
      "original": "Siversk In A Vise: Russian Forces Tighten The Encirclement Of Ukrainian Garrison\nRussian units are poised to sever the R-85 highway, a critical supply route for Ukrainian forces in Huliaipole. The encirclement of Ukrainian troops in Siversk is steadily tightening. Hungarian Prime Minister Viktor Orbán has stated that the conflict in Ukraine could end in the near future.\nSiversk Sector: \nThe Ukrainian Armed Forces in Siversk are gradually losing control of their area, with their main logistical routes under fire from Russian units. Fierce fighting continues in Yampol in the northern sector. Unmanned aerial vehicles are being used extensively to contain the offensive. Attempts to transfer equipment and personnel are being thwarted, with most of the equipment destroyed en route to the settlement. In the Dronovka area, the advance is taking place along the railway line towards Siversk, where there is also high UAV activity.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597003Z"
    },
    {
      "original": "Siversk In A Vise: Russian Forces Tighten The Encirclement Of Ukrainian Garrison\nRussian units are poised to sever the R-85 highway, a critical supply route for Ukrainian forces in Huliaipole. The encirclement of Ukrainian troops in Siversk is steadily tightening. Hungarian Prime Minister Viktor Orbán has stated that the conflict in Ukraine could end in the near future.\nSiversk Sector: \nThe Ukrainian Armed Forces in Siversk are gradually losing control of their area, with their main logistical routes under fire from Russian units. Fierce fighting continues in Yampol in the northern sector. Unmanned aerial vehicles are being used extensively to contain the offensive. Attempts to transfer equipment and personnel are being thwarted, with most of the equipment destroyed en route to the settlement. In the Dronovka area, the advance is taking place along the railway line towards Siversk, where there is also high UAV activity.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597012Z"
    },
    {
      "original": "Israeli Army Conducts More Raids In Lebanon As It Moves Closer To Decision On War \nIsrael continues to escalate its attacks on Lebanon amid reports suggesting that a new war against Hezbollah is nearing.\nIn a statement released late on November 16, the Israeli Defense Forces (IDF) revealed that it had conducted several overnight raids in southern Lebanon in the past week, as part of efforts to prevent Hezbollah from rearming.\nDuring one raid in the town of Aitaroun, the military said that reservists of the Alon Brigade demolished several buildings that had been used by the group , including recently to restore its capabilities in the area. In another raid in the town of Ramyeh, troops of the 300th “Baram” Regional Brigade seized and destroyed several weapons, including assault rifles, according to the military.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597021Z"
    },
    {
      "original": "Israeli Army Conducts More Raids In Lebanon As It Moves Closer To Decision On War \nIsrael continues to escalate its attacks on Lebanon amid reports suggesting that a new war against Hezbollah is nearing.\nIn a statement released late on November 16, the Israeli Defense Forces (IDF) revealed that it had conducted several overnight raids in southern Lebanon in the past week, as part of efforts to prevent Hezbollah from rearming.\nDuring one raid in the town of Aitaroun, the military said that reservists of the Alon Brigade demolished several buildings that had been used by the group , including recently to restore its capabilities in the area. In another raid in the town of Ramyeh, troops of the 300th “Baram” Regional Brigade seized and destroyed several weapons, including assault rifles, according to the military.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597030Z"
    },
    {
      "original": "Trump Shows Openness To Talks With Venezuela As Strike Group Enters Caribbean \nUnited States President Donald Trump has shown openness to engage with Venezuela, all while his military expanded presence in the Caribbean Sea with carrier strike groups.\nSpeaking to reporters on November 16, Trump suggested that future talks with his Venezuelan counterpart Nicolas Maduro could be on the table.\n“We may be having some discussions with Maduro, and we’ll see how that turns out,” Trump said, adding: “They would like to talk.”\nPressed for more details, he replied: “Venezuela would like to talk. What does it mean? You tell me, I don’t know… I’d talk to anybody.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597040Z"
    },
    {
      "original": "Renewed Clashes Between Syrian Government, Kurdish Forces Rises Risk Of War\nClashes between the forces of Syria’s Islamist-led Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) reignited in the eastern Raqqa countryside on November 17\nThe clashes between the towns of Madan and Ghanem Ali first broke out two days earlier. At the time, the SDF accused “factions” affiliated with the government of attacking its positions there.\n“In a new assault reflecting the state of chaos and recklessness pursued by some factions affiliated with the Damascus government, our forces today were subjected to a treacherous attack on the axis of Ghanem al-Ali village in the eastern countryside of Raqqa,” the SDF said in a statement issued on November 15.\nIt added that they “thwarted this reckless attack” that resulted in minor injuries to three SDF fighters and “confirmed casualties” among the attackers.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597053Z"
    },
    {
      "original": "Renewed Clashes Between Syrian Government, Kurdish Forces Rises Risk Of War\nClashes between the forces of Syria’s Islamist-led Interim Government and the Kurdish-led Syrian Democratic Forces (SDF) reignited in the eastern Raqqa countryside on November 17\nThe clashes between the towns of Madan and Ghanem Ali first broke out two days earlier. At the time, the SDF accused “factions” affiliated with the government of attacking its positions there.\n“In a new assault reflecting the state of chaos and recklessness pursued by some factions affiliated with the Damascus government, our forces today were subjected to a treacherous attack on the axis of Ghanem al-Ali village in the eastern countryside of Raqqa,” the SDF said in a statement issued on November 15.\nIt added that they “thwarted this reckless attack” that resulted in minor injuries to three SDF fighters and “confirmed casualties” among the attackers.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597063Z"
    },
    {
      "original": "Military Knowledge: R-73 Air-to-Air Missile\n▪️\n The R-73 missile, known in NATO designation as AA-11 Archer, is one of Russia’s most advanced short-range infrared air-to-air missiles. Entering service in the 1980s, it demonstrated significant superiority over its Western counterparts thanks to its high maneuverability, infrared seeker, and off-boresight launch capability.\n▫️\n Over time, the missile was upgraded into variants such as the R-74M and R-74M2, designed for fifth-generation fighters,\n \nwith the export version RVV-MD2 unveiled in 2023.\n▪️\n In addition to its widespread use in the Russian Air Force and CIS countries, some militaries—such as Yemen—have repurposed it as a surface-to-air missile under the name “Thaqib-1”, successfully downing fighter jets and drones. This evolution transformed the R-73 from a simple replacement for the R-60 into a symbol of modern air-to-air weapons development.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-17T14:54:58.597075Z"
    },
    {
      "original": "A little On-the-Ground Report from the Beaches of Sochi Russia by our friend Matt Ehret\nMatt Ehret and the Canadian Patriot Press",
      "timestamp": "2025-11-17T14:54:58.597079Z"
    }
  ],
  "script_run_time": "2025-11-17T14:54:58.597944Z"
}