{
  "messages": [
    {
      "original": "Дніпро - укриття!",
      "timestamp": "2025-08-15T21:37:36.221092Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу!",
      "timestamp": "2025-08-15T21:37:36.221110Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-15T21:37:36.221117Z"
    },
    {
      "original": "⚠️\n⚠️\nСпостерігається активність  розвідувальних БпЛА в Чернігівській, Харківській та Запорізькій областях, можлива робота ППО.Дані безпілотники можуть бути навідниками ворожих засобів ураження. У разі оголошення тривоги перебувайте в безпечних місцях!",
      "timestamp": "2025-08-15T21:37:36.221123Z"
    },
    {
      "original": "🛸\n На сході Чернігівської, сході Сумської, сході Харківської, сході Дніпропетровської, півночі Донецької областей -  ворожі розвідувальні БпЛА, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-08-15T21:37:36.221128Z"
    },
    {
      "original": "⚠\nУвага!\nРакетна небезпека по всій території України!\nЗліт МіГ-31К!",
      "timestamp": "2025-08-15T21:37:36.221137Z"
    },
    {
      "original": "⚠\n Увага!\n🚀\nШвидкісна ціль Київ!",
      "timestamp": "2025-08-15T21:37:36.221143Z"
    },
    {
      "original": "🛸\n На сході Чернігівської, заході Сумської, сході Дніпропетровської  областей та в районі Запоріжжя -  ворожі розвідувальні БпЛА, які можуть бути навідниками  ворожих засобів ураження!\nЗалучено засоби для збиття.",
      "timestamp": "2025-08-15T21:37:36.221149Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T21:37:36.221157Z"
    },
    {
      "original": "⚠\nУвага! Ракетна небезпека по всій території України! Зліт МіГ-31К!",
      "timestamp": "2025-08-15T21:37:36.221161Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К.",
      "timestamp": "2025-08-15T21:37:36.221166Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T21:37:36.221173Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі ударні БпЛА з Донеччини \n➡️\n на північ Запорізької, схід Дніпропетровської областей.",
      "timestamp": "2025-08-15T21:37:36.221181Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на сході Дніпропетровської області \n➡️\n курсом на північ.",
      "timestamp": "2025-08-15T21:37:36.221187Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та південно-східному напрямках зберігається! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T21:37:36.221194Z"
    },
    {
      "original": "🛵\n \"Шахеди\" на сході Дніпропетровської області \n➡️\n курсом на північ.",
      "timestamp": "2025-08-15T21:37:36.221200Z"
    },
    {
      "original": "🛵\n Група \"шахедів\" з Дніпропетровщини \n➡️\n на північ Донеччини.",
      "timestamp": "2025-08-15T21:37:36.221205Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Брянської обл., рф \n➡️\n на північ Чернігівщини.",
      "timestamp": "2025-08-15T21:37:36.221211Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-08-15T21:37:36.221215Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-08-15T21:37:36.221219Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-08-15T21:37:36.221224Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Луганщини \n➡️\n на північ Донеччини.",
      "timestamp": "2025-08-15T21:37:36.221229Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА з Курської, Бєлгородської обл.. рф \n➡️\n на північ та південь Сумщини, північ Харківщини.",
      "timestamp": "2025-08-15T21:37:36.221234Z"
    },
    {
      "original": "No launches from the MiG-31K. It is probably conducting training.",
      "timestamp": "2025-08-15T21:37:36.742904Z"
    },
    {
      "original": "The MiG is flying to Ryazan Oblast, (according to radio activity, it is under the control of the ground controller Kalityv).",
      "timestamp": "2025-08-15T21:37:36.742918Z"
    },
    {
      "original": "The MiG is flying to Ryazan Oblast, (according to radio activity, it is under the control of the ground controller Kalityv).",
      "timestamp": "2025-08-15T21:37:36.742921Z"
    },
    {
      "original": "The MiG has returned to Savasleika Airbase, landing there after completing its training mission.",
      "timestamp": "2025-08-15T21:37:36.742925Z"
    },
    {
      "original": "Update from the Gaza Strip - Gaza Governorate (12/8/25):\nThe IDF began what appears to be the first stages of their offensive aimed at capturing all of Gaza City.\nIsraeli forces, reinforced with armoured units, began a push through the flattened parts of southern Gaza City, previously cleared during the early stages of the war while the Netzarim Corridor was being established. They were able to occupy a large section of this area, reaching the less-destroyed parts of the Zeitoun Neighbourhood of Gaza City from the south, where they began clearing the surrounding areas in preparation for the advance into the more \"dangerous\" urban areas. A forward command and control post was likely set up at the school at 31.48877, 34.44553.\nAdditionally, the IDF continued to slowly clear the Shujaiyya Neighbourhood of eastern Gaza City, clearing one of the last areas east of the Salah Al-Deen Highway here, effectively completing the main part of their buffer zone project from the border, which they began working on in early April of this year. Israeli soldiers are now operating beyond the highway at this section, but no major clearing operations have been recorded yet.\nPalestinian militants are in turn intensifying their attacks, with the Al-Qassam Brigades (Hamas) and the Saraya Al-Quds Brigades (PIJ) carrying out the majority of attacks. These are mainly comprised of remotely detonating IEDs, and firing projectiles at vehicles, although mortars and short-range rockets have also been employed. Other smaller factions such as the Mujahideen Brigades have also been carrying out attacks. \n@Arabosint\n recently estimated that around 4,800 fighters from the Al-Qassam Brigades are present in Gaza City, down from the ~6,000-8,000 that were estimated to be part of Hamas' Gaza Brigade prior to October 7, 2023. Most of these fighters will have received much less training than your average pre-war militant, with many being recruited since the war began. However, these numbers provided by ArabOsint do not include that of other factions, such as the Saraya Al-Quds Brigades or the Al-Aqsa Martyrs Brigades.",
      "timestamp": "2025-08-15T21:37:36.742934Z"
    },
    {
      "original": "Explosion in Honcharivske, Chernihiv Oblast. There is a training ground there which has been regularly scouted out by recon drones for the past week.",
      "timestamp": "2025-08-15T21:37:36.742937Z"
    },
    {
      "original": "Smoke was seen rising over Honcharivske, Chernihiv Oblast after the Iskander strike.",
      "timestamp": "2025-08-15T21:37:36.742940Z"
    },
    {
      "original": "Deepstate got a knock at the door it seems",
      "timestamp": "2025-08-15T21:37:36.742947Z"
    },
    {
      "original": "Deepstate got a knock at the door it seems",
      "timestamp": "2025-08-15T21:37:36.742951Z"
    },
    {
      "original": "I honestly have no words.... this is mapping in its final form",
      "timestamp": "2025-08-15T21:37:36.742954Z"
    },
    {
      "original": "Ukrainian HIMARS GMLRS rockets attacked Donetsk City and Makiivka again. One interception was seen over Makiivka, and one impact is reported in Donetsk City.",
      "timestamp": "2025-08-15T21:37:36.742959Z"
    },
    {
      "original": "2 Russian Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast. They are still in Saratov Oblast, and the purpose of the flight is unknown. Following the recent movements to and from Ukrainka Airbase, Amur Oblast, it is believed that 2/3rds of the Tu-95s at Engels-2 are equipped with Kh-101 missiles.",
      "timestamp": "2025-08-15T21:37:36.742963Z"
    },
    {
      "original": "The Tu-214PU aircraft carrying Putin has entered U.S. airspace, and is expected to land at Anchorage Airport in 1 hr 13 mins.",
      "timestamp": "2025-08-15T21:37:36.742966Z"
    },
    {
      "original": "Putin's Tu-214PU is approaching Anchorage Elmendorf Airbase for landing, and is being tracked by over 340,000 people on Flightradar.",
      "timestamp": "2025-08-15T21:37:36.742969Z"
    },
    {
      "original": "2 Russian Tu-95MS strategic bombers departed from Engels-2 Airbase, Saratov Oblast. They are still in Saratov Oblast, and the purpose of the flight is unknown. Following the recent movements to and from Ukrainka Airbase, Amur Oblast, it is believed that 2/3rds…",
      "timestamp": "2025-08-15T21:37:36.742973Z"
    },
    {
      "original": "Correction: These two Tu-95s have been airborne for around an hour. A Tu-160 has departed a short time ago, however.",
      "timestamp": "2025-08-15T21:37:36.742976Z"
    },
    {
      "original": "Putin's Tu-214PU is approaching Anchorage Elmendorf Airbase for landing, and is being tracked by over 340,000 people on Flightradar.",
      "timestamp": "2025-08-15T21:37:36.742979Z"
    },
    {
      "original": "This reminds me of something...",
      "timestamp": "2025-08-15T21:37:36.742982Z"
    },
    {
      "original": "Putin's Tu-214PU has just touched down at Anchorage Elmendorf Airbase, Alaska.",
      "timestamp": "2025-08-15T21:37:36.742987Z"
    },
    {
      "original": "U.S. President Donald Trump has arrived at Joint Base Elmendorf–Richardson in Anchorage, Alaska. The meeting with Putin is set to begin in just over an hour.",
      "timestamp": "2025-08-15T21:37:36.742990Z"
    },
    {
      "original": "Reminder: Trump wants the war in Ukraine to continue. He just needs a way out of supplying Ukraine with weapons and aid, which is where Europe comes into play. \nKeeping the war going is in Trump's best interests in regard to tackling the main threat to U.S. hegemony: China. Why stop a war which has Russia distracted and committed, when you can let it play out even further and use that time to your advantage? \nUnfortunately, this will mean much more death and destruction in a war which has its outcome sealed if peace is not made. But when in pursuit of power - or in America's case, maintaining the power of an aging empire - administrations will go at great lengths with little worry about the costs, as long as it doesn't have significant effects back at home.\nDon't expect much of today's talks, or you will be very disappointed.",
      "timestamp": "2025-08-15T21:37:36.742997Z"
    },
    {
      "original": "Reminder: Trump wants the war in Ukraine to continue. He just needs a way out of supplying Ukraine with weapons and aid, which is where Europe comes into play.   Keeping the war going is in Trump's best interests in regard to tackling the main threat to U.S.…",
      "timestamp": "2025-08-15T21:37:36.743000Z"
    },
    {
      "original": "Ngl, if you told 2023 me that I'd be writing a post like this in 2025, I would've called you crazy. But here we are...",
      "timestamp": "2025-08-15T21:37:36.743003Z"
    },
    {
      "original": "With the Trump-Putin meeting set to begin in around 20 minutes, the first Russian Geran-2 drone launches have been recorded.\nThese are from:\nPrimorsko-Akhtarsk Airbase, Krasnodar Krai.\nShatalovo Airbase, Smolensk Oblast.\nTsumbolova Test Site, Oryol Oblast.\nThe first groups of Gerans (at least 10 units) from Primorsko-Akhtarsk flew north past Hulyaipole, Zaporizhzhia Oblast towards Dnipropetrovsk Oblast.\nTactical aviation continues its work as usual. Over the past 6 hours, targets were struck with KAB/FAB glide-bombs in and around:\nBilopillya, Sumy Oblast.\nVorozhba, Sumy Oblast.\nRichky, Sumy Oblast.\nYunakivka, Sumy Oblast.\nVelykyi Burluk, Kharkiv Oblast.\nLyman, Donetsk Oblast.\nSiversk, Donetsk Oblast.\nPokrovsk, Donetsk Oblast.\nNovopavlivka, Dnipropetrovsk Oblast.\nAdditionally, over the past few hours, 2 Iskander-M ballistic missiles impacted a target in southern Dnipro, 2 Iskander-Ms impacted a target in Honcharivske, Chernihiv Oblast (likely the training ground), and 1 Iskander-M impacted a target in Pavlohrad, Dnipropetrovsk Oblast.",
      "timestamp": "2025-08-15T21:37:36.743016Z"
    },
    {
      "original": "Trump and Putin have now met in Anchorage, Alaska.",
      "timestamp": "2025-08-15T21:37:36.743019Z"
    },
    {
      "original": "With the Trump-Putin meeting set to begin in around 20 minutes, the first Russian Geran-2 drone launches have been recorded.  These are from: Primorsko-Akhtarsk Airbase, Krasnodar Krai. Shatalovo Airbase, Smolensk Oblast. Tsumbolova Test Site, Oryol Oblast.…",
      "timestamp": "2025-08-15T21:37:36.743023Z"
    },
    {
      "original": "The 10+ drones from Zaporizhzhia Oblast are probably going to attack the Dobropillya area of Donetsk Oblast.",
      "timestamp": "2025-08-15T21:37:36.743026Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Hruzke, Bilozerske direction, Donetsk Oblast.\nPre-war population: ~176.\nTotal land area: ~0.89km².",
      "timestamp": "2025-08-15T21:37:36.743033Z"
    },
    {
      "original": "The three-on-three meeting involving Trump and Putin has begun in Anchorage, Alaska.",
      "timestamp": "2025-08-15T21:37:36.743036Z"
    },
    {
      "original": "Pentagon Effectively Confirms 'Golden Dome' Will Breach Outer Space Treaty \nL\nast week, the Pentagon presented more details about the upcoming \"Golden Dome\", revealing that it will be a four-layer missile defense system and that it will also include a space-based component (the other three are ground-based, including eleven short-range batteries planned for deployment in the continental US, Alaska and Hawaii). Reuters cited a presentation of the project, titled \"Go Fast, Think Big!\", shown in Huntsville, Alabama, last week to around 3,000 representatives of the American Military Industrial Complex (MIC).\nThe revelation didn't really show much more than what was already known about the US strategic missile defenses. The slides revealed there would be early warning satellites for detecting missile launches, tracking and \"boost-phase interception\". \n______________\nIn Video\n: Booz Allen Unveils “Brilliant Swarms” Satellite Constellation for US Golden Dome Missile Defense\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384170Z"
    },
    {
      "original": "Pentagon Effectively Confirms 'Golden Dome' Will Breach Outer Space Treaty \nL\nast week, the Pentagon presented more details about the upcoming \"Golden Dome\", revealing that it will be a four-layer missile defense system and that it will also include a space-based component (the other three are ground-based, including eleven short-range batteries planned for deployment in the continental US, Alaska and Hawaii). Reuters cited a presentation of the project, titled \"Go Fast, Think Big!\", shown in Huntsville, Alabama, last week to around 3,000 representatives of the American Military Industrial Complex (MIC).\nThe revelation didn't really show much more than what was already known about the US strategic missile defenses. The slides revealed there would be early warning satellites for detecting missile launches, tracking and \"boost-phase interception\". \n______________\nIn Video\n: Booz Allen Unveils “Brilliant Swarms” Satellite Constellation for US Golden Dome Missile Defense\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384189Z"
    },
    {
      "original": "Hezbollah Leader Vows ‘No Life In Lebanon,’ Warns U.S. Embassy Over Disarmament Plot \nHezbollah Secretary-General Naim Qassem on August 15 condemned the Lebanese government’s recent decision to approve a plan to disarm his group by the end of the year, warning that any attempt to implement the plan will undermine the country’s national security.\nIn an extended speech, Qassem emphasized that Hezbollah “will not hand over its weapons as long as the occupation exists and aggression continues.”\nThe leader said that the group would fight a “Karbala-like battle” – a reference to the 7th-century clash central to Shi’ite Muslim identity – against what he described as the American-Israeli project, expressing confidence in victory, and placing “full responsibility on the Lebanese government for any strife that may occur.”\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384199Z"
    },
    {
      "original": "Russia Is Testing Remotely-Controlled ATGM Launcher In Special Operation Zone\nThe Kirov Plant Mayak, a part of the Kalashnikov Group, trained Russian troops on the use of an advanced remote control system for the Fagot anti-tank guided missile (ATGM), the Russian defense giant announced on August 14.\nIn a news release, the group said that representatives from the Kirov Plant Mayak provided comprehensive instruction to operators of the Fagot ATGM belonging to one of the troop units deployed in the special military operation zone in Ukraine.\nThe training covered the operational principles of the upgraded remote control system, including its mounting procedures and key operational features, according to the release.\nKalashnikov officials said that the remote control kit was issued to the troops for autonomous training and real-world testing across diverse environments, including open fields, wooded areas, and urban settings.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384211Z"
    },
    {
      "original": "Russia Is Testing Remotely-Controlled ATGM Launcher In Special Operation Zone\nThe Kirov Plant Mayak, a part of the Kalashnikov Group, trained Russian troops on the use of an advanced remote control system for the Fagot anti-tank guided missile (ATGM), the Russian defense giant announced on August 14.\nIn a news release, the group said that representatives from the Kirov Plant Mayak provided comprehensive instruction to operators of the Fagot ATGM belonging to one of the troop units deployed in the special military operation zone in Ukraine.\nThe training covered the operational principles of the upgraded remote control system, including its mounting procedures and key operational features, according to the release.\nKalashnikov officials said that the remote control kit was issued to the troops for autonomous training and real-world testing across diverse environments, including open fields, wooded areas, and urban settings.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384221Z"
    },
    {
      "original": "Russia Launches Improved Project 22350 Frigate \nThe Severnaya Verf Shipyard in Russia St. Petersburg launched on August 14 the improved Project 22350 frigate “Admiral Amelko”.\nProject 22350 frigates have a displacement of about 5,000 tons, and can accelerate to 29 knots. The frigates are capable of engaging enemy aircraft carrier groups and other surface targets, providing air defense for naval formations, supporting amphibious operations, striking land and sea targets, and conducting anti-submarine warfare.\nRussian Navy Commander-in-Chief Admiral Alexander Moiseyev said that Admiral Amelko is capable of performing all tasks typical of a multi-purpose warship, in both near and far sea zones.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384229Z"
    },
    {
      "original": "Russia Launches Improved Project 22350 Frigate \nThe Severnaya Verf Shipyard in Russia St. Petersburg launched on August 14 the improved Project 22350 frigate “Admiral Amelko”.\nProject 22350 frigates have a displacement of about 5,000 tons, and can accelerate to 29 knots. The frigates are capable of engaging enemy aircraft carrier groups and other surface targets, providing air defense for naval formations, supporting amphibious operations, striking land and sea targets, and conducting anti-submarine warfare.\nRussian Navy Commander-in-Chief Admiral Alexander Moiseyev said that Admiral Amelko is capable of performing all tasks typical of a multi-purpose warship, in both near and far sea zones.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384238Z"
    },
    {
      "original": "Russian Forces Make Strategic Gains Across Multiple Fronts in Pivotal Week of Fighting\nThe past week of Russia’s special military operation has delivered significant battlefield successes, with Ukrainian forces largely retreating and losing territory across most sectors. The only area where Ukrainian troops continue counterattacking is near Stepnogorsk in the Zaporizhzhia region, while even their previously active Sumy axis has lost momentum.\nRussian “Northern” grouping forces continue advancing in both Sumy and Kharkiv regions, though progress remains tactical against stiff Ukrainian resistance. The redeployment of some Ukrainian units to more critical sectors has weakened defenses here, reducing counterattack capabilities. In the Kupiansk direction, fierce urban combat continues as Russian troops push to fully secure the strategically important city. \nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384246Z"
    },
    {
      "original": "Russian Forces Make Strategic Gains Across Multiple Fronts in Pivotal Week of Fighting\nThe past week of Russia’s special military operation has delivered significant battlefield successes, with Ukrainian forces largely retreating and losing territory across most sectors. The only area where Ukrainian troops continue counterattacking is near Stepnogorsk in the Zaporizhzhia region, while even their previously active Sumy axis has lost momentum.\nRussian “Northern” grouping forces continue advancing in both Sumy and Kharkiv regions, though progress remains tactical against stiff Ukrainian resistance. The redeployment of some Ukrainian units to more critical sectors has weakened defenses here, reducing counterattack capabilities. In the Kupiansk direction, fierce urban combat continues as Russian troops push to fully secure the strategically important city. \nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384254Z"
    },
    {
      "original": "Israeli Army Chief Hints At New Attack On Iran\nIsraeli military chief of staff Lt. Gen. Eyal Zamir on August 14 hinted at the possibility of launching another attack on Iran.\nDuring a speech at a military ceremony at the Glilot base in central Israel, Zamir said that the Israeli military was ready to repeat its strike on Iran if necessary.\nIsrael launched a surprise attack against Iran on June 13, stating that its goal was to cripple the Islamic Republic’s nuclear program. The war ended when a ceasefire was suddenly announced on June 24, just two days after the United States joined the war by attacking three Iranian nuclear sites.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384262Z"
    },
    {
      "original": "Ukraine Planned To Produce 200 Ballistic Missiles Every Month: Russian Intelligence\nThe Ukrainian military-industrial complex planned to produce 200 Sapsan ballistic missiles per month before the program was derailed as a result of a special operation carried out by the Russian Defense Ministry and the Russian Federal Security Service (FSB).\nThe FSB obtained intelligence on Ukraine’s secret missile program, which was then targeted by the MoD. Chemical and mechanical plants in Pavlograd, Dneptropetrovsk Region, as well as the “Zvezda” plant and State Scientific Research Institute of Chemical Products in Shostka, Sumy Region were struck during the operation.\nThe Sapsan, also known as Hirm and Grom, is believed to have a maximum range of 700 kilometers and a warhead weighing 480 kg. The FSB warned that the missile would have been capable of hitting a large part of Western Russia, including the capital Moscow.\nRead more \nHERE",
      "timestamp": "2025-08-15T21:37:37.384270Z"
    },
    {
      "original": "Military Situation In Ukraine On August 15, 2025 (Maps Update)",
      "timestamp": "2025-08-15T21:37:37.384274Z"
    },
    {
      "original": "Military Situation In Ukraine On August 15, 2025 (Maps Update)",
      "timestamp": "2025-08-15T21:37:37.384278Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 15, 2025\nOn August 15, several videos documenting some of the Russian military recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-15T21:37:37.384284Z"
    },
    {
      "original": "Summary of Russian Combat Footage From August 15, 2025\nOn August 15, several videos documenting some of the Russian military recent operations against Kiev forces surfaced online\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-15T21:37:37.384291Z"
    },
    {
      "original": "PUTIN'S PRE-SUMMIT PUSH: RUSSIAN FORCES SCORE VICTORIES TO SUPPORT DIPLOMACY",
      "timestamp": "2025-08-15T21:37:37.384294Z"
    }
  ],
  "script_run_time": "2025-08-15T21:37:37.385147Z"
}