{
  "messages": [
    {
      "original": "🛵\n БпЛА на Черкащині, курс на Смілу, Контянтинівку",
      "timestamp": "2025-11-09T09:26:33.871014Z"
    },
    {
      "original": "🛬\nБпЛА в Сумському району, Сумської області,курс а південь",
      "timestamp": "2025-11-09T09:26:33.871031Z"
    },
    {
      "original": "🛵\n БпЛА  в акваторії Чорного моря курсом на Одещину.",
      "timestamp": "2025-11-09T09:26:33.871038Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину.",
      "timestamp": "2025-11-09T09:26:33.871043Z"
    },
    {
      "original": "🛵\n БпЛА в Шосткинському районі Сумщини, курс на схід",
      "timestamp": "2025-11-09T09:26:33.871047Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-09T09:26:33.871056Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини в напрямку Полтавщини ( Полтавський р-н)",
      "timestamp": "2025-11-09T09:26:33.871060Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 34 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 09 листопада (з 18:00 08 листопада) противник атакував 69 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Міллєрово, Орел, Приморсько-Ахтарськ - рф, близько 50 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 34 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі та сході країни.\nЗафіксовано влучання 32 ударних БпЛА на 9 локаціях, а також падіння збитих (уламки) на одній локації.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-11-09T09:26:33.871080Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину!",
      "timestamp": "2025-11-09T09:26:33.871084Z"
    },
    {
      "original": "🛵\n БпЛА  в акваторії Чорного моря курсом на Одещину.",
      "timestamp": "2025-11-09T09:26:33.871089Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря в напрямку н.п.Чорноморськ (Одещина).",
      "timestamp": "2025-11-09T09:26:33.871093Z"
    },
    {
      "original": "🛵\n БпЛА  на півночі Донеччини, курсом на Харківщину;\n🛵\n БпЛА  на Полтавщині в напрямку н.п.Великі Сорочинці з південного сходу;\n🛵\n \n🛸\n БпЛА  на півночі Сумщини, курс - західний.",
      "timestamp": "2025-11-09T09:26:33.871102Z"
    },
    {
      "original": "🛵\n БпЛА  на Полтавщині в напрямку н.п.Заводське/н.п.Лохвиця з південного сходу.",
      "timestamp": "2025-11-09T09:26:33.871108Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-11-09T09:26:33.871113Z"
    },
    {
      "original": "🛵\n БпЛА  на південному сході Чернігівщини, курс - північно-західний.",
      "timestamp": "2025-11-09T09:26:33.871117Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на півночі Сумщини, курс - південний/південно-західний.",
      "timestamp": "2025-11-09T09:26:33.871123Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на півночі Сумщини, курс - південний/південно-західний.",
      "timestamp": "2025-11-09T09:26:33.871128Z"
    },
    {
      "original": "🛵\n БпЛА курсом на н.п.Свеса з північного заходу.",
      "timestamp": "2025-11-09T09:26:33.871134Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-09T09:26:33.871141Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область!",
      "timestamp": "2025-11-09T09:26:33.871145Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині курсом на/повз н.п.Глухів.",
      "timestamp": "2025-11-09T09:26:33.871149Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-11-09T09:26:33.871153Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces have advanced over the past 10 days, with Ukrainian forces eliminating most of the rest of the former Russian Kucheriv Yar salient.\nIn the north, Ukrainian forces advanced from positions south and east of Kucheriv Yar and recaptured positions in the treelines on the tactical heights and in the clay quarries. They reached the forests leading to western Shakhove where fighting is now ongoing.\nTo the south, Ukrainian forces advanced further east from positions east of Nove Shakhove. They pushed along two parallel gulleys and some treelines, capturing new positions in the direction of Pankivka, and threatening to cut off Russian formations entrenched in western Shakhove.\nTo the southwest, despite Russian FAB bombings, Ukrainian assault groups made additional progress towards the Kazenyi Torets River. They advanced southeast and captured new treeline positions on the tactical heights northwest of Mayak, while other forces entered the Hektova Gulley where they established control over most of the forested areas and began pushing towards the rear of Nykanorivka. Additionally, the Ukrainians advanced east from Dorozhnje, recapturing new positions in the forests west of Nykanorivka. \nOn the other hand, after their withdrawal from northern Pankivka, Russian forces re-entered the forests in the grey-zone northwest of the village, and consolidated in the positions there.\n+ ~24.45 km² in favour of Ukraine.\n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-11-09T09:26:34.735738Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nOver the last 24 hours, any remaining Ukrainian soldiers in the Dinas District of northeastern Pokrovsk surrendered after being physically encircled earlier. After combing operations, the rest of the district was brought under full Russian control.\nAttacks are now being carried out further east through Rivne. Russian forces were able to capture additional positions in the southern houses of the village as they attempt to advance east along the highway towards the northwestern outskirts of Myrnohrad.\nNorthwest of Myrnohrad, Russian forces levelled the frontline east of the northern pincer. After earlier infiltrations they were able to consolidate in the pig farm complex northwest of Svitle, as well as the treelines to the north. Additionally, Russian forces captured the pig farm complex south of Chervonyi Lyman, as well as the rest of the railway windbreaks further south.\nFierce fighting continues in western Rodynske, with no new confirmed changes. \nWith these new changes, for the first time, not a single part of Pokrovsk City is under Ukrainian control. More than 95% is under Russian control, with the rest in a fluid grey zone.",
      "timestamp": "2025-11-09T09:26:34.735754Z"
    },
    {
      "original": "In the Novopavlivka direction, over the past ten days, Russian forces have made significant progress on both banks of the Solena river.\nIn the northeast, Russian forces advanced further west from their positions west of Kotlyarivka. They established control over the remaining treelines in western Donetsk Oblast, crossing into Dnipropetrovsk Oblast, where they captured more positions on the tactical heights.\nTo the south, Russian forces widened their spearhead to the rear of Dachne by improving their positions in the treelines further north of the nearby gulley. They were able to capture positions in four separate treelines here.\nTo the southwest, following the Ukrainian withdrawal from the salient north of the Vovcha River, Russian forces levelled the frontline south of the gulley, establishing control over the remaining treeline positions there.\nTo the northwest, Russian forces broke through Ukrainian defences south of Novopavlivka and advanced up a treeline to the southeastern outskirts of the town. They then entered the town, capturing the southern streets. Once reinforcements were brought in, and positions were captured on the eastern and western flanks of the breach, the Russians advanced further north through the Novopavlivka, capturing additional residential streets. They also improved their positions further in the fortified forest, capturing additional positions north of Filiya.\nTo the west, Russian forces advanced east from Ivanivka to the forests on the northern bank of the Vovcha River. They established control over the positions there, linking up the Ivanivka bridgehead to the rest of the Novopavlivka direction. \n+ ~31.91 km² in favour of Russia.",
      "timestamp": "2025-11-09T09:26:34.735764Z"
    },
    {
      "original": "In the Pokrovsk'e and Hulyaipole directions, over the past five days Russian forces have continued their offensive operations, capturing new positions in several different areas. \nIn the north, Russian forces advanced from positions east of Oleksivika towards Orestopil, establishing control over two separate treelines and some nearby forest plantations. DRGs were able to enter the residential part of Orestopil. \nTo the southwest, the Russians continued expanding their zone of control around Zlahoda. They advanced down two perpendicular treelines south and southwest of the village, capturing new positions there. \nTo the south, after securing the central part of Uspenivka, Russian forces managed to capture the rest of the village, along with the agricultural buildings on its southern outskirts. They then crossed the Yanchur River at a new point from Pryvilne, and began advancing down a gulley and adjacent treelines towards Solodke. Russian soldiers quickly captured Solodke due to a lack of Ukrainian manpower in the area and consolidated in the treelines to the east.\nTo the southeast, the Russians advanced south and downhill from Uspenivka towards Nove, capturing positions in several different treelines and entering the village. Other forces advanced towards Novouspenivske from the southeast, crossing a gulley and capturing a forest along with nearby treeline positions to the north, northeast and south. As a result, any remaining Ukrainian soldiers still stationed west of Okhotnyche withdrew further west, allowing for the Russians to establish control over the treelines west of the Yanchur River there.\nFurther south, Russian forces continued to slowly advance west of Malynivka. They captured the rest of the gulley leading west from the village and secured new positions in two separate treelines, therefore reaching the eastern outskirts of Zelenyi Hai.\n+ ~30.98 km² in favour of Russia.",
      "timestamp": "2025-11-09T09:26:34.735772Z"
    },
    {
      "original": "Fun fact that a lot of people need to hear: both sides advance in Ukraine. \nJust because the side you don't support makes progress, it doesn't automatically mean its fake or cope, even though one country obviously advances more than the other.",
      "timestamp": "2025-11-09T09:26:34.735776Z"
    },
    {
      "original": "Ukrainian source Deepstate has provided some additional information regarding the deteriorating situation for Ukraine in the Hulyaipole and Pokrovsk'e directions. This, along with some information from other sources allows for us to paint a clearer picture of the events that unfolded here over the past 10 days. \nThey report that 50% of the Ukrainian soldiers defending the area of Uspenivka were withdrawn to improve the deteriorating situation near Vyshneve. At the time, Russia had quickly captured this relatively large village, crossed two rivers, and were advancing well beyond it to the north and west. These reinforcements somewhat stabilised the situation there, but it left a large gap in the defence of the Uspenivka area.\nAs a result, at least 200 Russian soldiers from the 14th Guards Spetsnaz Brigade, 218th Tank Regiment, and the 394th Motorized Rifle Brigade were able to enter Uspenivka, and bring it under their control relatively quickly. The 394th brigade consolidated in the village while the 14th brigade and 218th regiment began pushing to the nearby villages of Nove, Novouspenivske, Solodke, and Rivnopillya. \nIn order to try save the situation, one unspecified battalion of Ukraine's 102nd Territorial Defence Brigade was deployed to Uspenivka, but suffered heavy casualties due to Russia having already brought in significant reinforcements to the village, and just because of the fact that the battalion was low on manpower. \nA severe lack of coordination in cohesion in this sector, along with commanders not accurately reporting the situation to headquarters or neighbouring units, is partially responsible for these rapid losses in ground that should have been able to hold for some time. Critical manpower shortages also play a major role in this. These levels of incompetence, shortages, and inability to coordinate properly are beyond anything I have ever seen for Ukraine so far. \nAs a result of this chain of events over the past 10 days, Russia has been able to fully compromise Ukrainian defences on the western bank of the Yanchur River and is now pushing through the fields further west. Fighting is ongoing for the villages of Nove, Novouspenivske, and Rivnopillya, while Solodke was captured a few days ago. Rybne is also under threat of being encircled due to Russian advances near Zlahoda and Solodke, and all the while, the newly reinforced front further north is still not stabilised.",
      "timestamp": "2025-11-09T09:26:34.735784Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T09:26:34.735788Z"
    },
    {
      "original": "Ukrainian forces were geolocated being shelled and hit by a Russian drone-dropped explosive in southern Chasiv Yar.\nBased on my analysis of the footage, this advance took place sometime after October 4, therefore being well after the city was captured in July.",
      "timestamp": "2025-11-09T09:26:34.735796Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n 1 was killed in the israeli drone strike that targeted Kherbet Selm.\n@wfwitness",
      "timestamp": "2025-11-09T09:26:34.735806Z"
    },
    {
      "original": "Russian FPV drones continue to fly relatively freely over Kramatorsk, Donetsk Oblast. Interestingly, this video shows that Ukraine has begun constructing trenches in the city park.",
      "timestamp": "2025-11-09T09:26:34.735812Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T09:26:34.735815Z"
    },
    {
      "original": "Last night, around 10 Russian Geran-2 drones struck energy infrastructure in the city of Slovyansk, Donetsk Oblast. FPV drones were also heard over the city at the time of the attack. Power outages and voltage surges were reported.",
      "timestamp": "2025-11-09T09:26:34.735819Z"
    },
    {
      "original": "Last night, at least 7 Russian Geran-2 drones attacked energy infrastructure in the city of Lozova, Kharkiv Oblast. Power outages occurred as a result. A Grom-E1 rocket-powered glide-bomb also impacted the city, although it's unclear if it also targeted energy infrastructure. \nMeanwhile, due to previous missile and drone strikes in Kharkiv City, large parts of the city remain without power.",
      "timestamp": "2025-11-09T09:26:34.735823Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T09:26:34.735827Z"
    },
    {
      "original": "Overnight, several Russian Geran-2 drones attacked targets in eastern Dnipropetrovsk Oblast.\nThe towns of Vasylivka and Prosyana were hit. In Prosyana, the train station was the target, as evidenced by NASA FIRMS data. A large fire broke out afterwards and secondary detonations could be heard.",
      "timestamp": "2025-11-09T09:26:34.735831Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T09:26:34.735835Z"
    },
    {
      "original": "Three Ukrainian Neptune cruise missiles struck the Voronezh CHP-1 Power Plant in Voronezh Oblast.\nTwo missiles struck Boiler House no. 1, while a third likely hit the heat generation building. A fire broke out but was extinguished relatively quickly. Some power and heat disruptions were reported in the city.",
      "timestamp": "2025-11-09T09:26:34.735839Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T09:26:34.735843Z"
    },
    {
      "original": "1-2 Ukrainian Neptune cruise missiles have impacted the T-25 110/35/6 kV electrical substation in the city of Taganrog, Rostov Oblast. A large fire can be seen burning there, and disruptions in power, communication and water supply is reported. \nCoordinates: 47.21244, 38.87464",
      "timestamp": "2025-11-09T09:26:34.735847Z"
    },
    {
      "original": "Military Situation In Ukraine On November 8, 2025 (Maps Update)",
      "timestamp": "2025-11-09T09:26:35.634355Z"
    },
    {
      "original": "Military Situation In Ukraine On November 8, 2025 (Maps Update)",
      "timestamp": "2025-11-09T09:26:35.634368Z"
    },
    {
      "original": "Ukraine Nears Defeat In Kupyansk, Collapse Nearby (Videos)\nOn October 8, the Russian military expanded its control within Kupyansk in Kharkiv after repelling multiple Ukrainian counterattacks.\nIn its daily briefing, the Russian Ministry of Defense said that the 6th Army of the Zapad [West] Group of Forces inflicted more losses on Kiev forces inside Kupyansk and repelled a counterattack by Ukraine’s 1st National Guard Brigade near Osinovo to the south of the city.\nJust a day earlier, Russian media reported additional gains in the eastern outskirts of Kypyansk, with Russian troops approaching Kucherivka.\nRead more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634378Z"
    },
    {
      "original": "Ukraine Nears Defeat In Kupyansk, Collapse Nearby (Videos)\nOn October 8, the Russian military expanded its control within Kupyansk in Kharkiv after repelling multiple Ukrainian counterattacks.\nIn its daily briefing, the Russian Ministry of Defense said that the 6th Army of the Zapad [West] Group of Forces inflicted more losses on Kiev forces inside Kupyansk and repelled a counterattack by Ukraine’s 1st National Guard Brigade near Osinovo to the south of the city.\nJust a day earlier, Russian media reported additional gains in the eastern outskirts of Kypyansk, with Russian troops approaching Kucherivka.\nRead more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634387Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 8, 2025 (Map Update)",
      "timestamp": "2025-11-09T09:26:35.634391Z"
    },
    {
      "original": "Houthis Say 'Spy Network' Linked To CIA, Mossad & Saudi Intelligence Was Exposed \nThe Interior Ministry of the Houthi-led government in the Yemen capital, Sanaa, announced on November 8 that it had exposed a “spy network” run by the United States’ CIA, the Israeli Mossad agency and the intelligence service of Saudi Arabia.\nThe spy network was exposed as a result of a “high-level security operation, conducted in several stages,” the ministry said in a statement, noting that the operation “uncovered the enemy's plans, the methods of its treacherous agents, and their connections.”\nAccording to the ministry, the network was run by a joint operations room based in Saudi Arabia that coordinated “sabotage and espionage efforts against Yemen” and “established numerous small cells, each operating independently but all linked to the enemy's central operations room.”\nRead more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634399Z"
    },
    {
      "original": "U.S. Army Shares Photos Of Bombers, Fighter Jets Near Venezuela In New Escalation\nThe U.S. military has released photos showing strategic bombers and fighter jets flying over the Caribbean Sea, in a new sign of escalation against Venezuela.\nPhotos showing a pair of B-52 Stratofortress the Southern Command (SOUTHCOM) area of responsibility and conducting aerial refueling with a KC-135 Stratotanker were shared by the Air Force Global Strike Command to X on November 7. In the post, the command said that its aircraft “routinely conduct global operations in coordination with other combatant commands, services & participating US govt agencies to defend the US & its Allies”\nThe flight took place a day earlier. Data from aviation tracking websites, including Flightradar24, indicate that the B-52 flew along the coast of Venezuela, of course without violating the country’s airspace. This was the fourth instance of U.S. bombers approaching the country in recent weeks.\nRead more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634407Z"
    },
    {
      "original": "U.S. Army Shares Photos Of Bombers, Fighter Jets Near Venezuela In New Escalation\nThe U.S. military has released photos showing strategic bombers and fighter jets flying over the Caribbean Sea, in a new sign of escalation against Venezuela.\nPhotos showing a pair of B-52 Stratofortress the Southern Command (SOUTHCOM) area of responsibility and conducting aerial refueling with a KC-135 Stratotanker were shared by the Air Force Global Strike Command to X on November 7. In the post, the command said that its aircraft “routinely conduct global operations in coordination with other combatant commands, services & participating US govt agencies to defend the US & its Allies”\nThe flight took place a day earlier. Data from aviation tracking websites, including Flightradar24, indicate that the B-52 flew along the coast of Venezuela, of course without violating the country’s airspace. This was the fourth instance of U.S. bombers approaching the country in recent weeks.\nRead more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634415Z"
    },
    {
      "original": "TOS Attack: Summary Of Russian Combat Footage From November 8, 2025\nOn November 8, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-09T09:26:35.634422Z"
    },
    {
      "original": "TOS Attack: Summary Of Russian Combat Footage From November 8, 2025\nOn November 8, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-09T09:26:35.634429Z"
    },
    {
      "original": "Inside Trump’s C5+1 Push: Can America Rewrite Geopolitics Of Central Asia?\nThe C5+1 summit brought together the leaders of Kazakhstan, Kyrgyzstan, Tajikistan, Turkmenistan, and Uzbekistan with President Donald Trump. The format, created in 2015, aims to boost cooperation between the US and Central Asia on security, trade, and connectivity. It has evolved into a platform through which Washington seeks influence in a region traditionally shaped by Russian and Chinese presence.\nTrump’s renewed push is largely about rare-earth minerals and energy security: the American president has repeatedly framed access to strategic resources as a national priority. Central Asia’s reserves of rare-earth metals, particularly in Kazakhstan and Uzbekistan, are central to this renewed interest. These minerals underpin everything from smartphones to advanced weapons systems. Today Beijing dominates the sector, processing 90% of the world’s rare earths...\n👉\n Read more \nHERE",
      "timestamp": "2025-11-09T09:26:35.634437Z"
    }
  ],
  "script_run_time": "2025-11-09T09:26:35.635282Z"
}