{
  "messages": [
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Чорноморськ.",
      "timestamp": "2025-12-12T21:43:46.283773Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині на/повз Городню та Седнів.",
      "timestamp": "2025-12-12T21:43:46.283792Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-12-12T21:43:46.283798Z"
    },
    {
      "original": "🛵\n БпЛА у бік Чернігова з півночі.",
      "timestamp": "2025-12-12T21:43:46.283803Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря у напрямку н.п. Південне.",
      "timestamp": "2025-12-12T21:43:46.283807Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА над Черніговом. Перебувайте в укриттях!",
      "timestamp": "2025-12-12T21:43:46.283812Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Чорноморськ.",
      "timestamp": "2025-12-12T21:43:46.283816Z"
    },
    {
      "original": "🛵\n Чернігів - БпЛА у напрямку міста!",
      "timestamp": "2025-12-12T21:43:46.283821Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря на Чорноморськ/Овідіополь.",
      "timestamp": "2025-12-12T21:43:46.283826Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з акваторії Чорного моря в напрямку Одеси.",
      "timestamp": "2025-12-12T21:43:46.283831Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-12T21:43:46.283835Z"
    },
    {
      "original": "🛵\n БпЛА в акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2025-12-12T21:43:46.283841Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-12T21:43:46.283846Z"
    },
    {
      "original": "🛵\n Група БпЛА з акваторії Чорного моря в напрямку Одеси.\n🛵\n БпЛА з Чернігівщини на Сумщину (Конотопський район).\n🛵\n БпЛА з Сумщини на Полтавщину (Миргородський район).",
      "timestamp": "2025-12-12T21:43:46.283854Z"
    },
    {
      "original": "🛵\n Павлоград - БпЛА у напрямку міста!",
      "timestamp": "2025-12-12T21:43:46.283858Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА курсом на Суми.\n🛵\n Група БпЛА з Дніпропетровщини на Донеччину.\n🛵\n БпЛА з Полтавщини на Дніпропетровщину.",
      "timestamp": "2025-12-12T21:43:46.283866Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-12T21:43:46.283870Z"
    },
    {
      "original": "🛵\n Група БпЛА на півдні Миколаївщини у північно-західному напрямку.\n🛵\n Група БпЛА на межі Херсонщини на Запорізької області курсом на Дніпропетровщину.",
      "timestamp": "2025-12-12T21:43:46.283878Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА з Миколаївщини на Одещину.\n🛵\n Група БпЛА в акваторії Чорного моря у напрямку півдня Одещини.\n🛵\n Група БпЛА із Запорізької області на Дніпропетровщину (Нікопольський район).",
      "timestamp": "2025-12-12T21:43:46.283886Z"
    },
    {
      "original": "🚀\nПуски КАБ на сході Харківщини.",
      "timestamp": "2025-12-12T21:43:46.283891Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-12T21:43:46.809972Z"
    },
    {
      "original": "Overnight, around 8 Russian Geran-2 drones attacked energy infrastructure in Odesa City.\nThe target was likely the \"Centrolit\" 220 kV electrical substation (46.61796, 30.82342). A large fire subsequently broke out, resulting in power outages for parts of northern Odesa.",
      "timestamp": "2025-12-12T21:43:46.809984Z"
    },
    {
      "original": "Over the last few days, the defence of Siversk has completely collapsed. \nA fortress city that the Russians couldn't reach for nearly 4 years is about to be captured after just a week of fighting.\nIf this isn't a sign of how bad Ukraine's manpower shortages have got, I don't know what is.",
      "timestamp": "2025-12-12T21:43:46.809990Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-12T21:43:46.809998Z"
    },
    {
      "original": "🇹🇭\n🇰🇭\n⚡\n- Cambodian forces also launched a counterattack in the village of Trakoun, Poi Pet direction.\nFootage shows Cambodian troops crossing a recently planted Thai barbed wire point, as well as taking down the Thai flag, replacing it with a Cambodian one. Most of the village is under Cambodian control.",
      "timestamp": "2025-12-12T21:43:46.810005Z"
    },
    {
      "original": "The last Ukrainian defences in the besieged city of Myrnohrad are being breached by Russian forces, who have now entered the city centre. \nThe parts of the pocket still under firm Ukrainian control have decreased to around 2.8 km², compared to ~36 km² at the beginning of the siege. \nNevertheless, Russian FAB glide-bombs continue to strike the remaining blocks still under Ukrainian control. This video shows a FAB-1500 strike on a high-rise apartment building.",
      "timestamp": "2025-12-12T21:43:46.810010Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-12-12T21:43:46.810013Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-12-12T21:43:46.810020Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace. Possibly the work of Russian air defence.",
      "timestamp": "2025-12-12T21:43:46.810024Z"
    },
    {
      "original": "Russian forces have captured the village of Synkivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~389.\nTotal land area: ~1.64 km².\nThe fighting for Synkivka lasted approximately 2 years, 5 months.",
      "timestamp": "2025-12-12T21:43:46.810029Z"
    },
    {
      "original": "Russian forces have captured the village of Lyman, Bilyi Kolodyaz direction, Kharkiv Oblast.\nPre-war population: ~542.\nTotal land area: ~1.93 km².\nThe fighting for Lyman lasted approximately 16 days.",
      "timestamp": "2025-12-12T21:43:46.810034Z"
    },
    {
      "original": "1 Tu-95MS strategic bomber just carried out a launch maneuver over Penza Oblast while redeploying from Olenya Airbase to Engels-2 Airbase.",
      "timestamp": "2025-12-12T21:43:46.810038Z"
    },
    {
      "original": "Iskander threat from Bryansk Oblast",
      "timestamp": "2025-12-12T21:43:46.810043Z"
    },
    {
      "original": "1 Tu-95MS strategic bomber just carried out a launch maneuver over Penza Oblast while redeploying from Olenya Airbase to Engels-2 Airbase.",
      "timestamp": "2025-12-12T21:43:46.810046Z"
    },
    {
      "original": "The launch maneuvers were carried out 10 minutes ago.\nIf they were real, Kh-101 cruise missiles should enter Ukrainian airspace in the next 40 minutes.\nRemember, last time there was a missile attack, additional launches were carried out at around this time.",
      "timestamp": "2025-12-12T21:43:46.810052Z"
    },
    {
      "original": "I wrote about this during the previous attack, and I am doing it again now because its become clear. In recent strikes, Russia has clearly changed its tactics for carrying out large scale missile attacks on Ukraine involving Tu-95MS/Tu-160M strategic bombers. \nFor the past 3 to 4 years, Olenya Air Base served as the main base for combat flights, with bombers taking off from there ahead of any strike. Dyagilevo and Engels 2 were also used in combat strikes.\nNow the pattern has changed. Bombers take off directly from the Far East already ready for combat and fly towards launch zones in western Russia, where they launch cruise missiles at Ukraine. After that, the aircraft land at Engels 2 to refuel and rearm before returning to the Far East.",
      "timestamp": "2025-12-12T21:43:46.810058Z"
    },
    {
      "original": "Unidentified missile in Sumy Oblast",
      "timestamp": "2025-12-12T21:43:46.810061Z"
    },
    {
      "original": "Unidentified missile in Sumy Oblast",
      "timestamp": "2025-12-12T21:43:46.810064Z"
    },
    {
      "original": "Flying to Poltava on a ballistic trajectory. Could be EW.",
      "timestamp": "2025-12-12T21:43:46.810067Z"
    },
    {
      "original": "Flying to Poltava on a ballistic trajectory. Could be EW.",
      "timestamp": "2025-12-12T21:43:46.810070Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-12T21:43:46.810073Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-12T21:43:46.810076Z"
    },
    {
      "original": "This was Russian S-300/400 air defence targeting Ukrainian fighter jets",
      "timestamp": "2025-12-12T21:43:46.810079Z"
    },
    {
      "original": "I wrote about this during the previous attack, and I am doing it again now because its become clear. In recent strikes, Russia has clearly changed its tactics for carrying out large scale missile attacks on Ukraine involving Tu-95MS/Tu-160M strategic bombers.…",
      "timestamp": "2025-12-12T21:43:46.810082Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace. The launch maneuvers were simulated with electronic warfare.",
      "timestamp": "2025-12-12T21:43:46.810085Z"
    },
    {
      "original": "I'm aware of Deepstate's update on Kupyansk, and quite frankly I don't care.\nThose who map UKRAINIAN advances based off a UKRAINIAN source who is under constant pressure from the SBU are naive at best, and propagandists at worst.\nI'm not saying this map isn't correct, as the situation is indeed critical for Russian forces in the city, but we will need a lot more to say for certain that this is true.",
      "timestamp": "2025-12-12T21:43:46.810090Z"
    },
    {
      "original": "Israel Failed To End Iran’s Missile Program, Islamic Republic Could Fire 2,000 At Once In Next War\nIsrael believes that the damage it inflicted on Iran’s ballistic missile program during the 12-day June war was less severe than initially assessed, Al-Monitor reported on December 11.\nThe report revealed that Iran currently possesses around 2,000 heavy ballistic missiles, roughly the same number it had on the eve of the war.\nThe Israeli military intelligence chief Maj. Gen. Shlomi Binder shared this information with visiting United States Ambassador to the United Nations Mike Waltz earlier this week, in a sign that Israel is again urging Washington to act against Iran.\n“This is a threat that Israel will not be able to accept for long, and we must coordinate with the Americans the red lines and actions we will take in the future, perhaps even in the near future,” a source familiar with the matter told Al-Monitor.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340469Z"
    },
    {
      "original": "Turkey Shows Ambition With Test Of ‘Hypersonic Missile’ With 1,000 Kilometer Range (Video)\nTurkey has conducted another successful test of the Tayfun [Turkish for Typhoon] ballistic missile system developed locally by Roketsan, the Anadolu Agency reported on December 12.\nThe state-run news agency didn’t provide any details about the test. It is known, however, that such tests are usually held at a range in the Turkey Black Sea province of Rize.\nCommenting on the successful missile test, Haluk Gorgun, chairman of the country’s Defense Industry Agency, said on X that the “the heavens had once again borne witness to the will of the people.”\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340486Z"
    },
    {
      "original": "Alawites’ General Strike Enters Final Day Amid Rising Tensions With Syrian Government (Videos)\nA general strike by the Alawite community on the Syrian coast and nearby areas entered its fifth and final day on December 12, amid rising tensions with the country’s Islamist-led Interim Government.\nThe strike began on December 8, the first anniversary of the fall of the regime of former President Bashar al-Assad, a member of the community himself.\nIt was called by Sheikh Ghazal Ghazal, head of the Supreme Islamic Alawite Council in Syria and Abroad, who denounced attempts by the government to force Alawites to celebrate the occasion despite facing discrimination and violence since the fall of the Assad regime.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340495Z"
    },
    {
      "original": "Alawites’ General Strike Enters Final Day Amid Rising Tensions With Syrian Government (Videos)\nA general strike by the Alawite community on the Syrian coast and nearby areas entered its fifth and final day on December 12, amid rising tensions with the country’s Islamist-led Interim Government.\nThe strike began on December 8, the first anniversary of the fall of the regime of former President Bashar al-Assad, a member of the community himself.\nIt was called by Sheikh Ghazal Ghazal, head of the Supreme Islamic Alawite Council in Syria and Abroad, who denounced attempts by the government to force Alawites to celebrate the occasion despite facing discrimination and violence since the fall of the Assad regime.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340505Z"
    },
    {
      "original": "Russia-Ukraine Strikes: Substations Down, Cargo Ship Hit, Oil Refinery Fire\nOn the night of December 11-12, Russia and Ukraine conducted another exchange of strikes. Russian forces launched 80 attack UAVs against Ukraine, while Ukrainian forces struck targets in Russia. According to official reports, Russian air defense destroyed 90 drones during the latter attack. Russia's main strike was focused on energy infrastructure, particularly in the Odesa region and the city of Pavlohrad. Ukrainian drones struck a major Yaroslavl oil refinery—causing a fire—and targeted a residential building in Tver.\nIn Odesa, two substations were hit—one in the Kotovsky district and one in Cheremushky—leading to a partial power outage in the city. Additionally, a Turkish cargo ship in the port of Chornomorsk (Odesa region) was damaged. According to some reports, the vessel was transporting military cargo.\nRead more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340512Z"
    },
    {
      "original": "Russia-Ukraine Strikes: Substations Down, Cargo Ship Hit, Oil Refinery Fire\nOn the night of December 11-12, Russia and Ukraine conducted another exchange of strikes. Russian forces launched 80 attack UAVs against Ukraine, while Ukrainian forces struck targets in Russia. According to official reports, Russian air defense destroyed 90 drones during the latter attack. Russia's main strike was focused on energy infrastructure, particularly in the Odesa region and the city of Pavlohrad. Ukrainian drones struck a major Yaroslavl oil refinery—causing a fire—and targeted a residential building in Tver.\nIn Odesa, two substations were hit—one in the Kotovsky district and one in Cheremushky—leading to a partial power outage in the city. Additionally, a Turkish cargo ship in the port of Chornomorsk (Odesa region) was damaged. According to some reports, the vessel was transporting military cargo.\nRead more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340520Z"
    },
    {
      "original": "Russian Army Has Already Secured Third Of Huliaipole (Videos)\nOn December 12, the Russian military expanded its control in Huliaipole in Zaporozhye, securing at least a third of the key city.\nThe Vostok [East] Group of Forces stormed the eastern and northeastern parts of the city, taking control of Peschanya Street, after crossing the Haichur River a day earlier. Within 24 hours, Russian troops managed to reach the Specialized School at the city center after capturing large parts of Mira, Velyka and Urozhaina streets.\nCurrently 30% of Huliaipole is under Russian control. Around 2,4 square kilometers within the city have been captured, according to preliminary reports.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340529Z"
    },
    {
      "original": "Russian Army Has Already Secured Third Of Huliaipole (Videos)\nOn December 12, the Russian military expanded its control in Huliaipole in Zaporozhye, securing at least a third of the key city.\nThe Vostok [East] Group of Forces stormed the eastern and northeastern parts of the city, taking control of Peschanya Street, after crossing the Haichur River a day earlier. Within 24 hours, Russian troops managed to reach the Specialized School at the city center after capturing large parts of Mira, Velyka and Urozhaina streets.\nCurrently 30% of Huliaipole is under Russian control. Around 2,4 square kilometers within the city have been captured, according to preliminary reports.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340541Z"
    },
    {
      "original": "Kyiv’s High-Stakes Strategy: Rumors of a “Dirty Bomb” Resurface\nNew details have emerged about Kiev's secret activities. Why were spent nuclear fuel and protective equipment delivered to Ukraine? Senior Ukrainian officials are involved in preparations for a monstrous provocation.\nRecently, the operational situation on the Ukrainian front has not favored Kiev. The army is suffering setbacks on key sections of the front, and human reserves are dwindling daily. Massive Russian drone strikes are destroying the rear infrastructure daily. Explosions can be heard at night in most regions of Ukraine. The difficult economic situation could become critical if the European Union stops providing sufficient subsidies.\nThe world community is no longer shocked by the current fighting in Ukraine as it was in 2022. The media's impact is waning. Many now view the Ukrainian people's role as martyrs, led by the indomitable President Volodymyr Zelensky, with irony. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-12T21:43:47.340560Z"
    },
    {
      "original": "NORTHERN FRONT UNRAVELS: KYIV'S LAST RESERVES FAIL TO HALT RUSSIAN ADVANCE",
      "timestamp": "2025-12-12T21:43:47.340565Z"
    }
  ],
  "script_run_time": "2025-12-12T21:43:47.341325Z"
}