{
  "messages": [
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-12-16T07:37:04.824801Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря \n➡️\n у напрямку Вилково.",
      "timestamp": "2025-12-16T07:37:04.824821Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-12-16T07:37:04.824829Z"
    },
    {
      "original": "🛵\n Херсонщина: БпЛА в напрямку Зеленівки зі сходу.",
      "timestamp": "2025-12-16T07:37:04.824834Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-16T07:37:04.824839Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-16T07:37:04.824847Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-16T07:37:04.824852Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на сході Харківщини на/повз Великий Бурлук в північно-західному напрямку.",
      "timestamp": "2025-12-16T07:37:04.824857Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА вздовж оз.Сасик в напрямку Татарбунар.",
      "timestamp": "2025-12-16T07:37:04.824862Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА вздовж оз.Сасик в напрямку Татарбунар.",
      "timestamp": "2025-12-16T07:37:04.824866Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА курсом на Арциз, Сарату.",
      "timestamp": "2025-12-16T07:37:04.824874Z"
    },
    {
      "original": "🛵\n Одещина: нові БпЛА з акваторії Чорного моря в напрямку Одеси/Чорноморська.",
      "timestamp": "2025-12-16T07:37:04.824879Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА на сході в напрямку на/повз Чаплине, на південному заході - в напрямку на/повз Нікополь курсом на захід.",
      "timestamp": "2025-12-16T07:37:04.824884Z"
    },
    {
      "original": "🛵\n Чернігівщина: нові групи БпЛА з півночі \n➡️\n курсом на Холми, Короп.",
      "timestamp": "2025-12-16T07:37:04.824890Z"
    },
    {
      "original": "🛵\n Одещина: нові БпЛА з акваторії Чорного моря в напрямку Одеси/Чорноморська.",
      "timestamp": "2025-12-16T07:37:04.824895Z"
    },
    {
      "original": "🛵\n Ще групи БпЛА із акваторії Чорного моря \n➡️\n у бік Одеси!",
      "timestamp": "2025-12-16T07:37:04.824900Z"
    },
    {
      "original": "🛵\n Харківщина: БпЛА з Сумщини \n➡️\n курсом на Коломак.",
      "timestamp": "2025-12-16T07:37:04.824906Z"
    },
    {
      "original": "🛵\n Ще групи БпЛА із акваторії Чорного моря \n➡️\n у бік Одеси!",
      "timestamp": "2025-12-16T07:37:04.824912Z"
    },
    {
      "original": "🛵\n Нові групи БпЛА з акваторії Чорного моря \n➡️\n на Одещину.",
      "timestamp": "2025-12-16T07:37:04.824918Z"
    },
    {
      "original": "Швидкісна ціль курсом на Запоріжжя!",
      "timestamp": "2025-12-16T07:37:04.824921Z"
    },
    {
      "original": "🛵\n Черкащина: БпЛА \n➡️\n у напрямку Золотоноші.",
      "timestamp": "2025-12-16T07:37:04.824927Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 57 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 16 грудня (з 18.00 15 грудня) противник атакував 69-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Орел, Приморсько-Ахтарськ, Міллєрово– рф., Гвардійське - ТОТ АР Криму, близько 40 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 57 ворожих БпЛА типу Shahed, Гербера і дрони інших типів на півдні та сході країни.\nЗафіксовано влучання 10 ударних БпЛА на 7 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-16T07:37:04.824947Z"
    },
    {
      "original": "🛵\n БпЛА із акваторії Чорного моря \n➡️\n на Одещину.",
      "timestamp": "2025-12-16T07:37:04.824952Z"
    },
    {
      "original": "Ukrainian HIMARS rockets have once again targeted the Belgorod Power Plant in Belgorod City. A large fire was seen burning following the impacts.\nCoordinates: 50.59935, 36.61694",
      "timestamp": "2025-12-16T07:37:05.412342Z"
    },
    {
      "original": "Ukrainian HIMARS rockets have once again targeted the Belgorod Power Plant in Belgorod City. A large fire was seen burning following the impacts.\nCoordinates: 50.59935, 36.61694",
      "timestamp": "2025-12-16T07:37:05.412354Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again attacked targets in Dnipropetrovsk Oblast.\nAt least 12 Gerans targeted the railway junction in the city of Pyatykhatky (48.41386, 33.69432). Media 2 shows some of the damage from the blast waves. \nAt least 10 Gerans struck an unknown target in the village of Khoroshe.\nAt least 4 Gerans targeted the \"Svitlo Shakhtarya\" 150 kV electrical substation at the Stepnaya Mine near the city of Shakhtarske (48.37662, 36.36671). Media 1 shows one of the impacts and media 3 shows a fire burning afterwards.",
      "timestamp": "2025-12-16T07:37:05.412361Z"
    },
    {
      "original": "Overnight, Russian Geran-2 drones once again attacked targets in Dnipropetrovsk Oblast.\nAt least 12 Gerans targeted the railway junction in the city of Pyatykhatky (48.41386, 33.69432). Media 2 shows some of the damage from the blast waves. \nAt least 10 Gerans struck an unknown target in the village of Khoroshe.\nAt least 4 Gerans targeted the \"Svitlo Shakhtarya\" 150 kV electrical substation at the Stepnaya Mine near the city of Shakhtarske (48.37662, 36.36671). Media 1 shows one of the impacts and media 3 shows a fire burning afterwards.",
      "timestamp": "2025-12-16T07:37:05.412367Z"
    },
    {
      "original": "Currently live with \nHagueFugitive\n and \nHudson War Mapping\n. Come join! \nhttps://www.youtube.com/watch?v=YnlMQJetDDc",
      "timestamp": "2025-12-16T07:37:05.412373Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance, making more progress in and around Myrnohrad.\nIn the southeast, Russian forces continued advancing north towards Myrnohrad city centre and captured the rest of the 3-story buildings. Fighting is now ongoing for the City Central Hospital and the adjacent row of apartment buildings. Russian forces also advanced further northwest and linked up with assault groups in the northwestern streets of the city, while other forces cleared the remaining pockets of Ukrainian resistance in the treelines to the southwest. Additionally, the Russians reached the city centre from the east, advancing from the area of the paintball field to the stadium, capturing additional low-rise residential areas there.\nTo the northwest, Russian forces continued advancing east through Svitle and have captured most of the rest of the village. They also managed to consolidate in the former Novator Mine, fully securing the northern outskirts of Myrnohrad.\nTo the west, Russian forces continued their assault operations north of Pokrovsk and captured new positions in two different treelines, including one along the road to Hryshyne. \n+ ~6.86 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412380Z"
    },
    {
      "original": "Russia is currently completing its preparations for the next large-scale, combined missile and drone attack on Ukraine. \n- At least 3 Tu-95MS strategic bombers are redeploying from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast after being equipped with Kh-101 cruise missiles.\n- 1 Tu-95MS has been equipped with Kh-101 missiles at Engels-2 Airbase.\n- 3 Tu-160 strategic bombers have been equipped with Kh-101 missiles at Ukrainka Airbase. They will likely take part in the attack by flying from the far east to the launch lines.\n- 4-6 MiG-31K fighters have been equipped with Kinzhal hypersonic aeroballistic missiles at Savasleika Airbase, Nizhny Novgorod Oblast.\n- Iskander-M ballistic missiles have been delivered to OTRK installations in Kursk Oblast, Bryansk Oblast, Voronezh Oblast, and Rostov Oblast.\n- Iskander-K cruise missiles have been delivered to OTRK installations in Kursk Oblast and Voronezh Oblast.\n- Accumulation of Geran-2 and Gerbera drones has been ongoing at all major launch points surrounding Ukraine, with more than 500 ready for use.\n- There is no confirmed information about the possible usage of Kalibrs during this upcoming attack, however this is not ruled out.\nThe highest threat is for the night/morning of Tuesday/Wednesday; however, it could take place at any of the next 3 nights/mornings, including tonight. \nEnergy infrastructure in the western regions (especially Ivano-Frankivsk and Lviv Oblasts) and Kyiv Oblast are the most likely targets.",
      "timestamp": "2025-12-16T07:37:05.412392Z"
    },
    {
      "original": "Russia is currently completing its preparations for the next large-scale, combined missile and drone attack on Ukraine.   - At least 3 Tu-95MS strategic bombers are redeploying from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast after being…",
      "timestamp": "2025-12-16T07:37:05.412395Z"
    },
    {
      "original": "* This is not a complete list of activity. Changes will be made, some things listed here may be being prepared for something else. This is meant to serve as a minimum for current, confirmed activity.",
      "timestamp": "2025-12-16T07:37:05.412399Z"
    },
    {
      "original": "Deepstate has officially joined the linear warfare bros. \nPressure from the SBU must be high.",
      "timestamp": "2025-12-16T07:37:05.412403Z"
    },
    {
      "original": "6 Grom-E1 rocket-powered glide-bombs and at least 18 Geran-2 drones targeted the Zatoka Bridge in Odesa Oblast. All of the glide-bombs and most of the drones impacted.  Coordinates: 46.07611, 30.46972",
      "timestamp": "2025-12-16T07:37:05.412409Z"
    },
    {
      "original": "Footage showing yesterday's combined glide-bomb and Geran-2 drone attack on the Zatoka railway and road bridge in Odesa Oblast.\nThis bridge is the only connector in Ukraine between southern Odesa Oblast and the rest of the country.",
      "timestamp": "2025-12-16T07:37:05.412413Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance in several different areas, exploiting the fall of Siversk to make additional progress. \nIn the southeast, following the fall of Siversk and the withdrawal of Ukrainian formations from positions northwest of the city, Russian forces began a two-axis push further west along the tactical heights. They were able to quickly capture the remaining positions north of the Siversk - Lyman highway and began advancing south down the treelines to the rear of the chalk quarry. \nOther forces advanced directly west from Siversk, capturing the trenches just outside the city and quickly entering the chalk quarry from the east. Ukrainian units continued to withdraw further west, while covering Siversk itself with FPV drones in an attempt to disrupt Russian logistics and slow their advance. Since then, the Russians have continued to push west along the tactical heights and occupied new positions in the forest plantations and treelines further west, almost levelling the frontline between Platonivka and Sviato-Pokrovske. Additionally, they were able to complete the capture of Sviato-Pokrovske - establishing control over its western outskirts - and are now engaged in battles for the eastern outskirts of Riznykivka.\nTo the northwest, Russian forces advanced from the strongpoints along the highway and entered the first houses of Ozerne, capturing its northern street. Further west, other forces broke through to the northern bank of the Siverskyi Donets River and entrenched in the northwestern-most houses of Ozerne. \nIn the northwest, Russian forces continued to expand their zone of control in Dibrova and managed to fully capture the eastern half of the village. Other forces continued slowly advancing through the forests to the north, capturing additional positions southwest and west of the lakes.\n+ ~15.43 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412420Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction and on the northeastern flank of Kostyantynivka, Russian forces continued their intensified assault operations and have made significant progress over the past week.\nIn the southwest, following their earlier infiltrations, Russian forces managed to consolidate in the treelines north of Virolyubivka and in the forest on the eastern bank of the reservoir east of Klynove. They then entered Virolyubivka and established control over the northern part of the village. Additionally, under heavy artillery and MLRS cover, Russian forces began a new push north from Maiske in the direction of Markove - Fedorivka, and managed to consolidate in new treeline positions north of Maiske and the forest to the northwest. Some soldiers have infiltrated further, entering the western houses of Markove and reaching the forest plantations to the west.\nIn the northeast, Russian forces began advancing southwest from Vasyukivka. They captured new positions in five different treelines and some adjacent forested areas and are threatening to cut off some of the last remaining 2023 fortifications in this sector.  Additionally, the Russians managed to eliminate part of the salient north of Vasyukivka, consolidating in the trenches there, and began a new push further north. There, theyy were able to capture the village of Pazeno and advanced up two treelines, reaching and establishing control over a large part of the forest to the north.\n+ ~20.81 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412426Z"
    },
    {
      "original": "A Ukrainian sea drone likely struck a Russian Varshavyanka-class submarine stationed at Novorossiysk Naval Base, Krasnodar Krai.\nThe submarine, which can launch up to 6 Kalibr cruise missiles, reportedly received critical damage. Based on previous satellite imagery, the drone exploded next to the submarine’s stern.\nAdditionally, according to unconfirmed information, other ships were hit at the port, however there is no visual evidence to support this yet. \nThe head of the Black Sea Fleet Press Service responded to the claims by stating that none of the ships stationed at Novorossiysk were undamaged and are carrying out their duties as usual.",
      "timestamp": "2025-12-16T07:37:05.412433Z"
    },
    {
      "original": "Russia is currently completing its preparations for the next large-scale, combined missile and drone attack on Ukraine.   - At least 3 Tu-95MS strategic bombers are redeploying from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast after being…",
      "timestamp": "2025-12-16T07:37:05.412436Z"
    },
    {
      "original": "The next large-scale, combined Russian missile and drone attack will probably take place tomorrow morning, between 00:00 and 08:00 Kyiv time. \nIt won't be anything special - just another normal-sized attack involving strategic bombers, ballistic missiles and Geran-2 drones.\n3 Tu-160M strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Belaya Airbase, Irkutsk Oblast after being equipped with Kh-101 cruise missiles. They will then fly from Belaya Airbase to their launch lines in western Russia in order to carry out their combat sorties. \nThe 2 (not 3) Tu-95MS strategic bombers which redeployed from Ukrainka Airbase to Engels-2 Airbase, Saratov Oblast, yesterday have subsequently flown to Olenya Airbase where they will take off from during the next attack. 1 other Tu-95MS already stationed at Olenya was also equipped with missiles (delivered by an IL-76MD cargo plane) today. \n1 Tu-95MS stationed at Engels-2 Airbase is also equipped with missiles. \nThus, there are at least 4 Tu-95MS and 3 Tu-160M strategic bombers equipped and ready for usage. If Russia were to use this number of bombers, the number of Kh-101 cruise missiles launched would likely be somewhere around 30-40, although this is a very rough estimate.\nThere are no changes to the MiG-31K fighters stationed at Savasleika Airbase, Nizhny Novgorod Oblast. 4-6 Kinzhal hypersonic aeroballistic missiles are expected to be used.\nIskander-M ballistic missiles and possibly Iskander-K cruise missiles will be used as well. Additional deliveries of Iskander-Ms to OTRK installations near Taganrog, Rostov Oblast has been recorded. \nAt least 500 Geran-2 drones are expected to be used too, which have been accumulated at all major launch sites surrounding Ukraine. \nThe main targets for the strike will likely be energy infrastructure in the western regions of Ukraine (highest threat to Lviv and Ivano-Frankivsk Oblasts) and in Kyiv Oblast.",
      "timestamp": "2025-12-16T07:37:05.412446Z"
    },
    {
      "original": "Consequences of a Russian KAB glide-bomb strike on the city of Druzhkivka, Donetsk Oblast. \nI find it crazy that civilian truck drivers are still doing their jobs less than 10 km from the frontline. The whole of Ukrainian-controlled Donetsk Oblast should've been evacuated months ago.",
      "timestamp": "2025-12-16T07:37:05.412450Z"
    },
    {
      "original": "Odesa Oblast came under attack for the fifth night in a row. \nAt least 15 Geran-2 drones attacked targets in the southern suburbs of Odesa City, in the area of Sarata, and in Zatoka. A significant portion of the drones were shot down, especially over Odesa City, due to the format they were flying in (one after another). \nA large fire was seen burning at an impact site in Zatoka, as seen in the attached video.",
      "timestamp": "2025-12-16T07:37:05.412455Z"
    },
    {
      "original": "In the Khotin direction, Russian forces continue to advance and have made additional progress on the tactical heights.\nIn the east, Russian forces resumed their assault operations east of Oleksiivka, advancing down two treelines along the tactical heights, strengthening their western flank against the stronger Ukrainian defences near Varachyne. Ukrainian forces are trying to counterattack, and have also attempted to enter Oleksiivka, but so far have achieved no successes.\nIn the west, Russian forces continued to slowly advance around Andriivka. As a part of their intensified assault operations, they were able to approach the village from the northwest, capturing the rest of the gulley east of Kindrativka. Other forces then secured the northern outskirts of Andriivka and entered the northern houses of the village but were unable to consolidate and quickly withdrew due to Ukrainian drone and artillery strikes. Ukrainian forces also carried out additional unsuccessful counterattacks in Andriivka. Meanwhile, Russian artillery fire has intensified on both frontline and rear positions, significantly complicating Ukrainian logistics and their efforts at counterattacking. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412461Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued their assault operations and have made additional progress over the last week.\nIn the southwest, Russian forces continued pushing south through Lyman and reached the southern outskirts of the village. Other forces captured its eastern street, therefore completing the capture of the village. They also made additional progress in the forest to the west and captured new positions in the treelines to the east.\nTo the east, Russian forces continued to push through Vilcha, amid very heavy fighting. They were able to consolidate in the northeastern part of the town following earlier attacks and began a southward push through its eastern streets. As a result, they were able to outflank the town centre, allowing for the stronger Ukrainian positions there to be captured from three directions. From there, the Russians continued pushing towards the southern outskirts, capturing additional positions in the southern and eastern streets. Additionally, Russian forces advanced to the northeast of Vilcha, improving their positions along the highway to Vovchansk and capturing new positions in two different treelines east of the railway line.\nIn the northeast, following earlier attacks, Russian forces managed to cross a tributary of the Vovcha River from the southeastern edge of Vovchansk and entered the neighbouring village of Vovchanski-Khutory. They consolidated in the western houses in the area of Mryu Street and are now engaged in fierce battles for the western approaches to the industrial zone. \n+ ~8.03 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412467Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued to incrementally advance over the last week and have made additional progress in the direction of Khanje and Ambarne.\nRussian forces advanced from their positions in the forest plantations on the western side of the gulley and captured new positions in the treelines and forest plantations further west, pushing the Ukrainians back to the eastern approaches to Khatnje. They were also able to improve their positions northwest of Ambarne, capturing the rest of the forest plantations on the northern edge of the gulley outside the village.\n+ ~2.44 km² in favour of Russia.",
      "timestamp": "2025-12-16T07:37:05.412472Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces continue to advance on different sides of the Oskil River, making important progress in various areas.\nIn the east, Russian forces consolidated in the northwestern-most houses of Petropavlivka following the Ukrainian withdrawal from the Synkivka area. From there, they began pushing southeast along the southern bank of the Hnylytsya River, capturing additional positions in the forests and reaching the northern outskirts of Kucherivka. Other forces captured the fish farm to the west, securing most of the remaining positions in the forests outside Kupyansk. \nIn the southwest, Ukrainian forces continued advancing in southwestern Kupyansk. They consolidated in additional positions in the low-rise residential area southeast of the Yuvileynyi high-rise micro-district. They also captured the rest of the houses north of Yuvileynyi. Additionally, the Ukrainians began a new push north up the western bank of the Oskil River, reaching the central market from the south. \nTo the north, Ukrainian forces entered the territory of the City Central Hospital, capturing part of it along with the adjacent residential streets. Fierce fighting is ongoing for the main hospital building and the surrounding areas. They also managed to capture the Russian strongpoint at the bread factory and the substation in northwestern Kupyansk, as well as additional residential areas to the southeast. Additionally, the Ukrainians began advancing south down the eastern bank of the Oskil River in northern Kupyansk, capturing new positions in the low-rise residential streets there, while other assault groups pushed further south through the city centre in the direction of School No. 4. \nFurther north, Ukrainian forces managed to clear Russian positions in most of the forests southeast and northeast of Radkivka, including the pipeline exit point that the Russians previously used to infiltrate the city and bring in supplies. They also advanced west from Kindrashivka, recapturing positions in the treelines and forested areas there.\n+ ~6.26 km² in favour of Russia. \n+ ~3.01 km² in favour of Ukraine.",
      "timestamp": "2025-12-16T07:37:05.412480Z"
    },
    {
      "original": "Military Situation In Ukraine On December 15, 2025 (Maps Update)",
      "timestamp": "2025-12-16T07:37:05.984298Z"
    },
    {
      "original": "Military Situation In Ukraine On December 15, 2025 (Maps Update)",
      "timestamp": "2025-12-16T07:37:05.984309Z"
    },
    {
      "original": "Ukrainian Defenses Are Rapidly Collapsing West of Siversk (Videos)\nOn December 15, the Russian military expanded its control in the outskirts of the city of Siversk in Donetsk after defeating Kiev forces there.\nThe Yug [South] Group of Forces broke through Ukrainian defenses to the west of Siversk, securing a large area, more than 9,8 square kilometers in size, from Sviato-Pokrovske to the southwest of the city up to the T-05-13 road to the northwest of it.\nWeakened by the defeat in Siversk, Kiev forces withdrew from this area, which included a well-fortified chalk quarry, without putting up any real fight.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984321Z"
    },
    {
      "original": "Ukrainian Defenses Are Rapidly Collapsing West of Siversk (Videos)\nOn December 15, the Russian military expanded its control in the outskirts of the city of Siversk in Donetsk after defeating Kiev forces there.\nThe Yug [South] Group of Forces broke through Ukrainian defenses to the west of Siversk, securing a large area, more than 9,8 square kilometers in size, from Sviato-Pokrovske to the southwest of the city up to the T-05-13 road to the northwest of it.\nWeakened by the defeat in Siversk, Kiev forces withdrew from this area, which included a well-fortified chalk quarry, without putting up any real fight.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984330Z"
    },
    {
      "original": "Exchange of Strikes: Ukraine Faces Energy Collapse, Submarine Attacked in Novorossiysk\nOn December 14–15, Russia and Ukraine conducted another exchange of strikes. The Russian Ministry of Defense claimed to have shot down 130 Ukrainian drones, with the majority intercepted over the Astrakhan, Bryansk, and Moscow regions. Ukrainian forces announced attacks on Russian gas distribution and energy facilities, as well as striking a Russian submarine in Novorossiysk using maritime drones. In turn, the Ukrainian Air Force reported that out of 153 attack drones launched against Ukraine, 133 were intercepted and downed. The primary Russian strikes targeted energy infrastructure and railway hubs.\nThese sustained Russian attacks have left Ukraine's energy grid in critical condition, according to The Washington Post. Kyiv and the eastern regions are on the verge of a full-scale and potentially irreversible blackout. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984339Z"
    },
    {
      "original": "Exchange of Strikes: Ukraine Faces Energy Collapse, Submarine Attacked in Novorossiysk\nOn December 14–15, Russia and Ukraine conducted another exchange of strikes. The Russian Ministry of Defense claimed to have shot down 130 Ukrainian drones, with the majority intercepted over the Astrakhan, Bryansk, and Moscow regions. Ukrainian forces announced attacks on Russian gas distribution and energy facilities, as well as striking a Russian submarine in Novorossiysk using maritime drones. In turn, the Ukrainian Air Force reported that out of 153 attack drones launched against Ukraine, 133 were intercepted and downed. The primary Russian strikes targeted energy infrastructure and railway hubs.\nThese sustained Russian attacks have left Ukraine's energy grid in critical condition, according to The Washington Post. Kyiv and the eastern regions are on the verge of a full-scale and potentially irreversible blackout. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984347Z"
    },
    {
      "original": "KUPYANSK AT THE BREAKING POINT: THE DECISIVE UKRAINIAN-RUSSIAN BATTLE IN THE NORTH",
      "timestamp": "2025-12-16T07:37:05.984350Z"
    },
    {
      "original": "Russian Breakthrough In Zaporizhzhia: Ukraine Loses Pishchane\nIn the Zaporizhzhia sector, Russian troops crossed the Haichur River, seized Pishchane, and established a stable bridgehead. In the Siversk sector, the main effort is focused on clearing the heights to the west of Siversk and fighting for Zakotne and Ilyichivka. \nUkrainian and American negotiators offered an optimistic assessment of the talks in Berlin.\nRead more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984358Z"
    },
    {
      "original": "Russian Breakthrough In Zaporizhzhia: Ukraine Loses Pishchane\nIn the Zaporizhzhia sector, Russian troops crossed the Haichur River, seized Pishchane, and established a stable bridgehead. In the Siversk sector, the main effort is focused on clearing the heights to the west of Siversk and fighting for Zakotne and Ilyichivka. \nUkrainian and American negotiators offered an optimistic assessment of the talks in Berlin.\nRead more \nHERE",
      "timestamp": "2025-12-16T07:37:05.984366Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From December 15, 2025\nOn December 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-16T07:37:05.984373Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From December 15, 2025\nOn December 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-16T07:37:05.984380Z"
    }
  ],
  "script_run_time": "2025-12-16T07:37:05.985270Z"
}