{
  "messages": [
    {
      "original": "🛵\n Оновлення інформації щодо руху ворожих ударних БпЛА:\n1. БпЛА на півдні Київщини, курс - північний/північно-західний;\n2.  БпЛА на північному сході Харківщини, курс - південний;\n3. БпЛА на заході від м.Харкова, курс - південний.",
      "timestamp": "2025-08-01T11:12:48.497466Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T11:12:48.497483Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Харківщини та  Донеччини.",
      "timestamp": "2025-08-01T11:12:48.497489Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПовторні пуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-01T11:12:48.497496Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-01T11:12:48.497501Z"
    },
    {
      "original": "Швидкісна ціль на м.Харків зі сходу",
      "timestamp": "2025-08-01T11:12:48.497504Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-01T11:12:48.497510Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північний схід Харківщини.",
      "timestamp": "2025-08-01T11:12:48.497514Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Донецької, Дніпропетровської та Запорізької областей",
      "timestamp": "2025-08-01T11:12:48.497519Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 44 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 1 серпня (із 21.30 31 липня) противник атакував 72-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Міллерово, Курськ, Приморсько-Ахтарськ, рф.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 44 ворожі БпЛА на півночі, півдні, сході та в центрі країни.\nЗафіксовано влучання 28 БпЛА у 9 локаціях. Атаковано прифронтові території Харківської Донецької, Дніпропетровської областей та Київщину. \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-01T11:12:48.497537Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T11:12:48.497544Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T11:12:48.497550Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-01T11:12:48.497554Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-08-01T11:12:48.497559Z"
    },
    {
      "original": "Сумська область - загроза ударних БпЛА.",
      "timestamp": "2025-08-01T11:12:48.497562Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південному сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T11:12:48.497569Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на півночі Харківської, Донецької та Запорізької областей!\nЗалучено засоби для збиття.",
      "timestamp": "2025-08-01T11:12:48.497574Z"
    },
    {
      "original": "🚀\n🚀\nХарківська область - активність ворожої тактичної авіації! Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-01T11:12:48.497579Z"
    },
    {
      "original": "❗️\n Протягом липня 2025 року протиповітряною обороною Cил оборони знищено 6262 повітряні цілі:\n▪️\n 65 крилатих ракет Х-101/Х-55СМ;\n▪️\n 19 балістичних ракет \"Іскандер-М/KN-23\";\n▪️\n 4 крилаті ракети \"Калібр\";\n▪️\n 9 керованих авіаційних ракет Х-59/69;\n▪️\n 20 крилатих ракет \"Іскандер-К\"\n▪️\n 2990 ударні БпЛА типу Shahed;\n▪️\n 912 розвідувальних БпЛА;\n▪️\n 2243 БпЛА інших типів.\n✈️\n Авіацією Повітряних Сил впродовж червня здійснено 790 літаковильотів, зокрема:\n▪️\n близько 550 – на винищувальне авіаційне прикриття;\n▪️\n понад 160 – на вогневе ураження та авіаційну підтримку військ.\n💥\n У липні 2025 року авіацією Сил оборони України знищено 1012 повітряних цілей, уражено командні пункти, об’єкти логістичного забезпечення, а також місця скупчення живої сили та техніки противника.\n👊🏻\n Б'ємо ворога в небі й на землі!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-01T11:12:48.497600Z"
    },
    {
      "original": "Сумська область - загроза ударних БпЛА.",
      "timestamp": "2025-08-01T11:12:48.497603Z"
    },
    {
      "original": "In the Stepnohirsk Direction, Russian forces continued to make steady progress and have entered the town of Stepnohirsk.\nAfter completing the capture of Kamyanske and making advances nearby, Russian forces continued to push north on a wide front, moving uphill to the tactical heights, and capturing numerous treeline positions. They then began storming the block of high-rise buildings in the south of the town and established a foothold in its southern end. \nTo the west, Russian forces continued to advance in the village of Plavni, and completed the capture of the settlement. They also expanded their zone of control along the adjacent highway. \n+ ~9.56km² in favour of Russia.",
      "timestamp": "2025-08-01T11:12:49.025421Z"
    },
    {
      "original": "In the Prosyana Direction, Russian forces continued to advance and have crossed the border into Zaporizhzhia Oblast.\nRussian forces advanced in two areas. Most progress was made in the north, where they advanced on a wide front. The Russians continued to advance west of Zelene Pole and entered southern Temyrivka. The rest of the village fell quite quickly, with the Ukrainian withdrawing to the surrounding areas. \nTo the east, Russian forces made new progress down the treelines in the direction of Novoheorhiivka and Komyshuvakha, capturing positions in 6 different treelines. \nIn the south, Russian forces advanced from the village of Novodarivka, along the Zaporizhzhia-Donetsk Regional Border, and captured new positions in the low-lying ground. \n+ ~13.38km² in favour of Russia.",
      "timestamp": "2025-08-01T11:12:49.025435Z"
    },
    {
      "original": "Following the fall of Chasiv Yar, the remaining city administrative and military officials in Kramatorsk have begun to relocate to Dnipro. Evacuations of civilians is also being ramped up. \nIt's now clear why the Donetsk OVA Head announced the mandatory evacuation of families with children so suddenly last week - they knew Chasiv Yar was about to fall.",
      "timestamp": "2025-08-01T11:12:49.025440Z"
    },
    {
      "original": "New images from Chasiv Yar's city centre showing the extent of the damage suffered over the 16-month-long battle for the city.",
      "timestamp": "2025-08-01T11:12:49.025444Z"
    },
    {
      "original": "New images from Chasiv Yar's city centre showing the extent of the damage suffered over the 16-month-long battle for the city.",
      "timestamp": "2025-08-01T11:12:49.025447Z"
    },
    {
      "original": "Russian forces have captured the village of Zatyshok, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~62.\nTotal land area: ~0.39km².",
      "timestamp": "2025-08-01T11:12:49.025455Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given for more serious infractions such as posting uncensored gore, nudity, etc. Just use common sense and don't be a jerk, and you will be fine. \nThere will still be free-speech and people are welcome to voice their opinions whether you are Pro-Russian, Pro-Ukraine, Neutral, or anything else, but it must be done in a respectful manner. You are allowed to criticize admins, but within obvious limits. \nWhen you have a channel with many conflicting perspectives, you need stricter moderation, or otherwise it falls apart. I aim for the chat to become more productive, but also not formal. Appeals will be in DMs.",
      "timestamp": "2025-08-01T11:12:49.025460Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given…",
      "timestamp": "2025-08-01T11:12:49.025463Z"
    },
    {
      "original": "Rules are now pinned in the chat. \nhttps://t.me/AMK_Mapping_Chat/139040",
      "timestamp": "2025-08-01T11:12:49.025467Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-01T11:12:49.025470Z"
    },
    {
      "original": "Sirens in Sderot. Threat of rocket launches from Gaza.",
      "timestamp": "2025-08-01T11:12:49.025474Z"
    },
    {
      "original": "Explosion heard in Sderot",
      "timestamp": "2025-08-01T11:12:49.025477Z"
    },
    {
      "original": "1 rocket was reportedly intercepted.",
      "timestamp": "2025-08-01T11:12:49.025480Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-01T11:12:49.025493Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Gaza Airdrop Ongoing\nA multinational humanitarian airdrop is underway over Gaza airspace:\n🇦🇪\n UAE C-130 (1213)\n🇩🇪\n Germany 2x A400M (54+42, 54+39)\n🇪🇸\n Spain A400M (T.23-13)\n🇯🇴\n Jordan 2x C-130H (357, Hex: 1E3D0A)\n🇫🇷\n France C-130J (61-PR)\n@wfwitness",
      "timestamp": "2025-08-01T11:12:49.025505Z"
    },
    {
      "original": "Russian forces have captured the village of Sukhetske, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~39.\nTotal land area: ~0.32km².",
      "timestamp": "2025-08-01T11:12:49.025509Z"
    },
    {
      "original": "Russian forces have captured the village of Nykanorivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~250.\nTotal land area: ~1.35km².",
      "timestamp": "2025-08-01T11:12:49.025514Z"
    },
    {
      "original": "Russian forces have captured the village of Troyanda, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~80.\nTotal land area: ~0.20km².",
      "timestamp": "2025-08-01T11:12:49.025518Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance and have made significant progress in the direction of Pishchane. \nFollowing a series of Ukrainian counterattacks, Russian forces cleared the houses in western Stepova Novosilka which Ukraine had previously infiltrated, and pushed back down to railway line to the strongpoints in the area of the road bridge. These fortifications were subsequently captured, forcing a Ukrainian withdrawal further west, and a Russian advance further down the windbreaks on either side of the railway tracks. These positions are all on the tactical heights.\nAdditional pushes were made to the northwest, with Russian forces attacking down the treelines along the tactical heights, where they captured further positions north of the highway to Kupyansk in the treelines and forest plantations there.\n+ ~10.80km² in favour of Russia.",
      "timestamp": "2025-08-01T11:12:49.025523Z"
    },
    {
      "original": "In the Borova direction, Ukrainian forces counterattacked and regained some positions in Luhansk Oblast.\nUkrainian forces advanced from the southern forest west of Hrekivka, and cleared the adjacent treelines. They then moved south down the perpendicular treelines on the tactical heights, pushing along the western bank of the tributary of the Zherebets River, and pressuring the rear of the Russian garrison in Hrekivka. \n+ ~0.99km² in favour of Ukraine.",
      "timestamp": "2025-08-01T11:12:49.025528Z"
    },
    {
      "original": "Military Situation In Ukraine On July 31, 2025 (Maps Update)",
      "timestamp": "2025-08-01T11:12:49.544270Z"
    },
    {
      "original": "Military Situation In Ukraine On July 31, 2025 (Maps Update)",
      "timestamp": "2025-08-01T11:12:49.544283Z"
    },
    {
      "original": "ISRAEL IS ABOUT TO ANNEX GAZA",
      "timestamp": "2025-08-01T11:12:49.544287Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T11:12:49.544293Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T11:12:49.544300Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T11:12:49.544315Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T11:12:49.544329Z"
    },
    {
      "original": "Come and See: The War in Ukraine, Unfiltered. A Video Selection from July 24-31 \nIn a time flooded with relentless propaganda and misinformation, it’s increasingly difficult to discern reality. Yet, one thing remains constant—firsthand accounts and unfiltered footage that capture the raw essence of the conflict. In this compilation, we present a selection of some of the most shocking, sorrowful, and occasionally absurd moments captured from both the frontlines and the rear. No filters, no distortions—just the war as it unfolded over the past week.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T11:12:49.544337Z"
    },
    {
      "original": "Come and See: The War in Ukraine, Unfiltered. A Video Selection from July 24-31 \nIn a time flooded with relentless propaganda and misinformation, it’s increasingly difficult to discern reality. Yet, one thing remains constant—firsthand accounts and unfiltered footage that capture the raw essence of the conflict. In this compilation, we present a selection of some of the most shocking, sorrowful, and occasionally absurd moments captured from both the frontlines and the rear. No filters, no distortions—just the war as it unfolded over the past week.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T11:12:49.544345Z"
    },
    {
      "original": "Trump's Economic Warfare Targets Virtually Entire BRICS\nAfter Donald Trump once again became the President of the United States, tariffs became the new buzzword in the halls of power in Washington DC. He's using them not only against America's numerous geopolitical adversaries, but also vassals and satellite states that he wants to exploit in hopes of reinvigorating the US economy. \nHowever, the last several days of Trump's moves demonstrate his very limited understanding of the geopolitical consequences of such actions. Namely, apart from the ongoing attempts to probe Russia's and China's capabilities through economic warfare, the US government is also targeting India and Brazil (in other words, all four founding member states of what today is the rapidly growing BRICS+ format).\nUsed to cut-throat, swindler tactics of the ruthless American real estate business, Trump believes he can use the \"small carrot, big stick\" approach to resuscitate America's geopolitical dominance...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T11:12:49.544354Z"
    }
  ],
  "script_run_time": "2025-08-01T11:12:49.545264Z"
}