{
  "messages": [
    {
      "original": "🚀\nШвидкісна ціль на Чернігівщину через Сумщину",
      "timestamp": "2025-08-15T07:42:26.831080Z"
    },
    {
      "original": "🛵\n Нові групи ворожих ударних БпЛА на сході та південному сході Сумщини, курс на південь.",
      "timestamp": "2025-08-15T07:42:26.831098Z"
    },
    {
      "original": "📢\n Відбій ракетної небезпеки по областях.\n🛵\n На Сумщині зберігається загроза ударних ворожих БпЛА.",
      "timestamp": "2025-08-15T07:42:26.831105Z"
    },
    {
      "original": "☄️\n Харківська область загроза застосування балістичного озброєння.",
      "timestamp": "2025-08-15T07:42:26.831114Z"
    },
    {
      "original": "⚡\n Запорізька область  - активність  ворожих БпЛА, залучено засоби для їх збиття!",
      "timestamp": "2025-08-15T07:42:26.831119Z"
    },
    {
      "original": "📢\n Відбій загрози для Харківської області.",
      "timestamp": "2025-08-15T07:42:26.831124Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T07:42:26.831130Z"
    },
    {
      "original": "🛵\n Сумська область - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-08-15T07:42:26.831134Z"
    },
    {
      "original": "📢\n Відбій загрози для Сумської області.",
      "timestamp": "2025-08-15T07:42:26.831139Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T07:42:26.831147Z"
    },
    {
      "original": "🛵\n Чернігівська область - загроза застосування ворожих БпЛА.",
      "timestamp": "2025-08-15T07:42:26.831151Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 63 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 15 серпня (із 19.30 14 серпня) противник атакував 2-ма балістичними ракетами Іскандер-М із Воронезької та Брянської обл., 97-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Орел, Брянськ, Приморсько-Ахтарськ, Шаталово – рф. \nУдарними БпЛА атаковано прифронтові райони Харківщини, Сумщини, Донеччини, Чернігівщини, ракетами – Харківщину та Чернігівщину.\nПовітряний напад відбивали авіація, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08.00, протиповітряною обороною збито/подавлено 63 ворожі БпЛА типу Shahed і дронів-імітаторів різних типів на півночі та сході країни.\nЗафіксовано влучання ракет та 34 БпЛА на 13 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-15T07:42:26.831171Z"
    },
    {
      "original": "🛸\n На півночі Чернігівської, півдні Сумської, півночі Запорізької областей -  ворожі розвідувальні БпЛА, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-15T07:42:26.831176Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-15T07:42:26.831183Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-08-15T07:42:26.831190Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-08-15T07:42:26.831194Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-08-15T07:42:26.831198Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-15T07:42:26.831204Z"
    },
    {
      "original": "⚠\n Увага!\n🛸\n Ворожий БпЛА на півночі Київщини!\nЗалучено засоби для збиття.",
      "timestamp": "2025-08-15T07:42:26.831211Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину та Донеччину!",
      "timestamp": "2025-08-15T07:42:26.831215Z"
    },
    {
      "original": "An IL-96-300PU carrying Putin is currently airborne, flying to Anchorage Airport, Alaska, for the meeting with Trump tomorrow.",
      "timestamp": "2025-08-15T07:42:27.361622Z"
    },
    {
      "original": "The talks are set to take place at 11:30am local time on Friday.",
      "timestamp": "2025-08-15T07:42:27.361634Z"
    },
    {
      "original": "An IL-96-300PU carrying Putin is currently airborne, flying to Anchorage Airport, Alaska, for the meeting with Trump tomorrow.",
      "timestamp": "2025-08-15T07:42:27.361638Z"
    },
    {
      "original": "Correction: the plane is carrying journalists and people to set up the meeting. Putin has not left Russia yet.",
      "timestamp": "2025-08-15T07:42:27.361642Z"
    },
    {
      "original": "A Russian Su-30SM fighter crashed southeast of Snake Island in the Black Sea yesterday, likely while trying to shoot down Ukrainian UAVs flying to Crimea. \nIt belonged to the 43rd Separate Marine Assault Aviation Regiment based at Saki Airbase, Crimea. The Ukrainian Navy reported that search and rescue operations are underway to retrieve the pilots, while Russian sources report that they were killed.",
      "timestamp": "2025-08-15T07:42:27.361647Z"
    },
    {
      "original": "I tried to set up through private messages a public nuanced chat,\nHe's gone and made these public, fine I couldn't care less... \nWhy doesn't David use all the combat experience he talks about to go and actually fight ....?\nVery convenient to crop out my private message inviting him to an open and uncut interview.\nhttps://x.com/secretsqrl123/status/1956173289090359382?t=TJiQhhaUQCpcXUKLCET4AQ&s=19",
      "timestamp": "2025-08-15T07:42:27.361653Z"
    },
    {
      "original": "David D is - for some reason - using me as a reason for why he doesn't view WillyOAM as a reliable source, and why he won't join him for a podcast. \nIt's been over a year since the David-Ayden debate (which is where this whole thing started between him and me) and yet he still sees me as this boogey man in the corner. \nI'm living rent-free in his head, and its so funny. \nThese posts below are some of his from just from the last 2 days...",
      "timestamp": "2025-08-15T07:42:27.361659Z"
    },
    {
      "original": "A single HIMARS GMLRS rocket was shot down while on its way to Donetsk city. The rocket was launched from near Kramatorsk",
      "timestamp": "2025-08-15T07:42:27.361663Z"
    },
    {
      "original": "A single HIMARS GMLRS rocket was shot down while on its way to Donetsk city. The rocket was launched from near Kramatorsk",
      "timestamp": "2025-08-15T07:42:27.361667Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces broke through Ukrainian positions east of the Oskil River and entered the village of Petropavlivka.\nRussian forces from the 1st Tank Regiment spearheaded an attack west down the northern bank of the Hnylytsya River for ~3.5km, reaching and entering the southeasternmost houses of Petropavlivka. However, its unclear if they were able to capture any positions here. Soldiers from Azov, who were already stationed in the area, subsequently launched a counterattack on the approaches to Petropavlivka, which was reportedly repelled. \nFurther north, additional Russian forces began clearing  a series of trench strongpoints on the tactical heights, while other forces pushed in from the heights to the north, enveloping any remaining Ukrainian forces within this salient. \nAnother push was made to the northwest, where Russian forces broke through to the northern bank of the reservoir east of Petropavlivka, and established control over a large trench line further east.\nIt's unclear if any Ukrainian redeployments from here to Dobropillya took place, and the main reason for this sudden advance is likely a lack of supplies running over the Oskil River.\n+ ~20.80km² in favour of Russia.",
      "timestamp": "2025-08-15T07:42:27.361675Z"
    },
    {
      "original": "Early this morning, 10+ Ukrainian UAVs attacked the Syzran Oil Refinery in Samara Oblast, around 800km away from Ukraine. \nAt least five impacts were recorded, resulting in large fires breaking out that are still burning. Flights in and out of Samara Airport were temporarily suspended, and internet was shut off in some parts of the region. \nCoordinates: 53.08067, 48.39310",
      "timestamp": "2025-08-15T07:42:27.361680Z"
    },
    {
      "original": "Early this morning, 10+ Ukrainian UAVs attacked the Syzran Oil Refinery in Samara Oblast, around 800km away from Ukraine. \nAt least five impacts were recorded, resulting in large fires breaking out that are still burning. Flights in and out of Samara Airport were temporarily suspended, and internet was shut off in some parts of the region. \nCoordinates: 53.08067, 48.39310",
      "timestamp": "2025-08-15T07:42:27.361685Z"
    },
    {
      "original": "New footage showing 4 consecutive Russian Geran-2 drone strikes on a Ukrainian command post which was under construction, near the village of Byryne, Chernihiv Oblast.\nCoordinates: 52.10138, 33.37555",
      "timestamp": "2025-08-15T07:42:27.361689Z"
    },
    {
      "original": "Last night, another large-scale Russian Geran-2 drone attack was carried out on the Dobropillya area of Donetsk Oblast.\nAt least 10 impacts were recorded in and around Dobropillya, Svyatohorivka and Bilozerske, likely targeting Ukrainian units related to containing and counterattacking the breakthrough at Zolotyi Kolodyaz.",
      "timestamp": "2025-08-15T07:42:27.361698Z"
    },
    {
      "original": "Last night, another large-scale Russian Geran-2 drone attack was carried out on the Dobropillya area of Donetsk Oblast.\nAt least 10 impacts were recorded in and around Dobropillya, Svyatohorivka and Bilozerske, likely targeting Ukrainian units related to containing and counterattacking the breakthrough at Zolotyi Kolodyaz.",
      "timestamp": "2025-08-15T07:42:27.361702Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n Israeli forces are carrying out expansion works on Al-Marj hill, located on the outskirts of Wadi Hunin near Merka in southern Lebanon.\n@wfwitness",
      "timestamp": "2025-08-15T07:42:27.361709Z"
    },
    {
      "original": "North of Zolotyi Kolodyaz, these small trench systems here, according to the Ukrainians, are reinforced with concrete.\nThey say, it already takes dozens of drone drops and FPV attacks to force them out of a wood dugout. If they were to gain a foothold in these concrete trenches, it will be impossible to knock them out. That's the importance of the New Donbas Line. It was built with solutions to modern problems in mind.",
      "timestamp": "2025-08-15T07:42:27.361713Z"
    },
    {
      "original": "North of Zolotyi Kolodyaz, these small trench systems here, according to the Ukrainians, are reinforced with concrete. They say, it already takes dozens of drone drops and FPV attacks to force them out of a wood dugout. If they were to gain a foothold in these…",
      "timestamp": "2025-08-15T07:42:27.361718Z"
    },
    {
      "original": "While the main line has been breached, those types of isolated strongpoints have been formidable in the past, but of course only if they are properly manned. These trenches are probably better manned than most places considering the massive reinforcements brought in.",
      "timestamp": "2025-08-15T07:42:27.361723Z"
    },
    {
      "original": "A Shahid hit a petrol station not far from me, this was frequented by the Ukrainian military.",
      "timestamp": "2025-08-15T07:42:27.361726Z"
    }
  ],
  "script_run_time": "2025-08-15T07:42:27.763019Z"
}