{
  "messages": [
    {
      "original": "🛵\n Вишгородський р-н Київська обл.- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T16:49:53.732891Z"
    },
    {
      "original": "🛵\n Чернігів - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T16:49:53.732909Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Чернігівщини на Київщину (Броварський район).",
      "timestamp": "2025-09-09T16:49:53.732914Z"
    },
    {
      "original": "🛬\nАктивність ворожої тактичної авіації на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-09-09T16:49:53.732920Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-09T16:49:53.732925Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Чернігівщині у південно-західному напрямку.",
      "timestamp": "2025-09-09T16:49:53.732929Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Чернігівщини на Київщину (Броварський район).",
      "timestamp": "2025-09-09T16:49:53.732933Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-09T16:49:53.732940Z"
    },
    {
      "original": "🛵\n Обухівський район- загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T16:49:53.732945Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-09-09T16:49:53.732949Z"
    },
    {
      "original": "🚀\nОдещина - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-09T16:49:53.732956Z"
    },
    {
      "original": "🛸\n В районі Сум, на Харківщині(Куп'янський район) -  розвідувальні БпЛА противника, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для їх збиття.",
      "timestamp": "2025-09-09T16:49:53.732960Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-09T16:49:53.732976Z"
    },
    {
      "original": "🛬\nАктивність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-09-09T16:49:53.732983Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією в Запорізькій області.",
      "timestamp": "2025-09-09T16:49:53.732987Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі Чернігівщини(Корюківський та Чернігівський райони)  у південно-західному напрямку.",
      "timestamp": "2025-09-09T16:49:53.732993Z"
    },
    {
      "original": "🚀\n🚀\nКуп'янський район - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-09T16:49:53.732999Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією в напрямку північно-східного напрямку Харківщини.",
      "timestamp": "2025-09-09T16:49:53.733005Z"
    },
    {
      "original": "🛵\n Чернігів - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T16:49:53.733009Z"
    },
    {
      "original": "🛵\n Північ Сумщини - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-09-09T16:49:53.733013Z"
    },
    {
      "original": "Sentinel satellite imagery shows that the factory management building for the Zaporizhzhia Abrasive Plant was heavily damaged by Geran-2 drone strikes during the attacks on September 7.   Image credit: https://t.me/osint_alarm/223",
      "timestamp": "2025-09-09T16:49:54.251439Z"
    },
    {
      "original": "Here are some close-up photos of the Abrasive Plant that was hit in Zaporizhzhia.",
      "timestamp": "2025-09-09T16:49:54.251451Z"
    },
    {
      "original": "Here are some close-up photos of the Abrasive Plant that was hit in Zaporizhzhia.",
      "timestamp": "2025-09-09T16:49:54.251455Z"
    },
    {
      "original": "A series of Israeli airstrikes targeted the Hermel region, northeastern Lebanon, a short time ago.",
      "timestamp": "2025-09-09T16:49:54.251459Z"
    },
    {
      "original": "The IDF claimed that the airstrikes on northeastern Lebanon targeted Hezbollah camps, including ones used by their elite \"Radwan\" force.",
      "timestamp": "2025-09-09T16:49:54.251462Z"
    },
    {
      "original": "Sirens are again sounding in southern Israel due to the threat of Houthi UAVs. This time in the area of the Rotem Industrial Zone.",
      "timestamp": "2025-09-09T16:49:54.251465Z"
    },
    {
      "original": "Sirens are again sounding in southern Israel due to the threat of Houthi UAVs. This time in the area of the Rotem Industrial Zone.",
      "timestamp": "2025-09-09T16:49:54.251468Z"
    },
    {
      "original": "The UAV is flying west to the Dimona Nuclear Research Centre.",
      "timestamp": "2025-09-09T16:49:54.251472Z"
    },
    {
      "original": "The UAV is flying west to the Dimona Nuclear Research Centre.",
      "timestamp": "2025-09-09T16:49:54.251475Z"
    },
    {
      "original": "Israeli media reports that the UAV fell outside Dimona.",
      "timestamp": "2025-09-09T16:49:54.251478Z"
    },
    {
      "original": "This evening, Donetsk City and Makiivka came under a large-scale combined Ukrainian missile, rocket, and drone attack. Russian air defences were completely overwhelmed by the number of aerial targets, resulting in many of the cruise missiles getting through and impacting their targets. \nAmong the targets hit was the \"Topaz\" plant, where at least 4 Storm Shadow missiles impacted one after another. Additionally, the Scientific Research Institute of Complex Automation was hit, likely by Ukrainian-produced \"Peklo\" long-range jet drones. The Donetsk Metalurgical plant was also hit by at least one UAV. \nFurthermore, HIMARS GMLRS launched from the vicinity of Kramatorsk targeted Makiivka, although it's unclear if any impacted. Their goal was likely to further saturate air defence for the jet-drones and storm shadows. \nMost UAVs and jet-drones were shot down by air defence units in Donetsk, Makiivka, and Yenakijeve, but a large portion of Storm Shadow cruise missiles launched by tactical aviation over Dnipropetrovsk Oblast got through. \nUkrainian sources report that the targets were command posts used by the Russian Army, as well as the 41st Artillery Brigade, although this is currently unconfirmed.",
      "timestamp": "2025-09-09T16:49:54.251489Z"
    },
    {
      "original": "This evening, Donetsk City and Makiivka came under a large-scale combined Ukrainian missile, rocket, and drone attack. Russian air defences were completely overwhelmed by the number of aerial targets, resulting in many of the cruise missiles getting through and impacting their targets. \nAmong the targets hit was the \"Topaz\" plant, where at least 4 Storm Shadow missiles impacted one after another. Additionally, the Scientific Research Institute of Complex Automation was hit, likely by Ukrainian-produced \"Peklo\" long-range jet drones. The Donetsk Metalurgical plant was also hit by at least one UAV. \nFurthermore, HIMARS GMLRS launched from the vicinity of Kramatorsk targeted Makiivka, although it's unclear if any impacted. Their goal was likely to further saturate air defence for the jet-drones and storm shadows. \nMost UAVs and jet-drones were shot down by air defence units in Donetsk, Makiivka, and Yenakijeve, but a large portion of Storm Shadow cruise missiles launched by tactical aviation over Dnipropetrovsk Oblast got through. \nUkrainian sources report that the targets were command posts used by the Russian Army, as well as the 41st Artillery Brigade, although this is currently unconfirmed.",
      "timestamp": "2025-09-09T16:49:54.251496Z"
    },
    {
      "original": "Last night, a Russian missile strike was carried out on the city of Druzhkivka, Donetsk Oblast. 1-2 Iskander-M ballistic missiles were used, reportedly targeting an industrial zone (unconfirmed). Around 15 minutes later, another series of explosions were heard, likely from secondary detonations. \nCensorship regarding this event is unusually strong, so there is only one public video/photo showing the event, which is from a Russian channel.",
      "timestamp": "2025-09-09T16:49:54.251500Z"
    },
    {
      "original": "The channel chat is temporarily locked for new users because of a bot raid. Next time 200 scam bots raid my chat, I'd appreciate it if someone DMed me so it doesn't get like this.",
      "timestamp": "2025-09-09T16:49:54.251503Z"
    },
    {
      "original": "Explosions in Kharkiv City. KAB glide-bomb strikes.",
      "timestamp": "2025-09-09T16:49:54.251506Z"
    },
    {
      "original": "There is an increased threat of a large-scale combined Russian missile attack on Ukraine tomorrow. Currently as many as 9 Tu-95MS and Tu-160 strategic bombers are known to be equipped with Kh-101 cruise missiles at Engels-2 Airbase, Saratov Oblast, and Olenya Airbase, Murmansk Oblast.\nAdditionally, accumulations of Geran-2 drones at multiple launch points, likely for usage with missiles, has been recorded. \nThe possibility of a missile attack tomorrow is not 100%, but it is likely. The usage of Kalibrs and Iskanders is also possible.",
      "timestamp": "2025-09-09T16:49:54.251511Z"
    },
    {
      "original": "The channel chat is temporarily locked for new users because of a bot raid. Next time 200 scam bots raid my chat, I'd appreciate it if someone DMed me so it doesn't get like this.",
      "timestamp": "2025-09-09T16:49:54.251514Z"
    },
    {
      "original": "Alright, the chat is public again. New users should be able to join: \nhttps://t.me/AMKMapping_Chat",
      "timestamp": "2025-09-09T16:49:54.251518Z"
    },
    {
      "original": "There is an increased threat of a large-scale combined Russian missile attack on Ukraine tomorrow. Currently as many as 9 Tu-95MS and Tu-160 strategic bombers are known to be equipped with Kh-101 cruise missiles at Engels-2 Airbase, Saratov Oblast, and Olenya…",
      "timestamp": "2025-09-09T16:49:54.251524Z"
    },
    {
      "original": "I plan to get up early tomorrow to cover any missile strikes, so I will make an update post on any new movements some time after 6am NZ time (around 9 hours from now).",
      "timestamp": "2025-09-09T16:49:54.251527Z"
    },
    {
      "original": "This video went semi-viral today, with people using it to claim that Palestinian armed resistance in the West Bank is resurging once again. \nOne thing to realise is that following Israel's Operation Iron Walls, the Palestinian militant cells in the West Bank have mostly either been dismantled or dispersed out of major population centres. The IDF still occupies the two main centres of resistance: Tulkarm and Jenin. I estimate that there were roughly 500 members of the Jenin Battalion and the different groups in Tulkarm as of late 2024, all of which are now dead, disarmed, or no longer operating in either city. \nInstead, we have seen a shift to operations in the surrounding villages, especially in Jenin Governorate, which eventually prompted the IDF to expand Operation Iron Walls to those areas. So as of now, there are still probably quite a few militant cells active in the northern West Bank, but they will all be disorganised and disconnected, mostly dormant, waiting for the Israeli operations to end, so they can make some form of attempts at reconstructing back in major population centres. The only other cities which have active fighters in them would be Nablus, Tubas, and the town of Tamoun, but due to repeated Israeli storming operations this year in Tamoun and Tubas, and in 2022-2023 in Nablus, these groups are largely dismantled. \nSo, what about this video? Well, it claims to show Palestinian Islamic Jihad (PIJ) fighters operating freely in the West Bank. Because of these Israeli operations and the inability for any larger groupings of fighters to gather right now, it is likely an old video filmed in the Jenin Refugee Camp, and possibly with other areas spliced together, for propaganda effect. As I've said before, this doesn't necessarily mean these groups won't return to more organised, almost Hamas-style, resistance in the future after regrouping and recruiting new young fighters to refill their ranks, but right now this seems practically impossible to me.",
      "timestamp": "2025-09-09T16:49:54.251533Z"
    },
    {
      "original": "Unconfirmed reports state that at least four Israeli soldiers were killed in the ambush in Jabalia earlier. Some sources state that a tank drove over an IED, while others say that an IED was hurled into the tank.",
      "timestamp": "2025-09-09T16:49:54.251536Z"
    },
    {
      "original": "The IDF confirmed that four Israeli soldiers were killed in the ambush on an Israeli tank in Jabalia, Northern Gaza, yesterday.",
      "timestamp": "2025-09-09T16:49:54.251539Z"
    }
  ],
  "script_run_time": "2025-09-09T16:49:54.658796Z"
}