{
  "messages": [
    {
      "original": "🚀\nКР змінила курс на Житомирщину",
      "timestamp": "2025-08-30T07:23:27.692960Z"
    },
    {
      "original": "🚀\nм.Черкаси!!! В укриття!!",
      "timestamp": "2025-08-30T07:23:27.692979Z"
    },
    {
      "original": "🚀\nКР на Черкащині, курс на захід",
      "timestamp": "2025-08-30T07:23:27.692985Z"
    },
    {
      "original": "🚀\nКР на Вінничину",
      "timestamp": "2025-08-30T07:23:27.692990Z"
    },
    {
      "original": "🚀\nКР змінила курс на Житомирщину",
      "timestamp": "2025-08-30T07:23:27.692995Z"
    },
    {
      "original": "🚀\nКР курс на Черкаси",
      "timestamp": "2025-08-30T07:23:27.692999Z"
    },
    {
      "original": "⚠\nУвага!\n🛵\n Київ - загроза застосування ворогом ударних БпЛА",
      "timestamp": "2025-08-30T07:23:27.693006Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-30T07:23:27.693010Z"
    },
    {
      "original": "🛵\nЧернігівська область (Ніжинський р-н ) - загроза застосування ворогом ударних БпЛА",
      "timestamp": "2025-08-30T07:23:27.693015Z"
    },
    {
      "original": "🛵\nКиївська область (Бориспольський р-н) - загроза застосування ворогом ударних БпЛА",
      "timestamp": "2025-08-30T07:23:27.693020Z"
    },
    {
      "original": "⚠\nУвага!\n🛵\n Київ - загроза застосування ворогом ударних БпЛА",
      "timestamp": "2025-08-30T07:23:27.693032Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 548 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 30 серпня (із 19.00 29 серпня) противник завдав масованого удару по території України із застосуванням ударних БпЛА, ракет повітряного, наземного та морського базування. Загалом, під час удару,  радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 582 засобів повітряного нападу:\n- 537 ударних БпЛА типу Shahed і безпілотників-імітаторів різних типів із напрямків Курськ, Брянськ, Міллерово, Орел, Шаталово, Приморсько-Ахтарськ – рф.;\n- 8 балістичних ракет Іскандер-М/KN-23 із Ростовської обл., Краснодарського краю – рф.;\n- 37 крилатих/авіаційних ракет повітряного, наземного та морського базування: Х-101, Калібр, Іскандер-К, Х-59 (райони пусків із Саратовської обл. – рф., акваторії Чорного моря та ТОТ Запорізкої обл.).\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 548 повітряних цілей:\n- 510 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів;\n- 6 балістичних ракет Іскандер-М/KN-23;\n- 32 крилаті/авіаційні ракети Х-101, Калібр, Іскандер-К, Х-59.\nЗафіксовано влучання 5 ракет та 24 ударних БпЛА на 7 локаціях, падіння збитих (уламки) на 21 локації.\n❗️\nАтака триває, в повітряному просторі ще декілька ворожих БпЛА. Дотримуйтесь правил безпеки, перебувайте в укриттях!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-30T07:23:27.693057Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА на Чернігівщині, Сумщині! Залучено засоби для їх збиття.",
      "timestamp": "2025-08-30T07:23:27.693062Z"
    },
    {
      "original": "🛵\n Конотопський район - ударний БпЛА в західному напрямку.",
      "timestamp": "2025-08-30T07:23:27.693066Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-30T07:23:27.693074Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-30T07:23:27.693078Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-30T07:23:27.693083Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-30T07:23:27.693087Z"
    },
    {
      "original": "🛵\n Чернігівщина - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-30T07:23:27.693094Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-30T07:23:27.693098Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння",
      "timestamp": "2025-08-30T07:23:27.693104Z"
    },
    {
      "original": "To be honest, I can see why Bullying is needed.",
      "timestamp": "2025-08-30T07:23:28.333853Z"
    },
    {
      "original": "To be honest, I can see why Bullying is needed.",
      "timestamp": "2025-08-30T07:23:28.333869Z"
    },
    {
      "original": "What's funny is that I ratio'd the fuck out of the guy promoting this ridiculous theory that was put forth. \nDo you think he was just mad I put him as a C-tier on my Ukraine war mapping tierlist? \n🤣",
      "timestamp": "2025-08-30T07:23:28.333877Z"
    },
    {
      "original": "What's funny is that I ratio'd the fuck out of the guy promoting this ridiculous theory that was put forth. \nDo you think he was just mad I put him as a C-tier on my Ukraine war mapping tierlist? \n🤣",
      "timestamp": "2025-08-30T07:23:28.333883Z"
    },
    {
      "original": "Ukrainian forces have re-established control over the village of Rubizhne, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~105.\nTotal land area: ~0.38km².",
      "timestamp": "2025-08-30T07:23:28.333891Z"
    },
    {
      "original": "Russian forces have captured the village of Serednje, Lyman direction, Donetsk Oblast.\nPre-war population: ~156.\nTotal land area: ~1.36 km².",
      "timestamp": "2025-08-30T07:23:28.333896Z"
    },
    {
      "original": "Around an hour ago, Ukraine attempted a Neptune missile strike on Krasnodar Krai.   Four Russian S-300 air defence missiles were launched from the area of Cape Chauda, Crimea, intercepting them. Traffic on the Kerch Straight Bridge was briefly closed due to…",
      "timestamp": "2025-08-30T07:23:28.333899Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian Neptune anti-ship missile launcher near the village of Lyubyts'ke, Zaporizhzhia Oblast. This is the same Neptune system which launched missiles at Crimea. It was destroyed just a few hours later. \nThis is the first ever recorded destruction of a Neptune system. The footage also clearly demonstrates the effects of the Iskander's shrapnel, even though it impacted away from its target.",
      "timestamp": "2025-08-30T07:23:28.333904Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations, retaking previously lost positions in both Kharkiv and Donetsk Oblast.\nAfter Ukrainian forces from Azov attacked into and briefly established control over the village of Novomykhailivka, Russian forces regrouped to the east and northeast, before launching their own attacks. They were able to re-enter the village from the east, capturing positions in the first houses, and also established control over the agricultural buildings on the northern outskirts.\nTo the west, Russian forces resumed their attacks on Hlushchenkove. They were able to cross the Nitrius River and secured a foothold in the southern part of the settlement.\n+ ~2.09km² in favour of Russia.",
      "timestamp": "2025-08-30T07:23:28.333912Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have made important progress towards the village of Derylove.\nRussian forces advanced in two areas. Most of the progress was made in the southeast, where after a series of failed attacks on Shandryholove, the Russians began expanding their eastern flank along the low-lying ground, occupying various new positions in the forest plantations. From there, they were able to break through Ukrainian positions in a southwesterly direction, advancing for around 3.9km to the next set of tactical heights, where they took up new positions in the treelines. They were also able to improve their positions along two parallel treelines on the heights south of Zelena Dolnya.\nTo the northwest, Russian forces continued to slowly advance in the village of Seredjne. They advanced from the centre of the village, reaching its southern outskirts. Additionally, once reinforcements were brought in, they began expanding their zone of control west of the settlement, capturing new treeline positions. \nAdditionally, Russian forces were confirmed to have withdrawn from the northern outskirts of Shandryholove after failing to consolidate. Ukrainian forces, on the other hand, withdrew from their positions north of Serednje, where a grey zone has formed. \n+ ~6.64km² in favour of Russia.",
      "timestamp": "2025-08-30T07:23:28.333919Z"
    },
    {
      "original": "Another large-scale combined missile attack was carried out on Ukraine last night. Targets were hit in Dnipropetrovsk, Zaporizhzhia, Ternopil, and Zhytomyr Oblasts. \nThe following missiles were used:\n~20 Kh-101 cruise missiles launched from 2 Tu-95MS strategic bombers over the village of Uzmore, Saratov Oblast, and 1 Tu-160 from Kalachyovksy District, Volgograd Oblast.\n~10 Kalibr cruise missiles launched from off the coast of Cape Myskhako, Krasnodar Krai, in the eastern Black Sea.\n~9 Iskander-M ballistic missiles launched from OTRK installations near Liski (Voronezh Oblast), Simferopol (Crimea), Taganrog (Rostov Oblast), Millerovo Airbase (Rostov Oblast).\n~4 Kh-59 cruise missiles launched from 2 Su-57s near Taganrog (Rostov Oblast), and 1 Su-57 near Henichesk (Kherson Oblast). \nInterception rates are unknown, but 2 Kh-59s were confirmed to have been shot down over Dnipro, along with 1 Kh-101 in Cherkasy Oblast. \nAs for the targets, information is still being clarified, but I can confirm the following was hit:\nOzerne Airbase, Zhytomyr Oblast by as many as 6 Kh-101s.\nYuzhmash Defence Plant, Dnipro, Dnipropetrovsk Oblast by roughly 4 Kalibrs, 5 Iskander-Ms, and 1 Kh-59. \nZaporizhzhia City, Zaporizhzhia Oblast (possibly including Motor Sich Plant) by roughly 6 Kalibrs, 1 Kh-59, and 1 Iskander-M\nPavlohrad, Dnipropetrovsk Oblast (possibly the chemical plant) by roughly 8 Kh-101 and 3 Iskander-Ms.\nAn unknown target in central Ternopil Oblast by as many as 6 Kh-101s.",
      "timestamp": "2025-08-30T07:23:28.333931Z"
    },
    {
      "original": "Scenes from Dnipro, which was one of the main targets for last night's missile and drone attacks. Large fires are now burning at multiple points in the city.",
      "timestamp": "2025-08-30T07:23:28.333935Z"
    },
    {
      "original": "Scenes from Dnipro, which was one of the main targets for last night's missile and drone attacks. Large fires are now burning at multiple points in the city.",
      "timestamp": "2025-08-30T07:23:28.333938Z"
    },
    {
      "original": "Scenes from Dnipro, which was one of the main targets for last night's missile and drone attacks. Large fires are now burning at multiple points in the city.",
      "timestamp": "2025-08-30T07:23:28.333941Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at the Yuzhmash Defence Plant in Dnipro. This appears to be the main target for the missiles and drones in the city, as I previously suspected.",
      "timestamp": "2025-08-30T07:23:28.333944Z"
    },
    {
      "original": "NASA FIRMS data shows that a large fire is burning at the Yuzhmash Defence Plant in Dnipro. This appears to be the main target for the missiles and drones in the city, as I previously suspected.",
      "timestamp": "2025-08-30T07:23:28.333947Z"
    },
    {
      "original": "Additionally, the electrical substation for the Motor Sich Plant in Zaporizhzhia city was hit. \nThis is evidenced by a video from the scene showing damage to the residential buildings across the street. As usual, the camera is facing away from the actual impact site.\nCoordinates: 47.830538, 35.198064",
      "timestamp": "2025-08-30T07:23:28.333952Z"
    },
    {
      "original": "Additionally, the electrical substation for the Motor Sich Plant in Zaporizhzhia city was hit. \nThis is evidenced by a video from the scene showing damage to the residential buildings across the street. As usual, the camera is facing away from the actual impact site.\nCoordinates: 47.830538, 35.198064",
      "timestamp": "2025-08-30T07:23:28.333957Z"
    },
    {
      "original": "Security camera footage from Pavlohrad, Dnipro, and Zaporizhzhia during last night's missile attacks.",
      "timestamp": "2025-08-30T07:23:28.333960Z"
    },
    {
      "original": "Security camera footage from Pavlohrad, Dnipro, and Zaporizhzhia during last night's missile attacks.",
      "timestamp": "2025-08-30T07:23:28.333964Z"
    }
  ],
  "script_run_time": "2025-08-30T07:23:28.779770Z"
}