{
  "messages": [
    {
      "original": "🛵\n БпЛА на півдні Харківщини курсом на північ.\n🛵\n БпЛА в центральній частині Чернігівщини курсом на південь.",
      "timestamp": "2025-12-29T19:55:07.271753Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-29T19:55:07.271774Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-29T19:55:07.271780Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область та Донеччину.",
      "timestamp": "2025-12-29T19:55:07.271784Z"
    },
    {
      "original": "🛵\n Група БпЛА із Запорізької області на Дніпропетровщину курсом на Нікополь.",
      "timestamp": "2025-12-29T19:55:07.271789Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі.",
      "timestamp": "2025-12-29T19:55:07.271794Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-29T19:55:07.271798Z"
    },
    {
      "original": "🚀\nКАБ курсом на Суми.",
      "timestamp": "2025-12-29T19:55:07.271803Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Сумщину.",
      "timestamp": "2025-12-29T19:55:07.271807Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку обл.",
      "timestamp": "2025-12-29T19:55:07.271814Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину (Куп'янський, Ізюмський р-ни).",
      "timestamp": "2025-12-29T19:55:07.271819Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Запорізьку обл.",
      "timestamp": "2025-12-29T19:55:07.271823Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград",
      "timestamp": "2025-12-29T19:55:07.271828Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини",
      "timestamp": "2025-12-29T19:55:07.271832Z"
    },
    {
      "original": "🛵\n БпЛА з півдня курсом на Запоріжжя.",
      "timestamp": "2025-12-29T19:55:07.271837Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини курсом на Харків.",
      "timestamp": "2025-12-29T19:55:07.271841Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА на півночі Сумщини",
      "timestamp": "2025-12-29T19:55:07.271845Z"
    },
    {
      "original": "🚀\n🚀\nДонецька, Дніпропетровська обл. - загроза застосування авіаційних засобів ураження",
      "timestamp": "2025-12-29T19:55:07.271851Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА на межі Херсонської та Дніпропетровської областей - курс на північний захід",
      "timestamp": "2025-12-29T19:55:07.271855Z"
    },
    {
      "original": "🛵\n Близько десяти ударних БпЛА продовжують рух на північний захід південніше Кривого Рогу",
      "timestamp": "2025-12-29T19:55:07.271859Z"
    },
    {
      "original": "In the Lyman direction, both Russian and Ukrainian forces have advanced at various different points.\nIn the southeast, Russian forces captured additional positions in the western part of the Pynkiv Yar Gulley, and continued advancing through the treelines to the west. DRGs continue infiltrating towards the northern outskirts of the city, while other DRGs broke into the city centre of Lyman from the area of School No. 2.\nTo the northwest, Russian forces resumed their assault operations northwest of the town of Drobysheve, where they recaptured positions in the large forest there.\nTo the west, Ukrainian forces managed to clear the western part of Yarova from Russian DRGs, pushing them back beyond the railway line and resecuring the road to Drobysheve.\nTo the north, Russian forces resumed their assault operations in the Sviati Hory National Park and captured new positions in the direction of the Sosnove - Oleksandrivka Road. \n+ ~2.54 km² in favour of Russia.\n+ ~0.90 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T19:55:07.825176Z"
    },
    {
      "original": "On the southwestern flank of Kostyantynivka, Russian forces continued their assault operations and have made new progress in two different areas.\nIn the west, following earlier infiltrations, Russian forces managed to consolidate in the treelines west of Stepanivka, forcing the Ukrainians back into the village.\nIn the east, Russian forces continued their attacks along the highway in small groups and managed to consolidate in additional trenches in the direction of the highway intersection.\n+ ~2.83 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T19:55:07.825194Z"
    },
    {
      "original": "In the Dobropillya direciton, Russian forces continued to advance, completing the capture of Myrnohrad and making new progress elsewhere.\nIn Myrnohrad, following extensive clearing operations, Russian forces established control over the remaining low-rise residential streets in the northwestern part of the city. They also captured the remaining high-rise buildings in the northeast, thereby establishing full control over the city.\nTo the northwest, Russian forces launched a new series of assault operations in Rodynske following recent Ukrainian counterattacks. They managed to clear the western part of the southeastern high-rise micro-district and establish control over parts of the southern low-rise residential area. \nAdditionally, they broke through Ukrainian defences in the city centre, capturing most of the rest of the three-story buildings and dislodging the Ukrainians from practically all of their strongpoints there. Fighting is ongoing with the remaining pockets of resistance in the northern and southwestern parts of the city. \nTo the east, Russian forces managed to recapture the  Krasnolymanskaya Mine and the nearby forested area. Other assault groups advanced north up the treeline east of the mine and entered the ventilation shaft, where fighting is ongoing. \n+ ~3.39 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T19:55:07.825204Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-12-29T19:55:07.825208Z"
    },
    {
      "original": "KAB glide-bomb to Sumy City",
      "timestamp": "2025-12-29T19:55:07.825211Z"
    },
    {
      "original": "10 km away, flying to Tokari from the northeast",
      "timestamp": "2025-12-29T19:55:07.825214Z"
    },
    {
      "original": "Approximate path",
      "timestamp": "2025-12-29T19:55:07.825218Z"
    },
    {
      "original": "Explosion in Sumy",
      "timestamp": "2025-12-29T19:55:07.825221Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continued to advance and have made important progress in and around Novopavlivka\nIn the east, Russian forces continued pushing north through the treelines south of Novopavlivka, capturing new positions east and west of the highway. Other assault groups continued expanding their zone of control within the town, capturing new positions in the southern and southeastern streets, approaching the town centre.\nIn the west, Russian forces managed to complete the capture of the fortified forests northwest of Filiya, securing the last section to the east of Ivanivka.\n+ ~7.20 km² in favour of Russia.  \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T19:55:07.825228Z"
    },
    {
      "original": "In the Omelnyk direction, Russian forces continued to advance and have captured the city of Hulyaipole.\nIn the southeast, following the fall of the city centre and large parts of the western streets, Russian forces advanced further west down the highway and captured the industrial zone. Other forces cleared the remaining residential streets in the northwest of the city. Additionally, Russian forces advanced beyond the city and captured treeline positions to the southwest and continued incrementally advancing through the 2022 fortifications to the south.\nIn the northwest, Russian forces continued to expand their bridgehead on the western bank of the Haichur River. They improved their positions in the treelines west of Dobropillya, while DRGs infiltrated past the railway line and into the treelines further west. Other assault groups began advancing north up the treelines to Kosivtseve, and entered the village, where fighting is ongoing.\n+ ~12.68 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-29T19:55:07.825235Z"
    },
    {
      "original": "Russian forces have captured the city of Hulyaipole, Hulyaipole direction, Zaporizhzhia Oblast.  Pre-war population: ~14,600. Total land area: ~25.10 km².  The fighting for Hulyaipole lasted approximately 32 days.",
      "timestamp": "2025-12-29T19:55:07.825239Z"
    },
    {
      "original": "Following the fall of Hulyaipole, I expect the next step of the Russian offensive (which initially started from Vuhledar and is \"wrapping around\" the southern Ukrainian defences) will be to capture the highest point of the tactical heights west of the city in the area of Zaliznychne.\nThe fall of Hulyaipole and most of the positions east of the Haichur River means that Russia has effectively reached the end of the unfavourable terrain they have been advancing through since Velyka Novosilka, and opens up opportunities to advance parallel with the tactical heights instead.\nThis can only be done once Russia establishes a large bridgehead west of the Haichur River, beyond the two tactical bridgeheads they currently hold in the area of Hulyaipole and Kosivtseve. Once this is able to encompass those tactical heights at Zaliznychne and at Ternuvate, the path to outflank the fortress city of Orikhiv from the north will open.",
      "timestamp": "2025-12-29T19:55:07.825244Z"
    },
    {
      "original": "Following the fall of Hulyaipole, I expect the next step of the Russian offensive (which initially started from Vuhledar and is \"wrapping around\" the southern Ukrainian defences) will be to capture the highest point of the tactical heights west of the city…",
      "timestamp": "2025-12-29T19:55:07.825248Z"
    },
    {
      "original": "Another thing that I should mention is that the current movements from Stepnohirsk in the direction of the Konka River suggest that the Russians are going to attempt to outflank Orikhiv from both sides.\nThe terrain here for Ukraine is incredibly unfavourable, and the only thing that prevented a Russian advance into Orikhiv was the extensive fortifications between the city and the infamous village of Robotyne. \nThis may be part of the reason why Ukraine has brought in reinforcements to the Zaliznychne area, west of Hulyaipole - to prevent the Russians from securing the highest point of the tactical heights and beginning their outflanking maneuver from the east.",
      "timestamp": "2025-12-29T19:55:07.825253Z"
    },
    {
      "original": "As usual, I won't comment on the Zelensky-Trump meeting. It's all theatre, there will be no peace deal. \nI continue to assess that none of the sides are prepared to negotiate in good faith, even if they say otherwise publicly. \nStop falling for the same tricks over and over again!",
      "timestamp": "2025-12-29T19:55:07.825258Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published new footage showing FP-2 drone strikes on Russian rear targets.\nStrikes were carried on a Geran-2 storage facility near the city of Makiivka, Donetsk Oblast, and a repair unit for the Russian 1435th Motor Rifle Regiment near Antratsyt, Luhansk Oblast.",
      "timestamp": "2025-12-29T19:55:07.825262Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.\nThis attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles, Iskander-K cruise missiles, Kinzhal hypersonic aeroballistic missiles, and possibly Kalibr cruise missiles. There is still a possibility of strategic aviation being used, however.\nCurrently, it is known that at least two MiG-31K fighters are equipped with Kinzhals at Savasleika Airbase, Nizhny Novgorod Oblast. Additionally, Iskander-M and possibly Iskander-K cruise missiles have been delivered to OTRK installations in Taganrog (Rostov Oblast), Khalino Airbase (Kursk Oblast), and other areas recently. \nAnd, of course, an unprecedented accumulation of Geran-2 and Gerbera drones remains at the launch points surrounding Ukraine.",
      "timestamp": "2025-12-29T19:55:07.825268Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-29T19:55:07.825271Z"
    },
    {
      "original": "I feel like I should provide some context regarding my extensive coverage of Russian missile attacks, as it's always been one of the main focal points for my account.\nOver the last 2 years, I've spent over 1,000 hours covering more than 100 Russian missile and drone attacks on Ukraine live. To my knowledge, I was the first ever OSINTer in the world to provide real-time updates of missile trajectories with maps. But these attacks are only a small part of this war, so why spend so much time and effort covering it?\nFor me, when I first started covering these attacks, I had less than 50 followers on Twitter. Doing something like this brought attention to my account as no one had seen it in public spaces before. As my reporting got significant more accurate, more and more people tuned into my live updates. This provided me with a lot of motivation to continue covering these attacks, allowing for me to get even more precise and reliable. \nThis motivation, combined with me finding a lot of interest in these attacks and learning about so much stuff, meant I just never stopped, despite it being such a small portion of this war's events. \nMore recently, I have frequently been messaged by Ukrainians and people visiting Ukraine thanking me for my coverage as it provided them with knowledge of whether it is safe or not in their respective cities. The Ukrainian Airforce is notoriously slow on updating threats and air raid alerts, which is why far less people use official outlets for this anymore. \nSo, a combination of these factors means that I don't intend on stopping any time soon, even if it restricts my ability to cover other areas of the war such as political developments. Obviously, real-life factors for me can reduce my ability to cover attacks, but I hope to continue as it's good for my account and good for those watching it. \nA big thanks to those behind the scenes who help make this possible. You all know who you are.",
      "timestamp": "2025-12-29T19:55:07.825279Z"
    },
    {
      "original": "There is a high threat of another large-scale, combined Russian missile and drone attack on Ukraine in the next 36 hours.  This attack, if it takes place, will *likely* not include Tu-95MS or Tu-160 strategic bombers, but rather Iskander-M ballistic missiles…",
      "timestamp": "2025-12-29T19:55:07.825283Z"
    },
    {
      "original": "3 Tu-22m3 strategic bombers have redeployed from Shaykovka Airbase, Kaluga Oblast, to Engels-2 Airbase, Saratov Oblast. Earlier, an IL-76MD cargo plane landed at Engels-2 Airbase, transporting Kh-32 cruise missiles for the Tu-22m3 bombers. \nEngels-2 was the airbase which the Tu-22m3 bombers departed from during the most recent large-scale attack. Therefore, there is a significantly increased threat to Odesa Oblast for the next 36 hours.",
      "timestamp": "2025-12-29T19:55:07.825287Z"
    },
    {
      "original": "3 Tu-22m3 strategic bombers have redeployed from Shaykovka Airbase, Kaluga Oblast, to Engels-2 Airbase, Saratov Oblast. Earlier, an IL-76MD cargo plane landed at Engels-2 Airbase, transporting Kh-32 cruise missiles for the Tu-22m3 bombers.   Engels-2 was the…",
      "timestamp": "2025-12-29T19:55:07.825290Z"
    },
    {
      "original": "Correction: at least one of the Tu-22m3 strategic bombers did not land at Engels-2 Airbase and flew further southwest into Volgograd Oblast.\nIt is currently flying past Volgograd in the direction of Novorossiysk, Krasnodar Krai, and the waters of the Black Sea.",
      "timestamp": "2025-12-29T19:55:07.825294Z"
    },
    {
      "original": "Last night, Ukraine apparently attempted to strike Moscow with Ukrainian-made Grom-2 ballistic missiles. \nRussian sources report that both missiles were shot down by air defence over Tula Oblast. They stated that missile dangers were declared in a number of regions after the missiles were shot down due to the speed at which they were flying, and apparently due to very late detections.",
      "timestamp": "2025-12-29T19:55:07.825298Z"
    },
    {
      "original": "Correction: at least one of the Tu-22m3 strategic bombers did not land at Engels-2 Airbase and flew further southwest into Volgograd Oblast.  It is currently flying past Volgograd in the direction of Novorossiysk, Krasnodar Krai, and the waters of the Black…",
      "timestamp": "2025-12-29T19:55:07.825304Z"
    },
    {
      "original": "The Tu-22m3 appears to be carrying out a training mission in the eastern Black Sea,",
      "timestamp": "2025-12-29T19:55:07.825310Z"
    },
    {
      "original": "New footage shows Russian drones carrying out deep strikes on Ukrainian targets.\nThe video shows the following being hit:\n- P-19 radar\n- 19Zh6 radar\n- 79K6 Pelican radar\n- Zoopark-3 radar\n- P-18 radar\n- An-26 cargo plane\n- Mi-24 helicopter (apparently a decoy)\n- 2 dry cargo ships",
      "timestamp": "2025-12-29T19:55:07.825319Z"
    },
    {
      "original": "Elite Russian Unit Is Now Hitting Ukrainian Radars, Aircraft And Ships With Long-Range Drones (Video)\nThe Russian military’s elite Center for Advanced Unmanned Technologies “Rubicon” on December 29 revealed that it has been using a new type of long-range suicide drones to attack Ukrainian radars, aircraft and even ships.\nA video released by the center shows four aerial radars, a P-19, a Pelikan, an ST-68U and a P-18, getting hit, along with a Zoopark-3 counter-battery radar, an An-2 aircraft, what appears to be a Mi-24 gunship helicopter, and two unidentified ships. Notably, the helicopter was hit some 236 kilometers away from the front.\nRubicon didn’t share much details, but the footage reveals that at least some of the strikes were carried out using a drone unveiled earlier this year.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387470Z"
    },
    {
      "original": "North Korea Tests Heavy Land-Attack Cruise Missile After Reports Of Russian Interest (Photos)\nNorth Korea fired long-range strategic cruise missiles into the sea to test the nuclear deterrence, the state-run Korean Central News Agency (KCNA) reported on December 29.\nThe news agency said that leader Kim Jong Un expressed “great satisfaction” over the launches, which occurred off the country’s west coast.\nThe North Korean leader stressed that regular testing of the components of the country’s nuclear deterrent was a legitimate exercise of its right to self-defense amid persistent security threats. He also reaffirmed Pyongyang’s commitment to the continued development of the country’s nuclear combat forces, according to the agency.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387490Z"
    },
    {
      "original": "North Korea Tests Heavy Land-Attack Cruise Missile After Reports Of Russian Interest (Photos)\nNorth Korea fired long-range strategic cruise missiles into the sea to test the nuclear deterrence, the state-run Korean Central News Agency (KCNA) reported on December 29.\nThe news agency said that leader Kim Jong Un expressed “great satisfaction” over the launches, which occurred off the country’s west coast.\nThe North Korean leader stressed that regular testing of the components of the country’s nuclear deterrent was a legitimate exercise of its right to self-defense amid persistent security threats. He also reaffirmed Pyongyang’s commitment to the continued development of the country’s nuclear combat forces, according to the agency.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387500Z"
    },
    {
      "original": "Three Turkish Police Officers Killed By ISIS In Sign Of Growing Radical Influence From Syria (Videos)\nTurkey’s interior ministry on December 29 said that six terrorists from ISIS and three police officers were killed during a counterterrorism operation in the country’s northwest.\nThe operation targeted ISIS cells in the city Yalova, south of Ankara, and was carried out by Turkish security forces as part of ongoing counterterrorism efforts, Minister Ali Yerlikaya told reporters, adding that eight other police officers and one security guard were wounded in the clash.\nThe terrorist resisted when the police attempted to storm a house where they were hiding. Clashes spread into the streets and special forces were brought in from neighboring Bursa province.\nFollowing the deadly clash in Yalova, Turkish activists shared footage from last year showing Islamists celebrating the fall of the Assad regime and waving Islamic flags affiliated with Syrian rebels and terrorist groups.\nRead more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387512Z"
    },
    {
      "original": "Three Turkish Police Officers Killed By ISIS In Sign Of Growing Radical Influence From Syria (Videos)\nTurkey’s interior ministry on December 29 said that six terrorists from ISIS and three police officers were killed during a counterterrorism operation in the country’s northwest.\nThe operation targeted ISIS cells in the city Yalova, south of Ankara, and was carried out by Turkish security forces as part of ongoing counterterrorism efforts, Minister Ali Yerlikaya told reporters, adding that eight other police officers and one security guard were wounded in the clash.\nThe terrorist resisted when the police attempted to storm a house where they were hiding. Clashes spread into the streets and special forces were brought in from neighboring Bursa province.\nFollowing the deadly clash in Yalova, Turkish activists shared footage from last year showing Islamists celebrating the fall of the Assad regime and waving Islamic flags affiliated with Syrian rebels and terrorist groups.\nRead more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387524Z"
    },
    {
      "original": "Military Situation In Ukraine On December 29, 2025 (Maps Update)",
      "timestamp": "2025-12-29T19:55:08.387529Z"
    },
    {
      "original": "Military Situation In Ukraine On December 29, 2025 (Maps Update)",
      "timestamp": "2025-12-29T19:55:08.387533Z"
    },
    {
      "original": "Exchange of Strikes: Kyiv Attacks Russian President's Residence, Moscow Prepares Retaliation\nRussian-Ukrainian exchanges of strikes in late December were accompanied by significant diplomatic statements. Russian Foreign Minister Sergey Lavrov stated that on the night of December 28-29, the \"Kyiv regime\" carried out a \"terrorist attack\" on a Russian presidential state residence in the Novgorod region using 91 strike unmanned aerial vehicles.\nHe claimed that all drones were destroyed and emphasized that the incident occurred during intense Russian-American negotiations on settling the Ukrainian conflict. Lavrov stated that the \"reckless actions\" would not go unanswered, with targets and timing for retaliatory strikes already determined, and that Russia's negotiating position would be revised due to the \"Kyiv regime's shift to a policy of state terrorism.\"\nUkrainian President Volodymyr Zelenskyy called the statement about the attack on the residence “another lie”...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387543Z"
    },
    {
      "original": "Exchange of Strikes: Kyiv Attacks Russian President's Residence, Moscow Prepares Retaliation\nRussian-Ukrainian exchanges of strikes in late December were accompanied by significant diplomatic statements. Russian Foreign Minister Sergey Lavrov stated that on the night of December 28-29, the \"Kyiv regime\" carried out a \"terrorist attack\" on a Russian presidential state residence in the Novgorod region using 91 strike unmanned aerial vehicles.\nHe claimed that all drones were destroyed and emphasized that the incident occurred during intense Russian-American negotiations on settling the Ukrainian conflict. Lavrov stated that the \"reckless actions\" would not go unanswered, with targets and timing for retaliatory strikes already determined, and that Russia's negotiating position would be revised due to the \"Kyiv regime's shift to a policy of state terrorism.\"\nUkrainian President Volodymyr Zelenskyy called the statement about the attack on the residence “another lie”...\n👉\n Read more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387552Z"
    },
    {
      "original": "Military Situation In Syria On December 29, 2025 (Map Update)",
      "timestamp": "2025-12-29T19:55:08.387556Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387565Z"
    },
    {
      "original": "Desperate Ukrainian Counterattacks In Zaporizhzhia End With Massacres (Videos)\nThe Russian military’s Vostok [East] Group of Forces has repelled two Ukrainian counterattacks near the city of Huliapole in Zaporizhzhia, inflicting heavy losses on Kiev forces which were apparently attempting to score some media win.\nThe first counterattack was launched by Ukraine’s 1st Assault Regiment, also known as “Da Vinci” or “Da Vinci Wolves,” on December 28. Some 50 troops from the unit advanced in two pickup trucks, four armored personnel carriers, and three T-64 main battle tanks from Vozdvizhevka, towards Varvarovka on the Haichur River to the north of Haliapole.\nThe Vostok Group of Forces reacted very fast, however, targeting Ukrainian troops with drones and indirect fire means. \nOn December 29, the Vostok Group of Forces repelled a second counterattack launched by Ukraine’s 425th Separate Assault Regiment, also known as \"Skala,\" this time to the south of Huliapole.\nRead more \nHERE",
      "timestamp": "2025-12-29T19:55:08.387575Z"
    }
  ],
  "script_run_time": "2025-12-29T19:55:08.388597Z"
}