{
  "messages": [
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-20T19:57:00.766090Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К з ае \"Саваслейка\"",
      "timestamp": "2025-10-20T19:57:00.766109Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К",
      "timestamp": "2025-10-20T19:57:00.766115Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T19:57:00.766120Z"
    },
    {
      "original": "Суми - ворожий БпЛА у напрямку міста!",
      "timestamp": "2025-10-20T19:57:00.766124Z"
    },
    {
      "original": "БпЛА на Харківщині (Ізюмський район), курс північний.",
      "timestamp": "2025-10-20T19:57:00.766127Z"
    },
    {
      "original": "БпЛА в районі н.п. Мена на Чернігівщині, курс південно-східний.",
      "timestamp": "2025-10-20T19:57:00.766134Z"
    },
    {
      "original": "Ворожий БпЛА південніше Чернігова. Напрямок - північний.",
      "timestamp": "2025-10-20T19:57:00.766137Z"
    },
    {
      "original": "КАБ на Донеччину",
      "timestamp": "2025-10-20T19:57:00.766140Z"
    },
    {
      "original": "🚀\nПуски КАБів на Донеччину та Харківщину із Східного напрямку",
      "timestamp": "2025-10-20T19:57:00.766145Z"
    },
    {
      "original": "🚀\nПуски КАБів на Сумщину",
      "timestamp": "2025-10-20T19:57:00.766150Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині, курс південно-західний.",
      "timestamp": "2025-10-20T19:57:00.766154Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T19:57:00.766159Z"
    },
    {
      "original": "🚀\nПуски КАБів на Сумщину",
      "timestamp": "2025-10-20T19:57:00.766163Z"
    },
    {
      "original": "🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-10-20T19:57:00.766167Z"
    },
    {
      "original": "🛵\n БпЛА в Павлоградському районі Дніпропетровщини, курс західний.\n🛵\n БпЛА в Лозівському районі Харківщини, курс південно-західний.\n🛵\n БпЛА в Ніжинському районі Чернігівщини, курс західний.\n🛵\n БпЛА в Корюківському районі Чернігівщини, курс південно-західний.",
      "timestamp": "2025-10-20T19:57:00.766177Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-10-20T19:57:00.766184Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-10-20T19:57:00.766188Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-10-20T19:57:00.766193Z"
    },
    {
      "original": "🛵\n БпЛА на сході Чернігівщини, постійно змінюють напрямок руху.\n🛵\n БпЛА на півдні Чернігівщини, курс південний.",
      "timestamp": "2025-10-20T19:57:00.766199Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-10-20T19:57:00.766203Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-10-20T19:57:00.766209Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-20T19:57:00.766213Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на північно-східному напрямку!",
      "timestamp": "2025-10-20T19:57:00.766218Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it. \nIt's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions and movements in Gaza).\nI honestly think the goal was to make a peace plan that was borderline acceptable for Hamas, but just slightly too far outside of what they could feasibly agree too, in order to portray them as unwilling to end the war and rebuild some justification for the IDF to continue their operations. \nHamas actually accepting the deal surprised the US and Israel, so now they are relying on ceasefire violations to slowly swing back to a fighting stance.",
      "timestamp": "2025-10-20T19:57:01.485073Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance towards Myrnohrad from the east and have made further progress inside the city limits. \nIn the north, after establishing control over the Kapitalna Mine, Russian forces advanced down the highway to the industrial zone on the outskirts of Myrnohrad, establishing control over it. Using this to accumulate additional infantry, Russian forces broke into the northeastern suburbs of Myrnohrad, establishing control over Travnya 1 Street. Ukrainian forces withdrew from the area and are now repeating their strategy employed with the other Russian breach into the city, with striking every occupied house in an attempt to prevent consolidation and further accumulation of soldiers. In addition to this advance, the Russians were able to establish full control over the wastewater treatment plant and the surrounding areas.\nTo the south, after entering southeastern Myrnohrad and widening the breach in Ukrainian defences, Russian forces began attacking north into the village of Balahan. They entered the southern dachas, and pushed up into the main residential area, linking up with their formations in the forests to the east.\nTo the southwest, despite extensive Ukrainian FPV drone strikes, the Russians were able to consolidate further in the first houses of Myrnohrad, accumulating additional infantry for further attacks. They pushed further west down Stritenska and Syerova Streets and entered the eastern houses of Razina Street. As a result of these attacks, Russia has now secured a 1.3 km-long residential stretch of Myrnohrad, and is within 500 metres of the first high-rise residential buildings. \n+ ~2.86 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485091Z"
    },
    {
      "original": "Zoomed-in maps showing the Russian breaches into northeastern and southeastern Myrnohrad.\nAs Ukrainian supply into the Pokrovsk salient gets worse and worse, the deepest sections of the salient will begin to collapse.",
      "timestamp": "2025-10-20T19:57:01.485097Z"
    },
    {
      "original": "Zoomed-in maps showing the Russian breaches into northeastern and southeastern Myrnohrad.\nAs Ukrainian supply into the Pokrovsk salient gets worse and worse, the deepest sections of the salient will begin to collapse.",
      "timestamp": "2025-10-20T19:57:01.485101Z"
    },
    {
      "original": "In Lviv, TCC mobilisation officers pulled a man out of an ambulance to be arrested and likely sent to the frontline.",
      "timestamp": "2025-10-20T19:57:01.485105Z"
    },
    {
      "original": "In Lviv, TCC mobilisation officers pulled a man out of an ambulance to be arrested and likely sent to the frontline.",
      "timestamp": "2025-10-20T19:57:01.485108Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces are advancing, each taking various positions amid intensified fighting.\nOn the western part of the Kucheriv Yar salient, Russian forces continued stabilisation measures following the Ukrainian counterattacks last month. They were able to once again regain the initiative in the Nove Shakhove area, entering the village from the east and establishing control over most of it. Fighting is ongoing for its western houses which are currently in the grey zone. \nRussian forces have also begun attacks on Vilne from the northeast with its newly accumulated infantry. Fighting is ongoing for the forested areas just outside the village. The Russians are also carrying out attacks on Ivanivka from the southeast in an attempt to bring the village back under their control and level the front southwest of Nove Skakhove. \nAdditional attacks are being carried out northwest of Zatyshok, where Russia is trying to consolidate in the forest plantations in the direction of the railway line in order to solidify their presence on the Zatyshok - Sukhetske line. Ukrainian forces resumed their assault operations towards the treelines south of Nykanorivka, attacking from their positions east of the railway line.\nIn the eastern part of the Kucheriv Yar salient, fierce fighting is ongoing for the Volodymyrivka - Shakhove area. After repelling Russian assaults on northern Volodymyrivka, and inflicting heavy casualties on the initial force dropped off by the earlier mechanised assault, Ukrainian forces began attacking south from the northern street with their newly accumulated infantry, and captured new residential areas in the northern part of the village. Other forces began attacking southeast, establishing control over part of the agricultural complex and advancing down the treeline south of the Novyy Reservoir. \nAt the same time, additional Russian reinforcements were brought into southern Volodymyrivka, which are now trying to counterattack in the centre of the village.  Russian forces are also trying to consolidate in the forest plantations north of Novyy Reservoir again, while the Ukrainians attack through the forest plantations on the southeastern approaches to Shakhove.\n+ ~2.57 km² in favour of Russia.\n+ ~0.55 km² in favour of Ukraine.",
      "timestamp": "2025-10-20T19:57:01.485117Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, as Russian forces penetrate deep into Pokrovsk City, a new series of attacks on Rodynske has begun.\nAfter their initial failed attempts at taking the city, Russia regrouped and refocused their efforts on other areas. Since stabilising the situation in the Kucheriv Yar salient and beginning attacks into Pokrovsk, Russian forces have managed to break into Rodynske and begin fighting for large parts of the city.\nThey advanced west from positions in the area of the mine and terykon, and broke into the high-rise microdistrict in western Rodynske, establishing control over most of it. Other forces expanded their foothold in the city to the low-rise residential areas to the north, where they are now trying to storm the Ukrainian defences in the four-story buildings further west. \nMeanwhile, the Russians were able to break into the northern part of the city - which had a smaller Ukrainian presence - and establish control over large parts of it. Assault operations are now underway towards the city centre from the east, northeast, and north, while intense FAB and artillery bombardment of Ukrainian positions there and in the western suburbs is ongoing.\n+ ~3.94 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485123Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued their assault operations towards the rear of the Kleban-Bykske Reservoir and have managed to secure important positions here.\nDespite previous failed attacks here, Russian forces were able to advance out of Yablunivka to the east and enter the forests north of Oleksandro-Kalynove. With this southern sector secured, other soldiers advanced up the highway, establishing control over several strongpoints and approaching the rear of the reservoir. Attacks were also carried out on the first forests situated behind the reservoir, but they were repelled, mostly by Ukrainian FPV drones (which have been doing most of the work in this sector for some time). \n+ ~1.20 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485128Z"
    },
    {
      "original": "Zelensky accidentally reposted an 18+ Onlyfans model's post on Instagram instead of saving it to his favourites...\nIt was deleted shortly afterwards lol.",
      "timestamp": "2025-10-20T19:57:01.485133Z"
    },
    {
      "original": "Zelensky accidentally reposted an 18+ Onlyfans model's post on Instagram instead of saving it to his favourites...\nIt was deleted shortly afterwards lol.",
      "timestamp": "2025-10-20T19:57:01.485137Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards Kostyantynivka, and have captured positions in three different areas.\nIn the east, Russian forces secured the treelines and forest plantations north of Bila Hora which were previously in the grey zone, levelling the frontline south of the fortified forests. Additional attacks are being carried out on the main forest, as well as on the central part of Predtechyne.\nTo the west, Russian forces advanced back into the Yahidka Dachas southeast of Kostyantynivka, consolidating in the eastern half of them. Russian soldiers are infiltrating further, reaching the Kostyantynivka city limits, as well as the areas behind Predtechyne. \nIn the south, after weeks of assault operations, Russian forces were finally able to consolidate in the southern part of Pleshchiivka, and began attacks to the northwest where they are attempting to entrench in the denser residential areas. \n+ ~4.93 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485144Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive towards Lyman from the east and have made progress in two different areas.\nIn the north, Russian forces were able to eliminate the Ukrainian pocket in and around Myrne after an attack from the north and from the east over the Yampolivka Dam. Additional positions were captured to the south, thereby securing the route north of Zarichne to be used for future offensive actions. \nIn the south, Russian forces continued attacks through the Yampil forest. They advanced for at least 1 km to the west (north of the railway line), while DRGs began infiltrating even deeper towards the southeastern outskirts of Lyman itself. Additionally, as a result of the advances being made in the forests to the south and north, the Russians closed the salient southwest of Zarichne, establishing control over 6 treelines and the northern part of the Yampil Forest. \n+ ~19.56 in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485149Z"
    },
    {
      "original": "On the northwestern flank of Lyman, Russian forces intensified their assault operations, making significant advances over the past few days. \nRussian forces continued to advance in southern Novoselivka, reaching the rear of the village. This, plus renewed Russian attacks towards the centre of the village from the north forced the remaining Ukrainian formations to withdraw west. \nOther forces to the northwest were able to consolidate in the large forests after previous attacks and began expanding further west. They were also able to enter these same forests from southwestern Novoselivka and capture positions there, forcing the Ukrainians to withdraw further back from areas directly west of Novoselivka to the eastern approaches to Yarova. \nAdditionally, Russian forces managed to break through Ukrainian positions south of Novoselivka, where they advanced southwest through the forests and infiltrated the southeastern houses of Yarova. Fighting is now ongoing here, but it means that one of two remaining roads to Drobysheve (which was also previously used to supply Lyman) has been cut.\nMeanwhile in the east, Russian forces continued to slowly advance in Drobysheve. After capturing the agricultural buildings on the northeastern outskirts of the town, they entered the residential areas to the south. The main assault groups continued to push towards the town centre and have established control over positions on Pushkina Street.\n+ ~8.44 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485157Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued their assault operations on the Ukrainian bridgehead on the eastern bank of the Oskil River and have made new progress towards Pishchane.\nFollowing the recapture of previously lost positions west of Stepova Novosilka, Russian forces have continued to advance west, building on their momentum. They advanced along the railway line for more than 2.9 km, seizing numerous trenches and dugouts along the way. Once they reached the eastern outskirts of Pishchane, the Russian began entering the village, capturing trenches and houses there. \nSo far, they are only confirmed to be in control of the easternmost edge of the village, while the rest is in the grey zone, but they have attempted to consolidate in the northeastern streets. Meanwhile, additional attacks were carried out to the north, where Russian forces captured new treeline positions in the low-lying ground. \n+ ~3.57 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485162Z"
    },
    {
      "original": "Deepstate reports that Russia carried out a series of mechanised assaults in the Orikhiv direction, western Zaporizhzhia Oblast, today. \nThey stated that Russian forces, using tanks, BMPs, BTRs, and infantry attacked on four assault vectors towards Mala Tokmachka, Novodanylivka, Novoandriivka, and the areas east of Shcherbaky. \nAccording to them, most of the equipment was destroyed before it reached the frontline, but that infantry was able to continue the advance. Russian equipment was able to enter Mala Tokmachka and scatter infantry amongst the settlement, where fighting is now ongoing. \nIt's currently unclear how successful Russia was in the other vectors of attack, but we should receive more information in the near future.",
      "timestamp": "2025-10-20T19:57:01.485168Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance in Kupyansk, capturing new positions west of the Oskil River.\nFollowing the withdrawal of most Ukrainian forces from the central and northern parts of the city, Russian forces began clearing out the main parts of the city centre. They were able to establish control over the \"Comb\" stronghold in the high-rise microdistrict, and advanced to the Central City Hospital from the north. From the northwest, they consolidated in the first buildings of the small industrial zone and are trying to enter the winery. \nTo the south, Russian forces advanced further in the western residential areas, capturing the local school and approaching the Kupyanka River from the west. Additional progress was made to the southeast in the direction of the highway, where they are trying to cut off the remaining Ukrainian formations in the city centre.\nIn the south, Russian forces consolidated in the residential areas south of Skhilnyy Provuluk Street, bypassing the Yuvileynyi Microdistrict from the east. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485174Z"
    },
    {
      "original": "In the Vovchansk direction, Russian forces continued to advance in Vovchansk, significantly expanding their bridgehead on the southern bank of the Vovcha River.\nAfter establishing control over the Vovchansk Oil Extraction Plant and the surrounding areas, Russian forces continued to advance south towards the southern industrial zone, beginning to bypass Ukrainian defences south of the city centre. They pushed further down the railway line to the southern industrial zone, establishing control over the adjacent residential streets. Other forces pushed southeast towards the highway and are approaching Proletarska Street.\nAdditionally, Russian forces continued to clear the western suburbs of the city. they advanced from the area of the railway line to Volkovoj Street, capturing new positions there and on Yaroslava Mudroho Street. Other forces pushed south down Konstytutsii Street and Kniazia Street, reaching the intersections with Volkovoj Street. \n+ ~1.16 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485182Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to expand their bridgehead on the western bank of the Yanchur River and have established a new bridgehead further north.  \nIn the south, Russian forces advanced to the northern outskirts of Poltavka, completing the capture of the village. They also secured additional positions in the treelines to the west. Additionally, Russian forces began pushing west from the main part of Poltavka, where they established control over numerous new treeline positions and gained a foothold on the next set of tactical heights.  \nIn the north, Russian forces crossed the Yanchur River from the northeastern part of Novomykolaivka and entered the main part of the village. They quickly expanded their zone of control to include the rest of the village, reaching the southeastern outskirts of Uspenivka and the trench fortifications south of Novomykolaivka.\n+ ~8.60 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485188Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued their advance through Dnipropetrovsk Oblast and have crossed the Yanchur River at a new point. \nAfter breaking through to, and establishing control over Pryvillya, Russian forces crossed the Yanchur River and entered the village of Zlahoda from the north. They were able to capture the northern houses of the settlement and have begun attacking towards the southern outskirts. Most of the rest of the village is in the grey zone. \n+ ~1.04 km² in favour of Russia.",
      "timestamp": "2025-10-20T19:57:01.485192Z"
    },
    {
      "original": "Russian Troops Advance In Pokrovsk And Along Yanchur Line \nOn October 20, the Russian military advanced in several areas from the city of Pokrovsk in the Donetsk direction to the line along the Yanchur River in the Dnepropetrovsk direction.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces began storming the southern part of Myrnohrad from nearby Balahan, which was captured very recently. It’s worth noting that Russian troops are already attempting to advance in the eastern part of the large settlement, although Ukrainian troops are still showing resistance there.\nThe Tsentr Group of Forces made additional gains in Pokrovsk itself, capturing the railway station building in the heart of the city.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176889Z"
    },
    {
      "original": "Russian Troops Advance In Pokrovsk And Along Yanchur Line \nOn October 20, the Russian military advanced in several areas from the city of Pokrovsk in the Donetsk direction to the line along the Yanchur River in the Dnepropetrovsk direction.\nTo the east of Pokrovsk, the Tsentr [Center] Group of Forces began storming the southern part of Myrnohrad from nearby Balahan, which was captured very recently. It’s worth noting that Russian troops are already attempting to advance in the eastern part of the large settlement, although Ukrainian troops are still showing resistance there.\nThe Tsentr Group of Forces made additional gains in Pokrovsk itself, capturing the railway station building in the heart of the city.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176905Z"
    },
    {
      "original": "Israel’s Secretive Surveillance Jet Spotted Over Syria On Possible Mission Against Iran \nOne of Israel’s secretive Gulfstream G550-based high-altitude surveillance aircraft was spotted flying over southern Syria on October 20, marking the first such sighting since the war with Iran in June.\nA video showing the aircraft over al-Suwayda was shared by a local news blog, with activists from the governorate reporting that the aircraft was escorted by fighter jets.\nThe Israeli Air Force (IAF) operates two special mission versions of the G550, both were locally developed by Israel Aerospace Industries and ELTA Systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176915Z"
    },
    {
      "original": "Israel’s Secretive Surveillance Jet Spotted Over Syria On Possible Mission Against Iran \nOne of Israel’s secretive Gulfstream G550-based high-altitude surveillance aircraft was spotted flying over southern Syria on October 20, marking the first such sighting since the war with Iran in June.\nA video showing the aircraft over al-Suwayda was shared by a local news blog, with activists from the governorate reporting that the aircraft was escorted by fighter jets.\nThe Israeli Air Force (IAF) operates two special mission versions of the G550, both were locally developed by Israel Aerospace Industries and ELTA Systems.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176924Z"
    },
    {
      "original": "Military Situation In Gaza Strip On October 20, 2025 (Map Update)",
      "timestamp": "2025-10-20T19:57:02.176928Z"
    },
    {
      "original": "U.S. Envoy Warns Israel Could Resume War On Lebanon As Strikes Hit Hezbollah Heartland \nUnited States special envoy for Syria Tom Barrack warned on October 20 that Israel could resume war on Lebanon if the country fails to disarm Hezbollah, all while another wave of strikes hit the heartland of the group in the south of the country.\nBarrack made the warning in a lengthy opinion piece on the prospect of peace in the Middle East that he published on his X account.\n“Should Beirut continue to hesitate, Israel may act unilaterally – and the consequences would be grave,” cautioned Barrack.\n“If Beirut fails to act, Hizballah’s military arm will inevitably face major confrontation with Israel at a moment of Israel’s strength and Iran backed Hizballah’s weakest point,” wrote Barrack, who is also the U.S. envoy to Turkey.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176938Z"
    },
    {
      "original": "U.S. Envoy Warns Israel Could Resume War On Lebanon As Strikes Hit Hezbollah Heartland \nUnited States special envoy for Syria Tom Barrack warned on October 20 that Israel could resume war on Lebanon if the country fails to disarm Hezbollah, all while another wave of strikes hit the heartland of the group in the south of the country.\nBarrack made the warning in a lengthy opinion piece on the prospect of peace in the Middle East that he published on his X account.\n“Should Beirut continue to hesitate, Israel may act unilaterally – and the consequences would be grave,” cautioned Barrack.\n“If Beirut fails to act, Hizballah’s military arm will inevitably face major confrontation with Israel at a moment of Israel’s strength and Iran backed Hizballah’s weakest point,” wrote Barrack, who is also the U.S. envoy to Turkey.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176947Z"
    },
    {
      "original": "Military Situation In Ukraine On October 20, 2025 (Maps Update)",
      "timestamp": "2025-10-20T19:57:02.176951Z"
    },
    {
      "original": "Military Situation In Ukraine On October 20, 2025 (Maps Update)",
      "timestamp": "2025-10-20T19:57:02.176956Z"
    },
    {
      "original": "Beyond the Front Lines: How Ukraine’s Training System Challenges Mobilized Soldiers\nUkrainian conscripts face training hell. Surviving until deployment to the front line is becoming increasingly challenging. This is not because of the intensive and difficult training process, however.\nSince the beginning of the conflict in Ukraine, Kyiv has faced one of the most challenging tasks of our time: recruiting well-trained reinforcements for units and formations on the front line. The Ukrainian authorities’ tactics in this regard are constantly changing, as is the nature of the fighting.\nIn the early stages of the conflict, in 2022, Ukrainian President Volodymyr Zelenskyy distributed weapons to the population in an attempt to stop the Russian advance. Territorial defence units, equipped only with light weapons, were formed in haste. Amidst the prevailing panic and lack of clear command, there were frequent incidents in which the territorial defence forces mistakenly attacked AFU soldiers...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176968Z"
    },
    {
      "original": "Beyond the Front Lines: How Ukraine’s Training System Challenges Mobilized Soldiers\nUkrainian conscripts face training hell. Surviving until deployment to the front line is becoming increasingly challenging. This is not because of the intensive and difficult training process, however.\nSince the beginning of the conflict in Ukraine, Kyiv has faced one of the most challenging tasks of our time: recruiting well-trained reinforcements for units and formations on the front line. The Ukrainian authorities’ tactics in this regard are constantly changing, as is the nature of the fighting.\nIn the early stages of the conflict, in 2022, Ukrainian President Volodymyr Zelenskyy distributed weapons to the population in an attempt to stop the Russian advance. Territorial defence units, equipped only with light weapons, were formed in haste. Amidst the prevailing panic and lack of clear command, there were frequent incidents in which the territorial defence forces mistakenly attacked AFU soldiers...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-20T19:57:02.176978Z"
    }
  ],
  "script_run_time": "2025-10-20T19:57:02.177710Z"
}