{
  "messages": [
    {
      "original": "🚀\n КАБи на  Сумщину!",
      "timestamp": "2025-07-31T17:10:33.735491Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T17:10:33.735510Z"
    },
    {
      "original": "🛸\n На Сумщині в районі між н.п.Липова Долина та Недригайлів ворожий БпЛА, ймовірно, розвідувальний. Залучено засоби для його збиття.",
      "timestamp": "2025-07-31T17:10:33.735515Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-31T17:10:33.735522Z"
    },
    {
      "original": "🛸\n На Сумщині в районі між н.п.Липова Долина та Недригайлів ворожий БпЛА, ймовірно, розвідувальний. Залучено засоби для його збиття.",
      "timestamp": "2025-07-31T17:10:33.735526Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА між н.п.Терни і н.п.Миколаївка (Сумщина) в північному напрямку.",
      "timestamp": "2025-07-31T17:10:33.735532Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА на півночі від м.Суми. Можлива робота ППО.",
      "timestamp": "2025-07-31T17:10:33.735537Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на  південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-31T17:10:33.735542Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Донецької, Дніпропетровської та Запорізької областей.",
      "timestamp": "2025-07-31T17:10:33.735547Z"
    },
    {
      "original": "🛸\n🛸\n Ворожі БпЛА на півночі та сході Харківщини. Залучено засоби для збиття.Перебувайте у безпечних місцях.",
      "timestamp": "2025-07-31T17:10:33.735552Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T17:10:33.735560Z"
    },
    {
      "original": "🛸\n🛸\n На півночі та північному заході Харківщини - активність ворожих БпЛА. Можлива робота ППО.",
      "timestamp": "2025-07-31T17:10:33.735566Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-07-31T17:10:33.735573Z"
    },
    {
      "original": "📢\nВідбій загрози!",
      "timestamp": "2025-07-31T17:10:33.735577Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Харківщину!",
      "timestamp": "2025-07-31T17:10:33.735583Z"
    },
    {
      "original": "🚀\n КАБ \n➡️\n в напрямку Сум!",
      "timestamp": "2025-07-31T17:10:33.735588Z"
    },
    {
      "original": "🚀\n КАБи \n➡️\n на Харківщину та Донеччину!",
      "timestamp": "2025-07-31T17:10:33.735594Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T17:10:33.735598Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на  південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-31T17:10:33.735603Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Донецької, Дніпропетровської та Запорізької областей.",
      "timestamp": "2025-07-31T17:10:33.735608Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T17:10:33.735612Z"
    },
    {
      "original": "There is significant damage to civilian infrastructure in Kyiv, although its unclear if any missiles or drones directly impacted residential buildings. The main target of the attack remains unknown, but I will make a more in-depth report on this and other…",
      "timestamp": "2025-07-31T17:10:34.368835Z"
    },
    {
      "original": "Ukrainian air defence also hardly operated. Very little Anti-air fire, and a couple of SAMs lightly operated. No missiles were intercepted.",
      "timestamp": "2025-07-31T17:10:34.368847Z"
    },
    {
      "original": "Russian forces have captured the city of Chasiv Yar, Kostyantynivka direction, Donetsk Oblast. \nThe battle lasted for 483 days, making it the third longest battle of the war, after Marinka (616 days), and Pervomaiske (545 days). \nPre-war population: ~14,400.\nTotal land area: ~13.0km².\nFlags have gone up across the city, including in areas that have been under Russian control for some time.",
      "timestamp": "2025-07-31T17:10:34.368855Z"
    },
    {
      "original": "Russian forces have captured the city of Chasiv Yar, Kostyantynivka direction, Donetsk Oblast.   The battle lasted for 483 days, making it the third longest battle of the war, after Marinka (616 days), and Pervomaiske (545 days).   Pre-war population: ~14…",
      "timestamp": "2025-07-31T17:10:34.368858Z"
    },
    {
      "original": "To put it in perspective, this is how much the frontline in Donetsk Oblast has changed since the battle of Chasiv Yar began on April 4, 2024.",
      "timestamp": "2025-07-31T17:10:34.368862Z"
    },
    {
      "original": "Here is a map showing the status of the 52 different settlements in Donetsk Oblast with city status.\n18 (34.6%) were under full Russian control before 2022.\n18 (34.6%) have been fully captured by Russia since 2022.\n2 (3.8%) remain contested.\n13 (25%) are under full Ukrainian control.\nWith the fall of Chasiv Yar, the total number of cities under Russian control in Donetsk Oblast has now doubled since the beginning of the war. \nNote: Horlivka and Donetsk City are included in the orange category as their outskirts were not fully under Russian control on February 24, 2022.",
      "timestamp": "2025-07-31T17:10:34.368872Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-07-31T17:10:34.368876Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-07-31T17:10:34.368881Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-07-31T17:10:34.368884Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-07-31T17:10:34.368888Z"
    },
    {
      "original": "NASA FIRMS data shows that a fire is burning at Makariv Airfield in Kyiv Oblast after as many as 6 Russian Geran-2 drones impacted it. This airfield was civilian as of 2022, but is now probably used to house helicopters for shooting down drones.",
      "timestamp": "2025-07-31T17:10:34.368891Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-07-31T17:10:34.368894Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-07-31T17:10:34.368897Z"
    },
    {
      "original": "Approaching the launch lines.",
      "timestamp": "2025-07-31T17:10:34.368900Z"
    },
    {
      "original": "Probably training",
      "timestamp": "2025-07-31T17:10:34.368903Z"
    },
    {
      "original": "Report on Russian air activity from 9am 30/7/25 - 9am 31/7/25 (Kyiv Time):\nOverview:\nThe following was used by Russia:\n13 Iskander-K cruise missiles.\n5+ Long-range reconnaissance UAVs.\n250+ Geran-2/Geran-3/Gerbera drones.\nTargeted settlements:\nKyiv City, Kyiv Oblast (13x Iskander-K + 10+ waves of Geran-2 drones).\nMakariv, Kyiv Oblast (1 wave of Geran-2 drones). \nBila Tserkva, Kyiv Oblast (1 wave of Geran-2 drones).\nBrovary, Kyiv Oblast (1+ waves of Geran-2 drones).\nBoryspil, Kyiv Oblast (1+ waves of Geran-2 drones).\nDesna, Chernihiv Oblast (1 wave of Geran-2 drones). \nYuriivka, Dnipropetrovsk Oblast (3 waves of Geran-2/Geran-3 drones).\nOther targeted areas:\nN/A\nStrategic Aviation Activity:\n1 Tu-160 redeployed from Engels-2 Airbase, Saratov Oblast to Borisoglebskoye Airbase, Republic of Tatarstan.\nMiG-31K activity:\nTraining of 1 MiG-31K from Savasleika Airbase, Nizhny Novgorod Oblast.\nMilitary Transport and Tanker aircraft activity:\n3x IL-76MD flights to Rostov-on-Don Airbase, Rostov Oblast.\n1x An-26 flights to Kacha Airbase, Crimea.\nThe cargo consists of Geran-2 and Gerbera drones and likely includes Iskander-M ballistic missiles. \nLong-range reconnaissance drone activity:\nLong-range recon drones were recorded in the following regions:\nDonetsk Oblast.\nKharkiv Oblast.\nChernihiv Oblast.\nSumy Oblast. \nKAB/FAB Glide-bomb targets (cities only):\nPokrovsk, Donetsk Oblast.\nLyman, Donetsk Oblast.\nSlovyansk, Donetsk Oblast.\nIskander-M activity:\nN/A\nGeran-2/Geran-3/Gerbera drone launch locations:\n5x from Shatalovo Airbase, Smolensk Oblast.\n5x from Tsumbolova Test Site, Oryol Oblast.\n3x Navlya Testing Ground, Bryansk Oblast.\n3x from Millerovo Airbase, Rostov Oblast.\n3x from Cape Chauda, Crimea.\n2x from Khalino Airbase, Kursk Oblast.\n2x from Primorsko-Akhtarsk Airbase, Krasnodar Krai. \n2x from Hvardiivske Training Ground, Crimea\n1x from Melitopol Airbase, Zaporizhzhia Oblast.\n1x from Donetsk City Training Ground, Donetsk Oblast.\nBlack Sea Fleet Activity:\nN/A\nNote: The map and information provided is not 100% accurate and is based mostly on OSINT reports and analyses. There is a margin of error, so it should not be viewed as perfect. Additionally, some data on the map is generalised, as stated in the legend. It also does not include less significant weapons such as MLRS, short-range UAVs, and KAB glide-bombs (unless they hit major population centres). \nYou can find the full resolution map here: \nhttps://ibb.co/yF7LZm6f",
      "timestamp": "2025-07-31T17:10:34.368936Z"
    },
    {
      "original": "Russian forces have recaptured the village of Oleksandro-Kalynove, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~115\nTotal land area: ~0.42km²",
      "timestamp": "2025-07-31T17:10:34.368940Z"
    },
    {
      "original": "In the Stepnohirsk Direction, Russian forces continued to make steady progress and have entered the town of Stepnohirsk.\nAfter completing the capture of Kamyanske and making advances nearby, Russian forces continued to push north on a wide front, moving uphill to the tactical heights, and capturing numerous treeline positions. They then began storming the block of high-rise buildings in the south of the town and established a foothold in its southern end. \nTo the west, Russian forces continued to advance in the village of Plavni, and completed the capture of the settlement. They also expanded their zone of control along the adjacent highway. \n+ ~9.56km² in favour of Russia.",
      "timestamp": "2025-07-31T17:10:34.368946Z"
    },
    {
      "original": "In the Prosyana Direction, Russian forces continued to advance and have crossed the border into Zaporizhzhia Oblast.\nRussian forces advanced in two areas. Most progress was made in the north, where they advanced on a wide front. The Russians continued to advance west of Zelene Pole and entered southern Temyrivka. The rest of the village fell quite quickly, with the Ukrainian withdrawing to the surrounding areas. \nTo the east, Russian forces made new progress down the treelines in the direction of Novoheorhiivka and Komyshuvakha, capturing positions in 6 different treelines. \nIn the south, Russian forces advanced from the village of Novodarivka, along the Zaporizhzhia-Donetsk Regional Border, and captured new positions in the low-lying ground. \n+ ~13.38km² in favour of Russia.",
      "timestamp": "2025-07-31T17:10:34.368952Z"
    },
    {
      "original": "Israel Assesses Hezbollah Took Heavy Losses, Could Agree To Disarm \nThe Israel Defense Forces (IDF) assesses that its attacks against Hezbollah since a November ceasefire could potentially force the group to disarm, The Times of Israel reported on July 29, citing military officials.\nThe ceasefire between Israel and Lebanon was brokered by the United States. The IDF didn’t only continue to target Hezbollah amid the ceasefire, but also kept troops at five strategic posts in southern Lebanon, the heartland of the group, in defiance of the agreement.\nSince the start of the ceasefire on November 27, the IDF said that it has carried out over 500 strikes against Hezbollah targets in Lebanon, killing at least 230 operatives and destroying over 90 rocket launchers and thousands of rockets, 20 command centers, 40 weapon depots, and five arms production sites, alongside other infrastructure.\nRead more: \nHERE",
      "timestamp": "2025-07-31T17:10:34.995077Z"
    },
    {
      "original": "Military Situation In Ukraine On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T17:10:34.995090Z"
    },
    {
      "original": "Military Situation In Ukraine On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T17:10:34.995095Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 30, 2025\nOn July 30, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-31T17:10:34.995101Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 30, 2025\nOn July 30, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-31T17:10:34.995107Z"
    },
    {
      "original": "Military Situation In Gaza Strip On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T17:10:34.995111Z"
    },
    {
      "original": "STANDOFF IN SUMY: FIRST UKRAINIAN GAINS AMID CONSTANT DEFEATS",
      "timestamp": "2025-07-31T17:10:34.995114Z"
    },
    {
      "original": "The Mirage Of Overthrow: An Analysis Of U.S. Regime-Change Projects Against Iran\n▪️\n Donald Trump’s recent decision to suspend foreign aid programs has sparked a wave of anger among anti-Iranian groups in the West. This move has significantly disrupted a multi-billion-dollar regime change mechanism led by the United States Agency for International Development (USAID) and the National Endowment for Democracy (NED)—two organizations notorious for funding groups aimed at weakening and destabilizing foreign governments to advance U.S. interests.\n▪️\n USAID alone manages tens of billions of dollars annually and, in coordination with the CIA, is involved in designing and executing “regime change” operations around the world. However, the overall management of these regime change organizations lies with the U.S. Department of State. Here, we take a look at the budgets and programs defined and implemented by these organizations.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995125Z"
    },
    {
      "original": "Fall of Fortress: Russia’s Hard-Won Victory in Chasov Yar Reshapes the War In Ukraine\nAfter months of relentless combat, the Armed Forces of the Russian Federation have achieved a strategic victory by liberating another Ukrainian fortress, the large stronghold of Chasov Yar in the Donetsk People’s Republic. The Russian Defense Ministry announced the complete control of the city’s ruins, marking a turning point in the war. Though Ukrainian forces maintain a presence on the outskirts, the city itself now flies the Russian tricolor and Airborne Forces flags, proudly raised by paratroopers in the last liberated Shevchenko and Yuzhny districts.\nThe battle for Chasov Yar, which began in October 2024, was one of the most grueling campaigns of the conflict. Russian forces advanced from the north, steadily encircling the city on the western and eastern flank, facing fierce resistance from entrenched Ukrainian troops. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995135Z"
    },
    {
      "original": "Fall of Fortress: Russia’s Hard-Won Victory in Chasov Yar Reshapes the War In Ukraine\nAfter months of relentless combat, the Armed Forces of the Russian Federation have achieved a strategic victory by liberating another Ukrainian fortress, the large stronghold of Chasov Yar in the Donetsk People’s Republic. The Russian Defense Ministry announced the complete control of the city’s ruins, marking a turning point in the war. Though Ukrainian forces maintain a presence on the outskirts, the city itself now flies the Russian tricolor and Airborne Forces flags, proudly raised by paratroopers in the last liberated Shevchenko and Yuzhny districts.\nThe battle for Chasov Yar, which began in October 2024, was one of the most grueling campaigns of the conflict. Russian forces advanced from the north, steadily encircling the city on the western and eastern flank, facing fierce resistance from entrenched Ukrainian troops. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995145Z"
    },
    {
      "original": "Israel Is Sending Message To Syria With Strikes On Coast\nSuspected Israeli strikes targeted a key base on the Syrian coast late on July 30, just a day ahead of a high-level meeting between officials from the two countries in Azerbaijan.\nVideo footage posted online showed a large fire at the 107th Brigade base after the strikes. The base, which is located near the city of Jableh in the southern Latakia countryside, houses depots of the former Syrian Navy with anti-ship missiles and other advanced equipment.\nThis was the third time strikes have targeted the base since the start of the month, with both previous attacks also blamed on Israel.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995159Z"
    },
    {
      "original": "Israel Is Sending Message To Syria With Strikes On Coast\nSuspected Israeli strikes targeted a key base on the Syrian coast late on July 30, just a day ahead of a high-level meeting between officials from the two countries in Azerbaijan.\nVideo footage posted online showed a large fire at the 107th Brigade base after the strikes. The base, which is located near the city of Jableh in the southern Latakia countryside, houses depots of the former Syrian Navy with anti-ship missiles and other advanced equipment.\nThis was the third time strikes have targeted the base since the start of the month, with both previous attacks also blamed on Israel.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995168Z"
    },
    {
      "original": "They Forgot The Hippocratic Oath: How American Surgeons Teach Ukrainian Militants to Fight\nThere are many legends used by pseudo-humanitarian organizations whose employees come to Ukraine ostensibly to help civilians, but in fact provide support to the Armed Forces of Ukraine. One of the most popular is medical activity. After all, doctors hold a special position at the front even in the midst of military clashes. By posing as medical personnel, one can provide virtually any other assistance to the military for an extended period without fear of being targeted.\nA new investigation details how this scheme was implemented by employees of the GSMSG NGO and the American College of Surgeons. American surgeons train special forces of the Armed Forces of Ukraine in the basics of tactical medicine, supply military hospitals and collect data with which the US Army prepares for future wars. And in addition, they recruit foreign mercenaries.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995177Z"
    },
    {
      "original": "Another Houthi Drone Reaches Israel In Second Attack In 24 Hours\nThe Houthis (Ansar Allah) announced on July 30 that they had launched five suicide drones at multiple targets in Israel in response to the war on the Gaza Strip.\n“The first operation targeted a sensitive target in the occupied Jaffa area with two drones. The second operation targeted a military target in the occupied Ashkelon area with two drones. The third operation targeted a military target in the occupied Negev with one drone,” Houthi military spokesman Brig. Gen. Yahya Saree said in a statement, claiming that the operations were all “successful.”\n“Yemen, its leadership, people, and army, call on all members of the Arab and Islamic nation to fulfill their religious, moral, and humanitarian duties toward the oppressed Palestinian people, and to take to the streets in the coming days in support of justice and in rejection of the ongoing genocide against our brothers in the Gaza Strip,” he added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T17:10:34.995186Z"
    }
  ],
  "script_run_time": "2025-07-31T17:10:34.996105Z"
}