{
  "messages": [
    {
      "original": "🚀\n КАБи на Донеччину, схід Дніпропетровщини!",
      "timestamp": "2025-11-12T06:47:01.716941Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу з Чорного моря!",
      "timestamp": "2025-11-12T06:47:01.716958Z"
    },
    {
      "original": "🛵\n БпЛА на Одесу з Чорного моря!",
      "timestamp": "2025-11-12T06:47:01.716964Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-12T06:47:01.716972Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-11-12T06:47:01.716977Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину, схід Дніпропетровщини!",
      "timestamp": "2025-11-12T06:47:01.716982Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n на Запорізьку область!",
      "timestamp": "2025-11-12T06:47:01.716988Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n на північ Херсонщини!",
      "timestamp": "2025-11-12T06:47:01.716994Z"
    },
    {
      "original": "🛵\n Велика група \"шахедів\" з півдня \n➡️\n на північ Херсонщини!\n🛵\n Група \"шахедів\" на півночі Херсонщини \n➡️\n курсом на Кривий Ріг.\n🛵\n БпЛА на південному сході Дніпропетровщини \n➡️\n курсом на Павлоград.\n🛵\n БпЛА на північному заході, заході та півдні Харківщини \n➡️\n курсом на південь.\n🛵\n БпЛА на сході Полтавщини \n➡️\n курсом на Харківщину.",
      "timestamp": "2025-11-12T06:47:01.717012Z"
    },
    {
      "original": "🛵\n Група \"шахедів\" з Херсонщини \n➡️\n на південь Миколаївщини!\n🛵\n БпЛА з півдня \n➡️\n на північ Запорізької області!",
      "timestamp": "2025-11-12T06:47:01.717021Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-11-12T06:47:01.717025Z"
    },
    {
      "original": "🛵\n БпЛА на Запоріжжя!",
      "timestamp": "2025-11-12T06:47:01.717029Z"
    },
    {
      "original": "🛵\n БпЛА повз Кривий Ріг \n➡️\n на Кіровоградщину.",
      "timestamp": "2025-11-12T06:47:01.717037Z"
    },
    {
      "original": "🛵\n Група БпЛА з Бєлгородської обл., рф \n➡️\n на південь Сумщини.",
      "timestamp": "2025-11-12T06:47:01.717042Z"
    },
    {
      "original": "🛵\n БпЛА на сході Кіровоградщини \n➡️\n курсом на Кропивницький.",
      "timestamp": "2025-11-12T06:47:01.717056Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n на Одещину!\n🛵\n Велика група \"шахедів\" з півдня \n➡️\n на північ Херсонщини!\n🛵\n Група БпЛА з півдня \n➡️\n на північ Запорізької області.\n🛵\n Група \"шахедів\" у центрі Миколаївщини \n➡️\n курсом на Нову Одесу.\n🛵\n БпЛА на заході Дніпропетровщини \n➡️\n курсом на Кіровоградщину.\n🛵\n БпЛА на сході Кіровоградщини \n➡️\n курсом на Кропивницький.\n🛵\n БпЛА на південному сході Дніпропетровщини \n➡️\n курсом на Запорізьку область.\n🛵\n БпЛА на півдні Харківщини, східніше Лозової \n➡️\n рухаються по колу.\n🛵\n БпЛА уздовж кордону Сумщини та Харківщини \n➡️\n курсом на південь.",
      "timestamp": "2025-11-12T06:47:01.717083Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n на Одесу!",
      "timestamp": "2025-11-12T06:47:01.717089Z"
    },
    {
      "original": "📍\nОдещина:\n🛵\n БпЛА в районі Ширяєвого \n➡️\n курсом на північ.\n📍\nМиколаївщина:\n🛵\n БпЛА південніше Березнуватого, Баштанки \n➡️\n курсом на Нову Одесу.\n📍\nКіровоградщина:\n🛵\n БпЛА курсом на Рівне.\n📍\nЧеркащина:\n🛵\n БпЛА в районі Корсунь-Шевченківського \n➡️\n курсом на Київщину.\n🛵\n БпЛА в районі Городища \n➡️\n курсом на Звенигородку.\n📍\nХарківщина:\n🛵\n БпЛА в районі Краснокутська \n➡️\n курсом на південь. \n🛵\n БпЛА північніше Берестина, Слобожанського, Сахновщини \n➡️\n курсом на південь.\n🛵\n БпЛА східніше Лозової, в районі Близнюків, Барвінкового, Олександрівки \n➡️\n продовжують рухатися по колу.\n📍\nДніпропетровщина:\n🛵\n БпЛА на північному сході \n➡️\n курсом на Павлоград.",
      "timestamp": "2025-11-12T06:47:01.717121Z"
    },
    {
      "original": "📍\nОдещина:\n🛵\n БпЛА з Чорного моря \n➡️\n курсом на Одесу!\n🛵\n Кілька груп БпЛА в районі Ширяєвого, Березівки \n➡️\n курсом на північ.\n📍\nЧеркащина:\n🛵\n БпЛА в районі Городища \n➡️\n курсом на Корсунь-Шевченківський.\n📍\n Київщина:\n🛵\n Група БпЛА на півдні, в районі Тетіїва, Ставища \n➡️\n курсом на Житомирщину та Вінниччину.\n📍\nЖитомирщина:\n🛵\n БпЛА на півдні \n➡️\n курсом на Вінниччину.\n📍\nВінниччина:\n🛵\n БпЛА на півночі, в районі Козятина \n➡️\n курсом на південь.\n📍\nХарківщина:\n🛵\n БпЛА східніше Лозової, в районі Близнюків, Барвінкового, Олександрівки.\n📍\nДніпропетровщина:\n🛵\n БпЛА на північному сході \n➡️\n курсом на Павлоград.",
      "timestamp": "2025-11-12T06:47:01.717152Z"
    },
    {
      "original": "🛵\n БпЛА з Курської обл., рф \n➡️\n на північ Сумщини.",
      "timestamp": "2025-11-12T06:47:01.717157Z"
    },
    {
      "original": "Only a couple of streets of Pokrovsk remain until the city is captured by Russia.",
      "timestamp": "2025-11-12T06:47:02.431644Z"
    },
    {
      "original": "In the Stepnohirsk direction, over the past week Russian forces have intensified their assault operations, recapturing key positions.\nRussian forces continued to advance north through the village of Prymorske, recapturing the rest of the southern dachas and entering the main southern residential area. Forward assault groups reached and crossed the first gulley where fighting is now ongoing.\nTo the southeast, Russian forces advanced east towards the Kollektivnyye, Elektrovoznik-2, and Ogorody Dachas, capturing positions along the northern bank of the dried-up Zaliv Inlet. They were also able to capture the Stepnohirsk overpass, south of the Sukhaya River, and positions in the surrounding forested areas.\n+ ~2.99 km² in favour of Russia.",
      "timestamp": "2025-11-12T06:47:02.431660Z"
    },
    {
      "original": "Russian artillery shelling has resulted in power outages in large parts of Kherson City. The trolleybus lines have been halted, and disruptions in water supply are reported.",
      "timestamp": "2025-11-12T06:47:02.431664Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-12T06:47:02.431667Z"
    },
    {
      "original": "Iskander launch from Taganrog, Rostov Oblast",
      "timestamp": "2025-11-12T06:47:02.431670Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-12T06:47:02.431673Z"
    },
    {
      "original": "No missiles are detected in Ukrainian airspace yet",
      "timestamp": "2025-11-12T06:47:02.431677Z"
    },
    {
      "original": "Probably Russian S-300/400 air defence activity",
      "timestamp": "2025-11-12T06:47:02.431680Z"
    },
    {
      "original": "In the Hulyaipole direction, the situation continues to deteriorate for Ukraine, as Russian forces continue to rapidly advance.\nIn the south, Russian forces continued to advance west of Poltavka and began bypassing Vesele from the north, capturing new treeline positions on the tactical heights. Further north, after entering Novouspenivske from the south, the Russians established full control over the village and its surrounding positions. Simultaneously, the Russians consolidated to the north in Nove and quickly captured the rest of the village. Before this, any remaining Ukrainian soldiers withdrew from the areas east of Nove and Novouspenivske to avoid being encircled.\nAs these two villages were being captured, Russian DRGs began infiltrated to the villages of Rivnopillya and Yablukove, engaging in clashes with Ukrainian units sent to the area to clear them out. Assault groups, taking advantage of the complicated situation for Ukraine, then broke through Ukrainian positions west of Nove by advancing southwest down the road for over 5.6 km, capturing positions in numerous different treelines. Some forces were able to enter and entrench in eastern Yablukove, while others advanced to the west towards Rivnopillya, capturing the eastern street of the settlement. \nFurther north, taking advantage of the local collapse of Ukrainian defences near Solodke, Russian forces advanced west from Uspenivka for over 4 km, capturing numerous new treelines on the tactical heights and levelling the frontline between the newly captured village of Solodke and the breakthroughs further south. \nIn the north, Russian forces continued to advance around Zlahoda. They pushed south from the village to the next treelines, capturing them and entering the village of Rybne, which was quickly brought under control. They then advanced further south to the treelines on the tactical heights, capturing them and linking up their bridgehead over the Yanchur River with the rest of the Hulyaipole direction.\n+ ~46.27 km² in favour of Russia.",
      "timestamp": "2025-11-12T06:47:02.431687Z"
    },
    {
      "original": "In the Pokrovsk'e direction, Russian forces continued to advance and have established a foothold in the village of Orestopil.\nAfter DRGs infiltrated the village earlier, and Russian assault groups reached its southwestern outskirts, Russian forces entered the western part of the village, establishing control over positions on two streets. DRGs continue to operate further east, with the rest of the village now falling into the grey zone.\n+ ~0.60 km² in favour of Russia.",
      "timestamp": "2025-11-12T06:47:02.431692Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continue to advance in the salient south of Novopavlivka and have captured new key positions.\nFollowing the Ukrainian withdrawal from the southern part of the salient north of Dachne, Russian forces crossed the Kalmychkova Gulley along the highway and captured positions in the treelines on the tactical heights to the north. Other forces pushed west from already-established positions north of the gulley, making new progress along additional treelines. \nMeanwhile, in Novopavlivka, assault operations continue in the southern part of the town, with Russian soldiers attempting to make additional progress in the direction of the centre.\n+ ~3.94 km² in favour of Russia.",
      "timestamp": "2025-11-12T06:47:02.431701Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 1): \nOver the past few days, Russian forces have made substantial progress on the tactical heights west of Pokrovsk, while the last streets of the city begin to come under Russian control.\nNorth of Udachne, Russian forces advanced from the western part of the town to the western approaches to the Pokrovsk Coal Mine, capturing new positions along a treeline and a gulley. Other forces improved their positions along the treeline towards the eastern part of the mine. Heavy fighting continues on the approaches of this very important fortified node.\nWest of Pokrovsk, Russian forces broke through Ukrainian defences north of Kotlyne, capturing positions in the treelines to the north and northwest. They then went on to advance further northeast to the next treelines over on the tactical heights, while other forces pushed north from the railway line. Additionally, Russian forces captured numerous new treeline positions closer to Pokrovsk and made additional progress along the railway line to the south of Hryshyne, where they are beginning to outflank the Ukrainian positions in the rest of those treelines. \nIn northern Pokrovsk, under the cover of fog, additional Russian reinforcements were brought from the city centre to help the units who were struggling to consolidate in the northern residential areas of the 8th District. The remaining Ukrainian assault groups were forced to retreat from this part of the city, allowing for the Russians to establish full control over the district. Additionally, Russian forces advanced northwest from the low-rise part of the Dinas District to the nearby forested areas, while other forces in the 8th District advanced north to the forested areas just outside the city, forcing most Ukrainian formations to withdraw much further west - away from the Myrnohrad Pocket. \nIn northwestern Pokrovsk, after establishing control over and consolidating in the Shcherbakova District, Russian soldiers began infiltrating north across the Hryshinka River to the northernmost street of Pokrovsk and the Druzhba Dachas, where they are now trying to consolidate. Fighting is ongoing as Ukrainian forces attempt to prevent the Russians from securing this area as it would build a buffer outside the main part of the city and help develop the eastern flank to Hryshyne. \nNorth of Pokrovsk, Russian forces continued advancing down the road to Hryshyne and have captured additional positions there. They also advanced down a perpendicular treeline to the north. Assault groups then began attacking towards the next pig farm over, while DRGs infiltrated towards the third pig farm. DRGs also began infiltrating southwest through the treelines towards the northern outskirts of Pokrovsk\nNortheast of the city, Russian forces continued their assault operations in southern Rivne, attacking along the highway in the direction of northwestern Myrnohrad. In eastern Pokrovsk, other they began attacks from the Sobachivka District to the \"Kohozhkine\" street of Pokrovsk - the last street in the eastern part of the city. \nSouth of Myrnohrad, after capturing the last parts of Lysivka, Russian forces were able to capture the rest of the forests north of the village. They also consolidated in a large trench fortification further north and are attacking east down a treeline to the other one. Additionally, the Russians began attacks north up a treeline from eastern Lysivka to the western part of Sukhyi Yar. \nIn southeastern Myrnohrad, Russian forces continued assault operations from the area of the terykon to residential areas in the area of Dymytrov Park. They are also attacking towards the area of the high-rise buildings in the Zapadny District.\n(Part 2 is below)",
      "timestamp": "2025-11-12T06:47:02.431711Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 1):   Over the past few days, Russian forces have made substantial progress on the tactical heights west of Pokrovsk, while the last streets of the city begin to come under Russian control.  North of Udachne, Russian…",
      "timestamp": "2025-11-12T06:47:02.431715Z"
    },
    {
      "original": "Update from the Pokrovsk direction (Part 2): \nIn Rodynske, extremely heavy fighting continues. The Ukrainians are attempting to exploit poorly consolidated Russian positions in the city centre to reach the southeastern high-rise micro-district, while Russian forces continue attempts to counterattack from the flanks. Both sides are using extensive heavy weaponry to strike each other's positions. Ukraine is using MiG-29s and F-16s to launch glide-bombs at Russian positions in the city, while Russia continues to strike the Ukrainian positions in the city along with its main supply line with FAB glide-bombs.",
      "timestamp": "2025-11-12T06:47:02.431719Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-12T06:47:02.431722Z"
    },
    {
      "original": "The first groups of Ukrainian soldiers have begun to surrender in the besieged city of Myrnohrad.",
      "timestamp": "2025-11-12T06:47:02.431725Z"
    },
    {
      "original": "Do you guys think Zelensky is aware of his curse?",
      "timestamp": "2025-11-12T06:47:02.431728Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-12T06:47:02.431733Z"
    },
    {
      "original": "A short time ago, one Ukrainian long-range UAV impacted the ELOU-AVT unit at the Orsknefteorgsintez Oil Refinery in Orsk, Orenburg Oblast.\nThis is nearly 1,500 km from the nearest Ukrainian-controlled territory. \nCoordinates: 51.24429, 58.51838",
      "timestamp": "2025-11-12T06:47:02.431738Z"
    },
    {
      "original": "Despite the fierce battles, St. Michael's Church in Pokrovsk city centre has been left practically untouched.",
      "timestamp": "2025-11-12T06:47:02.431741Z"
    },
    {
      "original": "The surrounded Ukrainian units in Myrnohrad continue to be pounded by Russian FAB glide-bombs. \nThis video shows a FAB-3000 strike on high-rise buildings in the southern part of the city.",
      "timestamp": "2025-11-12T06:47:02.431744Z"
    },
    {
      "original": "Last night, Russia carried out a larger than usual Geran-2 drone attack on Ukraine. Approximately 200 Gerans and Gerberas were recorded in Ukrainian airspace, attacking targets in the areas of the following locations:\nKramatorsk, Donetsk Oblast (energy infrastructure).\nBohuslav, Kyiv Oblast (energy infrastructure).\nVinnytsia City, Vinnytsia Oblast.\nLadyzhyn, Vinnytsia Oblast (Thermal Power Plant).\nLozova, Kharkiv Oblast (Railway station).\nPavlohrad, Dnipropetrovsk Oblast.\nVasylkivka, Dnipropetrovsk Oblast (railway infrastructure).\nPetropavlivka, Dnipropetrovsk Oblast.\nChaplyne, Dnipropetrovsk Oblast (railway infrastructure).\nBerezivka, Odesa Oblast (energy infrastructure).\nDolynska, Kirovohrad Oblast.\nKropyvnytskyi, Kirovohrad Oblast.\nOdesa City, Odesa Oblast.",
      "timestamp": "2025-11-12T06:47:02.431754Z"
    },
    {
      "original": "Russian Army Captures One More Town In Zaporizhzhia, Enters Two Others (Video)\nOn November 11, the Russian military captured another settlement to the west of the Yanchur River moving closer to the city of Huliapole amid a collapse of Ukrainian defenses in Zaporizhzhia.\nThe capture of Novouspenivske by the Vostok [East] Group of Forces was first announced by the Russian Ministry of Defense.\nThe attack on the settlement was launched from Nove, which is located right to the north. It was reportedly led by the 127th Division of the 5th Army. Kiev forces lost two platoons of troops and more than nine units of military equipment while attempting to hold onto the settlement.\nRead more \nHERE",
      "timestamp": "2025-11-12T06:47:03.131961Z"
    },
    {
      "original": "Military Situation In Ukraine On November 11, 2025 (Maps Update)",
      "timestamp": "2025-11-12T06:47:03.131973Z"
    },
    {
      "original": "Military Situation In Ukraine On November 11, 2025 (Maps Update)",
      "timestamp": "2025-11-12T06:47:03.131978Z"
    },
    {
      "original": "Tomahawk Cruise Missile – U.S. Army’s Strategic Long-Range Weapon\n▪️\nThe Tomahawk is a subsonic, long-range, precision-guided cruise missile launched from submarines and surface platforms, designed for deep land strikes and targeting high-value objectives.  \n▪️\nThanks to its ability to fly at low altitude, its advanced combined guidance system, and in-flight retargeting capability (in modern versions), the Tomahawk has become a key strike weapon of the U.S. military over the past half-century.  \n▫️\nIt should be noted that during the 12-day war, the U.S. fired about 30 Tomahawk missiles at Iran’s Natanz and Isfahan nuclear sites, \nsome of which were intercepted by Iranian air defense systems.\n This was verified through images of Tomahawk wreckage recovered after the attacks.  \n👉\n Read more \nHERE",
      "timestamp": "2025-11-12T06:47:03.131991Z"
    },
    {
      "original": "Tomahawk Cruise Missile – U.S. Army’s Strategic Long-Range Weapon\n▪️\nThe Tomahawk is a subsonic, long-range, precision-guided cruise missile launched from submarines and surface platforms, designed for deep land strikes and targeting high-value objectives.  \n▪️\nThanks to its ability to fly at low altitude, its advanced combined guidance system, and in-flight retargeting capability (in modern versions), the Tomahawk has become a key strike weapon of the U.S. military over the past half-century.  \n▫️\nIt should be noted that during the 12-day war, the U.S. fired about 30 Tomahawk missiles at Iran’s Natanz and Isfahan nuclear sites, \nsome of which were intercepted by Iranian air defense systems.\n This was verified through images of Tomahawk wreckage recovered after the attacks.  \n👉\n Read more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132002Z"
    },
    {
      "original": "The Severed Hand of Midas: Internal Sabotage Undermines Ukraine's Defense Capacity\nThe confrontation between Zelensky's entourage and the anti-corruption agencies is escalating. The Ukrainian president's shadow purse is under attack. What role do the US, Europe and Russia play in the internal political strife within the president's office?\nOn 10 November, the National Anti-Corruption Bureau of Ukraine (NABU) initiated large-scale searches of a number of state organisations and companies. Operation “Midas” was 15 months in the making, with 1,000 hours of audio recordings collected during the preparation phase. The activities of a high-level criminal organisation were documented. Its members had established a widespread corruption scheme to influence strategic enterprises in the public sector, particularly National Nuclear Energy Company ‘Energoatom’.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132010Z"
    },
    {
      "original": "BREAKING INTO OPERATIONAL SPACE: RUSSIA'S POTENTIAL FOR ADVANCES IN THE SOUTH GROWS",
      "timestamp": "2025-11-12T06:47:03.132013Z"
    },
    {
      "original": "Assault On Vovchansk: Ukrainian Forces Amass Reserves To Hold Last Districts\nThe Russian army has taken control of the Novouspenivske settlement in the Zaporizhzhia region. Twenty-five Ukrainian naval infantry servicemen surrendered in Myrnohrad. \nThe US is demanding a revision of the upcoming anti-Russian UN General Assembly resolution on Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132020Z"
    },
    {
      "original": "Assault On Vovchansk: Ukrainian Forces Amass Reserves To Hold Last Districts\nThe Russian army has taken control of the Novouspenivske settlement in the Zaporizhzhia region. Twenty-five Ukrainian naval infantry servicemen surrendered in Myrnohrad. \nThe US is demanding a revision of the upcoming anti-Russian UN General Assembly resolution on Ukraine.\nRead more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132027Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 11, 2025\nOn November 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-12T06:47:03.132033Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 11, 2025\nOn November 11, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-12T06:47:03.132043Z"
    },
    {
      "original": "U.S. Largest Carrier Arrives In Latin America As Venezuela Holds More Military Drills (Videos)\nAircraft carrier USS Gerald R. Ford has begun operating in the United States Southern Command (SOUTHCOM) area of responsibility.\nThe Pentagon confirmed the arrival, which was first reported by Reuters news agency, saying in a statement on November 11 that it would help \"disrupt narcotics trafficking and degrade and dismantle Transnational Criminal Organizations.\"\nThe U.S. military has already carried out 19 strikes against boats allegedly carrying drugs in the Caribbean Sea and the eastern Pacific Ocean, killing 75 people.\nVenezuela has bracing for an attack by the U.S. The country’s military continues to conduct exercises with a focus on quick evacuation, and decentralized operations.\nRead more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132059Z"
    },
    {
      "original": "U.S. Largest Carrier Arrives In Latin America As Venezuela Holds More Military Drills (Videos)\nAircraft carrier USS Gerald R. Ford has begun operating in the United States Southern Command (SOUTHCOM) area of responsibility.\nThe Pentagon confirmed the arrival, which was first reported by Reuters news agency, saying in a statement on November 11 that it would help \"disrupt narcotics trafficking and degrade and dismantle Transnational Criminal Organizations.\"\nThe U.S. military has already carried out 19 strikes against boats allegedly carrying drugs in the Caribbean Sea and the eastern Pacific Ocean, killing 75 people.\nVenezuela has bracing for an attack by the U.S. The country’s military continues to conduct exercises with a focus on quick evacuation, and decentralized operations.\nRead more \nHERE",
      "timestamp": "2025-11-12T06:47:03.132067Z"
    }
  ],
  "script_run_time": "2025-11-12T06:47:03.132781Z"
}