{
  "messages": [
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-10-25T03:54:06.125742Z"
    },
    {
      "original": "🛵\n БпЛА південніше Сум, курс західний.",
      "timestamp": "2025-10-25T03:54:06.125761Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курс північний/північно-західний.",
      "timestamp": "2025-10-25T03:54:06.125766Z"
    },
    {
      "original": "🛵\n БпЛА західніше Сум, курс західний.\n🛵\n БпЛА в Богодухівському районі Харківщини, курс південний.\n🛵\n БпЛА на межі Чернігівщини та Сумщини, постійно змінює напрямок руху.\n🛵\n БпЛА на півночі Полтавщини, курс північно-західний.",
      "timestamp": "2025-10-25T03:54:06.125776Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T03:54:06.125781Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині, курсом на Мерефу.\n🛵\n БпЛА на Дніпропетровщині, курсом на Петропавлівку.\n🛵\n БпЛА на межі Чернігівщини та Сумщини, постійно змінює напрямок руху.\n🛵\n БпЛА на півночі Полтавщини, курс західний.",
      "timestamp": "2025-10-25T03:54:06.125790Z"
    },
    {
      "original": "🛵\n БпЛА на межі Чернігівщини та Сумщини, курс південний.",
      "timestamp": "2025-10-25T03:54:06.125795Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!\n🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T03:54:06.125801Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-25T03:54:06.125808Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-10-25T03:54:06.125812Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщині, курсом на Київщину!",
      "timestamp": "2025-10-25T03:54:06.125816Z"
    },
    {
      "original": "Швидкісна ціль на Чернігівщині, курсом на Київщину!",
      "timestamp": "2025-10-25T03:54:06.125821Z"
    },
    {
      "original": "Курсом на Київ!",
      "timestamp": "2025-10-25T03:54:06.125825Z"
    },
    {
      "original": "Ще швидкісні цілі курсом на Київ! Перебувайте в укриттях!",
      "timestamp": "2025-10-25T03:54:06.125828Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T03:54:06.125832Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння по всій території України.",
      "timestamp": "2025-10-25T03:54:06.125837Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння по всій території України.",
      "timestamp": "2025-10-25T03:54:06.125841Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-10-25T03:54:06.125845Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-10-25T03:54:06.125852Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-10-25T03:54:06.125856Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T03:54:06.125860Z"
    },
    {
      "original": "БпЛА в Корюківському районі Чернігівщини, курс південний.\n🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-10-25T03:54:06.125865Z"
    },
    {
      "original": "БпЛА в Богодухівському районі Харківщини, курс південний.",
      "timestamp": "2025-10-25T03:54:06.125869Z"
    },
    {
      "original": "2 explosions were heard in Kyiv from Iskander-M strikes.",
      "timestamp": "2025-10-25T03:54:06.630161Z"
    },
    {
      "original": "Threat of Oreshnik IRBMs from Kapustin Yar, Astrakhan Oblast. This is most likely related to Russia's nuclear exercises, but sirens are now sounding in all regions of Ukraine.",
      "timestamp": "2025-10-25T03:54:06.630172Z"
    },
    {
      "original": "A fire is burning in Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T03:54:06.630177Z"
    },
    {
      "original": "A fire is burning in Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T03:54:06.630181Z"
    },
    {
      "original": "A fire is burning in Kyiv from the Iskander strikes.",
      "timestamp": "2025-10-25T03:54:06.630184Z"
    },
    {
      "original": "The strikes on Kyiv targeted Ukrainian energy infrastructure, likely the CHP-6 Power Plant.",
      "timestamp": "2025-10-25T03:54:06.630187Z"
    },
    {
      "original": "The moment of one of the Iskander strikes on Kyiv.",
      "timestamp": "2025-10-25T03:54:06.630190Z"
    },
    {
      "original": "Threat of Oreshnik IRBMs from Kapustin Yar, Astrakhan Oblast. This is most likely related to Russia's nuclear exercises, but sirens are now sounding in all regions of Ukraine.",
      "timestamp": "2025-10-25T03:54:06.630193Z"
    },
    {
      "original": "The Oreshnik threat is confirmed to be from Russian tests. Sirens should be lifted in around 5-6 minutes.",
      "timestamp": "2025-10-25T03:54:06.630196Z"
    },
    {
      "original": "Footage showing the second Russian Iskander-M striking Kyiv.",
      "timestamp": "2025-10-25T03:54:06.630199Z"
    },
    {
      "original": "The Oreshnik threat is confirmed to be from Russian tests. Sirens should be lifted in around 5-6 minutes.",
      "timestamp": "2025-10-25T03:54:06.630202Z"
    },
    {
      "original": "Now there's a UAV threat for Astrakhan Oblast.",
      "timestamp": "2025-10-25T03:54:06.630205Z"
    },
    {
      "original": "Russia carried out additional long-range training over the northeast Pacific with their strategic bombers last night. \nOne Tu-95MS, escorted by two Su-35 fighters came close to the airspace of Sado Island, central Japan, forcing Japan to scramble fighters in response. The Russian MOD confirmed the incident, stating that they were escorted by fighters from a \"foreign country\" at one point. \nScheduled long-range training has delayed any future Russian large-scale, combined missile attacks on Ukraine involving strategic bombers, resulting in recent attacks all being carried out with missiles other than Kh-101s.",
      "timestamp": "2025-10-25T03:54:06.630211Z"
    },
    {
      "original": "Three Ukrainian HIMARS GMLRS rockets targeted the Belgorod Reservoir Dam, near the village of Grafovka, Belgorod Oblast. \nDamage was recorded to several buildings holding technical equipment, as well mechanisms of one of the sluices. The dam remains intact and is at no risk of collapsing. \nCoordinates: 50.41435, 36.75717",
      "timestamp": "2025-10-25T03:54:06.630216Z"
    },
    {
      "original": "Three Ukrainian HIMARS GMLRS rockets targeted the Belgorod Reservoir Dam, near the village of Grafovka, Belgorod Oblast. \nDamage was recorded to several buildings holding technical equipment, as well mechanisms of one of the sluices. The dam remains intact and is at no risk of collapsing. \nCoordinates: 50.41435, 36.75717",
      "timestamp": "2025-10-25T03:54:06.630220Z"
    },
    {
      "original": "During his visit to London, Zelensky presented an \"Octopus\" interceptor drone to British Prime Minister Starmer. \nDiscussions are ongoing between the UK and Ukraine to produce Octopus drones from within the UK, to then subsequently supply to Ukraine. The Octopus drone was initially developed domestically by Ukraine, but production will always be difficult due to Russian long-range strike capabilities and other internal factors. The UK plans to produce \"several thousand\" drones per month for supply to Ukraine. \nDue to ramped up production of Russian Geran-2 drones, and changes in their tactics, it has become increasingly difficult for Ukraine to intercept them with ordinary anti-air fire. The drones are now able to fly at very high altitudes, outside the range of most AA, before divebombing into their target, leaving only a very limited window of opportunity for interception. These new interceptor drones are known to have been effective in countering these Russian capabilities in the past, but current rates of production mean that their effect remains limited for the time being.",
      "timestamp": "2025-10-25T03:54:06.630225Z"
    },
    {
      "original": "During his visit to London, Zelensky presented an \"Octopus\" interceptor drone to British Prime Minister Starmer. \nDiscussions are ongoing between the UK and Ukraine to produce Octopus drones from within the UK, to then subsequently supply to Ukraine. The Octopus drone was initially developed domestically by Ukraine, but production will always be difficult due to Russian long-range strike capabilities and other internal factors. The UK plans to produce \"several thousand\" drones per month for supply to Ukraine. \nDue to ramped up production of Russian Geran-2 drones, and changes in their tactics, it has become increasingly difficult for Ukraine to intercept them with ordinary anti-air fire. The drones are now able to fly at very high altitudes, outside the range of most AA, before divebombing into their target, leaving only a very limited window of opportunity for interception. These new interceptor drones are known to have been effective in countering these Russian capabilities in the past, but current rates of production mean that their effect remains limited for the time being.",
      "timestamp": "2025-10-25T03:54:06.630230Z"
    },
    {
      "original": "A new drone view showing the destruction of Vovchansk City Centre, for which fighting has been ongoing for around 17 months. \nExtensive usage of Russian glide-bombs and constant back and forth fighting has left this part of the city practically flattened, with even the reinforced steel buildings no longer existing. Currently, Russia has begun a new series of assault operations on the less-destroyed western suburbs of Vovchansk, which has seen significant successes in recent weeks.",
      "timestamp": "2025-10-25T03:54:06.630234Z"
    },
    {
      "original": "A new drone view showing the destruction of Vovchansk City Centre, for which fighting has been ongoing for around 17 months.   Extensive usage of Russian glide-bombs and constant back and forth fighting has left this part of the city practically flattened…",
      "timestamp": "2025-10-25T03:54:06.630237Z"
    },
    {
      "original": "Correction: This footage is about 6 weeks old, but the level of destruction hasn't changed much since then.",
      "timestamp": "2025-10-25T03:54:06.630240Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations and have entered the first houses of Lyman City. \nIn the southeast, Russian forces continued to attack through the Yampil forest, moving south of the railway line in the direction of the road intersection southeast of Lyman. At the same time, they quickly advanced through the forests north of the tracks to the Masliakivka District of the city, entering its first houses. No consolidation has occurred here yet. \nTo the north, Russian forces continued pushing west through the Pynkiv Yar Gulley, slowing advancing through the forests towards its end. They were able to take additional positions here despite fierce Ukrainian resistance. \nFurther north, Russian forces began a new series of attacks west of Zarichne aimed at fully pushing the Ukrainians away from the village. After repelling Ukrainian counterattacks, they were able to break out of northwestern Zarichne into the Shablyn Yar Gulley, which was quickly brought under Russian control. This forced the Ukrainians to begin withdrawing from their strongpoints in the forests and agricultural buildings to the south to prevent being encircled. A large grey-zone has since formed at the abandoned positions, but the Russians have managed to take some positions in the eastern treelines and buildings. \nTo the northwest, over the past week, Russian forces have been carrying out assault operations on Stavky. After breaking into the village from the trenches to the north, Russia was able to consolidate in the northernmost houses and begin pushing south, fighting for each building towards the centre. A grey zone has now formed, encompassing the local school and surrounding areas, with the Ukrainians putting up fierce resistance despite Russian advances in the surrounding areas.\nTo the west, Russian forces broke through Ukrainian defences along the Drobysheve - Stavky Road and captured treeline positions there. They then advanced further, cutting the dirt road leading to Stavky and entering the nearby treelines, further pressuring the remaining Ukrainian formations in the village.\nMeanwhile, Russian forces continue to carry out assault operations in northern Drobysheve, and are trying to advance from the agricultural buildings and northern streets towards the town centre. They are also attempting to reach the village via the rest of the Bogdasarov Gulley. No new confirmed advances were recorded in these areas, however.\n+ ~9.99 km² in favour of Russia.",
      "timestamp": "2025-10-25T03:54:06.630252Z"
    },
    {
      "original": "On the northwestern flank of Lyman, and in the Borova direction, both Russian and Ukrainian forces have advanced, with Russian forces making significant progress towards the city of Svyatohirsk. \nRussian forces continued advancing through the Novoselivka forest and reached its northwestern edge. They were also able to establish control over the treelines on the tactical heights beyond it, before other forces began new attacks into the Sviati Hory National Park. The Russians were able to capture the Svyatohirsk Water Treatment Facility and gained a foothold in the forests of the national park. Due to a critical lack of manpower in this direction, Ukrainian forces put up limited resistance as the Russians advanced through the forests on multiple axes. \nRussian forces advanced west through the forests towards the Sosnove - Oleksandrivka Railway Line and Road and are rapidly approaching it. They are also advancing down the road to western Yarova, and captured new positions in the forests there. Additionally, the Russian soldiers who infiltrated southeastern Yarova were forced to withdraw after meeting fierce resistance from the Ukrainian garrison there and instead began attacks towards the village from forested areas further west. \nMeanwhile, Ukrainian forces continued their counterattacks in the village of Ridkodub. As a result of intensified attacks, they were able to recapture the agricultural buildings on the northern outskirts of the settlement, while the Russians largely pulled back to its easternmost street.\n+ ~7.09 km² in favour of Russia.\n+ ~0.50 km² in favour of Ukraine.",
      "timestamp": "2025-10-25T03:54:06.630258Z"
    },
    {
      "original": "U.S. Bombers Flew Over Caribbean Again, Venezuela Deployed ‘Thousands’ Of Air Defenses\nUnited States Air Force bombers flew again over the Caribbean Sea as President Donald Trump renewed threats of land operations against drug cartels in Venezuela and President Nicolas Maduro announced the deployment of “thousands” of air defenses across the country.\nTensions have been on the rise between Venezuela and the U.S. since August, when the Trump administration doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges then deployed a naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nEarlier this month, a trio of U.S. Air Force’s B-52 bombers were tracked over the Caribbean close to Venezuela in an apparent show of force.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165419Z"
    },
    {
      "original": "U.S. Bombers Flew Over Caribbean Again, Venezuela Deployed ‘Thousands’ Of Air Defenses\nUnited States Air Force bombers flew again over the Caribbean Sea as President Donald Trump renewed threats of land operations against drug cartels in Venezuela and President Nicolas Maduro announced the deployment of “thousands” of air defenses across the country.\nTensions have been on the rise between Venezuela and the U.S. since August, when the Trump administration doubled the reward for the arrest of Maduro to $50 million on drug trafficking charges then deployed a naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nEarlier this month, a trio of U.S. Air Force’s B-52 bombers were tracked over the Caribbean close to Venezuela in an apparent show of force.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165436Z"
    },
    {
      "original": "Russian Army Captures Town Near Seversk, Expands Control Along Kharkiv & Repels Attack \nOn October 24, the Russian military captured a key settlement near the city of Seversk in Donetsk, expanded its control along the border with Kharkiv, and repelled a Ukrainian counterattack close to the city of Kupyansk.\nIn Donetsk, the Yug [South] Group of Forces captured Dronivka, located right to the northwest of Seversk, according to the Russian Ministry of Defense. The attack on the settlement was led by the 7th Separate Guards Motor Rifle Brigade, which was congratulated by Defense Minister Andrey Belousov.\n“You have made a significant step towards Victory and achieving the goals of the special military operation. There is no doubt that new successes will follow,” MoD quoted Belousov as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165446Z"
    },
    {
      "original": "Russian Army Captures Town Near Seversk, Expands Control Along Kharkiv & Repels Attack \nOn October 24, the Russian military captured a key settlement near the city of Seversk in Donetsk, expanded its control along the border with Kharkiv, and repelled a Ukrainian counterattack close to the city of Kupyansk.\nIn Donetsk, the Yug [South] Group of Forces captured Dronivka, located right to the northwest of Seversk, according to the Russian Ministry of Defense. The attack on the settlement was led by the 7th Separate Guards Motor Rifle Brigade, which was congratulated by Defense Minister Andrey Belousov.\n“You have made a significant step towards Victory and achieving the goals of the special military operation. There is no doubt that new successes will follow,” MoD quoted Belousov as saying.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165455Z"
    },
    {
      "original": "Russian Army Increases Pressure On Pokrovsk, Captures Another Town Along Yanchur River \nOn October 24, the Russian military increased pressure on Ukrainian troops in the city of Pokrovsk in Donetsk, capturing a nearby town, and made additional gains along the Yanchur River in Dnepropetrovsk.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Promin just a few kilometers to the southeast of Pokrovsk. This was the last urban center under the control of Kiev forces to the east of Myrnohrad. After capturing the settlement, Russian troops will likely expand operations within Myrnohrad, as well as to the south of Pokrovsk, mainly between Sukhyi Yar and Lysivka.\nUkrainian defenses in Pokrovsk itself appear to be collapsing. The Tsentr Group of Forces is reported to be in control of all areas to the south of the railroad that splits the city in half.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165463Z"
    },
    {
      "original": "Russian Army Increases Pressure On Pokrovsk, Captures Another Town Along Yanchur River \nOn October 24, the Russian military increased pressure on Ukrainian troops in the city of Pokrovsk in Donetsk, capturing a nearby town, and made additional gains along the Yanchur River in Dnepropetrovsk.\nIn Donetsk, the Tsentr [Center] Group of Forces captured Promin just a few kilometers to the southeast of Pokrovsk. This was the last urban center under the control of Kiev forces to the east of Myrnohrad. After capturing the settlement, Russian troops will likely expand operations within Myrnohrad, as well as to the south of Pokrovsk, mainly between Sukhyi Yar and Lysivka.\nUkrainian defenses in Pokrovsk itself appear to be collapsing. The Tsentr Group of Forces is reported to be in control of all areas to the south of the railroad that splits the city in half.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165472Z"
    },
    {
      "original": "Russia Demonstrates Why It Would Be Best For US To Negotiate Another START\nOn October 22, President Vladimir Putin oversaw strategic nuclear forces drills, with official footage showing him controlling the situation from a special presidential room. He monitored the test launches of several types of strategic weapons, including ICBMs (intercontinental ballistic missiles), SLBMs (submarine-launched ballistic missiles) and ALCMs (air-launched cruise missiles). The Kremlin also released videos showing the tests from land, sea and air.\nThe drills were scheduled months ago, but many media outlets are claiming that Russia is sending a clear message with these exercises, especially now that US President Donald Trump called off the meeting with President Putin. Such interpretations might seem a bit far-fetched, but the truth is that it was certainly a mistake on Washington DC's part to cancel such an important meeting.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165480Z"
    },
    {
      "original": "Russia Tests AI-Aided Anti-Drone System With Rotary Guns \nRussia is testing a new anti-drone system based on twin GShG-7.62 machine guns with an artificial intelligence-powered aiming sight.\nVideo footage showing a successful live-fire test of the system, which took place somewhere in the Crimean Peninsula, surfaced online on October 23. During the test, the system took down a small fixed-wing drone flying at a low altitude within seconds.\nThe system is reportedly being developed by a Saint Petersburg-based company. It consists of two manually-controlled GShG-7.62 machine guns with an aiming sight built around a thermal imager and a radar with AI identification and tracking feature.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165488Z"
    },
    {
      "original": "Russia Tests AI-Aided Anti-Drone System With Rotary Guns \nRussia is testing a new anti-drone system based on twin GShG-7.62 machine guns with an artificial intelligence-powered aiming sight.\nVideo footage showing a successful live-fire test of the system, which took place somewhere in the Crimean Peninsula, surfaced online on October 23. During the test, the system took down a small fixed-wing drone flying at a low altitude within seconds.\nThe system is reportedly being developed by a Saint Petersburg-based company. It consists of two manually-controlled GShG-7.62 machine guns with an aiming sight built around a thermal imager and a radar with AI identification and tracking feature.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165501Z"
    },
    {
      "original": "Israel Kills Hezbollah’s Logistics Chief Amid Reports Of Near Large Attack On Lebanon\nThe Israeli Air Force killed Hezbollah’s south Lebanon logistics chief Abbas Hassan Karaki in a drone strike on October 24, amid reports of ongoing preparations by the Israeli Defense Forces (IDF) for a large attack against the country.\nKaraki was targeted in the southern town of Toul. Lebanon’s health ministry said the drone strike killed two people and wounded two others.\nIn a statement, the IDF said that Karaki was the head of logistics in Hezbollah’s so-called Southern Front, and held other senior roles in the group in recent years.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165510Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165520Z"
    },
    {
      "original": "A ‘Safari’ Gone Wrong: Foreign Mercenaries’ Disillusionment with the Ukrainian Military\nThe easy money promised by propaganda comes at a heavy price. The 'hunt' for Russian soldiers' heads turned out to be no easy walk in the park. Foreign mercenaries began to desert the Ukrainian army in large numbers.\nThroughout the conflict in Ukraine, Kyiv has been trying to solve one of the army's most pressing problems: replenishing its ranks with trained, motivated personnel. Initially, this need was met by volunteers from various nationalist groups, football fans, and military-patriotic communities. However, this was not enough.\nWestern media outlets launched a massive social media and mass media campaign to encourage people to join the Armed Forces of Ukraine. The campaign had several strands:\nFirstly, the campaign emphasised the recruitment of residents of the post-Soviet space who held negative views of Russia...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165529Z"
    },
    {
      "original": "PERSISTENT PRESSURE: RUSSIAN FORCES MAKE INCREMENTAL GAINS ACROSS EASTERN FRONT",
      "timestamp": "2025-10-25T03:54:07.165532Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165539Z"
    },
    {
      "original": "Ukrainian Reserves Shortage: Russian Forces Press Offensive On Seven Fronts\nIn the Zaporizhzhia sector, full control of the village of Pershotravneve was established following a successful crossing of the Yangach River. Russian units have reached the eastern outskirts of Mirnohrad and consolidated their positions in the west of Rodinske. \nThe decision on the use of frozen Russian assets has been postponed until the next EU summit.\nRead more \nHERE",
      "timestamp": "2025-10-25T03:54:07.165546Z"
    }
  ],
  "script_run_time": "2025-10-25T03:54:07.166440Z"
}