{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння в областях, де оголошено повітряну тривогу.",
      "timestamp": "2025-09-01T04:42:02.150526Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.\n🛬\n Продовжується активність ворожої тактичної авіації на східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-01T04:42:02.150544Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному та східному напрямках! \n🚀\n Загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-01T04:42:02.150552Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Чернігівщині та Сумщині \n➡️\n курсом на південь.",
      "timestamp": "2025-09-01T04:42:02.150559Z"
    },
    {
      "original": "🛵\n Група ворожих БпЛА на Дніпропетровщині \n➡️\n курсом на захід.",
      "timestamp": "2025-09-01T04:42:02.150564Z"
    },
    {
      "original": "🛵\n ударні БпЛА на Чернігівщині \n➡️\n курсом на Київщину.\n🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Чернігівщину та Полтавщину.",
      "timestamp": "2025-09-01T04:42:02.150573Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.",
      "timestamp": "2025-09-01T04:42:02.150590Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на сході Дніпропетровщини \n➡️\n курсом на північ.\n🛵\n ворожі БпЛА на сході Донеччини \n➡️\n курсом на північний схід/південь.",
      "timestamp": "2025-09-01T04:42:02.150599Z"
    },
    {
      "original": "🛵\n нова група ударних БпЛА на Донеччині \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-09-01T04:42:02.150605Z"
    },
    {
      "original": "⚠\nУвага!\n🛬\n Спостерігається активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\n Загроза застосування авіаційних засобів ураження!\n🚀\nПуски КАБ на Сумщину!",
      "timestamp": "2025-09-01T04:42:02.150614Z"
    },
    {
      "original": "🚀\n Запоріжжя - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-01T04:42:02.150618Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.",
      "timestamp": "2025-09-01T04:42:02.150624Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на Полтавщину та Чернігівщину.\n🛵\n ударні БпЛА на Полтавщині \n➡️\n курсом на захід.\n🛵\n ворожі БпЛА на півночі Чернігівщини \n➡️\n курсом північний захід.",
      "timestamp": "2025-09-01T04:42:02.150638Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Сумщині \n➡️\n курсом на захід.\n🛵\n ударні БпЛА на Полтавщині \n➡️\n західним курсом.\n🛵\n ворожі БпЛА на Чернігівщині \n➡️\n курсом північний захід та південь.\n🛵\n ворожі БпЛА на півночі Київщини \n➡️\n курсом на Житомирщину.",
      "timestamp": "2025-09-01T04:42:02.150652Z"
    },
    {
      "original": "🛵\n ворожі БпЛА на Черкащині \n➡️\n курсом на Київщину.",
      "timestamp": "2025-09-01T04:42:02.150658Z"
    },
    {
      "original": "🛵\n на півдні Чернігівщини ворожий БпЛА \n➡️\n курсом на Київщину.",
      "timestamp": "2025-09-01T04:42:02.150665Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА в акваторії Чорного моря в напрямку Одещини",
      "timestamp": "2025-09-01T04:42:02.150669Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-01T04:42:02.150675Z"
    },
    {
      "original": "🚀\n Запоріжжя - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-01T04:42:02.150679Z"
    },
    {
      "original": "🛵\n на півдні Чернігівщини ворожий БпЛА \n➡️\n курсом на Київщину.",
      "timestamp": "2025-09-01T04:42:02.150685Z"
    },
    {
      "original": "Striking August\nRussia used 4136 drones 60% of July, probably accumulating them after the mid summer performance.\n691 drone reached a target, even more fall as debris.\nFPVs surpassed barrages by the end of month.\nOverall numbers are next:\nBarrages: 166471 \n⬇️\nFPVs: 147444 \n⬆️\n⬆️\nBombs: 4400 \n⬆️\n⬆️\nMLRS: 2478 \n⬇️",
      "timestamp": "2025-09-01T04:42:02.833216Z"
    },
    {
      "original": "Striking August\nRussia used 4136 drones 60% of July, probably accumulating them after the mid summer performance.\n691 drone reached a target, even more fall as debris.\nFPVs surpassed barrages by the end of month.\nOverall numbers are next:\nBarrages: 166471 \n⬇️\nFPVs: 147444 \n⬆️\n⬆️\nBombs: 4400 \n⬆️\n⬆️\nMLRS: 2478 \n⬇️",
      "timestamp": "2025-09-01T04:42:02.833237Z"
    },
    {
      "original": "Russian forces have re-established control over the village of Plavni, Stepnohirsk direction, Zaporizhzhia Oblast.\nPre-war population: ~329.\nTotal land area: ~2.13 km².",
      "timestamp": "2025-09-01T04:42:02.833242Z"
    },
    {
      "original": "Multiple sources are reporting that the spokesperson for the Al-Qassam Brigades (armed wing of Hamas) was killed in an Israeli airstrike on the Gaza Strip yesterday.   This is unconfirmed and should be treated as such considering Israel's track record of not…",
      "timestamp": "2025-09-01T04:42:02.833246Z"
    },
    {
      "original": "The IDF announced that Al-Qassam Brigades Spokesperson Abu Obeida was killed in an Israeli airstrike yesterday. This was then later confirmed by Palestinian sources affiliated with the Al-Qassam Brigades, as well as relatives of Abu Obeida.",
      "timestamp": "2025-09-01T04:42:02.833249Z"
    },
    {
      "original": "FPV drones from the Ukrainian GUR's \"Prymary\" special operations unit continues to attack valuable Russian targets in Crimea. \nIn a new compilation of footage from recent attacks, FPV drones attacked:\nRLK “Utyos-T” Radar System\nRT-70 radio telescope\n“GLONASS” dome complex\nMR-10M1 Mys radar\n96L6-AP radar for the S-400 Air defence system\nAs usual, the drones were launched from USVs in the waters of the Black Sea.",
      "timestamp": "2025-09-01T04:42:02.833258Z"
    },
    {
      "original": "I personally believe that Israel is gearing up to annex the Palestinian controlled parts of The West Bank. Here are a few reasons why.   1. In their briefings and announcements on \"anti-terrorist operations\" in the West Bank, the IDF has begun referring to…",
      "timestamp": "2025-09-01T04:42:02.833265Z"
    },
    {
      "original": "Let's see if my \nprediction\n from the beginning of the year holds up. \nhttps://t.me/DefenderDome/13550",
      "timestamp": "2025-09-01T04:42:02.833270Z"
    },
    {
      "original": "A Ukrainian UAV attack on the Ilsky refinery in Krasnodar Krai is currently ongoing. There are reports of a fire burning in the area. Russian air defence is currently working on the UAVs from the Primorsko-Akhtarsk - Severskaya area, which is the source of the explosions heard there. \nA U.S. RQ-4B Global Hawk reconnaissance drone was operating over the Black Sea earlier, guiding the Ukrainian drones to their targets in Crimea and Krasnodar Krai.",
      "timestamp": "2025-09-01T04:42:02.833275Z"
    },
    {
      "original": "Launch of 3 Ukrainian Flamingo cruise missiles, likely from Tuzly or somewhere in southern Odessa Oblast.   It remains unclear if these launches were for combat use, as the missile has not yet been reported in any confirmed strike, though the activity appears…",
      "timestamp": "2025-09-01T04:42:02.833278Z"
    },
    {
      "original": "Three Ukrainian flamingo cruise missiles, probably launched from Odesa Oblast, targeted a Russian Army Barracks near the village of Voloshyne, northern Crimea. Local sources report that the barracks partially burned down.\nSatellite imagery has now been published showing significant damage to the complex, confirming the reports. This is the first confirmed usage of the Flamingo missile so far.\nSatellite imagery credit: \nhttps://t.me/Crimeanwind/85519",
      "timestamp": "2025-09-01T04:42:02.833284Z"
    },
    {
      "original": "Three Ukrainian flamingo cruise missiles, probably launched from Odesa Oblast, targeted a Russian Army Barracks near the village of Voloshyne, northern Crimea. Local sources report that the barracks partially burned down.\nSatellite imagery has now been published showing significant damage to the complex, confirming the reports. This is the first confirmed usage of the Flamingo missile so far.\nSatellite imagery credit: \nhttps://t.me/Crimeanwind/85519",
      "timestamp": "2025-09-01T04:42:02.833289Z"
    },
    {
      "original": "Ukrainian UAVs have impacted Sevastopol Airport in Crimea. Multiple explosions were heard, and a large fire is now burning.   Explosions were also heard in the area of Saki Airbase, where three smaller fires are burning. It is unclear if these fires are from…",
      "timestamp": "2025-09-01T04:42:02.833293Z"
    },
    {
      "original": "Satellite imagery shows that as a result of the Ukrainian UAV attack on Crimea on August 30, Simferopol Airport was hit. The imagery shows two impact points with traces of burning where 1 Mi-8 and 1 Mi-24 helicopter were previously stationed. \nImagery credit: \nhttps://t.me/avivector/2944",
      "timestamp": "2025-09-01T04:42:02.833299Z"
    },
    {
      "original": "Russian Geran-2 drones once again attacked the city of Pavlohrad, Dnipropetrovsk Oblast. The main target appears to be the Pavlohrad Chemical plant, where detonations of rocket fuel were observed. \nMore details later.",
      "timestamp": "2025-09-01T04:42:02.833303Z"
    },
    {
      "original": "Guess who found the stickers! \n😱\n👌",
      "timestamp": "2025-09-01T04:42:02.833311Z"
    },
    {
      "original": "In the Kostyantynivka direction, Ukrainian forces advanced and recaptured previously lost positions in the village of Predtechyne.\nFollowing the Russian capture of Predtechyne, Ukrainian forces were able to constrain the Russian attacks on positions surrounding Kostyantynivka, slowing their advance and regrouping the remainder of their FPV drone operators who were outside the city, in the city. After the last section of the Siversky Donets line fell, Russian forces began focusing on capturing positions outside the large, fortified forest southeast of Stupochky, and then storming it. Neither of these goals were achieved. \nAfter their successful defence in the forest, Ukrainian forces then attempted a series of counterattacks towards the highway northwest of Predtechyne, but were unsuccessful. However, this did tie up Russian forces in the area and eventually led to the Russians attempting to advance towards the eastern dachas of Kostyantynivka. Nevertheless, Ukrainian forces were able to consolidate in the forest north of the highway and began advancing towards Predtechyne. They secured isolated positions west of the village, before entering it and taking up positions in the western houses. Russian forces, who had supply issues due to the increase in Ukrainian FPV drone attacks from Kostyantynivka, withdrew to the eastern houses. \n+ ~9.09 km² in favour of Ukraine.",
      "timestamp": "2025-09-01T04:42:02.833317Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces continued to quickly advance and have made additional progress towards the goal of eliminating the rest of the Russian salient.\nUkrainian forces advanced in two areas. In the west, following Russian withdrawals to shorten the line of contact, Ukrainian forces advanced from their newly recaptured positions west of Rubizhne and northeast of Stepy, recapturing the rest of the treelines on the tactical heights. From there, forces from 12th Special Forces Brigade \"Azov\" advanced from the treelines north of Vilne, and cleared part of the Velyka Balka Gulley. They then crossed the Hruzke River, capturing further positions in the forest plantations, and entered the village of Kucheriv Yar. It is currently unclear if they were able to establish a permanent presence in the settlement, however. Additionally, Ukrainian forces advanced from their positions south of Zolotyi Kolodyaz and cleared the northernmost part of the Velyka Balka Gulley, facilitating the entry into Kucheriv Yar.\nIn the east, after capturing the treelines on the tactical heights west of Toretske, Ukrainian forces from the 93rd Mechanised Brigade advanced north down the gulley south of Hruzke, forcing the remaining Russian formations stationed east of the Shakhove - Hruzke road to withdraw to positions in the treelines south of Kucheriv Yar. \n+ ~15.57km² in favour of Ukraine.",
      "timestamp": "2025-09-01T04:42:02.833322Z"
    },
    {
      "original": "In the Novopavlivka direction, over the past week both Russian and Ukrainian forces have been advancing north of the Vovcha River.\nRussian forces were able to cross the Vovcha River and took up positions in the forests southwest of Fillya. After reinforcements were brought in, they began storming the village of Fillya. They entered the southern houses and took up positions there. Ukrainian forces, utilising the trench fortifications in the forest to the north were able to hold the northern part of the settlement, and launched a few counterattacks, however these were repelled. Russian forces responded by dropping several FAB glide-bombs on this forest. \nTo the east, Ukrainian forces continued their slow advance towards Dachne. They completed the capture of the forest west of the village, and secured positions in the treeline to the east. Other forces then advanced south from the treelines in the area of the highway and captured the large trench fortification on the northern approaches to the village. This fortification was then used to enter Dachne, where they captured the western houses. The rest of the settlement is in the grey zone. \n+ ~5.23km² in favour of Russia.\n+ ~4.32 km² in favour of Ukraine.",
      "timestamp": "2025-09-01T04:42:02.833330Z"
    },
    {
      "original": "Yesterday evening and overnight, around 18 Russian Geran-2 drones attacked Donetsk Oblast. Impacts were recorded in Druzhkivka, Kostyanytnivka, Dobropillya, and Ivers'ke. Media 1 shows a Geran impact in Druzhkivka. Media 2 shows a fire burning in Kostyantynivka.",
      "timestamp": "2025-09-01T04:42:02.833334Z"
    },
    {
      "original": "Yesterday evening and overnight, around 18 Russian Geran-2 drones attacked Donetsk Oblast. Impacts were recorded in Druzhkivka, Kostyanytnivka, Dobropillya, and Ivers'ke. Media 1 shows a Geran impact in Druzhkivka. Media 2 shows a fire burning in Kostyantynivka.",
      "timestamp": "2025-09-01T04:42:02.833337Z"
    },
    {
      "original": "Last night, Russia carried out a Geran-2 drone attack on Kyiv Oblast. At least 12 impacts were recorded, 10 of which were in Bila Tserkva, along with a minimum of 2 in the area of Fastiv. \nGerbera (parody) drones played a significant role in decreasing the number of Gerans being shot down by Ukrainian air defence. Videos are all from Bila Tserkva.",
      "timestamp": "2025-09-01T04:42:02.833343Z"
    },
    {
      "original": "Last night, Russia carried out a Geran-2 drone attack on Kyiv Oblast. At least 12 impacts were recorded, 10 of which were in Bila Tserkva, along with a minimum of 2 in the area of Fastiv. \nGerbera (parody) drones played a significant role in decreasing the number of Gerans being shot down by Ukrainian air defence. Videos are all from Bila Tserkva.",
      "timestamp": "2025-09-01T04:42:02.833347Z"
    },
    {
      "original": "For the first time in over a month, I'm now fully caught up with Ukraine map updates. Expect much less of a delay in the coming days as I'm able to cover the newest developments. \nAlso, as per usual, I will release my report on the monthly changes on the battlefield for the month of August tomorrow, September 2nd (New Zealand Time), but in light of recent developments with Ukraine retaking ground that Russia initially took within the past month, I'd like to remind you all that the monthly changes report covers net gains for each side. Ukrainian advances that took place on territory Russia occupied within that same month will simply be subtracted from the Russian total.",
      "timestamp": "2025-09-01T04:42:02.833351Z"
    }
  ],
  "script_run_time": "2025-09-01T04:42:03.324181Z"
}