{
  "messages": [
    {
      "original": "🛵\n БпЛА на Білу Церкву зі сходу.",
      "timestamp": "2025-12-27T14:33:33.990729Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Житомира з північного сходу.",
      "timestamp": "2025-12-27T14:33:33.990746Z"
    },
    {
      "original": "🛵\n Житомир - в укриття!",
      "timestamp": "2025-12-27T14:33:33.990753Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Сум з північного сходу.",
      "timestamp": "2025-12-27T14:33:33.990759Z"
    },
    {
      "original": "🛵\n Декілька груп БпЛА з півночі \n➡️\n на Київ. \n🛵\n Житомирщина: БпЛА \n➡️\n повз Малин.\n🛵\n Чернігівщина: БпЛА \n➡️\n на Ніжин.\n🛵\n Сумщина: БпЛА \n➡️\n на Суми та в районі Конотопу.",
      "timestamp": "2025-12-27T14:33:33.990780Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Дніпропетровщині (Кам'янський район)",
      "timestamp": "2025-12-27T14:33:33.990785Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА з півдня у напрямку н.п. Кам'янське.",
      "timestamp": "2025-12-27T14:33:33.990791Z"
    },
    {
      "original": "🛵\n БпЛА з півночі у напрямку Києва.",
      "timestamp": "2025-12-27T14:33:33.990796Z"
    },
    {
      "original": "🛵\n БпЛА з південного сходу у напрямку Кременчука.",
      "timestamp": "2025-12-27T14:33:33.990802Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 503 ЦІЛІ ПРОТИВНИКА\n \nУ ніч на 27 грудня (з 18:00 26 грудня) противник завдав комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного, морського та наземного базування.\n❗️\nОсновний напрямок удару – Київщина.\nЗагалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 559-ти засобів повітряного нападу – 40 ракет та 519 БпЛА різних типів:\n- 519 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Орел, Міллерово, Шаталово, Приморсько-Ахтарськ – рф, Гвардійське – ТОТ АР Крим (близько 300 із них – «шахеди»);\n- 10 балістичних/аеробалістичних ракет Іскандер-М/Х-47М2 «Кинджал» (райони пусків – Рязанська, Брянська обл. – рф);\n- 7 крилатих ракет Іскандер-К/Калібр (район пуску – Ростовська область, акваторія Чорного моря);\n- 21 крилатої ракети Х-101 (райони пусків – повітряний простір Вологодської обл. - рф);\n- 2 крилатих ракет Х-22 із повітряного простору над акваторією Чорного моря.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\nЗа попередніми даними, станом на 13.00, протиповітряною обороною збито/подавлено 503 повітряні цілі:\n- 474 ворожих БпЛА типу Shahed, Гербера (безпілотників інших типів);\n- 6 балістичних/аеробалістичних ракет Іскандер-М/Х-47М2 «Кинджал»;\n- 4 крилаті ракети Іскандер-К/Калібр;\n- 19 крилатих ракет Х-101.\nЗафіксовано влучання 10 ракет та 25 ударних БпЛА на 30-ти локаціях, падіння збитих (уламки) – на 16 локаціях.\nКрім того, одна з ракет не досягла цілей, інформація щодо 15 (локаційно втрачених) БпЛА уточнюється, декілька ворожих БпЛА в повітрі. Дотримуйтесь заходів безпеки!\n \n✊\n Тримаймо небо!\n \n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-27T14:33:33.990830Z"
    },
    {
      "original": "🛵\n Полтавщина: БпЛА з півночі у напрямку Миргорода.",
      "timestamp": "2025-12-27T14:33:33.990836Z"
    },
    {
      "original": "🛵\n БпЛА з півночі у напрямку Києва/Броварів.",
      "timestamp": "2025-12-27T14:33:33.990841Z"
    },
    {
      "original": "🛵\n БпЛА з півночі у напрямку Харкова.",
      "timestamp": "2025-12-27T14:33:33.990845Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА повз Обухів курсом на схід.",
      "timestamp": "2025-12-27T14:33:33.990850Z"
    },
    {
      "original": "🛵\n БпЛА над Кременчуцьким водосховищем рухається у напрямку Черкас.",
      "timestamp": "2025-12-27T14:33:33.990855Z"
    },
    {
      "original": "📹\n Бойова робота захисників неба під час масованого комбінованого удару ворога у ніч на 27 грудня 2025 року\n✊\n Тримаймо небо!",
      "timestamp": "2025-12-27T14:33:33.990860Z"
    },
    {
      "original": "🛵\n Київщина: БпЛА \n➡️\n повз Глеваху у напрямку Василькова.",
      "timestamp": "2025-12-27T14:33:33.990866Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-12-27T14:33:33.990871Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу!",
      "timestamp": "2025-12-27T14:33:33.990875Z"
    },
    {
      "original": "Миргород!",
      "timestamp": "2025-12-27T14:33:33.990879Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Харківщину зі сходу.",
      "timestamp": "2025-12-27T14:33:33.990883Z"
    },
    {
      "original": "As a result of the recent Russian combined missile and drone attack, around 600,000 consumers in Kyiv Oblast are currently without power. Work is underway to restore power supply.",
      "timestamp": "2025-12-27T14:33:34.573267Z"
    },
    {
      "original": "A large fire is burning at an enterprise in Bila Tserkva, Kyiv Oblast, following Russian Geran-2 drone strikes.",
      "timestamp": "2025-12-27T14:33:34.573280Z"
    },
    {
      "original": "A large fire is burning at an enterprise in Bila Tserkva, Kyiv Oblast, following Russian Geran-2 drone strikes.",
      "timestamp": "2025-12-27T14:33:34.573284Z"
    },
    {
      "original": "Extremely close call from a Geran-2 drone in Kyiv.",
      "timestamp": "2025-12-27T14:33:34.573288Z"
    },
    {
      "original": "Myrne, Polohy direction. Another interesting correction.\nUkrainian forces control Myrne: Barbed wire placement is observed from early October to mid-November in the white circles of photo #1.\nThis cannot be placement by the Russian side because:\n1. The wire has been placed in a half arch pointing south and is itself located south of Myrne\n2. Russian forces basically never place barbed wire in long lines and at most surround their individual dugout or trench. The only place where this has been found is in their Surovikin line, a case that definitely doesn't apply here.\nThe frontline drawn is extremely approximate and will be subject to changes in the future if more information becomes available.\nThis also lines up with this post: \nhttps://t.me/ShalinW/6872",
      "timestamp": "2025-12-27T14:33:34.573297Z"
    },
    {
      "original": "Myrne, Polohy direction. Another interesting correction.\nUkrainian forces control Myrne: Barbed wire placement is observed from early October to mid-November in the white circles of photo #1.\nThis cannot be placement by the Russian side because:\n1. The wire has been placed in a half arch pointing south and is itself located south of Myrne\n2. Russian forces basically never place barbed wire in long lines and at most surround their individual dugout or trench. The only place where this has been found is in their Surovikin line, a case that definitely doesn't apply here.\nThe frontline drawn is extremely approximate and will be subject to changes in the future if more information becomes available.\nThis also lines up with this post: \nhttps://t.me/ShalinW/6872",
      "timestamp": "2025-12-27T14:33:34.573305Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance and have made significant progress in three different areas over the last 10 days.\nIn the northeast, Ukrainian forces completed their withdrawal from the salient encompassing the 2023 fortifications northeast of Zaliznyanske, allowing for the Russians to consolidate in the strongpoints there. From there, they began pushing further northwest to the next forest over, while assault groups on the flanks improved their positions in the treelines.\nTo the west, Russian forces continued attacking northwest from the area of Orikhovo-Vasylivka, capturing numerous treeline positions and entrenching in the first houses on southern Minkivka. With support from assault groups clearing the treelines to the south, Russian forces continued pushing west and northwest from their foothold, clearing additional positions and entering the central and southwestern parts of the village. \nAdditionally, the Russians established control over the treelines southeast and east of Minkivka and began a push up the E-40 Highway in the direction of Pryvillya, which Russian DRGs have already entered. They also managed to clear the rest of the fortified forest along the highway and consolidated in the remaining positions to the southeast. \nIn the southwest, Russian forces infiltrated the village of Novomarkove from their positions northwest of the village along the southern bank of the Siverskyi-Donets Canal. Other forces then entered its southern houses, allowing for it to be brought under full Russian control. They also improved their positions in the treelines to the south. \n+ ~16.27 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-27T14:33:34.573316Z"
    },
    {
      "original": "The Russian MOD has now resorted to Ukraine-like informational tactics regarding Kupyansk. \n\"Continuing to destroy small groups, hiding in the holes\"\n\"The city is under our control\"\n\"Clearing of basement premises\"\nSound familiar?\nThese must be some titan-like troops to be valiently carrying out these operations all while being encircled in multiple pockets. \nThis is yet another example of why you should NEVER consider any official government source as a reliable source when trying to accurately determine the true situation somewhere. \nThe narrative will likely change to \"we withdrew to more advantageous positions across the Oskil River\" in the coming weeks. It's all damage control.",
      "timestamp": "2025-12-27T14:33:34.573326Z"
    },
    {
      "original": "Russian forces now control approximately 83% of Hulyaipole.",
      "timestamp": "2025-12-27T14:33:34.573330Z"
    },
    {
      "original": "Organised Ukrainian resistance has come to an end in Hulyaipole. More than 90% of the city is under Russian control.",
      "timestamp": "2025-12-27T14:33:34.573334Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to quickly advance west of Siversk and have made significant progress on a wide front.\nIn the southwest, Russian forces began advancing west from the village of Pazeno, capturing new treeline positions and consolidating in the forested gulleys.\nTo the northeast, Russian forces advanced through the treelines on the tactical heights northeast of Pazeno, capturing a series of strongpoints and capturing most of the rest of the nearby forest. Other assault groups pushed north through the treelines and forested areas further east and reached the gulley running southwest from Riznykivka.\nAdditionally, following earlier infiltrations, Russian forces cleared the rest of Kuzmynivka which was abandoned by the Ukrainians due to additional Russian advances through the treelines to the north, outflanking it. From there, in coordination with attacks from Sviato-Pokrovske, the Russians managed to collapse the Ukrainian lines south of Sviato-Pokrovske, fully capturing the tactical heights there and aligning the front with the gulley to the west. \nTo the north, Russian forces consolidated in the eastern houses of Riznykivka. They also continued advancing along the tactical heights north of the Sukha River, consolidating in additional forests and breaking through to the northern part of Riznykivka.\nFurther north, the Russians continued expanding their zone of control in the fields west of Siversk. They secured the rest of the forested gulleys and established control over the surrounding treelines, advancing towards the southern end of the gulley leading south from Zakitne. Other assault groups continued advancing south down the gulley from Zakitne, and cleared the treeline positions to the east.\nTo the northwest, Russian forces cleared the rest of eastern Zakitne and began attacks on the central part of the settlement. They managed to infiltrate the village from the forests to the northeast and entrenched in the central houses. Fighting is ongoing for areas further west.\nIn the northwest, Russian forces continued to incrementally advance in and around Ozerne, clearing most of the rest of the forests north of the village. They also managed to marginally advance in its western houses.\n+ ~43.41 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-27T14:33:34.573347Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have made new progress in three different areas over the last 10 days.\nIn the south, Russian forces continued to advance through the forests north of Dibrova and have captured new positions further northwest. They also improved their positions in the area of the highway and are attempting to advance closer towards the southern outskirts of Lyman.\nTo the north, Russian forces resumed their attacks in the direction of Lyman, capturing a number of positions in forests in the area of the road bridge over the railway line. \nFurther north, Russian forces advanced west from the Pynkiv Yar Gulley, capturing positions in the treelines on the tactical heights. DRGs have since infiltrated further west and reached the northern edge of Lyman.\n+ ~2.54 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-27T14:33:34.573355Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance as the last Ukrainian defences in Hulyaipole collapse.\nRussian forces continued pushing west from the area of the administrative building and captured the rest of the city centre. This forced the remaining Ukrainian formations to withdraw from the rest of their strongholds in the high-rise buildings, which in turn allowed for the Russians to collapse their lines and capture large parts of the remaining low-rise residential areas.\nSince then, Russian forces have begun attacking the industrial zone on the western edge of Hulyaipole, and have captured most of the rest of the residential streets.\nThis collapse, like all the previous advances, has been caused primarily due to a complete breakdown in coordination between Ukrainian units, and terrible command decisions which has so far led to at least 20 soldiers being encircled (although this number is likely higher). Superior Russian manpower and firepower has resulted in Ukrainian forces suffering heavy casualties while attempting their chaotic withdrawal. \n+ ~2.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-27T14:33:34.573363Z"
    },
    {
      "original": "Over the past couple weeks, several channel owners have reached out to me asking for cross-promotions and advertising. \nI just want to put this out there now: I don't plan on ever cross-promoting or advertising for anyone, or get this channel advertised anywhere. Telegram already puts ads on channels, which is already more than enough. If anything, extra ads just make the viewing experience more disrupted and inconvenient. I also can't guarantee the reliability and ethics of most channels without actually knowing them and following them for some time, so I wouldn't want to promote someone who doesn't provide ethical and fair news. \nSo, if you're a channel owner looking to promote, please don't ask me. I'm more than happy to forward interesting posts from channels, but I don't want to get involved in the advertising space.",
      "timestamp": "2025-12-27T14:33:34.573368Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-27T14:33:34.573371Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-27T14:33:34.573374Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-27T14:33:34.573377Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-27T14:33:34.573381Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-27T14:33:34.573384Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-27T14:33:34.573390Z"
    },
    {
      "original": "Speed seemed similar to that of an S-400 air defence missile, but it was detected late.\nIt disappeared in western Poltava Oblast.",
      "timestamp": "2025-12-27T14:33:34.573394Z"
    },
    {
      "original": "Both Ukrainska Pravda and Deepstate report that the commander of the Ukrainian 54th Mechanised Brigade has been removed from his position due to the fall of Siversk and false reports made from his area.\nAdditionally, the commander of the 10th Separate Mountain Assault Brigade is expected to be removed from his position once he returns from ongoing medical treatment.",
      "timestamp": "2025-12-27T14:33:34.573398Z"
    },
    {
      "original": "Consequences of the Russian missile strikes on the Kyiv Hydroelectric Power Plant this morning. \n~3 Kh-101 cruise missiles impacted it.",
      "timestamp": "2025-12-27T14:33:34.573402Z"
    },
    {
      "original": "Powerline air defence in Kyiv",
      "timestamp": "2025-12-27T14:33:34.573405Z"
    },
    {
      "original": "Elite Russian Drone Unit Eliminates Ukrainian Tank Gathering Near Kostiantynivka (Videos)\nThe Center for Advanced Unmanned Technologies “Rubicon” announced on December 26 that it has destroyed more than two dozen Ukrainian armored vehicles which were gathered in the Kostiantynivka direction in Donetsk in a well-planned special operation.\nThe gathering was near the city of Druzhkivka, a logistics and command hub of Kiev forces located right to the north of the city of Kostiantynivka where the Russian military’s Yug [South] Group of Forces is currently advancing.\nRubicon said that the gathering was discovered by one of its drone pilots on December 20, and was quickly targeted in an attack that went on for hours.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204474Z"
    },
    {
      "original": "Elite Russian Drone Unit Eliminates Ukrainian Tank Gathering Near Kostiantynivka (Videos)\nThe Center for Advanced Unmanned Technologies “Rubicon” announced on December 26 that it has destroyed more than two dozen Ukrainian armored vehicles which were gathered in the Kostiantynivka direction in Donetsk in a well-planned special operation.\nThe gathering was near the city of Druzhkivka, a logistics and command hub of Kiev forces located right to the north of the city of Kostiantynivka where the Russian military’s Yug [South] Group of Forces is currently advancing.\nRubicon said that the gathering was discovered by one of its drone pilots on December 20, and was quickly targeted in an attack that went on for hours.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204498Z"
    },
    {
      "original": "MOBILIZATION BY FORCE, LIFE BY PRIVILEGE: THE DEEPENING SOCIAL SPLIT IN WARTIME UKRAINE",
      "timestamp": "2025-12-27T14:33:35.204505Z"
    },
    {
      "original": "Key Heights And Forests: Russian Army Makes Tactical Moves Against Ukrainian Forces In Slaviansk\nIn the Kharkiv sector, Russian units are achieving tactical success by advancing south of Vilcha towards Hrafskyi and capturing strongpoints in forested areas. In the Slaviansk sector, after establishing control over Sviato-Pokrovske, assault groups have reached the eastern part of Reznykivka. They are conducting fierce fighting in Zakotne and the Bondarne area. In the Zaporizhzhia sector, Kosivtsiv was taken under control. \nIn Huliaipole, units established control over a significant part of the city, including a captured headquarters. In the Sumy sector, advances of up to 600 meters have been noted in several areas, including Andriivka. Meanwhile, the Ukrainian command is attempting to reinforce defenses and prevent troop withdrawals. \nKyiv's European allies plan to finalize a package of security guarantees for Ukraine in January 2026.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204519Z"
    },
    {
      "original": "Key Heights And Forests: Russian Army Makes Tactical Moves Against Ukrainian Forces In Slaviansk\nIn the Kharkiv sector, Russian units are achieving tactical success by advancing south of Vilcha towards Hrafskyi and capturing strongpoints in forested areas. In the Slaviansk sector, after establishing control over Sviato-Pokrovske, assault groups have reached the eastern part of Reznykivka. They are conducting fierce fighting in Zakotne and the Bondarne area. In the Zaporizhzhia sector, Kosivtsiv was taken under control. \nIn Huliaipole, units established control over a significant part of the city, including a captured headquarters. In the Sumy sector, advances of up to 600 meters have been noted in several areas, including Andriivka. Meanwhile, the Ukrainian command is attempting to reinforce defenses and prevent troop withdrawals. \nKyiv's European allies plan to finalize a package of security guarantees for Ukraine in January 2026.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204533Z"
    },
    {
      "original": "Lancet Strikes: Summary Of Russian Combat Footage From December 26, 2025\nOn December 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-27T14:33:35.204549Z"
    },
    {
      "original": "Lancet Strikes: Summary Of Russian Combat Footage From December 26, 2025\nOn December 26, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-27T14:33:35.204561Z"
    },
    {
      "original": "Survival Among One’s Own: Extrajudicial Punishments In The Ukrainian Armed Forces\nAfter forced mobilization and brief — often merely formal — training at training centers, a new survival quest begins for many Ukrainian servicemen. This struggle is shaped not only by frontline combat but also by harsh internal rules within their own units. \nA stark example of the punitive system in some Ukrainian Armed Forces (AFU) units surfaced in a video circulated in December 2025. It shows a serviceman pointing to a deep earthen pit, describing it as standard punishment for offenders in his unit. Offenders are forced to dig the hole themselves, then lowered into it; the ladder is removed, and they are left there for 24 hours — without food, water, or warm clothing amid winter cold. \nAnother video, trophy footage recovered by Russian forces from a deceased Ukrainian soldier's phone, depicts tactical fighters conducting a \"debriefing\" with mobilized offenders.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204578Z"
    },
    {
      "original": "Survival Among One’s Own: Extrajudicial Punishments In The Ukrainian Armed Forces\nAfter forced mobilization and brief — often merely formal — training at training centers, a new survival quest begins for many Ukrainian servicemen. This struggle is shaped not only by frontline combat but also by harsh internal rules within their own units. \nA stark example of the punitive system in some Ukrainian Armed Forces (AFU) units surfaced in a video circulated in December 2025. It shows a serviceman pointing to a deep earthen pit, describing it as standard punishment for offenders in his unit. Offenders are forced to dig the hole themselves, then lowered into it; the ladder is removed, and they are left there for 24 hours — without food, water, or warm clothing amid winter cold. \nAnother video, trophy footage recovered by Russian forces from a deceased Ukrainian soldier's phone, depicts tactical fighters conducting a \"debriefing\" with mobilized offenders.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204594Z"
    },
    {
      "original": "Israel Advances Plans To Displace Gazans, Fight Houthis With Recognition Of Somaliland \nIsrael on December 26 become the first country to recognize the Republic of Somaliland as an independent state, in what may be the first step in a plan to permanently displace Palestinians from the Gaza Strip to the Horn of Africa and escalate military operations against the Houthis (Ansar Allah) in Yemen.\nSomaliland, which claims the northwestern portion of Somalia, declared independence from the country in 1991, but has failed until the accord with Israel to secure the recognition of any United Nations member state.\nAccording to Israel’s Channel 12, talks between the two sides gained momentum as Israel searched for countries willing to take in Gazans it was looking to move out of the Strip.\nThis is, of course, not everything Israel may be getting from the accord. Somaliland is located less than 300 kilometers away from Yemen’s Red Sea coast that is mostly controlled by the Iran-aligned Houthis.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204624Z"
    },
    {
      "original": "Israel Advances Plans To Displace Gazans, Fight Houthis With Recognition Of Somaliland \nIsrael on December 26 become the first country to recognize the Republic of Somaliland as an independent state, in what may be the first step in a plan to permanently displace Palestinians from the Gaza Strip to the Horn of Africa and escalate military operations against the Houthis (Ansar Allah) in Yemen.\nSomaliland, which claims the northwestern portion of Somalia, declared independence from the country in 1991, but has failed until the accord with Israel to secure the recognition of any United Nations member state.\nAccording to Israel’s Channel 12, talks between the two sides gained momentum as Israel searched for countries willing to take in Gazans it was looking to move out of the Strip.\nThis is, of course, not everything Israel may be getting from the accord. Somaliland is located less than 300 kilometers away from Yemen’s Red Sea coast that is mostly controlled by the Iran-aligned Houthis.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204640Z"
    },
    {
      "original": "Turkish Attempts To Deploy Radars In Syria Anger Israel\nTurkey has been attempting to deploy radars in Syria for weeks, the Jerusalem Post reported on December 25, citing two Western intelligence sources.\nOne of the sources told the Post that Turkey is planning to transfer the radar systems to the Syrian military. The sources noted, however, that Turkish personnel would remain responsible for operating the systems.\nFollowing the fall of the regime of former President Bashar al-Assad, Turkey emerged as the main ally of Syria’s Interim Government that was formed by Islamist rebels it backed for years.\nAnkara is now playing a leading role in the rebuilding of the country’s military which lost nearly all of its advanced capabilities as a result of an Israeli primitive attack that took place after the collapse of the Assad regime last year.\nThe attack, codenamed “Operation Arrow of Bashan,” wiped out the country’s entire air defense network.\nRead more \nHERE",
      "timestamp": "2025-12-27T14:33:35.204657Z"
    }
  ],
  "script_run_time": "2025-12-27T14:33:35.205847Z"
}