{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317581Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317597Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2026-01-14T20:15:23.317603Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півночі та північному сході Чернігівщини, курс західний.",
      "timestamp": "2026-01-14T20:15:23.317608Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у Нікопольському р-ні. курс південно-східний.",
      "timestamp": "2026-01-14T20:15:23.317612Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Кривого Рогу зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317617Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з Чернігівщини у напрямку Києва через Київське водосховище.",
      "timestamp": "2026-01-14T20:15:23.317621Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА з півночі Київщини зайшов на Житомирщину, курс західний;\n🛵\n Декілька ворожих БпЛА з Чернігівщини на Київщині (р-н. Боришівки), вектор руху Бровари.",
      "timestamp": "2026-01-14T20:15:23.317627Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА південніше Києва у напрямку Білої Церкви.",
      "timestamp": "2026-01-14T20:15:23.317632Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у напрямку Запоріжжя із західного напрямку",
      "timestamp": "2026-01-14T20:15:23.317636Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Запоріжжя.",
      "timestamp": "2026-01-14T20:15:23.317641Z"
    },
    {
      "original": "🛵\n БпЛА повз Васильків на Київщині, курс північно-західний.",
      "timestamp": "2026-01-14T20:15:23.317645Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину!",
      "timestamp": "2026-01-14T20:15:23.317650Z"
    },
    {
      "original": "⚡️\n ЗБИТО 10 РЕАКТИВНИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n❗️\nВ період з 07.00 по 17.00 14 січня 2026 року ворог активізував повітряні атаки в напрямку міста Київ, застосовуючи реактивні БпЛА.\nДо знищення та протидії ворожим реактивним дронам залучені усі необхідні засоби, зокрема авіацію.\n💥\n Станом на 17.00 збито десять із десяти реактивних безпілотників ворога у Київській та Чернігівській областях.\nПісля вивчення уламків спеціалісти імовірно з’ясують тип БпЛА та його корисне навантаження.\nВтім атака продовжується, на півдні від столиці України фіксуються звичні шахеди або ж БпЛА інших типів. Бойова робота триває, не ігноруйте тривогу!",
      "timestamp": "2026-01-14T20:15:23.317667Z"
    },
    {
      "original": "🛵\n Північ Чернігівщини - ворожий БпЛА, курс західний.",
      "timestamp": "2026-01-14T20:15:23.317674Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у напрямку Дніпра зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317678Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317683Z"
    },
    {
      "original": "🛵\n БпЛА повз Буринь (Сумщина), курс південно-західний.",
      "timestamp": "2026-01-14T20:15:23.317689Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Дніпропетровщину (Синельниківський р-н).",
      "timestamp": "2026-01-14T20:15:23.317693Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2026-01-14T20:15:23.317698Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2026-01-14T20:15:23.317702Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.\nLaunched from a Su-57",
      "timestamp": "2026-01-14T20:15:23.893770Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued their assault operations on a wide front, making new progress in four different areas.\nIn the south, following several attempts, Russian infantry managed to gain a foothold in the railway windbreaks north of Rodynske and began accumulating infantry for additional attacks through the windbreaks further west. Other forces in central Rodynske managed to infiltrate the former \"Zaporozhskaya\" Mine west of the city. Fighting also continues for central Zatyshok, where the Russians are trying to dislodge the remaining Ukrainian soldiers.\nTo the north, Russian forces managed to consolidate in two more clay mines, along with additional forested areas and treelines. Attacks are now being carried out further north, where assault groups have reached the southern outskirts of Kucheriv Yar once again. Renewed fighting is also ongoing for Ivanivka, and Russian soldiers are continuing their attacks in western Nove Shakhove.\nTo the northeast, Russian forces continued advancing north from Shakhove and captured new positions southwest of Toretske. Fighting is ongoing for a large trench fortification there. Additionally, Russian forces managed to further improve their positions in the treelines northeast of Sofiivka. \n+ ~7.55 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T20:15:23.893786Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.  Launched from a Su-57",
      "timestamp": "2026-01-14T20:15:23.893790Z"
    },
    {
      "original": "The Kh-59/69 cruise missile was shot down as it approached the Sumy-Poltava border. \nAn explosion was heard in Sumy, likely from the launch of a patriot missile which intercepted the Russian missile. \nA Russian Su-57 continues to fly in Kursk Oblast, covered by a Su-35.",
      "timestamp": "2026-01-14T20:15:23.893795Z"
    },
    {
      "original": "In addition to the strikes on the Kryvyi Rih TPP, eastern Dnipropetrovsk Oblast also came under attack.  - 2 Iskander-M ballistic missiles launched from Millerovo Airbase, Rostov Oblast, impacted an unknown target in the town of Petropavlivka [Media 2].  …",
      "timestamp": "2026-01-14T20:15:23.893799Z"
    },
    {
      "original": "Footage has been released showing last night's Russian Iskander-M ballistic missile strike on eastern Dnipropetrovsk Oblast.\n1 missile (not 2) targeted a concentration of Ukrainian manpower and vehicles near the village of Troitske, just east of Petropavlivka.",
      "timestamp": "2026-01-14T20:15:23.893803Z"
    },
    {
      "original": "For some reason, after months of constant updates, all of the so-called Pro-Ukrainian sources aren't reporting on the Dobropillya direction anymore... \n🤔\nAs I've said before, your silence and selective reporting is a betrayal to Ukraine - the country you claim to support so much.",
      "timestamp": "2026-01-14T20:15:23.893809Z"
    },
    {
      "original": "New footage shows FP-2 drones of the Ukrainian \"Kairos\" battalion of the 414th Special Operations Brigade striking rear Russian targets in Donetsk Oblast. \nThe following was hit:\n- \"Myrna\" 330 kV electrical substation in the city of Mariupol (47.185541, 37.561191) by 2 drones. 2 of the substation's transformers were damaged.\n- \"Azovska\" 220 kV electrical substation in the city of Mariupol (47.164252,37.513224) by 1 drone. 1 of the substations transformers was damaged.\n- Warehouses containing rockets and artillery shells of the Russian 51st Guards Combined Arms Army in Donetsk City (48.065319,37.851658) by 2 drones. A fire broke out, followed by secondary detonations. \nAdditionally, it is claimed that drones also struck an oil depot in the city of Makiivka.",
      "timestamp": "2026-01-14T20:15:23.893816Z"
    },
    {
      "original": "In the Kostyanytnivka direction, both sides have advanced, with Russian forces continuing to collapse Ukrainian defences southwest of Kostyantynivka.\nIn the west, Russian forces continued their attacks in the direction of Stepanivka and managed to capture the remaining positions in the forest plantations west of the village, before entering its first houses (without consolidating yet). Russian attacks also continued from the treelines to the south. \nTo the southeast, Russian forces continued advancing east along the highway, capturing new positions in the treelines there and operationally encircling Ukrainian formations in their strongpoints to the south. Other assault groups are now clearing out the pocket, capturing strongpoints in the forests.\nMeanwhile, Russian forces continued infiltrating in small groups through the forests and into the village of Illinivka. Ukrainian drone operators continue attempts at fully eliminating the Russian groupings there, however the total number of Russian soldiers recorded in the village is growing. \nTo the east, Russian forces consolidated in additional positions in the forests on the northern bank of the Kleban-Byksky reservoir, and managed to enter the agricultural buildings on the southern outskirts of Beretok. On the other hand, the Ukrainians are continuing their incremental withdrawal from their last positions in the forests north of the reservoir due to the risk of encirclement.\nTo the northeast, Russian forces continued to advance in Kostyantynivka, and began bypassing the railway station from the north, capturing positions in the residential streets across the highway. However, more recently, they have begun struggling with supplies due to increased Ukrainian FPV drone strikes on the area between the city and Oleksandro-Shultyne. \nMeanwhile, at some point recently, Ukrainian forces managed to clear the Hora District of northeastern Kostyantynivka from Russian DRGs, as well as the adjacent forests, where they are now trying to accumulate. Additionally, the Ukrainians infiltrated across the fields south of the highway and recaptured the western and central parts of Predtechyne again. They also improved their positions in the forests just north of the highway.\nRussian forces are now trying to counterattack in Predtechyne, and continue their attempts at consolidating in the eastern part of the forests north of the highway. DRGs are also infiltrating further west through the treelines, where they were able to reach the village of Novodmytrivka. This has resulted in some of the Ukrainian formations in the salient west of Chasiv Yar withdrawing further west. \n+ ~5.24 km² in favour of Russia.\n+ ~3.97 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T20:15:23.893827Z"
    },
    {
      "original": "Russian forces have captured the village of Bondarne, Rai-Oleksandrivka direction, Donetsk Oblast.\nPre-war population: ~43.\nTotal land area: ~0.89 km².\nThe fighting for Bondarne lasted approximately 20 days.",
      "timestamp": "2026-01-14T20:15:23.893833Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]:\nAfter the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA (& TSK support) to the Tishrin and Deir Hafer fronts, as well as to Raqqa, on the Ma'dan-Ghanem Ali axis. Consequently, the SDF has also sent reinforcements to these fronts in anticipation of a large-scale confrontation that will end any attempt at diplomacy in Syria and mark the beginning of a new violent phase of the civil war.",
      "timestamp": "2026-01-14T20:15:23.893837Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]:\nAfter the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA (& TSK support) to the Tishrin and Deir Hafer fronts, as well as to Raqqa, on the Ma'dan-Ghanem Ali axis. Consequently, the SDF has also sent reinforcements to these fronts in anticipation of a large-scale confrontation that will end any attempt at diplomacy in Syria and mark the beginning of a new violent phase of the civil war.",
      "timestamp": "2026-01-14T20:15:23.893842Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]: After the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA…",
      "timestamp": "2026-01-14T20:15:23.893845Z"
    },
    {
      "original": "Any integration of the SDF into the STG seems extremely unlikely anymore, although I doubt Turkey would've allowed it anyway.",
      "timestamp": "2026-01-14T20:15:23.893849Z"
    },
    {
      "original": "Happy new year everyone!  Best of luck to you all for 2026.",
      "timestamp": "2026-01-14T20:15:23.893852Z"
    },
    {
      "original": "Well, the first two weeks of 2026 have been very eventful.\n- The U.S. bombs Venezuela and kidnaps Maduro.\n- The Southern Transitional Council in Yemen capitulates after a lightning offensive by the PLC.\n- Russia strikes Lviv with an Oreshnik IRBM.\n- Aleppo finally falls to the new Syrian government.\n- Mass protests in Iran.\n- Trump expressing his wish to annex Greenland again.\nIt's gonna be a busy year...",
      "timestamp": "2026-01-14T20:15:23.893859Z"
    },
    {
      "original": "Russian Geran-3 jet-drones are currently attacking the Kyiv Hydroelectric Power Plant. Explosions are heard.",
      "timestamp": "2026-01-14T20:15:23.893863Z"
    },
    {
      "original": "Another Geran-3 is approaching the CHP-5 power plant in Kyiv.",
      "timestamp": "2026-01-14T20:15:23.893866Z"
    },
    {
      "original": "Another Geran-3 is approaching the CHP-5 power plant in Kyiv.",
      "timestamp": "2026-01-14T20:15:23.893869Z"
    },
    {
      "original": "It flew further east, away from the power plant in the direction of Boryspil.",
      "timestamp": "2026-01-14T20:15:23.893872Z"
    },
    {
      "original": "The drone turned back to Kyiv and was subsequently shot down over the southern outskirts of the city. \nMultiple more Geran-3 jet-powered drones seem to be flying to Kyiv from Chernihiv Oblast.",
      "timestamp": "2026-01-14T20:15:23.893879Z"
    },
    {
      "original": "Iskander Strike: Ships And Radars Hit: Summary Of Russian Combat Footage From January 13, 2026 \nOn January 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-14T20:15:24.437704Z"
    },
    {
      "original": "Iskander Strike: Ships And Radars Hit: Summary Of Russian Combat Footage From January 13, 2026 \nOn January 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-14T20:15:24.437719Z"
    },
    {
      "original": "Former Dutch Mercenary In Ukraine Reveals Kiev's Crimes\nWhile the Western media strives to prevent the crimes committed by the Ukrainian troops from becoming known to public opinion, the mercenaries themselves who join Kiev in the war are shocked by the reality they find on the front lines. Recently, a European veteran of the Ukrainian army told journalists what he saw in the ranks of Kiev, revealing details about the behavior of the regime's soldiers.\nA former Dutch mercenary who fought for Kiev told journalists during a recent interview that Ukrainian troops are full of all types of criminals, including neo-Nazi militants and drug traffickers - including members of foreign cartels. He said that the use of illicit substances and practices of corruption and theft are common activities among soldiers, as there are no ethical or moral guidelines regulating the behavior of troops. The Dutch soldier used the pseudonym Hendrik, omitting his true identity for security reasons.  \n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437728Z"
    },
    {
      "original": "Egypt Struck Arms Shipment Bound To UAE Allies In Sudan \nThe Egyptian Air Forces carried out strikes against an arms shipment bound to the Sudanese Rapid Support Forces (RSF) in the border triangle between Egypt, Sudan and Libya, Al-Araby Al-Jadeed reported on January 12.\nAn Egyptian official told the London-based Arab news outlet that the strike took place on January 9, two days before a visit to Cairo by Saddam Haftar, a senior commander in the Libyan National Army (LNA).\nDuring the visit, which was his second to Cairo within a month, Saddam Haftar met Egypt’s defense minister, Abdel-Magid Saqr, to discuss military cooperation and regional developments, according to the official, who revealed that Cairo had previously warned LNA leader Khalifa Haftar against providing support to the RSF.\nEgypt and the UAE are generally considered to be close allies. Still, the latest Egyptian strikes appear to be a part of wider regional efforts, led by Saudi Arabia, to quell Emirate influence.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437738Z"
    },
    {
      "original": "India's Drone Revolution: Creating A New Force Of 100,000  To Deter China And Pakistan\nWhile Russia and Ukraine continue to bash each other on the battlefield and within their borders, other countries are taking note. One of them is India.\nNew Delhi is trying to absorb the fundamentals of modern warfare and create an efficient military with innovative technology. Since February 2022, the Indian high command and top military leaders have had ample time to consider this. Being sandwiched between the hostile communist nation of China and the even more hostile Islamist nation of Pakistan necessitates cleverness in the realm of external security.\nEven India, with its enormous population, has realized that numbers alone cannot win wars anymore. To prevail, your army must be large and capable of rapid deployment, as well as equipped with modern technology, especially unmanned aerial vehicles (UAVs).\n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437747Z"
    },
    {
      "original": "Israel Rejects Deployment Of Russian Troops In Syria, And Arms Deals Between Damascus And Moscow\nIsrael rejected a Russian initiative aimed at deploying military forces and observation posts in southern Syria, Maariv reported on January 14, citing an Israeli official.\nReports of the initiative began to emerge last August, and in November Syrian and Russian defense officials were spotted conducting a tour in the southern governorates of al-Qunitra and Daraa.\nThe Israeli military invaded the buffer zone adjacent to the occupied Golan Heights in al-Qunitra right after the fall of the regime of former President Bashar al-Assad, and has since established a series of posts there, including atop of the strategic Mount Hermon.\nThe official who spoke to Maariv said that the military will not withdraw from the Mount Hermon in Syria.\nHe added that Israel is following “with great concern” the ongoing contacts between Syria and both Russia and Turkey, especially those related to potential arms deals.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437757Z"
    },
    {
      "original": "U.S. Evacuates Key Middle East Bases Following Warning From Iran \nIran warned other countries in the Middle East that it will strike U.S. military bases on their territories in case of an attack by Washington, Reuters reported on January 14.\nThe report came right after President Donald Trump renewed his threats to the Islamic Republic over an ongoing wave of protests.\nTrump told CBS News that the U.S. would act if Iran began hanging protesters, after Tehran prosecutors said Iranian authorities would press capital charges of “moharebeh,” or “waging war against God,” against some suspects arrested over recent demonstrations.\nIn its latest report, the U.S.-based rights group Human Rights Activists News Agency (HRANA) put the death toll from the protests, which began late in December, at 2,403 people.\nNot all the casualties were protestors, however, Iranian authorities held a mass funeral of 300 security personnel who were killed in the protests.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437767Z"
    },
    {
      "original": "U.S. Evacuates Key Middle East Bases Following Warning From Iran \nIran warned other countries in the Middle East that it will strike U.S. military bases on their territories in case of an attack by Washington, Reuters reported on January 14.\nThe report came right after President Donald Trump renewed his threats to the Islamic Republic over an ongoing wave of protests.\nTrump told CBS News that the U.S. would act if Iran began hanging protesters, after Tehran prosecutors said Iranian authorities would press capital charges of “moharebeh,” or “waging war against God,” against some suspects arrested over recent demonstrations.\nIn its latest report, the U.S.-based rights group Human Rights Activists News Agency (HRANA) put the death toll from the protests, which began late in December, at 2,403 people.\nNot all the casualties were protestors, however, Iranian authorities held a mass funeral of 300 security personnel who were killed in the protests.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437777Z"
    },
    {
      "original": "Russia’s Security Zone In Sumy And Kharkiv Is Growing (Videos)\nOn January 14, the Russian military secured another settlement in Sumy along the border, all while further expanding its control near the border in Kharkiv.\nThe capture of Komarivka, located right on Sumy’s border with the Russian region of Kursk, by the Severe [North] Group of Forces was announced by the Russian Ministry of Defense, with other sources reporting that the attack on the settlement was led by the 80th Motor Rifle Division.\nThe ministry also noted in a  statement that the Sever Group of Forces has been advancing “into the depth of enemy’s defense” not just in Sumy, but also in Kharkiv -which borders the Russian region of Belgorod-, on a daily basis to fulfill the task of creating a “security zone” along the border.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437785Z"
    },
    {
      "original": "Russia’s Security Zone In Sumy And Kharkiv Is Growing (Videos)\nOn January 14, the Russian military secured another settlement in Sumy along the border, all while further expanding its control near the border in Kharkiv.\nThe capture of Komarivka, located right on Sumy’s border with the Russian region of Kursk, by the Severe [North] Group of Forces was announced by the Russian Ministry of Defense, with other sources reporting that the attack on the settlement was led by the 80th Motor Rifle Division.\nThe ministry also noted in a  statement that the Sever Group of Forces has been advancing “into the depth of enemy’s defense” not just in Sumy, but also in Kharkiv -which borders the Russian region of Belgorod-, on a daily basis to fulfill the task of creating a “security zone” along the border.\nRead more \nHERE",
      "timestamp": "2026-01-14T20:15:24.437794Z"
    },
    {
      "original": "Military Situation In Ukraine On January 14, 2026 (Maps Update)",
      "timestamp": "2026-01-14T20:15:24.437798Z"
    },
    {
      "original": "Military Situation In Ukraine On January 14, 2026 (Maps Update)",
      "timestamp": "2026-01-14T20:15:24.437802Z"
    },
    {
      "original": "THE LIMAN END-RUN: BYPASSING DEFENSES, RUSSIA'S PENETRATION AIMS FOR SLAVYANSK'S FLANK",
      "timestamp": "2026-01-14T20:15:24.437806Z"
    }
  ],
  "script_run_time": "2026-01-14T20:15:24.438544Z"
}