{
  "messages": [
    {
      "original": "🛵\n БпЛА на Чернігів з півночі.",
      "timestamp": "2025-10-29T07:53:11.670192Z"
    },
    {
      "original": "🚀\nПуски КАБ на Херсонщину.",
      "timestamp": "2025-10-29T07:53:11.670210Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Чернігова з півдня.",
      "timestamp": "2025-10-29T07:53:11.670215Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів зі сходу.\n🛵\n БпЛА на сході Харківщини , курсом на південь.",
      "timestamp": "2025-10-29T07:53:11.670222Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігів з півдня.",
      "timestamp": "2025-10-29T07:53:11.670226Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-29T07:53:11.670231Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на півдні Харківщини , курсом на північ.\n🛵\n Ударні БпЛА на сході Дніпропетровщини, курсом на захід.",
      "timestamp": "2025-10-29T07:53:11.670237Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу.\n🛵\n БпЛА на Чернігів з півночі.",
      "timestamp": "2025-10-29T07:53:11.670244Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччині в районі н.п. Олександрівка - Білозерське, курсом на північ та на південь.\n🛵\n БпЛА на Харківщині, поблизу н.п. Барвінкове , курсом на північ.",
      "timestamp": "2025-10-29T07:53:11.670250Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-29T07:53:11.670254Z"
    },
    {
      "original": "🛸\n В районі Харкова - ворожий розвідувальний БпЛА!",
      "timestamp": "2025-10-29T07:53:11.670260Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини, курсом на південь.",
      "timestamp": "2025-10-29T07:53:11.670265Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині на н.п. Лиманівка - Лозова.",
      "timestamp": "2025-10-29T07:53:11.670269Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 93 ВОРОЖІ БПЛА\n =================      \nУ ніч на 29 жовтня (з 19:00 28 жовтня) противник атакував 126 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Приморсько-Ахтарськ – рф, Донецьк, Чауда, Гвардійське – ТОТ України, близько 80 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 93 ворожі БпЛА типу Shahed, Гербера і дронів інших типів на півночі та сході країни.\nЗафіксовано влучання 32 ударних БпЛА на 10 локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n \n✊\nТримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-29T07:53:11.670281Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Чернігівщини в напрямку н.п.Понориці.",
      "timestamp": "2025-10-29T07:53:11.670286Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на півночі від м.Суми в напрямку на обласний центр.",
      "timestamp": "2025-10-29T07:53:11.670291Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-29T07:53:11.670298Z"
    },
    {
      "original": "🛵\n БпЛА на Краматорськ з західного напрямку.",
      "timestamp": "2025-10-29T07:53:11.670315Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині в напрямку Бахмача;\n🛵\n БпЛА на Дніпропетровщині в напрямку м.Павлоград/н.п.Тернівка.",
      "timestamp": "2025-10-29T07:53:11.670322Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на Херсонщині! Залучено засоби для  збиття.",
      "timestamp": "2025-10-29T07:53:11.670327Z"
    },
    {
      "original": "In the Hulyaipole and Pokrovske directions, Russian forces continued their offensive operations, advancing in several different areas.  In the south, Russian forces expanded their bridgehead on the western bank of the Yanchur River. After establishing control…",
      "timestamp": "2025-10-29T07:53:12.246916Z"
    },
    {
      "original": "As a result of these recent Russian advances, and the breaching of the Ukrainian defences west of the Yanchur River, forward Russian units are now within 4.3 km of the critical Pokrovsk'e - Hulyaipole Highway. \nOnce cut, logistics into Hulyaipole will become very difficult as the only other road is less than 6 km from the frontline. I previously talked about Russia's goals to capture Hulyaipole at the beginning of September. Since then, they have advanced over 19 km westwards, with the Ukrainians being unable to stop the advance due to their critical manpower shortages in this sector.",
      "timestamp": "2025-10-29T07:53:12.246930Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces advanced to the Dnipropetrovsk - Donetsk Regional Border, establishing control over an important stronghold.\nRussian forces advanced from the western part of Novoserhiivka and entered a large trench stronghold and bunker system. Soldiers were able to clear it, detonating the concrete bunkers with explosives and engaging the remaining Ukrainian soldiers with small arms. Other forces captured new positions in the treelines to the north, largely aligning the front with the regional border.\n+ ~3.04 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246936Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance in and around Pokrovsk, capturing key positions within the city.\nIn the west, after bombing Ukrainian positions with FABs, Russian forces advanced from the treelines west of Pokrovsk to the railway line, establishing control over a 2.9 km stretch of the railway windbreaks. \nIn Pokrovsk City, Russian forces were able to consolidate in the northern part of the Sobachivka District, as well as the eastern part of the city centre. Clashes continue in the area of the railway station, administrative building, city council building, and other nearby districts. \nFrom there, the Russians crossed the railway line and entrenched in the private sector, establishing a wedge between the two industrial strongholds in northern Pokrovsk. They then advanced further, capturing positions on Bereznya and Demury Streets, with DRGs infiltrating even further north. Additionally, Russian forces infiltrated further into the northwestern industrial zone of Pokrovsk, expanding the grey zone further.\n+ ~1.87 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246943Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued their assault operations in Myrnohrad, and have made significant progress in the southern part of the city. \nAfter entering the city further north and securing the areas to the east, Russian forces infiltrated the southern suburbs of Myrnohrad in multiple new places, consolidating in the first streets. Reinforcements were then sent in, allowing for additional progress to be made on a wide front. \nRussian forces reached the terykon from the east, establishing control over Mine 5/6, and began bypassing the terykon from the south into the nearby residential streets. Other forces who entered further south captured the small private sector and advanced towards one of the city parks, linking up with other formations. \n+ ~1.91 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246949Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces continued to advance behind Pokrovsk and established full control over the city of Rodynske. \nAfter infiltrating the city from the south, and advancing from the east and north, the remaining Ukrainian units were forced to leave the city, allowing for the Russians to capture the rest of the city centre and western suburbs. They then went on to establish control over the railway line to the west, along with the abandoned and demolished mine. \nTo the southeast, Russian forces continued to advance north of Myrnohrad, and captured additional treeline positions north of the city as well as an abandoned mineshaft. Some soldiers were able to infiltrate the northern streets of the city; however no consolidation has occurred yet. \n+ ~3.68 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246955Z"
    },
    {
      "original": "In the Dobropillya direction, both Russian and Ukrainian forces are advancing, with Ukrainian forces making substantial progress on the western flank of the salient.\nIn the south, Ukrainian forces advanced from their positions east of the railway line and recaptured treeline positions north of Zatyshok. They then infiltrated the village from the north, and attempted to push towards its western edge, resulting in Russian and Ukrainian positions being mixed up in a grey zone. Other forces also infiltrated Sukhetske, however there is no evidence of consolidation yet. \nTo the north, the Ukrainians once again recaptured the village of Nove Shakhove, and established control over positions to the south. They also advanced from Vilne to the treelines south and southeast and recaptured the dachas to the east. \nTo the northeast, Ukrainian forces advanced from their newly established positions in Kucheriv Yar, capturing positions in the forest plantations to the south. \nMeanwhile, Russian forces continued to advance in western Shakhove amid fierce fighting, and established full control over that section of the village. Mechanised assaults were also carried out on the eastern part of the village, however there is no evidence of consolidation yet. \n+ ~13.99 km in favour of Ukraine.\n+ ~0.52 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246962Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces closed the pocket south of the reservoir and began refocusing their efforts further north.\nFollowing the earlier Ukrainian withdrawal from the cut-off area south of the Kleban-Bykske reservoir via rubber boats, Russian forces have now established control over the treelines and forests to the south. Since then, they have continued their attacks towards the rear of the reservoir and are attempting to gain a foothold in the forests east of the highway.\n+ ~12.40 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246967Z"
    },
    {
      "original": "In the Siversk direction, Russian forces resumed their assault operations towards Siversk from the southeast and have captured new positions on the tactical heights.\nRussian forces advanced from the treelines northeast of Vyimka, pushing along the tactical heights, and captured new positions to the northwest. They then advanced further north up a treeline and are attempting to establish control over additional positions closer to Siversk. \n+ ~2.52 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246972Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive operations and have made new progress to east of the city. \nIn the northwest, Russian forces advanced further through the forests along the railway line and reached the eastern edge of Lyman. DRGs then infiltrated the city and have since been operating in the area of the freight terminals. They also established control over new parts of the forests and infiltrated further into the Masliakivka District. \nTo the southeast, Russian forces continued to slowly advance in Yampil. They were able to advance out of the village centre and capture some new positions in the southwestern streets. Ukrainian forces are gradually being pushed back to the southwestern edge of the settlement. \n+ ~3.70 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246978Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to expand their zone of control west of Zarichne, and have eliminated the salient recently formed there.\nAfter outflanking Ukrainian strongpoints west of Zarichne from the north, Ukrainian forces began withdrawing to the west to prevent being encircled. The Russians have since captured the agricultural complex that served as one of Ukraine's main forward deployment points in this sector, and secured the rest of the surrounding forests, levelling the frontline to the west. \n+ ~3.85 km² in favour of Russia.",
      "timestamp": "2025-10-29T07:53:12.246983Z"
    },
    {
      "original": "Following reports of Hamas fighters opening fire on Israeli soldiers in Rafah and firing an anti-tank missile, the IDF has begun a series of airstrikes on targets across Gaza City and Rafah. \nExplosions are currently sounding across the strip from the artillery shelling and airstrikes focusing on Gaza City. One airstrike targeted the courtyard of Al-Shifa Hospital in Gaza City; however no casualties were reported.",
      "timestamp": "2025-10-29T07:53:12.246987Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it. \nIt's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions and movements in Gaza).\nI honestly think the goal was to make a peace plan that was borderline acceptable for Hamas, but just slightly too far outside of what they could feasibly agree too, in order to portray them as unwilling to end the war and rebuild some justification for the IDF to continue their operations. \nHamas actually accepting the deal surprised the US and Israel, so now they are relying on ceasefire violations to slowly swing back to a fighting stance.",
      "timestamp": "2025-10-29T07:53:12.246992Z"
    },
    {
      "original": "All those naive people when the war and genocide starts again will be so confused why the \"peace president\" couldn't stop it.   It's almost as if Trump's plan was terribly laid out and had very few guarantees for Hamas (let alone the other Palestinian factions…",
      "timestamp": "2025-10-29T07:53:12.246996Z"
    },
    {
      "original": "This new round of attacks could only be temporary, but long-term the trend is obvious.",
      "timestamp": "2025-10-29T07:53:12.247001Z"
    },
    {
      "original": "Today, in preparation for the next large-scale missile strike, 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to western Russia. 1 landed at Olenya Airbase, Murmansk Oblast, and 3 landed at Engels-2 Airbase, Saratov Oblast.\nCurrently, there are 10 strategic bombers stationed near Ukraine - 13 if you include Diaghilev Airbase (Ryazan Oblast).",
      "timestamp": "2025-10-29T07:53:12.247005Z"
    },
    {
      "original": "Today, in preparation for the next large-scale missile strike, 4 Tu-95MS strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to western Russia. 1 landed at Olenya Airbase, Murmansk Oblast, and 3 landed at Engels-2 Airbase, Saratov Oblast.  Currently…",
      "timestamp": "2025-10-29T07:53:12.247008Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers have departed from Engels-2 Airbase and are redeploying to Olenya Airbase. They have been equipped with Kh-101 cruise missiles and will take part in the next missile attack from Olenya.",
      "timestamp": "2025-10-29T07:53:12.247011Z"
    },
    {
      "original": "Russian forces have captured the village of Dronivka, northern flank of Siversk, Donetsk Oblast.\nPre-war population: ~613.\nTotal land area: ~0.98 km².",
      "timestamp": "2025-10-29T07:53:12.247016Z"
    },
    {
      "original": "Following reports of Hamas fighters opening fire on Israeli soldiers in Rafah and firing an anti-tank missile, the IDF has begun a series of airstrikes on targets across Gaza City and Rafah.   Explosions are currently sounding across the strip from the artillery…",
      "timestamp": "2025-10-29T07:53:12.247019Z"
    },
    {
      "original": "Hamas denied responsibility for the attack on IDF soldiers in Rafah, southern Gaza, and emphasised its commitment to the ceasefire.",
      "timestamp": "2025-10-29T07:53:12.247022Z"
    },
    {
      "original": "2 Tu-95MS strategic bombers have departed from Engels-2 Airbase and are redeploying to Olenya Airbase. They have been equipped with Kh-101 cruise missiles and will take part in the next missile attack from Olenya.",
      "timestamp": "2025-10-29T07:53:12.247025Z"
    },
    {
      "original": "4 Tu-95MS strategic bombers landed at Olenya Airbase. They are all equipped with Kh-101 cruise missiles. \nMutliple vessels of the Black Sea Fleet stationed at Novorossiysk Naval base, Krasnodar Krai, are equipped with Kalibr cruise missiles. \nMultiple OTRK installations have Iskander-M ballistic missiles ready to launch, especially from the north and northeastern directions. \n2 MiG-31Ks are equipped with Kinzhal hypersonic aeroballistic missiles at Savasleika Airbase, Nizhny Novgorod Oblast. Their usage in the next attack is likely, but not certain.\nAt least 4 Tu-22m3 strategic bombers stationed at Diaghilev Airbase, Ryazan Oblast, are equipped with Kh-22 cruise missiles. It is unclear if they will be used in the next attack.\n1 Tu-95MS and 3 Tu-160s remain stationed at Engels-2 Airbase. Not all are equipped with missiles. \nThe next large-scale, combined missile attack on Ukraine is likely to take place tomorrow night. I will provide additional updates closer to the time.",
      "timestamp": "2025-10-29T07:53:12.247032Z"
    },
    {
      "original": "I think we may be seeing the last days of the battle for Pokrovsk.",
      "timestamp": "2025-10-29T07:53:12.247035Z"
    },
    {
      "original": "Get ready",
      "timestamp": "2025-10-29T07:53:12.247038Z"
    },
    {
      "original": "Military Situation In Ukraine On October 28, 2025 (Maps Update)",
      "timestamp": "2025-10-29T07:53:12.830679Z"
    },
    {
      "original": "Military Situation In Ukraine On October 28, 2025 (Maps Update)",
      "timestamp": "2025-10-29T07:53:12.830692Z"
    },
    {
      "original": "Russian Salad in Orbit: How Space Gastronomy Becomes Part of Cultural Diplomacy\nFor the first time, a Russian salad has been prepared in microgravity conditions aboard the ISS. What other traditional Russian dishes have made their way to the International Space Station?\nThe crew of the International Space Station has taken part in a unique cultural mission. Russian astronauts Alexey Zubritsky and Oleg Platonov used their limited personal time to conduct a culinary experiment, preparing a classic Russian salad in weightless conditions.\nThe initiative was timed to coincide with the birthday of NASA astronaut Zina Cardman and served as a gesture of intercultural dialogue. Using the station’s standard products, the team adapted the recipe, replacing missing ingredients with available analogues, including smoked quail eggs from the Japanese food supply.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830702Z"
    },
    {
      "original": "U.S. Switchblade Failed Miserably In Ukraine \nAeroVironment Switchblade 300 loitering munitions supplied by the United States failed miserably in Ukraine, a report published by The Economist on October 23 revealed.\nThe Switchblade 300 was very much among the very first Western weapons supplied to Ukraine to be promoted as a “game changer” at the time.\nUkraine’s high hopes were quickly shattered, however, according to The Economist.\nRead more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830711Z"
    },
    {
      "original": "\"No One Left to Fight\": Why Only 7 Out of 125 Soldiers in Ukrainian Battalions Are Infantry\nThe Ukrainian Armed Forces are experiencing a profound personnel and organizational crisis, which is particularly acute in infantry units. According to Ruslan Gorbenko, a Ukrainian MP from the ruling \"Servant of the People\" party, some battalions are facing a catastrophic personnel imbalance: against an official strength of 120 servicemen, only seven are actual infantrymen, with the rest being commanders, signalers, logisticians, or personnel from the support company.\nThe MP noted that in some cases, the ratio reaches as high as 13 commanders to one soldier, rendering such units virtually ineffective. Gorbenko emphasized that this situation requires radical measures, including the dissolution of ineffective brigades and battalions, and the demotion or even criminal prosecution of some commanders.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830723Z"
    },
    {
      "original": "Overview of Ukrainian-Russian Strikes: A Lull Before the Storm?\nOn the night of October 27-28, the mutual exchange of strikes using unmanned aerial vehicles (UAVs) between Russia and Ukraine continued. However, the intensity of these attacks was notably lower compared to previous days. A total of 38 attack UAVs were launched over Ukraine, and 17 over Russia.\nRegarding the deployment of drone technology, Western combat UAVs supplied to Ukraine are reported to be failing to meet battlefield expectations. Assessments indicate they are too costly and vulnerable to Russian electronic warfare systems. Ukrainian drone developer Valeriy Borovik reported that during tests conducted under jamming conditions, these models malfunctioned, demonstrating low reliability. The core issues are identified as a combination of high cost, low survivability, and a lack of sufficient adaptation to the conditions of modern combat.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830732Z"
    },
    {
      "original": "Overview of Ukrainian-Russian Strikes: A Lull Before the Storm?\nOn the night of October 27-28, the mutual exchange of strikes using unmanned aerial vehicles (UAVs) between Russia and Ukraine continued. However, the intensity of these attacks was notably lower compared to previous days. A total of 38 attack UAVs were launched over Ukraine, and 17 over Russia.\nRegarding the deployment of drone technology, Western combat UAVs supplied to Ukraine are reported to be failing to meet battlefield expectations. Assessments indicate they are too costly and vulnerable to Russian electronic warfare systems. Ukrainian drone developer Valeriy Borovik reported that during tests conducted under jamming conditions, these models malfunctioned, demonstrating low reliability. The core issues are identified as a combination of high cost, low survivability, and a lack of sufficient adaptation to the conditions of modern combat.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830740Z"
    },
    {
      "original": "UKRAINIAN INFRASTRUCTURE ABLAZE AS RUSSIAN 'VOSTOK' FORCES PRESS WESTWARD",
      "timestamp": "2025-10-29T07:53:12.830744Z"
    },
    {
      "original": "Fire Control: The Influence of Drones On Ukraine’s Logistics In Zaporizhzhia And Vovchansk \nUkrainian forces are attempting to break the blockade of their troops in Pokrovsk. Near Zaporizhzhia, Russian forces have taken control of the Lyman-Zakotne highway. The Ukrainian command is transferring reserves to Orikhiv. \nHungary is seeking to form an anti-Ukrainian alliance with the Czech Republic and Slovakia.\nRead more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830753Z"
    },
    {
      "original": "Fire Control: The Influence of Drones On Ukraine’s Logistics In Zaporizhzhia And Vovchansk \nUkrainian forces are attempting to break the blockade of their troops in Pokrovsk. Near Zaporizhzhia, Russian forces have taken control of the Lyman-Zakotne highway. The Ukrainian command is transferring reserves to Orikhiv. \nHungary is seeking to form an anti-Ukrainian alliance with the Czech Republic and Slovakia.\nRead more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830761Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From October 28, 2025\nOn October 28, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-29T07:53:12.830768Z"
    },
    {
      "original": "Drone Attacks: Summary Of Russian Combat Footage From October 28, 2025\nOn October 28, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-29T07:53:12.830774Z"
    },
    {
      "original": "Russia’s Rostec Showcases First Anti-Drone Laser System (Videos)\nShvabe, a part of the Russian state-owned Rostec defense conglomerate, showcased for the first time a counter-drone laser system on the sideline of the Interpolitex-2025 exhibition, which opened its doors in Moscow on October 28.\nThe system can be fielded both as an stand-alone anti-drone laser, or as part of amulti-layered air defense network, according to a press release by Rostec.\nThe press release said that the laser system is capable of taking down several drones of various types within a single minute.\nRead more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830782Z"
    },
    {
      "original": "Russia’s Rostec Showcases First Anti-Drone Laser System (Videos)\nShvabe, a part of the Russian state-owned Rostec defense conglomerate, showcased for the first time a counter-drone laser system on the sideline of the Interpolitex-2025 exhibition, which opened its doors in Moscow on October 28.\nThe system can be fielded both as an stand-alone anti-drone laser, or as part of amulti-layered air defense network, according to a press release by Rostec.\nThe press release said that the laser system is capable of taking down several drones of various types within a single minute.\nRead more \nHERE",
      "timestamp": "2025-10-29T07:53:12.830790Z"
    }
  ],
  "script_run_time": "2025-10-29T07:53:12.831643Z"
}