{
  "messages": [
    {
      "original": "🛵\n Донеччина: БпЛА в напрямку Краматорська з півдня.",
      "timestamp": "2025-12-21T14:48:12.410016Z"
    },
    {
      "original": "🛸\n На південному заході від м.Запоріжжя ворожий БпЛА, ймовірно, розвідувальний. Можлива робота ППО.",
      "timestamp": "2025-12-21T14:48:12.410032Z"
    },
    {
      "original": "🛵\n Запорізька обл.: БпЛА на півдні від н.п. Малокатеринівка в західному напрямку.",
      "timestamp": "2025-12-21T14:48:12.410039Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Сум з північного сходу.",
      "timestamp": "2025-12-21T14:48:12.410045Z"
    },
    {
      "original": "🛵\n Херсонщина: БпЛА в напрямку Херсона з північного сходу.",
      "timestamp": "2025-12-21T14:48:12.410050Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-21T14:48:12.410056Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину, Дніпропетровщину!",
      "timestamp": "2025-12-21T14:48:12.410061Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину, Дніпропетровщину!",
      "timestamp": "2025-12-21T14:48:12.410065Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n курсом на Одещину, Миколаївщину.",
      "timestamp": "2025-12-21T14:48:12.410071Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-21T14:48:12.410077Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-12-21T14:48:12.410082Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-12-21T14:48:12.410086Z"
    },
    {
      "original": "🚀\n КАБи на північ Харківщини!",
      "timestamp": "2025-12-21T14:48:12.410090Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря \n➡️\n на Миколаївщину!",
      "timestamp": "2025-12-21T14:48:12.410096Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Петропавлівку.\n🛵\n БпЛА на сході Одещини \n➡️\n курсом на захід.",
      "timestamp": "2025-12-21T14:48:12.410105Z"
    },
    {
      "original": "🚀\n КАБи на Донеччину!",
      "timestamp": "2025-12-21T14:48:12.410111Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на Петропавлівку. \n🛵\n БпЛА на сході Одещини \n➡️\n курсом на захід.",
      "timestamp": "2025-12-21T14:48:12.410120Z"
    },
    {
      "original": "🛵\n БпЛА на Одещині курсом на Чорноморське/Південне з півночі.",
      "timestamp": "2025-12-21T14:48:12.410125Z"
    },
    {
      "original": "🚀\n КАБи на схід Харківщини!",
      "timestamp": "2025-12-21T14:48:12.410129Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на півночі Сумщини в напрямку Шостки зі сходу.",
      "timestamp": "2025-12-21T14:48:12.410135Z"
    },
    {
      "original": "🛵\n БпЛА на півдні Харківщини \n➡️\n курсом на Ізюм.",
      "timestamp": "2025-12-21T14:48:12.410141Z"
    },
    {
      "original": "🇺🇦\n Deep State on the dire situation of Gulyaypole:  The Ukrainian military resource Deep State reports on the risk of losing Gulyaypole due to management problems and internal sabotage in the 102nd Territorial Defense Brigade. According to DS, some officers…",
      "timestamp": "2025-12-21T14:48:13.484927Z"
    },
    {
      "original": "The 102nd brigade has mostly been withdrawn to the rear now due to heavy losses from the encirclements east of Hulyaipole, lack of coordination, constant Russian bombardment, and low-quality fortifications. \nThe issues in this unit have been known for some time, and the casualties they suffered prior to the Russian entry into Hulyaipole had meant they couldn't perform properly. This is the main reason why defences are collapsing there right now. The higher command is blame.",
      "timestamp": "2025-12-21T14:48:13.484940Z"
    },
    {
      "original": "Deepstate published satellite imagery showing the ruins of eastern Siversk. Around 300-400 civilians remained in the city for the nearly 4 years of fighting.",
      "timestamp": "2025-12-21T14:48:13.484944Z"
    },
    {
      "original": "4 have targeted the Dobroslav area.",
      "timestamp": "2025-12-21T14:48:13.484947Z"
    },
    {
      "original": "2 of the Iskanders which I previously thought targeted Dobroslav, Odesa Oblast, actually hit port infrastructure near Pivdenne.\nAt least 7 civilians were killed and 15 others injured.",
      "timestamp": "2025-12-21T14:48:13.484951Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-21T14:48:13.484957Z"
    },
    {
      "original": "The U.S. is currently carrying out a massive series of attacks on ISIS targets in eastern and central Syria.\nFighter jets, attack helicopters, artillery, HIMARS, and ATACMS ballistic missiles are being used, striking dozens of targets, including weapons depots and operational support buildings used by militants.\nThe operation, dubbed \"Operation Hawkeye strike\" is in response to the ISIS attack that killed 3 U.S. soldiers in Palmyra, central Syria on July 13.",
      "timestamp": "2025-12-21T14:48:13.484962Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-21T14:48:13.484968Z"
    },
    {
      "original": "🇺🇸\n⚡️\n- BREAKING: Jeffrey Epstein brought a 14-year-old girl to Mar-a-Lago and asked President Trump, “This is a good one, right?” Donald Trump then nodded and smiled in agreement.",
      "timestamp": "2025-12-21T14:48:13.484973Z"
    },
    {
      "original": "What will the mental gymnastics be this time?",
      "timestamp": "2025-12-21T14:48:13.484976Z"
    },
    {
      "original": "It seems that Russia’s next large-scale, combined missile attack on Ukraine has been delayed, as no significant strategic bomber movement has been recorded for the last two days.\nIn my opinion, this is due to the prioritisation of smaller, more targeted attacks on Odesa Oblast with Geran-2 drones, Grom-E1 rocket glide-bombs, and Iskander-M ballistic missiles. \nAdditionally, the preparation of a number of Tu-22m3 strategic bombers is underway. Two of them, each equipped with 2 Kh-32 cruise missiles, redeployed from Belaya Airbase, Irkutsk Oblast, to Engels-2 Airbase, Saratov Oblast. 2 other Tu-22m3 bombers stationed at Engels-2 Airbase are also equipped with 1 Kh-32 missile each. \nIt’s also likely that two Buyan-M corvettes were equipped with Kalibr cruise missiles at Kaspiysk Naval Base, Republic of Dagestan, in the Caspian Sea. They can launch a maximum of 16 Kalibrs. \nHowever, 2 days ago, 1 Tu-160 and 1 Tu-95MS strategic bomber redeployed from Engels-2 Airbase to Ukrainka Airbase, Amur Oblast. There, they will likely be equipped with Kh-101 cruise missiles.\nRemember, another 4 Tu-95MS are already equipped with missiles at Olenya Airbase, Murmansk Oblast, ready for use. \nAs for Iskanders, deliveries of Iskander-M ballistic missiles and possibly Iskander-K cruise missiles were carried out to OTRK installations in Voronezh and Rostov Oblast.\nMass accumulation of Geran-2 and Gerbera drones continues at all major launch sites surrounding Ukraine.",
      "timestamp": "2025-12-21T14:48:13.484985Z"
    },
    {
      "original": "Russian forces have launched a new incursion across the international border into Sumy Oblast, quickly capturing the villages of Hrabovske and Vysoke. Attacks are now underway, with the Russians attempting to penetrate deeper into the region.\nAs usual with these sorts of incursions, the goal is not to take large swaths of territory. The goal is to stretch Ukrainian forces even thinner, worsening the issues coming from their manpower shortages.\nIf Ukraine decides to redeploy units away from one direction to this new area in order to reinforce the lines, halt, and possibly even push back Russian forces, the area which they are redeployed from will be significantly weakened, making it easier for the Russians to make progress in.\nThis is all part of what I like to call Russia's \"Whack-a-mole\" tactic, which softens up the lines, and exploits the successful attrition being dealt to Ukraine right now. It puts Ukraine in a difficult spot, as if they choose not to redeploy here, the incursion zone could continue to expand and become even more difficult and costly to deal with later on. \nEssentially, they are trying to put out more fires than they can possibly deal with - and Russia keeps setting new ones. The main reason why they can't deal with all of the fires at once is because of manpower shortages, which are only continuing to get worse.\nExpect more maneuvers like this in different places from Russian forces in the future.",
      "timestamp": "2025-12-21T14:48:13.484993Z"
    },
    {
      "original": "Russian forces have captured the village of Hrabovske, Krasnopillya Direction, Sumy Oblast.\nPre-war population: ~724.\nTotal land area: ~3.12 km².\nThe fighting for Hrabovske lasted <1 day.",
      "timestamp": "2025-12-21T14:48:13.485002Z"
    },
    {
      "original": "Russian forces have captured the village Vysoke, Krasnopillya direction, Sumy Oblast.\nPre-war population: ~28.\nTotal land area: ~0.37 km²",
      "timestamp": "2025-12-21T14:48:13.485007Z"
    },
    {
      "original": "In the Bilyi Kolodyaz direction, Russian forces continued to advance and have captured new positions in three different areas.\nIn the northeast, Russian forces continued advancing beyond Vovchansk, establishing a buffer-zone around the city where they captured positions in six different treelines to the southeast. They also continued advancing in Vovchanski-Khutory, where they established control over the rest of the eastern part of the village, including the industrial zone.\nIn the southwest, Russian forces continued their assault operations in Vilcha. They managed to reach the southeastern edge of the town and secured the rest of its western streets. Fighting is ongoing for the last Ukrainian positions in the southern streets.\n+ ~6.80 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485014Z"
    },
    {
      "original": "In the Velykyi Burluk direction, Russian forces continued their assault operations and are making incremental progress in two main areas.\nIn the northeast, Russian forces advanced south from the village of Dvorichanske to the nearby forest plantations, establishing control over them after heavy fighting, further shrinking the Ukrainian salient. Ukrainian forces are responding by heavily striking Russian temporary deployment points in Dvorichanske. The Russians also resumed attacks from the east, securing two forest plantations northwest of Kamyanka and pressuring the eastern part of the Ukrainian salient. \nIn the southwest, Russian forces have been carrying out assault operations towards Putnykove for the last few weeks. So far, despite the length of the battles, they have not achieved significant success, only securing a section of the highway and adjacent treeline positions. Additionally, more recently, attacks were carried out in the direction of the Dovhenke tract. As a result, they were able to capture two treelines and reach the eastern edge of the forested areas there.\n+ ~3.03 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485021Z"
    },
    {
      "original": "In the Kupyansk direction, over the last week Ukrainian forces continued to advance and have cleared additional parts of western Kupyansk.\nIn the north, following the withdrawal of most Russian soldiers from northwestern Kupyansk, Ukrainian forces managed to cut off the salient by advancing south through the city centre, linking up with other assault groups who captured the City Central Hospital. From there, they managed to clear large parts of this newly formed pocket, including the rest of the enterprises in the northwest, as well as most of the rest of the low-rise residential streets. The \"Comb\" stronghold in the high-rise blocks remains in the grey-zone. \nIn the south, Ukrainian forces began advancing southeast from the area of the grain elevators, reaching the police station. They then infiltrated east to the administrative building, effectively cutting off Russian formations in the area of the central market from the rest of the operationally encircled units. The Ukrainians also captured the furniture factory and School no. 1 to the west, while other forces began a series of assaults in the low-rise residential areas which effectively cut off Russian formations in the southwestern part of the city too.\n+ ~1.13 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485028Z"
    },
    {
      "original": "In the Rai-Oleksandrivka and Lyman directions, Russian forces continued to advance and have captured new positions in four different areas.\nIn the southeast, Russian forces continued their assault operations in Zakitne and have captured the remaining positions in its southeastern streets. They also entered its northeastern streets and are attempting to push further west towards the centre. \nTo the west, Russian forces continued their assault operations in Ozerne where they are incrementally advancing. They were able to secure new positions in the eastern streets of the village. Other forces cleared large parts of the forest to the northwest and made further progress through the northwestern houses, slowly beginning to squeeze the Ukrainians out of the northern part of Ozerne.\nIn the northwest, Russian forces continued attacking north of Dibrova, supporting assault operations within the village. They advanced further west and captured additional positions in the forests there.\n+ ~2.49 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485036Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to make significant progress over the last week, advancing in four different areas.\nIn the northeast, under heavy artillery and drone cover, Russian forces advanced through the fortifications along the edge of the tactical heights and secured the forest northwest of Sviato-Pokrovske. They also captured the treeline to the north.\nTo the south, Russian forces advanced north from the area of Fedorivka to the gulley, establishing control over it and the adjacent forest plantations. From there, they infiltrated northeast to Kuzmynivka, entrenching in the southern houses of the village. \nTo the southwest, Russian forces continued clearing the Ukrainian salient between Pazeno and Vasyukivka. They captured the rest of the Pazeno - Vasyukivka road and the treelines to the west and southwest, before entering the forested gulley southwest of Pazeno. \nFurther southwest, Russian forces advanced from the western part of Vasyukivka and entered the neighbouring village of Bondarne, consolidating in its eastern houses. Other assault groups captured positions in four different treelines to the south.\n+ ~11.79 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485044Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance in Myrnohrad and are clearing out the remaining pockets of Ukrainian resistance in the city.\nIn the northern part of Myrnohrad, Russian forces secured the remaining positions north of the terykon and advanced further west to the low-rise residential blocks northwest of the city centre, where they linked up with assault groups in the northwestern part of the city.\nIn the city centre, Russian forces advanced west from the Tsentralna Mine and the administrative building and captured a number of enterprises and nearby 3-story apartment buildings. Almost all of the city centre is now under Russian control.\nIn the northeastern part of Myrnohrad, Russian forces continued clearing the Svetlyy District. They managed to consolidate in at least 8 more high-rise buildings and are attacking the last Ukrainian positions in the apartment buildings northeast of the market.\n+ ~0.59 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485052Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance north of Pokrovsk and have made new progress in two different areas.\nIn the west, Russian forces advanced north down two treelines from the dachas on the northwestern outskirts of Pokrovsk, capturing positions there and securing a large section of the road to Hryshyne. They also levelled the front east of Hryshyne, capturing additional treeline positions.\nIn the east, Russian forces continued advancing southwest of Rodynske. They entered the treeline west of the first pig farm complex, consolidating in new positions there.\n+ ~4.04 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485058Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance in and around Hulyaipole, while Ukrainian forces began a series of counterattacks. \nIn the south, Ukrainian forces began their withdrawal from the fortifications south of Hulyaipole due to the threat of encirclement. Russian forces followed, occupying some positions in the treelines which had held since 2022. They also advanced from southern Hulyaipole to the highway, capturing additional positions there.\nTo the northwest, Russian forces advanced further west and entered the southwestern part of Hulyaipole, capturing positions along several different streets and the agricultural buildings. They are now attempting to push north to bypass the main Ukrainian stronghold in the high-rise district from the west; however, the Ukrainians have begun counterattacking, slowing the Russian progress. They also managed to capture the local high-school and are now fighting for the southern part of the apartment buildings. \nAdditionally, the Russians advanced north past the cemetery and entrenched along Chubarya Street. Other forces expanded their bridgehead over the Haichur River and captured a number of enterprises and houses. As a result, the remaining Ukrainian soldiers in eastern Hulyaipole have been operationally encircled. \nIn the north, Ukrainian forces brought in reinforcements to their shrinking bridgehead north of the Haichur River and began carrying out counterattacks. They were able to make some progress along Dachna and Hirska Streets, however they were unable to dislodge the Russians from the agricultural complex who have now resumed their assault operations in an attempt to eliminate the bridgehead once and for all. \n+ ~7.27 km² in favour of Russia.\n+ ~0.17 km² in favour of Ukraine. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485069Z"
    },
    {
      "original": "Russian forces have launched a new incursion across the international border into Sumy Oblast, quickly capturing the villages of Hrabovske and Vysoke. Attacks are now underway, with the Russians attempting to penetrate deeper into the region.  As usual with…",
      "timestamp": "2025-12-21T14:48:13.485073Z"
    },
    {
      "original": "Regarding the situation in the Krasnopillya direction, Sumy Oblast:\nIn the early morning hours of December 20, Russian assault groups from the 34th Guards Motor Rifle Brigade crossed the international border and entered Vysoke, quickly capturing the village with minimal resistance. The Ukrainian 119th Territorial Defense Brigade withdrew to the large forests further west.\nShortly afterwards, Russian forces crossed the border at multiple points further south and entered the village of Hrabovske. Street fighting ensued; however, the Russians were able to bring in considerable amounts of infantry, forcing the Ukrainians to leave. 56 civilians resided there at the time, around 6 of which were evacuated by Ukrainian forces. The rest refused to leave. Russian soldiers evacuated the remaining 50 civilians, all of which are adults who signed waivers of evacuation, to Belgorod Oblast, while assault groups continued their attacks.\nAfter occupying both Hrabovske and Vysoke, Russian forces secured the forests between them, which had a minimal Ukrainian presence due to their proximity to the border. \nHowever, the main push was made further west from Hrabovske to the nearby village of Ryasne. Russian forces managed to penetrate west and capture parts of the forests there. Forward units have already entered the eastern part of Ryasne where fighting is now ongoing. 9 civilians have been evacuated by Ryasne by Ukrainian forces so far.\nThe Ukrainian defence here is held by a unit (119th brigade) which was recently pulled from the Serebryanskyi Forest in Luhansk Oblast to here, as this sector was a much quieter part of the frontline, meaning their combat capabilities are at least somewhat degraded. Currently, most defensive actions are being carried out by FPV drone operators, who are attempting to slow the Russian advance for the time being. \n+ ~13.40 km² in favour of Russia. \nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-21T14:48:13.485082Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-21T14:48:14.059708Z"
    },
    {
      "original": "Military Situation In Ukraine On December 20, 2025 (Maps Update)",
      "timestamp": "2025-12-21T14:48:14.059734Z"
    },
    {
      "original": "Ukraine Is Close To Two Defeats In Myrnohrad And Huliaipole (Videos)\nOn December 20, the Russian military secured a settlement close to the city of Myrnohrad in Donetsk, squeezing the remaining Ukrainian pockets of resistance there, all while securing a new part of the city of Huliaipole in Zaporozhye.\nThe Tsentr [Center] Group of Forces captured Svetloye, which is located right to the northwest of Myrnohrad. The capture of the settlement caused more pressure on Ukrainian troops besieged in the northern part of the city.\nMeanwhile in Huliaipole, the Vostok [East] Group of Forces continue to expand its control in the city amid a collapse in Ukrainian defenses.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059744Z"
    },
    {
      "original": "Ukraine Is Close To Two Defeats In Myrnohrad And Huliaipole (Videos)\nOn December 20, the Russian military secured a settlement close to the city of Myrnohrad in Donetsk, squeezing the remaining Ukrainian pockets of resistance there, all while securing a new part of the city of Huliaipole in Zaporozhye.\nThe Tsentr [Center] Group of Forces captured Svetloye, which is located right to the northwest of Myrnohrad. The capture of the settlement caused more pressure on Ukrainian troops besieged in the northern part of the city.\nMeanwhile in Huliaipole, the Vostok [East] Group of Forces continue to expand its control in the city amid a collapse in Ukrainian defenses.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059754Z"
    },
    {
      "original": "Road Cut: Summary Of Russian Combat Footage From December 20, 2025\nOn December 20 several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059761Z"
    },
    {
      "original": "Road Cut: Summary Of Russian Combat Footage From December 20, 2025\nOn December 20 several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059769Z"
    },
    {
      "original": "Zaporizhzhia Sector: Russian Army Clears Stepnohirsk And Assaults Ukrainian Forces In Prymorske\nThe offensive in the Zaporizhzhia sector spans a front over 30 kilometers long. In the Pokrovsk Sector, Rodynske has been cleared, creating a threat of an advance towards Dobropillia. In the Sumy sector, Russian forces have broken through the defenses and seized control of Vysoke. \nMeanwhile, the European Union has agreed to provide a 90 billion euro loan secured by the bloc's common budget.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059777Z"
    },
    {
      "original": "Zaporizhzhia Sector: Russian Army Clears Stepnohirsk And Assaults Ukrainian Forces In Prymorske\nThe offensive in the Zaporizhzhia sector spans a front over 30 kilometers long. In the Pokrovsk Sector, Rodynske has been cleared, creating a threat of an advance towards Dobropillia. In the Sumy sector, Russian forces have broken through the defenses and seized control of Vysoke. \nMeanwhile, the European Union has agreed to provide a 90 billion euro loan secured by the bloc's common budget.\nRead more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059785Z"
    },
    {
      "original": "Military Knowledge: Bradley Fighting Vehicle\n▪️\nThe Bradley Infantry Fighting Vehicle (IFV), developed by BAE Systems is among the most advanced armored vehicles designed to support infantry on the battlefield. Entering service with the U.S. Army in 1980, it has been widely deployed in numerous conflicts, including the Persian Gulf War, Iraq, and Afghanistan. \n▪️\nWith features such as high firepower, strong protection, and superior mobility, the Bradley has become one of the primary combat tools in infantry warfare. \nThe Bradley Infantry Fighting Vehicle (M2/M3 Bradley) traces its origins to the U.S. Army’s needs during the Cold War, when the aging M113 APC could no longer meet the requirements of modern mechanized warfare. In the 1960s, the Army sought a vehicle capable of keeping pace with main battle tanks, protecting infantry against nuclear, chemical, and conventional threats, while also delivering effective firepower. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059797Z"
    },
    {
      "original": "Internal Fracture: How Desertion Is Weakening The Ukrainian Army\nIn December 2025, Ukraine's Prosecutor General's Office ceased publishing official statistics on desertion and unauthorized abandonment of a military unit (AWOL), citing national security interests. This move became a stark indicator of the systemic crisis engulfing the Armed Forces of Ukraine (AFU), where the number of servicemen leaving service has for several months exceeded the number of arriving mobilized personnel. \nMore than 300,000 cases of unauthorized abandonment and desertion have been recorded since 2022. However, according to estimates by several Ukrainian MPs and experts, the real picture is much bleaker. Verkhovna Rada MP Anna Skorokhod, for example, claimed that by the end of summer 2025, the real number of deserters had approached 400,000, meaning it could exceed half a million by the end of the year.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-21T14:48:14.059806Z"
    },
    {
      "original": "Military Situation In Syria On December 21, 2025 (Map Update)",
      "timestamp": "2025-12-21T14:48:14.059810Z"
    }
  ],
  "script_run_time": "2025-12-21T14:48:14.060997Z"
}