{
  "messages": [
    {
      "original": "🛵\n Групи БпЛА через Бериславський район Херсонщини, курсом на Новий Буг (Миколаївщина)",
      "timestamp": "2025-09-27T04:34:06.713964Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Полтавщини, курсом на Дніпропетровщину.\n🛵\n БпЛА в південній частині Харківщини, курсом на південь.\n🛵\n БпЛА в східній частині Харківщини, курс західний/південно-західний.\n🛵\n БпЛА в західній частині Чернігівщини, курс південно-західний.\n🛵\n БпЛА північніше Кам'янського (Дніпропетровщина), курс західний.",
      "timestamp": "2025-09-27T04:34:06.713986Z"
    },
    {
      "original": "🛵\n БпЛА на межі Кіровоградщини та Миколаївщини, курс західний/північно-західний.",
      "timestamp": "2025-09-27T04:34:06.713992Z"
    },
    {
      "original": "🛵\n БпЛА із акваторії Чорного моря, курсом на Одещину.",
      "timestamp": "2025-09-27T04:34:06.713997Z"
    },
    {
      "original": "🛵\n Групи ударних БпЛА на межі Кіровоградщини та Миколаївщини, курс північно-західний.\n🛵\n БпЛА в західній частині Харківщини, курс південний.\n🛵\n БпЛА в південній частині Харківщини, курс західний.\n🛵\n БпЛА в північно-східній частині Полтавщини, курс південно-західний.\n🛵\n БпЛА в північній частині Донеччини, курс південно-західний.\n🛵\n БпЛА в північній частині Запоріжжя, курс західний.\n🛵\n БпЛА з Миколаївщини, курсом на Одещину.",
      "timestamp": "2025-09-27T04:34:06.714010Z"
    },
    {
      "original": "🛵\n БпЛА в Гайсинському районі Вінниччини, курс західний.\n🛵\n БпЛА на межі Кіровоградщини та Миколаївщини, курс північно-західний.\n🛵\n БпЛА курсом на Кременчук з північно-східного напрямку.\n🛵\n БпЛА над Кам'янським (Дніпропетровщина), курс західний.\n🛵\n БпЛА в східній частині Дніпропетровщини, курс південно-західний.",
      "timestamp": "2025-09-27T04:34:06.714021Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Чернігівщини, курс південно-західний.",
      "timestamp": "2025-09-27T04:34:06.714025Z"
    },
    {
      "original": "🛵\n БпЛА з Чернігівщини, курсом на Київщину.\n🛵\n БпЛА в північно-східній частині Чернігівщини, курс південно-західний.\n🛵\n БпЛА в Сумському районі, курс західний.\n🛵\n БпЛА в південній частині Харківщини, курс західний.\n🛵\n БпЛА північніше Кременчука, постійно змінює напрямок руху.\n🛵\n БпЛА в Гайсинському районі Вінниччини, курс західний.\n🛵\n БпЛА південніше Павлограда, курс південно-західний.",
      "timestamp": "2025-09-27T04:34:06.714038Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.\n🛵\n БпЛА в східній частині Чернігівщини, курс південно-західний.\n🛵\n БпЛА в Дніпровському районі, курс західний.",
      "timestamp": "2025-09-27T04:34:06.714045Z"
    },
    {
      "original": "🛵\n БпЛА з Дніпропетровщини, курсом на Кіровоградщину.",
      "timestamp": "2025-09-27T04:34:06.714052Z"
    },
    {
      "original": "🛵\n БпЛА північніше Броварів, курсом на захід.",
      "timestamp": "2025-09-27T04:34:06.714056Z"
    },
    {
      "original": "🛵\n БпЛА в Бучанському районі, курсом на Макарів.",
      "timestamp": "2025-09-27T04:34:06.714063Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини, курсом на Полтавщину.\n🛵\n БпЛА в центральній та східній частинах Полтавщини, курс південно-західний.",
      "timestamp": "2025-09-27T04:34:06.714069Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-09-27T04:34:06.714075Z"
    },
    {
      "original": "🛵\n БпЛА з Київщини, курсом на Житомирщину.",
      "timestamp": "2025-09-27T04:34:06.714079Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс південний.\n🛵\n БпЛА на півночі Сумщини, курс південно-західний.\n🛵\n БпЛА з Полтавщини, курсом на Дніпропетровщину.\n🛵\n БпЛА в центральній частині Полтавщини, постійно змінює напрямок руху.",
      "timestamp": "2025-09-27T04:34:06.714088Z"
    },
    {
      "original": "🛵\n БпЛА в східній частині Чернігівщини, курс південний.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-09-27T04:34:06.714094Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-09-27T04:34:06.714098Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-09-27T04:34:06.714103Z"
    },
    {
      "original": "🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-09-27T04:34:06.714107Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Сумщини, курс південно-західний.\n🛵\n БпЛА в Сумському районі, курс південний.",
      "timestamp": "2025-09-27T04:34:06.714112Z"
    },
    {
      "original": "Russian forces have captured Odradne, Velykyi Burluk direction, Kharkiv Oblast.\nPre-war population: ~183.\nTotal land area: ~1.02 km².",
      "timestamp": "2025-09-27T04:34:07.249406Z"
    },
    {
      "original": "Footage showing 10 Russian Geran-2 and Geran-3 drone strikes on the Honcharivske Training Ground in Chernihiv Oblast. Prior to these strikes, 2 Iskander-M ballistic missiles impacted.   The Ukrainian Armed Forces admitted to an unspecified number of casualties…",
      "timestamp": "2025-09-27T04:34:07.249419Z"
    },
    {
      "original": "From a prominent Ukrainian channel with close connections with Ukrainian air defence and ground forces. He's talking about the strikes on the Honcharivske Training Ground in Chernihiv Oblast.",
      "timestamp": "2025-09-27T04:34:07.249423Z"
    },
    {
      "original": "From a prominent Ukrainian channel with close connections with Ukrainian air defence and ground forces. He's talking about the strikes on the Honcharivske Training Ground in Chernihiv Oblast.",
      "timestamp": "2025-09-27T04:34:07.249427Z"
    },
    {
      "original": "Another prominent Ukrainian source with close connections to air defence units.\nChernihiv Oblast seems to be wide open and not prioritised.",
      "timestamp": "2025-09-27T04:34:07.249435Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-27T04:34:07.249439Z"
    },
    {
      "original": "Chernihiv City right now. Geran-2 drones have struck the city. Nizhyn also came under attack earlier.",
      "timestamp": "2025-09-27T04:34:07.249443Z"
    },
    {
      "original": "Sentinel satellite imagery reveals that groups of Ukrainian soldiers were encircled in the western part of Sichneve around four days ago, after Russian forces bypassed the village and continued advancing further west.   Russian forces are now striking them…",
      "timestamp": "2025-09-27T04:34:07.249447Z"
    },
    {
      "original": "We have geolocations confirming my earlier reports that Ukrainian forces were encircled in Sichneve and were being hit by FPV drones.",
      "timestamp": "2025-09-27T04:34:07.249450Z"
    },
    {
      "original": "⚡️\n🇮🇱\n🇱🇧\n IDF: The Air Force, guided by Military Intelligence, struck a alleged Hezbollah precision missile production site in Lebanon’s Bekaa region.\nThe IDF said the site’s existence violates understandings between Israel and Lebanon and vowed to continue acting against threats to Israel.\n@wfwitness",
      "timestamp": "2025-09-27T04:34:07.249461Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-09-27T04:34:07.249465Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-09-27T04:34:07.249468Z"
    },
    {
      "original": "Iskander on Khotin, Sumy Oblast",
      "timestamp": "2025-09-27T04:34:07.249471Z"
    },
    {
      "original": "Iskander on Khotin, Sumy Oblast",
      "timestamp": "2025-09-27T04:34:07.249474Z"
    },
    {
      "original": "Flying to Ulyanivka/Sumy City",
      "timestamp": "2025-09-27T04:34:07.249477Z"
    },
    {
      "original": "Disappeared. This was an S-300 in ground-to-ground mode.",
      "timestamp": "2025-09-27T04:34:07.249480Z"
    },
    {
      "original": "8 Russian Tu-95MS strategic bombers departed from Ukrainka Airbase, Amur Oblast. The purpose of the flight is unknown - possibly large-scale training exercises.",
      "timestamp": "2025-09-27T04:34:07.249483Z"
    },
    {
      "original": "Correction: 3 rockets were launched. 1 impacted in Ashdod.",
      "timestamp": "2025-09-27T04:34:07.249487Z"
    },
    {
      "original": "The Saraya Al-Quds Brigades (Palestinian Islamic Jihad) has claimed responsibility for the rocket attack on the Israeli city of Ashdod, over 30 km away from the closest potential launch positions. \nThey stated that three \"Badr-3\" MLRS rockets were used.",
      "timestamp": "2025-09-27T04:34:07.249492Z"
    },
    {
      "original": "Remind me, who was it who carried out that drone strike on a car with a family of American citizens this week?",
      "timestamp": "2025-09-27T04:34:07.249496Z"
    },
    {
      "original": "— \n🇮🇱\n/\n🇵🇸\n Netanyahu:\n 'The amount of civilians killed compared to the amount of terrorists in Gaza is extremely low'\n@Middle_East_Spectator",
      "timestamp": "2025-09-27T04:34:07.249503Z"
    },
    {
      "original": "It feels like its been a while since i've addressed the overall situation across the front in Ukraine. Over the last few months, Ukrainian forces have been conducting localised counterattacks in various places across the front when they hold a slight numerical advantage. However, this has significantly depleted the overall situation for the AFU, as the strategic whack-a-mole game grows in intensity. Gaps are opening up more frequently, and in greater magnitude. The biggest example was the Zolotyy Kolodyaz breakthrough, which forced Ukraine to pull elite Azov units from the Serebryanske forestry and Kupyansk, as well as regular units from Pokrovske direction. What we saw was the clearest evidence of the whackamole theory yet, as villages toward Pokrovske tumbled, the Serebraynske forest, which had held out for over 2 YEARS collapsed immediately, and Russian forces now controlling over half of Kupyansk. The whack a mole game continues, and will continue, with larger and larger gaps opening up, until the eventual end of organised resistance by the AFU. To be vulnerable and honest, i've made so many mistakes predicting a timeline of collapse, so im not gonna try to predict a timeline again lol. But collapse is happening, in stages, gradually.",
      "timestamp": "2025-09-27T04:34:07.249507Z"
    },
    {
      "original": "5 Tu-95MS bombers from Ukrainka landed at Engels-2 airbase today. There are now 8 Tu-95MS at Engels-2 and 1 at Olenya airbase.\nFollowing this redeployment, at least 8 Tu-95MS are ready for combat. A large-scale missile attack against Ukraine is likely within the next 48 hours",
      "timestamp": "2025-09-27T04:34:07.249510Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued to advance within Kupyansk City and have broken through towards the southwestern suburbs. \nAfter a period of intensified assault operations, DRG activities, and infantry accumulation, Russian forces were able to make significant progress in the western part of Kupyansk, advancing through the residential areas west of the Kupyanka River. They were able to capture positions along Lermontova Street, which leads to Sobolivka, while assault groups penetrated further south to the high-rise buildings of the Yuvileynyi Neighbourhood in the southwest of the city. \nEast of the Kupyanka River, Russian forces improved their positions in the residential areas and reached the industrial zone in the centre of Kupyansk. They are now bypassing the Ukrainian \"Comb\" stronghold in the high-rise micro-district in the northern suburbs which the Russians previously failed to enter. Meanwhile, Russian forces continued to carry out assault operations in the area of the Central City Hospital, while Ukrainian forces continued to repel Russian attacks in the city centre. \n+ ~0.96 km² in favour of Russia.",
      "timestamp": "2025-09-27T04:34:07.249516Z"
    },
    {
      "original": "Russian forces have captured the village of Derylove, Lyman direction, Donetsk Oblast.\nPre-war population: ~108.\nTotal land area: ~0.63 km².",
      "timestamp": "2025-09-27T04:34:07.249522Z"
    }
  ],
  "script_run_time": "2025-09-27T04:34:07.647093Z"
}