{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння  з північно-східного напрямку.",
      "timestamp": "2025-11-18T19:44:24.347270Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-18T19:44:24.347286Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння зі сходу.",
      "timestamp": "2025-11-18T19:44:24.347291Z"
    },
    {
      "original": "Дніпро - в укриття!",
      "timestamp": "2025-11-18T19:44:24.347295Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград з північно-східного напрямку.",
      "timestamp": "2025-11-18T19:44:24.347300Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з Брянська.",
      "timestamp": "2025-11-18T19:44:24.347305Z"
    },
    {
      "original": "⚠\n Увага!\nХарків - в районі міста ворожий БпЛА.\nПеребувайте в укриттях!",
      "timestamp": "2025-11-18T19:44:24.347311Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград з північно-східного напрямку.",
      "timestamp": "2025-11-18T19:44:24.347315Z"
    },
    {
      "original": "🛵\n БпЛА з півночі \n➡️\n курсом на Харків!",
      "timestamp": "2025-11-18T19:44:24.347321Z"
    },
    {
      "original": "🛵\n БпЛА з Харківщини в напрямку Полтавщини ( Полтавський р-н).",
      "timestamp": "2025-11-18T19:44:24.347326Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північно-східного напрямку.",
      "timestamp": "2025-11-18T19:44:24.347330Z"
    },
    {
      "original": "🛵\n Харків - в районі міста ворожий БпЛА.",
      "timestamp": "2025-11-18T19:44:24.347334Z"
    },
    {
      "original": "☄️\n  Загроза застосування балістичного озброєння з південно-східного напрямку!",
      "timestamp": "2025-11-18T19:44:24.347339Z"
    },
    {
      "original": "Харків - в укриття!",
      "timestamp": "2025-11-18T19:44:24.347342Z"
    },
    {
      "original": "🛵\n БпЛА з півдня \n➡️\n курсом на Дніпро!",
      "timestamp": "2025-11-18T19:44:24.347348Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччині.",
      "timestamp": "2025-11-18T19:44:24.347352Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину з півночі та сходу.",
      "timestamp": "2025-11-18T19:44:24.347356Z"
    },
    {
      "original": "🛵\nСуми - загроза БпЛА! Перебувайте в укриттях!",
      "timestamp": "2025-11-18T19:44:24.347361Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-11-18T19:44:24.347367Z"
    },
    {
      "original": "🛵\n БпЛА на Суми з півночі!",
      "timestamp": "2025-11-18T19:44:24.347371Z"
    },
    {
      "original": "🛵\n БпЛА з Сумщини \n➡️\n у бік Полтавщини.",
      "timestamp": "2025-11-18T19:44:24.347377Z"
    },
    {
      "original": "🇵🇸\n🇮🇱\n⚡️\n- \"If the United Nations pushes for recognition of Palestine, I will order targeted assassinations of senior Palestinian Authority terrorists and the arrest of Mahmoud Abbas himself.\" - Israeli National Security Minister Ben Gvir.",
      "timestamp": "2025-11-18T19:44:24.907801Z"
    },
    {
      "original": "Last night, Russia carried out a combined missile and drone attack on the city of Berestyn, Kharkiv Oblast. \nAt least five Geran-2 drones and four Iskander-M ballistic missiles attacked an unknown target within the city limits.",
      "timestamp": "2025-11-18T19:44:24.907813Z"
    },
    {
      "original": "Over the last week, I've seeing a lot of Pro-Ukraine accounts beginning to doom about the war. People are highlighting the massive issues plaguing the Armed Forces of Ukraine, and the Russian superiority in all the different fields of war.\nBut I guarantee you, that at some point towards the end of 2025 and into 2026, Ukraine will carry out some sort of PR-related operation like Spiderweb or Kursk which will \"win back\" these supporters. And sure enough, they will follow like sheep and good lil' patriots, changing up the presumed narrative, and shifting the goal posts back, once again, to restoring the 2014, or even 1991 borders. \nWe saw a similar phenomenon last year. After Russia entered northern Kharkiv Oblast and attacked the cities of Vovchansk and Lyptsi, and Ukraine redeployed units away from the Donbas, Russia began rapidly advancing in the directions of Pokrovsk, Vuhledar, Ukrainsk, and Kurakhove. Pro-Ukrainians began sounding the alarms, with these rapid advances massively contrasting the prolonged and difficult battle for Avdiivka. Then, in early August, Ukraine launched their Kursk operation, and everything changed back. \nIt's just the ebb and flow of the uninformed parts of the information space. But slowly, the goal posts are shifting. It's not linear, but the goal posts are trending in favour of Russia, and away from the original goal which was set of restoring the 1991 borders. This will only accelerate, but of course with a delay to Russian progress as we have seen in the past.",
      "timestamp": "2025-11-18T19:44:24.907820Z"
    },
    {
      "original": "I cannot believe this. \nUkraine's train stations get hit by 4 ballistic missiles and half a dozen Geran-2 drones, and only result in some rerouting and delays of up to 1 hour. \nMy train lines get COMPLETELY CANCELLED for the entire day for an average of 4 days per week due to \"track repairs\". You're repairing tracks four times per week??? How is that even possible?",
      "timestamp": "2025-11-18T19:44:24.907825Z"
    },
    {
      "original": "🇱🇧\n🇮🇱\n - Israel has now killed 367 Hezbollah members since the Israel-Hezbollah ceasefire 356 days ago. \nHezbollah has responded 0 times.",
      "timestamp": "2025-11-18T19:44:24.907831Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:\nYesterday, 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. It is unlikely to be equipped with Kh-101 cruise missiles, as another Tu-160 redeployed from Engels-2 Airbase to Ukrainka Airbase, suggesting a rotation was carried out for training purposes, as this bomber has been stationed at Engels-2 for a long time and was only ever used for training.\n2 Tu-95MS and 1 Tu-160 landed at Engels-2 Airbase just now after redeploying from Ukrainka airbase and will also be equipped with Kh-101 missiles. The 2 Tu-95MS will likely make a flight to Olenya Airbase, Murmansk Oblast, in the next 36 hours. \nAnother IL-76MD cargo plane, along with an An-26 cargo plane landed at Rostov Airbase. The cargo consists of additional Iskander-M ballistic missiles, which will be delivered to OTRK installations near Taganrog, Rostov Oblast. \nRemember, 2 Iskanders were launched from Taganrog last night at a target in Berestyn, Kharkiv Oblast. It's also possible (but unlikely in my opinion) that a portion of these Iskanders from Rostov Airbase are being delivered to OTRK installations at Millerovo Airbase, Rostov Oblast.\nNew deliveries of at least 150 Geran-2 drones have been made to the launch sites at Millerovo Airbase, Rostov Oblast, and Navlya Test Site, Bryansk Oblast, via rail. Accumulation of drones at launch points surrounding Ukraine that have been allocated for this upcoming attack will be over 400 now. \nOne \"Buyan-M\" Corvette was equipped with up to 8 Kalibr cruise missiles at Novorossiysk Naval Base, Krasnodar Krai. No other Kalibr carriers are known to be equipped with missiles, so if the upcoming attack occurs in the next two days, it's unlikely that Kalibrs will be used\nOne MiG-31K fighter carried out rare, long-range training from Savasleika Airbase, Nizhny Novgorod Oblast. An IL-76M tanker from Diaghilev Airbase, Ryazan Oblast, took part in refueling the aircraft. \nCurrently, there are 8 MiG-31Ks stationed at Savasleika Airbase. Their equipment status is unknown, but likely only a portion are equipped with Kinzhal missiles. The 2 MiG-31Ks at Akhtubinsk Airbase, Astrakhan Oblast, are not equipped with missiles.\nRight now, there are 3 Tu-95MS at Olenya Airbase, 3 Tu-95MS at Engels-2 Airbase, and 5 Tu-160s at Engels-2 Airbase. Currently confirmed to be equipped / are being equipped with missiles are: 6 Tu-95MS and 3 Tu-160s. \nThe next large-scale missile attack is unlikely to take place tonight, but there is an increased threat for Wednesday night / Thursday morning, and the three nights after that.",
      "timestamp": "2025-11-18T19:44:24.907842Z"
    },
    {
      "original": "⚡\n🇷🇺\n \nKommersant:\n Russia’s United Aircraft Corporation (OAK) has delivered two fifth-generation Su-57 stealth fighters to an undisclosed foreign customer. OAK CEO Vadim Badeha stated that the aircraft have already entered combat duty, are performing well, and the buyer is satisfied. \nThe announcement comes as Russia showcased the export version Su-57E and the upgraded Yak-130M at the Dubai Airshow 2025. This marks the first confirmed export delivery of the Su-57.\n@wfwitness",
      "timestamp": "2025-11-18T19:44:24.907850Z"
    },
    {
      "original": "Twitter just realised they almost went a whole week without breaking, so had to quickly fix that.",
      "timestamp": "2025-11-18T19:44:24.907858Z"
    },
    {
      "original": "A car-ramming and stabbing incident has just taken place at Gush Etzion Junction in the Israeli-occupied part of the West Bank. \nThree Palestinians took part in the attack and have reportedly all been killed. One woman is in critical condition and unconscious.",
      "timestamp": "2025-11-18T19:44:24.907863Z"
    },
    {
      "original": "A car-ramming and stabbing incident has just taken place at Gush Etzion Junction in the Israeli-occupied part of the West Bank.   Three Palestinians took part in the attack and have reportedly all been killed. One woman is in critical condition and unconscious.",
      "timestamp": "2025-11-18T19:44:24.907866Z"
    },
    {
      "original": "Four Israelis are injured. The woman in critical condition was reportedly accidentally shot by IDF security forces as they fired on the Palestinian perpetrators.",
      "timestamp": "2025-11-18T19:44:24.907869Z"
    },
    {
      "original": "Update on Russian preparations for the next large-scale, combined missile attack on Ukraine:  Yesterday, 1 Tu-160 strategic bombers redeployed from Ukrainka Airbase, Amur Oblast, to Engels-2 Airbase, Saratov Oblast. It is unlikely to be equipped with Kh-101…",
      "timestamp": "2025-11-18T19:44:24.907872Z"
    },
    {
      "original": "1 Tu-95MS departed from Engels-2 Airbase, Saratov Oblast, redeploying to Olenya Airbase, after it was equipped with Kh-101 cruise missiles. The other bomber will take off shortly.",
      "timestamp": "2025-11-18T19:44:24.907876Z"
    },
    {
      "original": "Autumn logistics in Ukraine.",
      "timestamp": "2025-11-18T19:44:24.907879Z"
    },
    {
      "original": "Polish Prime Minister Donald Tusk reports that the two suspects for blowing up the Warsaw-Dęblin were Ukrainian citizens, collaborating with Russian intelligence services. Both have reportedly flown back to Belarus.",
      "timestamp": "2025-11-18T19:44:24.907882Z"
    },
    {
      "original": "Russian forces have captured the village of Vesele, Hulyaipole direction, Zaporizhzhia Oblast.\nPre-war population: ~35.\nTotal land area: ~0.18 km².",
      "timestamp": "2025-11-18T19:44:24.907889Z"
    },
    {
      "original": "Multiple Ukrainian ballistic missiles were shot down by Russian air defence over Voronezh. No impacts were reported.\nIt's possible that these were Hrim-2 \"Sapsan\" missiles.",
      "timestamp": "2025-11-18T19:44:24.907893Z"
    },
    {
      "original": "Multiple Ukrainian ballistic missiles were shot down by Russian air defence over Voronezh. No impacts were reported.\nIt's possible that these were Hrim-2 \"Sapsan\" missiles.",
      "timestamp": "2025-11-18T19:44:24.907897Z"
    },
    {
      "original": "There is a possible threat of a large-scale Russian missile attack tonight. Nothing is certain, and nothing significant has been recorded, but there is an increased threat. \nI will update in the morning (NZ time).",
      "timestamp": "2025-11-18T19:44:24.907901Z"
    },
    {
      "original": "There is a possible threat of a large-scale Russian missile attack tonight. Nothing is certain, and nothing significant has been recorded, but there is an increased threat.   I will update in the morning (NZ time).",
      "timestamp": "2025-11-18T19:44:24.907904Z"
    },
    {
      "original": "The next combined missile and drone attack will probably take place tonight. 3 frequencies are active, including two command and control signals between Engels-2 Airbase and Olenya Airbase with Moscow.",
      "timestamp": "2025-11-18T19:44:24.907907Z"
    },
    {
      "original": "The next combined missile and drone attack will probably take place tonight. 3 frequencies are active, including two command and control signals between Engels-2 Airbase and Olenya Airbase with Moscow.",
      "timestamp": "2025-11-18T19:44:24.907910Z"
    },
    {
      "original": "While no combat related frequency activity has been observed yet, this is because Russia has switched to winter frequencies since November 1, and due to changes in daylight hours, departures of Tu-95MS strategic bombers will take place later than previously.\nCurrently, there are a minimum of 6 Tu-95MS known to be equipped with Kh-101 cruise missiles. 3 are stationed at Olenya Airbase in Murmansk Oblast, and interestingly, the 3 which were previously stationed at Engels-2 Airbase have been redeployed / are redeploying to Diaghilev Airbase, Ryazan Oblast.\nAs for the Tu-160 strategic bombers, 1 is airborne from Engels-2 Airbase, redeploying to Diaghilev airbase in a group with 2 of the Tu-95MS. 2 others stationed at Engels-2 Airbase are known to be equipped with Kh-101 missiles.",
      "timestamp": "2025-11-18T19:44:24.907915Z"
    },
    {
      "original": "As for Kalibr-carriers, 1 \"Admiral Makarov\" frigate, 1 \"Buyan-M\" corvette, and 1 \"Varshavyanka\" submarine, are now equipped with Kalibr cruise missiles.\nThey can launch a total of 24 Kalibrs.",
      "timestamp": "2025-11-18T19:44:24.907919Z"
    },
    {
      "original": "Russian Strikes On Ukraine's Energy And Railway Infrastructure Worsen Crisis\nOn the night of November 18, according to the Ukrainian Air Force, Russian forces launched four Iskander-M ballistic missiles and 114 kamikaze drones, of which 101 aerial targets were reportedly shot down or suppressed.\nThe primary Russian strike was concentrated on targets within four regions of Ukraine. The most intense attacks targeted Dnipropetrovsk Region, particularly the city of Dnipro. The assault focused on railway infrastructure facilities: a suburban depot, a repair shop, and the station building were damaged.\nFurthermore, a strike hit a television and radio center housing the offices of media companies, including the news agency \"Suspilne Dnipro\" and \"Ukrainian Radio.\" Strikes were also recorded in the areas of Vasylkivka, Shakhtarske, Petropavlivka, and the outskirts of Pavlohrad.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482814Z"
    },
    {
      "original": "Russian Strikes On Ukraine's Energy And Railway Infrastructure Worsen Crisis\nOn the night of November 18, according to the Ukrainian Air Force, Russian forces launched four Iskander-M ballistic missiles and 114 kamikaze drones, of which 101 aerial targets were reportedly shot down or suppressed.\nThe primary Russian strike was concentrated on targets within four regions of Ukraine. The most intense attacks targeted Dnipropetrovsk Region, particularly the city of Dnipro. The assault focused on railway infrastructure facilities: a suburban depot, a repair shop, and the station building were damaged.\nFurthermore, a strike hit a television and radio center housing the offices of media companies, including the news agency \"Suspilne Dnipro\" and \"Ukrainian Radio.\" Strikes were also recorded in the areas of Vasylkivka, Shakhtarske, Petropavlivka, and the outskirts of Pavlohrad.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482832Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 18, 2025 (Map Update)",
      "timestamp": "2025-11-18T19:44:25.482837Z"
    },
    {
      "original": "Russian Army Reaches Haichur River, Ukrainian Troops Flee Pokrovsk Disguised As Civilians (Videos)\nOn November 18, the Russian military reached the Haichur River in Dnipropetrovsk and expanded its control in Pokrovsok and nearby areas in Donetsk forcing more Ukrainian troops to flee in a disorganized manner.\nThe Vostok [East] Group of Forces reached Haichur after capturing Nechayevka in Dnipropetrovsk, according to the Russian Ministry of Defense. \nThis Ukrainian failure between Dnipropetrovsk and Zaporozhye is a direct result of Kiev’s decision to prioritize the defense of the strategic city of Pokrovsk in Donetsk to the east. Ukraine is, however, also losing the battle there.\nAbandoned by their command, more and more Ukrainian troops are now attempting to flee Pokrovsk disguised as civilians.\nRead more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482846Z"
    },
    {
      "original": "Russian Army Reaches Haichur River, Ukrainian Troops Flee Pokrovsk Disguised As Civilians (Videos)\nOn November 18, the Russian military reached the Haichur River in Dnipropetrovsk and expanded its control in Pokrovsok and nearby areas in Donetsk forcing more Ukrainian troops to flee in a disorganized manner.\nThe Vostok [East] Group of Forces reached Haichur after capturing Nechayevka in Dnipropetrovsk, according to the Russian Ministry of Defense. \nThis Ukrainian failure between Dnipropetrovsk and Zaporozhye is a direct result of Kiev’s decision to prioritize the defense of the strategic city of Pokrovsk in Donetsk to the east. Ukraine is, however, also losing the battle there.\nAbandoned by their command, more and more Ukrainian troops are now attempting to flee Pokrovsk disguised as civilians.\nRead more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482855Z"
    },
    {
      "original": "Military Situation In Ukraine On November 18, 2025 (Maps Update)",
      "timestamp": "2025-11-18T19:44:25.482859Z"
    },
    {
      "original": "Military Situation In Ukraine On November 18, 2025 (Maps Update)",
      "timestamp": "2025-11-18T19:44:25.482863Z"
    },
    {
      "original": "Ukraine Is Losing More Ground In Kharkiv (Videos)\nOn November 18, the Russian military captured another settlement close to Vovchansk and made additional gains in the city of Kupyansk in Kharkiv.\nThe Sever [North] Group of Forces imposed control of Tsegelnoye, located right to the southwest of Vovchansk, according to the Russian Ministry of Defense.\nThe capture of the settlement is very important for Russian military operations in this part of Kharkiv. From there, the Sever Group of Forces could attack Vil’cha to the south. This would put immense pressure on remaining Ukrainian troops in the southeastern part of Vovchansk.\nThe pressure on Kiev forces is even larger to the south in Kharkiv, specifically in Kupyansk, where the Zapad Group of Forces has been making gains on a daily basis.\nRead more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482872Z"
    },
    {
      "original": "Ukraine Is Losing More Ground In Kharkiv (Videos)\nOn November 18, the Russian military captured another settlement close to Vovchansk and made additional gains in the city of Kupyansk in Kharkiv.\nThe Sever [North] Group of Forces imposed control of Tsegelnoye, located right to the southwest of Vovchansk, according to the Russian Ministry of Defense.\nThe capture of the settlement is very important for Russian military operations in this part of Kharkiv. From there, the Sever Group of Forces could attack Vil’cha to the south. This would put immense pressure on remaining Ukrainian troops in the southeastern part of Vovchansk.\nThe pressure on Kiev forces is even larger to the south in Kharkiv, specifically in Kupyansk, where the Zapad Group of Forces has been making gains on a daily basis.\nRead more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482885Z"
    },
    {
      "original": "A Reckoning for Ukraine's Spy Chief: Budanov's Ambitions Clash With Battlefield Realities\nA chronology of the Ukrainian Main Intelligence Directorate's special forces' suicidal landing. The Black Hawk-style operation ended in disaster. Despite efforts made, success was not achieved.\nOver the past few months, the operational crisis facing Ukrainian troops in the Pokrovsk and Mirnograd area has perhaps become the most critical point on the entire front. Despite the advance of Russian units, Ukrainian commanders claimed that the situation was under control. However, it later emerged that Pokrovsk had fallen and that a group of several thousand well-trained Ukrainian paratroopers and marines had become isolated from the main forces in Mirnograd.\nLosing such combat-ready units would seriously impact the entire front line. Consequently, the Ukrainian command deployed almost all available forces to relieve the besieged garrison.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482895Z"
    },
    {
      "original": "A Reckoning for Ukraine's Spy Chief: Budanov's Ambitions Clash With Battlefield Realities\nA chronology of the Ukrainian Main Intelligence Directorate's special forces' suicidal landing. The Black Hawk-style operation ended in disaster. Despite efforts made, success was not achieved.\nOver the past few months, the operational crisis facing Ukrainian troops in the Pokrovsk and Mirnograd area has perhaps become the most critical point on the entire front. Despite the advance of Russian units, Ukrainian commanders claimed that the situation was under control. However, it later emerged that Pokrovsk had fallen and that a group of several thousand well-trained Ukrainian paratroopers and marines had become isolated from the main forces in Mirnograd.\nLosing such combat-ready units would seriously impact the entire front line. Consequently, the Ukrainian command deployed almost all available forces to relieve the besieged garrison.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-18T19:44:25.482904Z"
    }
  ],
  "script_run_time": "2025-11-18T19:44:25.483756Z"
}