{
  "messages": [
    {
      "original": "🚀\n Ракетна небезпека: Черкаська, Кіровоградська, Полтавська області.",
      "timestamp": "2025-12-31T11:16:23.174055Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Чернігівщини, курс на південь.",
      "timestamp": "2025-12-31T11:16:23.174071Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-31T11:16:23.174076Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння.",
      "timestamp": "2025-12-31T11:16:23.174081Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині (Миргородський район), напрямок Миргород.",
      "timestamp": "2025-12-31T11:16:23.174085Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря в напрямку  м.Чорноморськ.",
      "timestamp": "2025-12-31T11:16:23.174090Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння.",
      "timestamp": "2025-12-31T11:16:23.174098Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-12-31T11:16:23.174103Z"
    },
    {
      "original": "🚀\n Пуски КАБ на Запорізьку область.",
      "timestamp": "2025-12-31T11:16:23.174108Z"
    },
    {
      "original": "🛵\n Запорізька обл.: БпЛА на південному сході від м.Запоріжжя, курс - північний/північно-західний.",
      "timestamp": "2025-12-31T11:16:23.174112Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА на сході від м.Сум в південному напрямку.",
      "timestamp": "2025-12-31T11:16:23.174117Z"
    },
    {
      "original": "🛵\n Харківщина: група БпЛА повз Богодухів на сході, курс - південний.",
      "timestamp": "2025-12-31T11:16:23.174121Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА з акваторії Чорного моря в напрямку  м.Чорноморськ.",
      "timestamp": "2025-12-31T11:16:23.174128Z"
    },
    {
      "original": "🛵\n \n🛸\n Запорізька обл.: \n- \n🛸\n Ворожий БпЛА, ймовірно, розвідувальний, на півдні від м.Запоріжжя;\n- \n🛵\n БпЛА на південному сході від м.Запоріжжя постійно змінює курс руху.",
      "timestamp": "2025-12-31T11:16:23.174138Z"
    },
    {
      "original": "🛵\n \n🛸\n Запорізька обл.:  - \n🛸\n Ворожий БпЛА, ймовірно, розвідувальний, на півдні від м.Запоріжжя; - \n🛵\n БпЛА на південному сході від м.Запоріжжя постійно змінює курс руху.",
      "timestamp": "2025-12-31T11:16:23.174147Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Запоріжжя зі сходу.",
      "timestamp": "2025-12-31T11:16:23.174152Z"
    },
    {
      "original": "🛵\n Харківщина: група БпЛА \n- повз Богодухів на сході, курс - південний;\n- повз Слобожанське на півночі, курс - південно-східний.",
      "timestamp": "2025-12-31T11:16:23.174157Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині повз н.п.Коломак на півночі в напрямку Полтавщини.",
      "timestamp": "2025-12-31T11:16:23.174164Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА, ймовірно, розвідувальний, в напрямку Кременчука з північного сходу. Залучено засоби для збиття.",
      "timestamp": "2025-12-31T11:16:23.174168Z"
    },
    {
      "original": "https://youtu.be/NGYTmrR-svc?si=Eztbz8WH0R7x-Z24",
      "timestamp": "2025-12-31T11:16:23.174172Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині в напрямку на/повз Нікополь зі сходу.",
      "timestamp": "2025-12-31T11:16:23.174177Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку м.Запоріжжя з південного заходу.",
      "timestamp": "2025-12-31T11:16:23.174183Z"
    },
    {
      "original": "And no, this is a not a \"response\" to a non-existent Ukrainian drone attack on Putin's house.\nThis attack has been in preparation for the last 3.5 days. \nRussia has never really done \"responses\" to anything, even if they say they do. Politically and emotionally charged decision-making doesn't seem to be a big thing in the Russian command, unlike some other countries.",
      "timestamp": "2025-12-31T11:16:23.889946Z"
    },
    {
      "original": "And no, this is a not a \"response\" to a non-existent Ukrainian drone attack on Putin's house.  This attack has been in preparation for the last 3.5 days.   Russia has never really done \"responses\" to anything, even if they say they do. Politically and emotionally…",
      "timestamp": "2025-12-31T11:16:23.889958Z"
    },
    {
      "original": "It also wont target Ukrainian government buildings. Ignore the propaganda noise and be smarter than it. These sorts of missile attacks are nothing new.\nEveryone will forget about this in a few days.",
      "timestamp": "2025-12-31T11:16:23.889963Z"
    },
    {
      "original": "Yesterday, due to recent Russian advances, the Pokrovs'ke Territorial Community announced mandatory evacuation orders for 42 settlements, including the town of Pokrovs'ke, in Dnipropetrovsk Oblast.\nInterestingly, a significant portion of the villages named are already under Russian control or contested. This is likely due to a combination of false reports being sent, and the announcement being delayed to support official reports on the defence of the area.",
      "timestamp": "2025-12-31T11:16:23.889968Z"
    },
    {
      "original": "The Chernihiv OVA announced mandatory evacuation orders for civilians in 14 unspecified border villages of Chernihiv Oblast.\nIt's likely that these are: Senkivka, Khrinivka, Klyusy, Hirsk, Yeline, Mistky, Salne, Huta-Studenetska, Baranivka, Bleshnya, Mkhy, Krasni Lozy, Karopvychi, and Hati.",
      "timestamp": "2025-12-31T11:16:23.889972Z"
    },
    {
      "original": "AMK, I don't know if you read the comments at all, but can I have a suggestion about the map reports? They sound dry, detailless and lacks depth. \"They advanced, further taking bla bla. Then they advanced to the south.\" Why? How? What was the key factors in this? What is the probable long term goal in doing so? What are the strategies (or tactics in this case)? I think WeebUnion is a masterclass in this, it's not my place to teach you how to do your job, but I really admire your work overall and you seem like a guy whose open to criticism. Keep up the good work and thanks.",
      "timestamp": "2025-12-31T11:16:23.889976Z"
    },
    {
      "original": "AMK, I don't know if you read the comments at all, but can I have a suggestion about the map reports? They sound dry, detailless and lacks depth. \"They advanced, further taking bla bla. Then they advanced to the south.\" Why? How? What was the key factors in…",
      "timestamp": "2025-12-31T11:16:23.889980Z"
    },
    {
      "original": "I'll respond to this as a post as I'd like more people to see this.\nI add that kind of information in where I can, but these map updates have always been more situational. I just don't have enough information on that stuff, so I omit it most of the time. I could make guesses, but I'm not confident in that considering how much more unpredictable things have gotten as this war evolves.\nAs an analyst, it's important to understand that you don't and can't know everything. For me, speculating about the processes of an attack wouldn't be analysing things. But, I do write separate posts with this sort of information once the dust has settled and things are clarified.",
      "timestamp": "2025-12-31T11:16:23.889988Z"
    },
    {
      "original": "The Ukrainian Group of Forces \"South\" published footage claiming to show their forces clearing Hulyaipole. \nIn reality, the video was recorded in the town of Zaliznychne, 6 km away. \nCoordinates: 47.6475668, 36.1651338",
      "timestamp": "2025-12-31T11:16:23.889995Z"
    },
    {
      "original": "3 Su-57s flying from Rostov Oblast to the Sea of Azov.\nA Su-34 is also airborne in the area.",
      "timestamp": "2025-12-31T11:16:23.889999Z"
    },
    {
      "original": "Su-34 is over Russian controlled Kherson Oblast. It launched a KAB/Grom-E1 at Kherson Oblast.",
      "timestamp": "2025-12-31T11:16:23.890003Z"
    },
    {
      "original": "Flight of the glide-bombs, flying towards Vysokopillia and then likely the Zelenodolsk Thermal Power Plant.",
      "timestamp": "2025-12-31T11:16:23.890006Z"
    },
    {
      "original": "The 3 Su-57s took off from Akhtubinsk Airbase, Astrakhan Oblast.\nThey are flying over the Sea of Azov right now.",
      "timestamp": "2025-12-31T11:16:23.890010Z"
    },
    {
      "original": "Flight of the glide-bombs, flying towards Vysokopillia and then likely the Zelenodolsk Thermal Power Plant.",
      "timestamp": "2025-12-31T11:16:23.890014Z"
    },
    {
      "original": "The KABs disappeared west of Novovorontsovka, Kherson Oblast.",
      "timestamp": "2025-12-31T11:16:23.890017Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-12-31T11:16:23.890021Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-12-31T11:16:23.890024Z"
    },
    {
      "original": "There is a Zala recon drone near Myrhorod, Poltava Oblast right now",
      "timestamp": "2025-12-31T11:16:23.890027Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-12-31T11:16:23.890030Z"
    },
    {
      "original": "No missiles are detected. \nRecon drones are also detected near Nedryhailiv, Sumy Oblast.",
      "timestamp": "2025-12-31T11:16:23.890034Z"
    },
    {
      "original": "Russian forces have recaptured the village of Andriivka, Khotin direction, Sumy Oblast.\nPre-war population: ~86.\nTotal land area: ~1.05 km².\nThe second battle for Andriivka lasted approximately 30 days.",
      "timestamp": "2025-12-31T11:16:23.890040Z"
    },
    {
      "original": "According to data from the different OVAs in Ukraine, Russia launched a total of 44,782 KAB/FAB glide-bombs at populated areas in 2025.\nHowever, the true total number including strikes on areas directly on the frontline, strikes which were not included in official tallies (which frequently happens), and strikes on areas outside populated areas, is probably closer to 80,000.\nIf you even say 1 Ukrainian soldier was killed on average per strike, those numbers add up very quickly. If you were to say 5 on average, it gets even worse. \nAdditionally, according to statistics from the Ukrainian airforce, Russia launched more than 54,000 Geran-2, Geran-3, and Gerbera drones in 2025.",
      "timestamp": "2025-12-31T11:16:23.890046Z"
    },
    {
      "original": "According to data from the different OVAs in Ukraine, Russia launched a total of 44,782 KAB/FAB glide-bombs at populated areas in 2025.  However, the true total number including strikes on areas directly on the frontline, strikes which were not included in…",
      "timestamp": "2025-12-31T11:16:23.890049Z"
    },
    {
      "original": "The 3 Su-57s are carrying out a training mission in the Sea of Azov.\nThe attached audio is of communications from one of the aircraft.",
      "timestamp": "2025-12-31T11:16:23.890053Z"
    },
    {
      "original": "Happy new year everyone!\nBest of luck to you all for 2026.",
      "timestamp": "2025-12-31T11:16:23.890057Z"
    },
    {
      "original": "Happy new year everyone!  Best of luck to you all for 2026.",
      "timestamp": "2025-12-31T11:16:23.890061Z"
    },
    {
      "original": "YouTube gave me 3 unskippable ads just as the clock was about to hit 12 on a new year's countdown livestream. (The ads were from an Israeli company too).\nVery reflective of the current state of the world \n🤣",
      "timestamp": "2025-12-31T11:16:23.890069Z"
    },
    {
      "original": "Military Situation In Ukraine On December 30, 2025 (Maps Update)",
      "timestamp": "2025-12-31T11:16:24.706107Z"
    },
    {
      "original": "Military Situation In Ukraine On December 30, 2025 (Maps Update)",
      "timestamp": "2025-12-31T11:16:24.706118Z"
    },
    {
      "original": "Russia’s Mi-34M1, Small Helicopter With Big Attack Potentials, Made Maiden Flight (Video)\nRussia’s Mi-34M1 light helicopter, powered by the new domestically produced VK-650V engine, has completed its maiden flight, CEO of Russian Helicopters Holding - part of the Rostec state corporation - Nikolay Kolesov announced on December 30.\nThe helicopter took off under the guidance of Sergey Barkov, a test pilot at the Mil and Kamov National Helicopter Center, a subsidiary of Russian Helicopters.\nNo military version of the Mi-34M1 has been presented yet, and it is unclear if there are even any plans for such a version. However, the specifications of the helicopter, which are comparable to France’s Aérospatiale Gazelle and the United States’s MD 500, makes it very suitable for such a role.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706128Z"
    },
    {
      "original": "Russia’s Mi-34M1, Small Helicopter With Big Attack Potentials, Made Maiden Flight (Video)\nRussia’s Mi-34M1 light helicopter, powered by the new domestically produced VK-650V engine, has completed its maiden flight, CEO of Russian Helicopters Holding - part of the Rostec state corporation - Nikolay Kolesov announced on December 30.\nThe helicopter took off under the guidance of Sergey Barkov, a test pilot at the Mil and Kamov National Helicopter Center, a subsidiary of Russian Helicopters.\nNo military version of the Mi-34M1 has been presented yet, and it is unclear if there are even any plans for such a version. However, the specifications of the helicopter, which are comparable to France’s Aérospatiale Gazelle and the United States’s MD 500, makes it very suitable for such a role.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706137Z"
    },
    {
      "original": "Russian Army Set To Trap Ukrainian Troops In Krasny Liman \nOn December 30, the Russian military advanced to the north of Krasny Liman in Donetsk, in an apparent effort to cut all roads leading to the key city and trap Ukrainian troops there.\nThe Zapad [West] Group of Forces started a fresh attack from its positions between Yarova and Oleksandrivka towards Sosnove. Russian troops managed to reach the settlement, and battles are now reported to be taking place in its outskirts, where Ukrainian defenses mainly consist of a series of checkpoints.\nThe recent operations of the Zapad Group of Forces were not limited to the area around Krasny Liman in Donetsk. The group also advanced to the north, in Kharkiv, and managed to capture Boguslavka, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706146Z"
    },
    {
      "original": "Russian Army Set To Trap Ukrainian Troops In Krasny Liman \nOn December 30, the Russian military advanced to the north of Krasny Liman in Donetsk, in an apparent effort to cut all roads leading to the key city and trap Ukrainian troops there.\nThe Zapad [West] Group of Forces started a fresh attack from its positions between Yarova and Oleksandrivka towards Sosnove. Russian troops managed to reach the settlement, and battles are now reported to be taking place in its outskirts, where Ukrainian defenses mainly consist of a series of checkpoints.\nThe recent operations of the Zapad Group of Forces were not limited to the area around Krasny Liman in Donetsk. The group also advanced to the north, in Kharkiv, and managed to capture Boguslavka, according to the Russian Ministry of Defense.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706154Z"
    },
    {
      "original": "Military Situation In Syria On December 30, 2025 (Map Update)",
      "timestamp": "2025-12-31T11:16:24.706158Z"
    },
    {
      "original": "Ukraine's \"War Party\" Provocation Targets Putin, Tests U.S.-Russia Rapprochement\nThe \"war party\" is trying to disrupt the negotiations. Kiev carried out a new, high-profile provocation directed against Russian President Vladimir Putin personally. The U.S. reaction to the incident was unexpected.\nOn the night of the 29th, the Kyiv regime launched a large-scale drone attack on the Russian president's primary residence in Valdai, Novgorod Oblast. A total of at least 23 unmanned aerial vehicles were involved. The Russian army's air defense systems destroyed all targets, preventing them from hitting important state facilities. This attack occurred shortly after a telephone conversation between Putin and Trump, during which they discussed the results of negotiations between Trump and Ukrainian President Volodymyr Zelensky.\nAnother round of peace talks between Donald Trump and Volodymyr Zelensky took place on December 29 at the Mar-a-Lago residence in Florida. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706168Z"
    },
    {
      "original": "Ukraine's \"War Party\" Provocation Targets Putin, Tests U.S.-Russia Rapprochement\nThe \"war party\" is trying to disrupt the negotiations. Kiev carried out a new, high-profile provocation directed against Russian President Vladimir Putin personally. The U.S. reaction to the incident was unexpected.\nOn the night of the 29th, the Kyiv regime launched a large-scale drone attack on the Russian president's primary residence in Valdai, Novgorod Oblast. A total of at least 23 unmanned aerial vehicles were involved. The Russian army's air defense systems destroyed all targets, preventing them from hitting important state facilities. This attack occurred shortly after a telephone conversation between Putin and Trump, during which they discussed the results of negotiations between Trump and Ukrainian President Volodymyr Zelensky.\nAnother round of peace talks between Donald Trump and Volodymyr Zelensky took place on December 29 at the Mar-a-Lago residence in Florida. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706178Z"
    },
    {
      "original": "UAE Announces Withdrawal From Yemen, But Saudi Arabia Keeps Pressure On\nThe United Arab Emirates announced on December 30 afternoon that it will end its military presence in Yemen. The announcement came just a few hours after Saudi Arabia launched strikes against allies of Abu Dhabi and called for an Emirate withdrawal from the country within 24 hours.\n“The Ministry of Defense affirms that the UAE has participated as part of the Arab Coalition since 2015 in support of legitimacy in Yemen, in backing international efforts to combat terrorist organizations, and in pursuit of security and stability for the brotherly Yemeni people,” the UAE Ministry of Defense said in a statement.\nThe steps taken by the UAE were not apparently satisfactory enough for Saudi Arabia, which responded by calling on Abu Dhabi to stop any military or financial support to its allies in Yemen. \nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706186Z"
    },
    {
      "original": "THE GEOPOLITICAL TIPPING POINT: A REVIEW OF 2025",
      "timestamp": "2025-12-31T11:16:24.706190Z"
    },
    {
      "original": "Ukrainian Collapse In Zaporizhzhia: Russian Advance Near Prymorske Changes the Operational Picture\nIn the Slaviansk sector, Russian units are advancing west of Yarove and have reached Sosnove. They are also fighting on the approaches to Oleksandrivka and Korovyi Yar. In the Kharkiv sector, advances are being recorded on nearly all fronts, including in the Liman forest area, where four strongpoints have been seized and counterattacks repelled.\nThey resumed active operations south of Konstantynivka and in the Andriivka area. In the Zaporizhzhia sector, near Prymorske, units have reached the southern shore of the Malokaterynivka Estuary and are approaching Zaporizhzhia. In Kupyansk, despite both sides claiming success, heavy street fighting continues.\nPolish Prime Minister Donald Tusk stated that the United States has expressed a willingness to consider providing Ukraine with security guarantees after a peace treaty is concluded.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706199Z"
    },
    {
      "original": "Ukrainian Collapse In Zaporizhzhia: Russian Advance Near Prymorske Changes the Operational Picture\nIn the Slaviansk sector, Russian units are advancing west of Yarove and have reached Sosnove. They are also fighting on the approaches to Oleksandrivka and Korovyi Yar. In the Kharkiv sector, advances are being recorded on nearly all fronts, including in the Liman forest area, where four strongpoints have been seized and counterattacks repelled.\nThey resumed active operations south of Konstantynivka and in the Andriivka area. In the Zaporizhzhia sector, near Prymorske, units have reached the southern shore of the Malokaterynivka Estuary and are approaching Zaporizhzhia. In Kupyansk, despite both sides claiming success, heavy street fighting continues.\nPolish Prime Minister Donald Tusk stated that the United States has expressed a willingness to consider providing Ukraine with security guarantees after a peace treaty is concluded.\nRead more \nHERE",
      "timestamp": "2025-12-31T11:16:24.706207Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 30, 2025\nOn December 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-31T11:16:24.706214Z"
    },
    {
      "original": "Drone Strikes: Summary Of Russian Combat Footage From December 30, 2025\nOn December 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-12-31T11:16:24.706221Z"
    }
  ],
  "script_run_time": "2025-12-31T11:16:24.707025Z"
}