{
  "messages": [
    {
      "original": "🛵\n БпЛА на заході Дніпропетровщини, курсом на Полтавщину.",
      "timestamp": "2025-11-04T17:51:23.746425Z"
    },
    {
      "original": "🛵\n БпЛА на сході Сумщини, курсом на Полтавщину.",
      "timestamp": "2025-11-04T17:51:23.746441Z"
    },
    {
      "original": "🛵\n БпЛА на заході Запоріжжя та Дніпропетровщини, курсом на захід.",
      "timestamp": "2025-11-04T17:51:23.746447Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-11-04T17:51:23.746451Z"
    },
    {
      "original": "🚀\nЗагроза застосування авіаційних засобів ураження для Криворізького, Нікопольського районів Дніпропетровщини.",
      "timestamp": "2025-11-04T17:51:23.746456Z"
    },
    {
      "original": "🛵\n БпЛА на заході Полтавщини в районі н.п. Кобиляки, на північно-західний напрямок.\n🛵\n БпЛА на півночі Сумщини, в напрямку Сум.\n🛵\n БпЛА на південь від Запоріжжя, в напрямку обласного центру.",
      "timestamp": "2025-11-04T17:51:23.746465Z"
    },
    {
      "original": "🛵\n БпЛА на сході Харківщини, в напрямку н.п. Савинці.",
      "timestamp": "2025-11-04T17:51:23.746470Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА на півночі від Запоріжжя, курсом на захід.",
      "timestamp": "2025-11-04T17:51:23.746477Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курсом на захід та на Донеччину.",
      "timestamp": "2025-11-04T17:51:23.746482Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курсом на захід та на Донеччину.",
      "timestamp": "2025-11-04T17:51:23.746487Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА \n➡️\n в районі Петропавлівки та Шахтарського.\n🛵\n Донеччина: декілька груп БпЛА \n➡️\n у напрямку Покровського району.",
      "timestamp": "2025-11-04T17:51:23.746496Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на схід Харківщини!",
      "timestamp": "2025-11-04T17:51:23.746503Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-11-04T17:51:23.746507Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-11-04T17:51:23.746512Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-04T17:51:23.746516Z"
    },
    {
      "original": "🛵\n БпЛА в Новгород-Сіверському районі Чернігівщини, курс південний.\n🛵\n БпЛА в Синельниківському районі Дніпропетровщини, курс західний.\n🛵\n БпЛА в Конотопському та Сумському районах, курс південний.\n🚀\nПовторні пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-11-04T17:51:23.746526Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-11-04T17:51:23.746530Z"
    },
    {
      "original": "🛵\n БпЛА в Роменському та Сумському районах, курс західний.\n🛵\n БпЛА в Корюківському районі Чернігівщини, курс південно-західний.\n🛬\n Активність ворожої тактичної авіації  на південно-східному напрямку!",
      "timestamp": "2025-11-04T17:51:23.746540Z"
    },
    {
      "original": "🛵\n На півночі Сумщини ворожий БпЛА, курсом на н.п. Миколаївка.\n🛵\n БпЛА на Чернігівщині, поблизу н.п.Корюківка, курсом на південь.",
      "timestamp": "2025-11-04T17:51:23.746546Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, основним курсом на захід.",
      "timestamp": "2025-11-04T17:51:23.746551Z"
    },
    {
      "original": "🛵\n На Харківщині ударні безпілотники в районі н.п.Золочів та Мерафа, курсом на південь.",
      "timestamp": "2025-11-04T17:51:23.746557Z"
    },
    {
      "original": "🛵\n На півночі Сумщини БпЛА в напрямку обласного центру.",
      "timestamp": "2025-11-04T17:51:23.746561Z"
    },
    {
      "original": "This morning, at least two Ukrainian UAVs struck the Sterlitamak Petrochemical Plant in the Republic of Bashkortostan, Russia. A fire is now seen burning at the plant's water treatment workshop, one of which has partially collapsed. \nCoordinates: 53.63798, 55.95034",
      "timestamp": "2025-11-04T17:51:24.410499Z"
    },
    {
      "original": "This morning, at least two Ukrainian UAVs struck the Sterlitamak Petrochemical Plant in the Republic of Bashkortostan, Russia. A fire is now seen burning at the plant's water treatment workshop, one of which has partially collapsed. \nCoordinates: 53.63798, 55.95034",
      "timestamp": "2025-11-04T17:51:24.410508Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Ktsovo Oil Refinery in Nizhny Novgorod Oblast. A large fire is now burning there, which also threatens the neighbouring SIBUR-Kstovo petrochemical plant.\nCoordinates: 56.10583, 44.14388",
      "timestamp": "2025-11-04T17:51:24.410513Z"
    },
    {
      "original": "Last night, Ukrainian UAVs attacked the Ktsovo Oil Refinery in Nizhny Novgorod Oblast. A large fire is now burning there, which also threatens the neighbouring SIBUR-Kstovo petrochemical plant.\nCoordinates: 56.10583, 44.14388",
      "timestamp": "2025-11-04T17:51:24.410518Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published footage of last night's FP-2 drone strikes on targets in Luhansk Oblast.\n1 drone struck a fuel and lubricants unloading site near the city of Dovzhansk (48.11294, 39.60513). Secondary detonations of ammunition was also seen afterwards [Media 2].\n1 drone struck a reported supply warehouse in the village of Rozkishne, just south of Luhansk City (48.49514, 39.26693).",
      "timestamp": "2025-11-04T17:51:24.410523Z"
    },
    {
      "original": "The Ukrainian Special Operations Forces published footage of last night's FP-2 drone strikes on targets in Luhansk Oblast.\n1 drone struck a fuel and lubricants unloading site near the city of Dovzhansk (48.11294, 39.60513). Secondary detonations of ammunition was also seen afterwards [Media 2].\n1 drone struck a reported supply warehouse in the village of Rozkishne, just south of Luhansk City (48.49514, 39.26693).",
      "timestamp": "2025-11-04T17:51:24.410530Z"
    },
    {
      "original": "Overnight, Ukrainian UAVs attacked the 550 kV Frolovskaya electrical substation near the city of Frolovo, Volgograd Oblast. \nCoordinates: 49.78431, 43.71596",
      "timestamp": "2025-11-04T17:51:24.410534Z"
    },
    {
      "original": "Overnight, Ukrainian UAVs attacked the 550 kV Frolovskaya electrical substation near the city of Frolovo, Volgograd Oblast. \nCoordinates: 49.78431, 43.71596",
      "timestamp": "2025-11-04T17:51:24.410538Z"
    },
    {
      "original": "Yesterday evening, Ukraine carried out a combined strike on the 110 kV electrical substation in the city of Rylsk, Kursk Oblast. \nBoth UAVs and HIMARS GMLRS were used in the attack, resulting in a fire breaking out. As a result, city-wide power outages were reported in Rylsk, with additional outages in the surrounding settlements. \nCoordinates: 51.56506, 34.66293",
      "timestamp": "2025-11-04T17:51:24.410544Z"
    },
    {
      "original": "Yesterday evening, Ukraine carried out a combined strike on the 110 kV electrical substation in the city of Rylsk, Kursk Oblast. \nBoth UAVs and HIMARS GMLRS were used in the attack, resulting in a fire breaking out. As a result, city-wide power outages were reported in Rylsk, with additional outages in the surrounding settlements. \nCoordinates: 51.56506, 34.66293",
      "timestamp": "2025-11-04T17:51:24.410549Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-04T17:51:24.410555Z"
    },
    {
      "original": "Overnight, a large-scale Russian Geran-2 drone attack was carried out on southern Odesa Oblast, involving at least 24 drones. \nAt least 12 drones attacked two targets in the city of Izmail. One target was the city's 110 kV electrical substation, and the other was the port on the Danube River. Large fires are burning at both impact sites, as evidenced by NASA FIRMS data.\nNASA FIRMS also shows a fire burning in the forests opposite the Izmail port on the Romanian side of the border. This is likely from downed debris of a drone targeted the port. \nAdditionally, around 12 Geran-2 drones struck an unknown target in/near the village of Dunaiske, just southeast of Izmail.",
      "timestamp": "2025-11-04T17:51:24.410560Z"
    },
    {
      "original": "The Ukrainian GUR published footage of new FPV drone strikes on valuable Russian targets in Crimea. \nThe drones targeted:\nA command post of a Russian S-400 air defence system in a combat position.\nA 92N6E multifunctional radar + the autonomous power supply for the S-400 command post. \nAn AORL-1AS airfield surveillance radar.\nP-18 “Terek” general-purpose early warning radar.",
      "timestamp": "2025-11-04T17:51:24.410568Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-04T17:51:24.410572Z"
    },
    {
      "original": "Last night, Russia attacked the town of Rohan, Kharkiv Oblast. At least five explosions were recorded, with the explosions being heard from neighbouring Kharkiv City (as seen in media 1).",
      "timestamp": "2025-11-04T17:51:24.410575Z"
    },
    {
      "original": "There is an increased threat of a large-scale, combined Russian missile attack on Ukraine in the next 5 days, not including Kh-101 cruise missiles launched from strategic aviation.\nThe attack would involve Iskander-M ballistic missiles, Iskander-K cruise missiles, and hundreds of Geran-2 drones. The highest threat is to Kyiv, Poltava, Zaporizhzhia and Dnipropetrovsk Oblasts, especially for gas and energy infrastructure. \nAs of now, nothing is certain, but there have been actions noted that suggest preparations for a large attack.",
      "timestamp": "2025-11-04T17:51:24.410580Z"
    },
    {
      "original": "Once this war is over, I think a lot of people are going to consider the fall of Pokrovsk as the \"turning point\" for why Russia won. \nThis is not the case. The fall of Pokrovsk will be just one thing in a chain of events that trend towards collapse for Ukraine, and there is still much more to come. Attritional warfare prioritises degrading your enemy's ability to fight, and the territory you gain in the meantime is - for the most part - a biproduct of successful attrition. \nThere wasn't really a turning point for this war, as Russia is the larger country, with superior capabilities, and the ability to keep up the fight far longer than Ukraine, meaning they are destined to win unless something drastic and revolutionary happens. There are many reasons for this, of which I have outlined in the past. \nPokrovsk is just the \"new Bakhmut\" - the city that the media focuses on. You could even consider it Zelensky's PR city. I don't think Pokrovsk will be forgotten like the 2023 Zaporizhzhia counteroffensive, or the 2024-2025 Kursk offensive, however, as it will probably be labelled as the turning point further down the line.",
      "timestamp": "2025-11-04T17:51:24.410586Z"
    },
    {
      "original": "Currently, there are 40 Tu-95MS strategic bombers stationed at Ukrainka Airbase, Amur Oblast. \n30 Tu-95MS are not used and have remained stationary for a long time.\n1 Tu-95MS is there purely for training purposes. \n7 Tu-95MS redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, and will be equipped with Kh-101 cruise missiles.\n2 Tu-95MS redeployed from Diaghilev Airbase, Ryazan Oblast, to Ukrainka Airbase, and will also be equipped with missiles.\nThe most interesting news is that 4 Tu-160s were previously stationed there, 1 of which was used for training purposes. On October 1, maintenance of 3 Tu-160s used for combat missions was carried out. \nSince then, 1 IL-76MD cargo plane landed there, carrying Kh-101 missiles, which were equipped to the 3 Tu-160s. The 3 Tu-160s equipped with missiles redeployed back to Engels-2 overnight and have since landed there.",
      "timestamp": "2025-11-04T17:51:24.410593Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-04T17:51:24.410599Z"
    },
    {
      "original": "High-resolution satellite imagery of Engels-2 Airbase, Saratov Oblast, reveals that 9 new parking areas have been completed.\nThese will house Russian Su-34 and Su-35 tactical aircraft, which take part in launches of KAB glide-bombs at frontline areas. These new parking areas are being constructed due to increased production of Su-34 and Su-35s. \nImage credit",
      "timestamp": "2025-11-04T17:51:24.410604Z"
    },
    {
      "original": "Update from the Pokrovsk direction:\nThe battle for Pokrovsk is approaching its end as the parts of the city begin to come under Russian control.\nIn the northern part of the city, Russian forces established control over new positions in the northernmost residential neighbourhoods, fully establishing themselves along the southern bank of the Hrishynka River. Additionally, they advanced from the area of School no. 14 and the northwestern industrial zone, to the remaining residential streets not yet under Russian control, capturing new positions towards the northern outskirts.\nIn the northeastern part of Pokrovsk, Russian forces consolidated in the southern part of the high-rise district and operationally encircled the remaining Ukrainian formations in the district. To the southeast, they made additional progress in the low-rise residential areas towards the eastern outskirts of the city, establishing control over most of the rest of the buildings there.\nThe most important news comes from the bottleneck of the Myrnohrad pocket. After entering the high-rise district and compromising it as a blocking position against attempts to physically cut off Myrnohrad, Russian forces advanced beyond northeastern Pokrovsk, past the cemetery, and to the highway, where they entrenched in the windbreaks. From there, they entered and captured the soft drinks factory and infiltrated into the northwestern part of Rivne.\nOn the northern end of the bottleneck, the Russians advanced from their positions near the pig farm and reached the high-rise intersection, establishing full control over it and the surrounding positions. They then went on to advance west down the road, where they have reached the next pig farm complex.\nCurrently, there is a ~1.3 km corridor of open fields and a small, disconnected residential area consisting of two short streets connecting the Myrnohrad pocket with the rest of the front. This area is entirely in the grey zone, and movement in and out of the pocket is now practically impossible. The vast majority of formations still in the pocket will either be killed or captured. \nMeanwhile, north of Pokrovsk, Russian forces began counterattacking against the Ukrainian infiltrations in northern Rodynske. They were able to quickly retake the northern low-rise residential area, and begin assaults on the Ukrainian soldiers entrenched in the three-story buildings. Extremely fierce fighting is ongoing here, with both sides making use of extensive fire power. Some Ukrainian soldiers have been encircled, while others still reside in the grey zone. \n+ ~4.57 in favour of Russia.",
      "timestamp": "2025-11-04T17:51:24.410613Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021773Z"
    },
    {
      "original": "Review of Russian-Ukrainian Strikes: Ukrainian Marines Killed During Awards Ceremony and Drone Attacks on Crimean Air Defenses\nRussia\n and Ukraine continued intense mutual strikes in early November. Russian air defences claimed to have destroyed 64 Ukrainian UAVs overnight, while Ukraine reported intercepting one 'Kinzhal' missile and 115 attack drones out of 145 incoming threats.\nOne notable incident was a Russian missile strike on November 1st, against a formation of the 35th Marine Brigade of the Ukrainian Armed Forces in the Dnipropetrovsk region. Reports indicate the strike hit a parade ground during an awards ceremony for military personnel, resulting in significant casualties.\nUkrainian journalist Dmytro Sviatnenko confirmed the incident and reported that his brother was among those killed.\n\"They assembled the best. The best pilots and infantrymen of the brigade. By direct order. In an open area. Ballistics arrived. The story of negligence has repeated itself,\" stated Sviatnenko.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021789Z"
    },
    {
      "original": "Air Defenses Hit: Summary Of Russian Combat Footage From November 3, 2025 \nOn November 3, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-04T17:51:25.021797Z"
    },
    {
      "original": "Air Defenses Hit: Summary Of Russian Combat Footage From November 3, 2025 \nOn November 3, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-04T17:51:25.021804Z"
    },
    {
      "original": "U.S. Threatens Iraq Following Israeli Reports Claiming Iran Is Planning Large Attack From There\nIraq received a direct threat from the United States following Hebrew media reports accusing Iran of planning a large-scale attack on Israel in cooperation with Shiite armed factions, in what appears to be an attempt to fabricate a casus belli for an operation in the country.\nThese claims started from Walla. The Hebrew news outlet reported on October 31 that the Israeli Defense Forces (IDF) and the Mossad spy agency are preparing for a “developing threat” against Israel from pro-Iranian factions in Iraq.\nFollowing the release of Walla’s report, Iraqi Defence Minister Thabet al-Abbasi disclosed that U.S. Secretary of War Pete Hegseth directly warned the country of imminent military operations in the region, urging it to restrain pro-Iranian factions operating within its borders.\nRead more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021812Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – November 4, 2025",
      "timestamp": "2025-11-04T17:51:25.021816Z"
    },
    {
      "original": "Ukraine’s Desperation On Full Display As Russian Army Tightens Grip On Pokrovsk (Videos)\nOn November 4, the Russian military tightened its grip on Pokrovsk in Donetsk, expanding its control within the key city and repelling multiple counterattacks. Meanwhile, Ukraine’s attempts to distort the reality of the situation in the city got more and more desperate.\nThe Tsentr [Center] Group of Forces made additional gains in the northern and eastern parts of Pokrovsk, according to the Russian Ministry of Defense, which noted that the the 2nd and 51st armies are currently leading offensive operations in the city.\nThe ministry also said that a total of ten attempts by Kiev forces to “escape the encirclement” in Pokrovsk were foiled by the Tsentr Group of Forces to the north and northwest of the city. \nOne of the attempts foiled by the Tsentr Group Of Forces to the northwest of Pokrovsk involved a helicopter landing by special forces. The attempt was likely carried out by the Ukrainian intelligence.\nRead more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021826Z"
    },
    {
      "original": "Ukraine’s Desperation On Full Display As Russian Army Tightens Grip On Pokrovsk (Videos)\nOn November 4, the Russian military tightened its grip on Pokrovsk in Donetsk, expanding its control within the key city and repelling multiple counterattacks. Meanwhile, Ukraine’s attempts to distort the reality of the situation in the city got more and more desperate.\nThe Tsentr [Center] Group of Forces made additional gains in the northern and eastern parts of Pokrovsk, according to the Russian Ministry of Defense, which noted that the the 2nd and 51st armies are currently leading offensive operations in the city.\nThe ministry also said that a total of ten attempts by Kiev forces to “escape the encirclement” in Pokrovsk were foiled by the Tsentr Group of Forces to the north and northwest of the city. \nOne of the attempts foiled by the Tsentr Group Of Forces to the northwest of Pokrovsk involved a helicopter landing by special forces. The attempt was likely carried out by the Ukrainian intelligence.\nRead more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021835Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 4, 2025 (Map Update)",
      "timestamp": "2025-11-04T17:51:25.021839Z"
    },
    {
      "original": "Russian Army Advances In Kupyansk, Kiev Forces Murder Fleeing Civilians (18+ Videos)\nOn November 4, the Russian military expanded its control in the city of Kupyansk and nearby areas in Kharkiv, all while repelling multiple Ukrainian counterattacks.\nThe Zapad [West] Group of Forces repelled multiple counterattacks right to the north and west of Kupyansk, specifically close to Radkovka, Moskovka, and Sobolevka. \nIn the city itself, Russian troops made additional gains in the area of the Central Market towards the Yubileyny neighborhood. Remaining Ukrainian troops in the southern and eastern parts of the city are facing some serious logistical problems.\nInstead of ordering an organized withdrawal to save the lives of its troops and prevent a complete collapse, Kiev is, as usual, forcing its troops to fight there to the end. Ukrainian blocking detachments and drone units are targeting anyone attempting to flee Kupyansk, not just soldiers, but also civilians.\nRead more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021848Z"
    },
    {
      "original": "Russian Army Advances In Kupyansk, Kiev Forces Murder Fleeing Civilians (18+ Videos)\nOn November 4, the Russian military expanded its control in the city of Kupyansk and nearby areas in Kharkiv, all while repelling multiple Ukrainian counterattacks.\nThe Zapad [West] Group of Forces repelled multiple counterattacks right to the north and west of Kupyansk, specifically close to Radkovka, Moskovka, and Sobolevka. \nIn the city itself, Russian troops made additional gains in the area of the Central Market towards the Yubileyny neighborhood. Remaining Ukrainian troops in the southern and eastern parts of the city are facing some serious logistical problems.\nInstead of ordering an organized withdrawal to save the lives of its troops and prevent a complete collapse, Kiev is, as usual, forcing its troops to fight there to the end. Ukrainian blocking detachments and drone units are targeting anyone attempting to flee Kupyansk, not just soldiers, but also civilians.\nRead more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021861Z"
    },
    {
      "original": "«To Serve And Protect» The Ukrainian Way: Witch Hunts In Frontline Settlements\nDriven by hatred and a sense of impunity, Ukrainian soldiers are turning on their own citizens. They launch unpunished attacks on the very people they swore to protect, carrying out summary executions without trial or investigation.\nSince the beginning of the conflict in Ukraine, Kyiv has faced a serious problem. A significant proportion of the population in eastern and central Ukraine remains neutral, or even loyal, towards Russia. This is despite the intense propaganda promoting the ‘European path’ and inciting hatred towards Russians, which has been ongoing since 2014. Numerous civilians have chosen to stay in their homes, waiting for the Russian army to arrive. They have ignored the Ukrainian government’s evacuation orders.\nConsequently, Kyiv has established an unspoken rule that anyone who refuses to leave frontline areas is an accomplice of Moscow, regardless of gender or age.  \n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021871Z"
    },
    {
      "original": "«To Serve And Protect» The Ukrainian Way: Witch Hunts In Frontline Settlements\nDriven by hatred and a sense of impunity, Ukrainian soldiers are turning on their own citizens. They launch unpunished attacks on the very people they swore to protect, carrying out summary executions without trial or investigation.\nSince the beginning of the conflict in Ukraine, Kyiv has faced a serious problem. A significant proportion of the population in eastern and central Ukraine remains neutral, or even loyal, towards Russia. This is despite the intense propaganda promoting the ‘European path’ and inciting hatred towards Russians, which has been ongoing since 2014. Numerous civilians have chosen to stay in their homes, waiting for the Russian army to arrive. They have ignored the Ukrainian government’s evacuation orders.\nConsequently, Kyiv has established an unspoken rule that anyone who refuses to leave frontline areas is an accomplice of Moscow, regardless of gender or age.  \n👉\n Read more \nHERE",
      "timestamp": "2025-11-04T17:51:25.021881Z"
    }
  ],
  "script_run_time": "2025-11-04T17:51:25.022290Z"
}