{
  "messages": [
    {
      "original": "🚀\n Пуски КАБ на Сумщину.",
      "timestamp": "2025-12-28T01:51:17.840709Z"
    },
    {
      "original": "🛵\n БпЛА \n➡️\n у напрямку Києва з півдня.",
      "timestamp": "2025-12-28T01:51:17.840729Z"
    },
    {
      "original": "Полтавщина: БпЛА \n➡️\n у напрямку Ромодану.",
      "timestamp": "2025-12-28T01:51:17.840735Z"
    },
    {
      "original": "🛵\n🛸\nВорожий БпЛА на Дніпропетровщині поблизу Павлограда рухається на південь.",
      "timestamp": "2025-12-28T01:51:17.840741Z"
    },
    {
      "original": "🛵\n БпЛА над Кам'янським водосховищем рухається у напрямку Кременчука.",
      "timestamp": "2025-12-28T01:51:17.840746Z"
    },
    {
      "original": "🛵\n БпЛА південніше Кременчука рухається на захід на Кіровоградщину.",
      "timestamp": "2025-12-28T01:51:17.840750Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-12-28T01:51:17.840754Z"
    },
    {
      "original": "🛵\n Дніпропетровщина: БпЛА на/повз Петропавлівку курсом на захід.",
      "timestamp": "2025-12-28T01:51:17.840759Z"
    },
    {
      "original": "🛵\n БпЛА з Донеччини на Дніпропетровщину.",
      "timestamp": "2025-12-28T01:51:17.840763Z"
    },
    {
      "original": "🛵\n БпЛА на південному сході Полтавщини, курс північно-західний (Полтава).",
      "timestamp": "2025-12-28T01:51:17.840768Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2025-12-28T01:51:17.840772Z"
    },
    {
      "original": "🛵\n Одеса - перебувайте в укриттях!",
      "timestamp": "2025-12-28T01:51:17.840777Z"
    },
    {
      "original": "🛵\n БпЛА з акваторії Чорного моря курсом на Одесу.",
      "timestamp": "2025-12-28T01:51:17.840781Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на сході! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-12-28T01:51:17.840787Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-28T01:51:17.840791Z"
    },
    {
      "original": "🛵\n Одещина: БпЛА на Вилкове з акваторії.",
      "timestamp": "2025-12-28T01:51:17.840799Z"
    },
    {
      "original": "Ворожий БпЛА у напрямку Миргорода з півночі.",
      "timestamp": "2025-12-28T01:51:17.840802Z"
    },
    {
      "original": "🛵\n БпЛА у напрямку Миргорода зі сходу.",
      "timestamp": "2025-12-28T01:51:17.840807Z"
    },
    {
      "original": "🛵\n БпЛА на Миргород з північного сходу.",
      "timestamp": "2025-12-28T01:51:17.840811Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград з півдня.",
      "timestamp": "2025-12-28T01:51:17.840815Z"
    },
    {
      "original": "As a result of the recent Russian combined missile and drone attack, around 600,000 consumers in Kyiv Oblast are currently without power. Work is underway to restore power supply.",
      "timestamp": "2025-12-28T01:51:18.697443Z"
    },
    {
      "original": "A large fire is burning at an enterprise in Bila Tserkva, Kyiv Oblast, following Russian Geran-2 drone strikes.",
      "timestamp": "2025-12-28T01:51:18.697455Z"
    },
    {
      "original": "A large fire is burning at an enterprise in Bila Tserkva, Kyiv Oblast, following Russian Geran-2 drone strikes.",
      "timestamp": "2025-12-28T01:51:18.697459Z"
    },
    {
      "original": "Extremely close call from a Geran-2 drone in Kyiv.",
      "timestamp": "2025-12-28T01:51:18.697462Z"
    },
    {
      "original": "Myrne, Polohy direction. Another interesting correction.\nUkrainian forces control Myrne: Barbed wire placement is observed from early October to mid-November in the white circles of photo #1.\nThis cannot be placement by the Russian side because:\n1. The wire has been placed in a half arch pointing south and is itself located south of Myrne\n2. Russian forces basically never place barbed wire in long lines and at most surround their individual dugout or trench. The only place where this has been found is in their Surovikin line, a case that definitely doesn't apply here.\nThe frontline drawn is extremely approximate and will be subject to changes in the future if more information becomes available.\nThis also lines up with this post: \nhttps://t.me/ShalinW/6872",
      "timestamp": "2025-12-28T01:51:18.697471Z"
    },
    {
      "original": "Myrne, Polohy direction. Another interesting correction.\nUkrainian forces control Myrne: Barbed wire placement is observed from early October to mid-November in the white circles of photo #1.\nThis cannot be placement by the Russian side because:\n1. The wire has been placed in a half arch pointing south and is itself located south of Myrne\n2. Russian forces basically never place barbed wire in long lines and at most surround their individual dugout or trench. The only place where this has been found is in their Surovikin line, a case that definitely doesn't apply here.\nThe frontline drawn is extremely approximate and will be subject to changes in the future if more information becomes available.\nThis also lines up with this post: \nhttps://t.me/ShalinW/6872",
      "timestamp": "2025-12-28T01:51:18.697479Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to advance and have made significant progress in three different areas over the last 10 days.\nIn the northeast, Ukrainian forces completed their withdrawal from the salient encompassing the 2023 fortifications northeast of Zaliznyanske, allowing for the Russians to consolidate in the strongpoints there. From there, they began pushing further northwest to the next forest over, while assault groups on the flanks improved their positions in the treelines.\nTo the west, Russian forces continued attacking northwest from the area of Orikhovo-Vasylivka, capturing numerous treeline positions and entrenching in the first houses on southern Minkivka. With support from assault groups clearing the treelines to the south, Russian forces continued pushing west and northwest from their foothold, clearing additional positions and entering the central and southwestern parts of the village. \nAdditionally, the Russians established control over the treelines southeast and east of Minkivka and began a push up the E-40 Highway in the direction of Pryvillya, which Russian DRGs have already entered. They also managed to clear the rest of the fortified forest along the highway and consolidated in the remaining positions to the southeast. \nIn the southwest, Russian forces infiltrated the village of Novomarkove from their positions northwest of the village along the southern bank of the Siverskyi-Donets Canal. Other forces then entered its southern houses, allowing for it to be brought under full Russian control. They also improved their positions in the treelines to the south. \n+ ~16.27 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T01:51:18.697488Z"
    },
    {
      "original": "The Russian MOD has now resorted to Ukraine-like informational tactics regarding Kupyansk. \n\"Continuing to destroy small groups, hiding in the holes\"\n\"The city is under our control\"\n\"Clearing of basement premises\"\nSound familiar?\nThese must be some titan-like troops to be valiently carrying out these operations all while being encircled in multiple pockets. \nThis is yet another example of why you should NEVER consider any official government source as a reliable source when trying to accurately determine the true situation somewhere. \nThe narrative will likely change to \"we withdrew to more advantageous positions across the Oskil River\" in the coming weeks. It's all damage control.",
      "timestamp": "2025-12-28T01:51:18.697496Z"
    },
    {
      "original": "Russian forces now control approximately 83% of Hulyaipole.",
      "timestamp": "2025-12-28T01:51:18.697500Z"
    },
    {
      "original": "Organised Ukrainian resistance has come to an end in Hulyaipole. More than 90% of the city is under Russian control.",
      "timestamp": "2025-12-28T01:51:18.697503Z"
    },
    {
      "original": "In the Rai-Oleksandrivka direction, Russian forces continued to quickly advance west of Siversk and have made significant progress on a wide front.\nIn the southwest, Russian forces began advancing west from the village of Pazeno, capturing new treeline positions and consolidating in the forested gulleys.\nTo the northeast, Russian forces advanced through the treelines on the tactical heights northeast of Pazeno, capturing a series of strongpoints and capturing most of the rest of the nearby forest. Other assault groups pushed north through the treelines and forested areas further east and reached the gulley running southwest from Riznykivka.\nAdditionally, following earlier infiltrations, Russian forces cleared the rest of Kuzmynivka which was abandoned by the Ukrainians due to additional Russian advances through the treelines to the north, outflanking it. From there, in coordination with attacks from Sviato-Pokrovske, the Russians managed to collapse the Ukrainian lines south of Sviato-Pokrovske, fully capturing the tactical heights there and aligning the front with the gulley to the west. \nTo the north, Russian forces consolidated in the eastern houses of Riznykivka. They also continued advancing along the tactical heights north of the Sukha River, consolidating in additional forests and breaking through to the northern part of Riznykivka.\nFurther north, the Russians continued expanding their zone of control in the fields west of Siversk. They secured the rest of the forested gulleys and established control over the surrounding treelines, advancing towards the southern end of the gulley leading south from Zakitne. Other assault groups continued advancing south down the gulley from Zakitne, and cleared the treeline positions to the east.\nTo the northwest, Russian forces cleared the rest of eastern Zakitne and began attacks on the central part of the settlement. They managed to infiltrate the village from the forests to the northeast and entrenched in the central houses. Fighting is ongoing for areas further west.\nIn the northwest, Russian forces continued to incrementally advance in and around Ozerne, clearing most of the rest of the forests north of the village. They also managed to marginally advance in its western houses.\n+ ~43.41 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T01:51:18.697514Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance and have made new progress in three different areas over the last 10 days.\nIn the south, Russian forces continued to advance through the forests north of Dibrova and have captured new positions further northwest. They also improved their positions in the area of the highway and are attempting to advance closer towards the southern outskirts of Lyman.\nTo the north, Russian forces resumed their attacks in the direction of Lyman, capturing a number of positions in forests in the area of the road bridge over the railway line. \nFurther north, Russian forces advanced west from the Pynkiv Yar Gulley, capturing positions in the treelines on the tactical heights. DRGs have since infiltrated further west and reached the northern edge of Lyman.\n+ ~2.54 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T01:51:18.697521Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance as the last Ukrainian defences in Hulyaipole collapse.\nRussian forces continued pushing west from the area of the administrative building and captured the rest of the city centre. This forced the remaining Ukrainian formations to withdraw from the rest of their strongholds in the high-rise buildings, which in turn allowed for the Russians to collapse their lines and capture large parts of the remaining low-rise residential areas.\nSince then, Russian forces have begun attacking the industrial zone on the western edge of Hulyaipole, and have captured most of the rest of the residential streets.\nThis collapse, like all the previous advances, has been caused primarily due to a complete breakdown in coordination between Ukrainian units, and terrible command decisions which has so far led to at least 20 soldiers being encircled (although this number is likely higher). Superior Russian manpower and firepower has resulted in Ukrainian forces suffering heavy casualties while attempting their chaotic withdrawal. \n+ ~2.11 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2025-12-28T01:51:18.697529Z"
    },
    {
      "original": "Over the past couple weeks, several channel owners have reached out to me asking for cross-promotions and advertising. \nI just want to put this out there now: I don't plan on ever cross-promoting or advertising for anyone, or get this channel advertised anywhere. Telegram already puts ads on channels, which is already more than enough. If anything, extra ads just make the viewing experience more disrupted and inconvenient. I also can't guarantee the reliability and ethics of most channels without actually knowing them and following them for some time, so I wouldn't want to promote someone who doesn't provide ethical and fair news. \nSo, if you're a channel owner looking to promote, please don't ask me. I'm more than happy to forward interesting posts from channels, but I don't want to get involved in the advertising space.",
      "timestamp": "2025-12-28T01:51:18.697533Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-28T01:51:18.697537Z"
    },
    {
      "original": "Iskander on Myrhorod, Poltava Oblast",
      "timestamp": "2025-12-28T01:51:18.697540Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-28T01:51:18.697543Z"
    },
    {
      "original": "2 missiles",
      "timestamp": "2025-12-28T01:51:18.697546Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-28T01:51:18.697551Z"
    },
    {
      "original": "Disappeared",
      "timestamp": "2025-12-28T01:51:18.697555Z"
    },
    {
      "original": "Speed seemed similar to that of an S-400 air defence missile, but it was detected late.\nIt disappeared in western Poltava Oblast.",
      "timestamp": "2025-12-28T01:51:18.697558Z"
    },
    {
      "original": "Both Ukrainska Pravda and Deepstate report that the commander of the Ukrainian 54th Mechanised Brigade has been removed from his position due to the fall of Siversk and false reports made from his area.\nAdditionally, the commander of the 10th Separate Mountain Assault Brigade is expected to be removed from his position once he returns from ongoing medical treatment.",
      "timestamp": "2025-12-28T01:51:18.697562Z"
    },
    {
      "original": "Consequences of the Russian missile strikes on the Kyiv Hydroelectric Power Plant this morning. \n~3 Kh-101 cruise missiles impacted it.",
      "timestamp": "2025-12-28T01:51:18.697568Z"
    },
    {
      "original": "Powerline air defence in Kyiv",
      "timestamp": "2025-12-28T01:51:18.697571Z"
    },
    {
      "original": "U.S. To Build ‘Battleship’, China Arms Cargo Ships, And Libya Will Get Fighter Jets From Pakistan \nThe United States unveiled plans to build a new class of massive, heavily-armed battleships named after President Donald Trump. China is testing a containerized missile system designed to arm cargo ships. Libya reached a multi-billion dollar deal with Pakistan to acquire advanced fighter jets. The United Kingdom's Challenger 3 main battle tank program faces another setback.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560165Z"
    },
    {
      "original": "U.S. To Build ‘Battleship’, China Arms Cargo Ships, And Libya Will Get Fighter Jets From Pakistan \nThe United States unveiled plans to build a new class of massive, heavily-armed battleships named after President Donald Trump. China is testing a containerized missile system designed to arm cargo ships. Libya reached a multi-billion dollar deal with Pakistan to acquire advanced fighter jets. The United Kingdom's Challenger 3 main battle tank program faces another setback.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560180Z"
    },
    {
      "original": "Military Situation In Ukraine On December 27, 2025 (Maps Update)",
      "timestamp": "2025-12-28T01:51:19.560185Z"
    },
    {
      "original": "Military Situation In Ukraine On December 27, 2025 (Maps Update)",
      "timestamp": "2025-12-28T01:51:19.560192Z"
    },
    {
      "original": "Russia Captures Huliaipole And Myrnohrad, Dealing Double Blow To Ukraine (Videos)\nOn December 27, Russian President Vladimir Putin was informed during a high-level meeting that the Russian military had captured Myrnohrad in Donetsk and Huliaipole in Zaporozhye. The loss of these two key cities before the end of the year represents a double blow to Ukraine.\n“The Supreme Commander-in-Chief received a report by Chief of the General Staff of Russia's Armed Forces Valery Gerasimov,” the Russian Ministry of Defense said in a statement.\n“In addition, the commanders of the Tsentr [Centre] and Vosotok [East] forces, as well as unit commanders reported on the progress of their missions, announcing in particular the liberation of the towns of Dimitrov, Donetsk People's Republic and Gulyaipole, Zaporozhye Region,” it added, referring to the two cities by their Russian names.\nThe capture of both Myrnohrad and Huliaipole was confirmed via videos released by the Russian MoD and other media sources.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560202Z"
    },
    {
      "original": "Russia Captures Huliaipole And Myrnohrad, Dealing Double Blow To Ukraine (Videos)\nOn December 27, Russian President Vladimir Putin was informed during a high-level meeting that the Russian military had captured Myrnohrad in Donetsk and Huliaipole in Zaporozhye. The loss of these two key cities before the end of the year represents a double blow to Ukraine.\n“The Supreme Commander-in-Chief received a report by Chief of the General Staff of Russia's Armed Forces Valery Gerasimov,” the Russian Ministry of Defense said in a statement.\n“In addition, the commanders of the Tsentr [Centre] and Vosotok [East] forces, as well as unit commanders reported on the progress of their missions, announcing in particular the liberation of the towns of Dimitrov, Donetsk People's Republic and Gulyaipole, Zaporozhye Region,” it added, referring to the two cities by their Russian names.\nThe capture of both Myrnohrad and Huliaipole was confirmed via videos released by the Russian MoD and other media sources.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560211Z"
    },
    {
      "original": "Kyiv Plunged Into Darkness: Russia Launches New Massive Strike On Ukrainian Capital's Energy Infrastructure\nOn the night of December 27, the Russian armed forces launched a new large-scale combined strike on targets in Ukraine. This occurred just four days after the previous massive attack. According to the Ukrainian Air Force, the attack involved up to 550 units, including cruise missiles, ballistic missiles, and unmanned aerial vehicles.\nThe primary target of the strike was Kyiv and its energy system. It is reported that the Russian strikes targeted:\n▪️\nDarnytska Power Substation (CHPP-4).\n▪️\nKyivska (CHPP-5) and CHPP-6 thermal power plants.\n▪️\nKyiv Hydroelectric Pumped Storage Power Plant in Vyshhorod.\n▪️\nBrovarska Power Substation in the city of Brovary.\n▪️\nTrypilska Thermal Power Plant in the town of Tripillya, the most powerful power station in the region.\n▪️\nKyiv Hydroelectric Power Station, located north of the capital.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560229Z"
    },
    {
      "original": "Kyiv Plunged Into Darkness: Russia Launches New Massive Strike On Ukrainian Capital's Energy Infrastructure\nOn the night of December 27, the Russian armed forces launched a new large-scale combined strike on targets in Ukraine. This occurred just four days after the previous massive attack. According to the Ukrainian Air Force, the attack involved up to 550 units, including cruise missiles, ballistic missiles, and unmanned aerial vehicles.\nThe primary target of the strike was Kyiv and its energy system. It is reported that the Russian strikes targeted:\n▪️\nDarnytska Power Substation (CHPP-4).\n▪️\nKyivska (CHPP-5) and CHPP-6 thermal power plants.\n▪️\nKyiv Hydroelectric Pumped Storage Power Plant in Vyshhorod.\n▪️\nBrovarska Power Substation in the city of Brovary.\n▪️\nTrypilska Thermal Power Plant in the town of Tripillya, the most powerful power station in the region.\n▪️\nKyiv Hydroelectric Power Station, located north of the capital.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560244Z"
    },
    {
      "original": "Kupyansk In Focus: Fierce Street Fighting As Russia And Ukraine Battle For Control Over The City \nIn the Kupyansk sector, intense fighting continues. Russian units have repelled several attacks on the approaches to the city. The situation remains very difficult, however, as the Ukrainian command is using most of its resources and reserves to drive out Russian troops. After losing several key cities over the past couple of months, the Ukrainian government needs at least one victory to justify the money invested by the European Union in Ukraine. \nMeanwhile, Florian Philippot, the leader of the \"Patriots\" party, directly accused retired General Jean-Paul Paloméros, former military advisor to President Macron, of inciting war with Russia.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560252Z"
    },
    {
      "original": "Kupyansk In Focus: Fierce Street Fighting As Russia And Ukraine Battle For Control Over The City \nIn the Kupyansk sector, intense fighting continues. Russian units have repelled several attacks on the approaches to the city. The situation remains very difficult, however, as the Ukrainian command is using most of its resources and reserves to drive out Russian troops. After losing several key cities over the past couple of months, the Ukrainian government needs at least one victory to justify the money invested by the European Union in Ukraine. \nMeanwhile, Florian Philippot, the leader of the \"Patriots\" party, directly accused retired General Jean-Paul Paloméros, former military advisor to President Macron, of inciting war with Russia.\nRead more \nHERE",
      "timestamp": "2025-12-28T01:51:19.560260Z"
    }
  ],
  "script_run_time": "2025-12-28T01:51:19.561077Z"
}