{
  "messages": [
    {
      "original": "🛵\n Сумщина - БпЛА в напрямку міста.",
      "timestamp": "2025-10-31T09:49:59.484475Z"
    },
    {
      "original": "🚀\n КАБ на Дніпро",
      "timestamp": "2025-10-31T09:49:59.484492Z"
    },
    {
      "original": "🛵\n Група БпЛА на Миколаївщині, курсом на Одещину.",
      "timestamp": "2025-10-31T09:49:59.484497Z"
    },
    {
      "original": "⚠\n Увага! \n☄️\n Загроза застосування балістичного озброєння з південно-східного напрямку.",
      "timestamp": "2025-10-31T09:49:59.484504Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-10-31T09:49:59.484508Z"
    },
    {
      "original": "🛵\n Нова група БпЛА на півночі Харківщини, курс південний.",
      "timestamp": "2025-10-31T09:49:59.484512Z"
    },
    {
      "original": "🛵\n БпЛА на Донеччині, курсом на Харківщину.\n🛵\n БпЛА на Харківщині, південним курсом.",
      "timestamp": "2025-10-31T09:49:59.484518Z"
    },
    {
      "original": "🛵\n Група БпЛА на Запоріжжі, курс північний.",
      "timestamp": "2025-10-31T09:49:59.484522Z"
    },
    {
      "original": "🚀\n КАБ на Сумщину",
      "timestamp": "2025-10-31T09:49:59.484526Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині, курс південний.\n🛵\n Група БпЛА на Харківщині, курс південний, південно-західний.",
      "timestamp": "2025-10-31T09:49:59.484532Z"
    },
    {
      "original": "🛵\n Група БпЛА на Харківщині, продовжують рух на південь.\n🛵\n Група БпЛА на Дніпропетровщині, курс на південь, північний схід.",
      "timestamp": "2025-10-31T09:49:59.484540Z"
    },
    {
      "original": "🚀\n КАБ на Запоріжжі",
      "timestamp": "2025-10-31T09:49:59.484545Z"
    },
    {
      "original": "🚀\n КАБи на Сумщину!",
      "timestamp": "2025-10-31T09:49:59.484549Z"
    },
    {
      "original": "🚀\n КАБи на схід Дніпропетровщини!",
      "timestamp": "2025-10-31T09:49:59.484553Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 108 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 31 жовтня (з 19:00 30 жовтня) противник атакував 1 балістичною ракетою Іскандер-М  із Ростовської обл., 145-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Курськ, Орел, Приморсько-Ахтарськ – рф, Чауда, Гвардійське – ТОТ АР Крим, близько 90 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09:00, протиповітряною обороною збито/подавлено 1 балістичну ракету та 107 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на півночі, півдні та сході країни.\nЗафіксовано влучання 36 ударних БпЛА на 20 локаціях. \nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги",
      "timestamp": "2025-10-31T09:49:59.484572Z"
    },
    {
      "original": "🛵\n  БпЛА на півночі Сумщині та Чернігівщини, на південно-східний напрямок.\n🛵\n  БпЛА на сході Дніпропетровщини, курс на Донеччину.",
      "timestamp": "2025-10-31T09:49:59.484578Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-31T09:49:59.484582Z"
    },
    {
      "original": "🛵\n  БпЛА на сході Дніпропетровщини, курс на н.п.Чаплине/н.п.Просяна.",
      "timestamp": "2025-10-31T09:49:59.484586Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Чернігівщини, курс - південно-західний.",
      "timestamp": "2025-10-31T09:49:59.484590Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ на Донеччину.",
      "timestamp": "2025-10-31T09:49:59.484595Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження.",
      "timestamp": "2025-10-31T09:49:59.484600Z"
    },
    {
      "original": "Situational update from the Pokrovsk Direction as of 31/10/25 06:00 (Kyiv Time) - Part 1:\nIn short, the situation is catastrophic for Ukraine. I estimate that there is a BARE MINIMUM of 500 soldiers effectively cut off in and around Myrnohrad, however some successful withdrawals have taken place. \nIn Pokrovsk City, Russian forces continued their advance towards the northern outskirts and now control the majority of the city. They have captured the rest of the northwestern industrial zone and broke out of the city limits to the nearby treelines. Here, they were able to infiltrate all the way to the outskirts of the stronghold village Hryshyne where Ukraine's main defences are located. Reinforcements from elements of the 32nd Mechanised Brigade were successfully withdrawn from northern Pokrovsk and are now deployed in Hryshyne alongside the 68th \"Jaeger\" Brigade.\nHowever, the main Russian push on this axis has been towards the Ukrainian strongpoints southeast of Hryshyne. These strongpoints were bombed with several FAB glide-bombs, including a FAB-3000, completely destroying them. Russian soldiers are now attempting to cross the dam next to the reservoir and enter the treelines where these strongpoints are located, while simultaneously infiltrating further into the northernmost neighbourhoods of Pokrovsk.\nIn the city centre, Russian forces were able to clear the remaining pockets of Ukrainian resistance in the Pervomaika District and city centre, capturing Pokrovsk's Administrative building and railway station. With these new areas secured, FPV drone pilots have been deployed to the central suburbs of Pokrovsk, while forward deployment and accumulation points were set up in the southern suburbs, allowing for a significant increase in the supply of heavy weaponry and vehicles into the city. \nIn the eastern suburbs, after dislodging Ukraine from their main defensive stronghold, the Russians achieved a breakthrough to the northern outskirts of Pokrovsk. Small, mobile Ukrainian assault groups are attempting to clear them out but are having no success due to Russian numerical superiority and the fluidity of the frontline. Russian forces have since advanced east, bypassing the high-rise district from the north and capturing the church area. They also entered the main factory in the eastern suburbs of the city, where they are attempting to push towards the park.\nIn the southeastern suburbs of Pokrovsk, Russian forces fully consolidated west of the highway and entered the villages of Hnativka and Rih. Neither village has been brought under full control, but Russian presence here is significant. \nIn southern Myrnohrad, Ukrainian forces withdrew from their main defensive positions in the 3-story-buildings after being bombed by numerous FABs, with very few soldiers remaining in the southern suburbs of the city. Some forces are now stationed in the northern suburbs of the city, while others attempted to escape the pocket through the small corridor of fields while being targeted by Russian artillery and FPV drones. As a result, the Russians were able to capture practically all of southeastern Myrnohrad, along with the terykon, and reached the central high-rise district. \nIn the northeastern suburbs of Myrnohrad, Russian forces managed to dismount and enter the main high-rise district here. They quickly gained a foothold and linked up with other forces advancing from the treeline further north. At least 10 high-rise buildings are under their control now. Artillery and FAB strikes are targeting the main Ukrainian defensive positions in the western part of this high-rise district, ahead of the Russian advance. Additionally, they were able to enter the city at a new point, advancing from the Kapitalna Industrial Zone to the low-rise residential areas, where at least 12 blocks were brought under their control. \n(Continued below)",
      "timestamp": "2025-10-31T09:50:00.220857Z"
    },
    {
      "original": "Situational update from the Pokrovsk Direction as of 31/10/25 06:00 (Kyiv Time) - Part 1:  In short, the situation is catastrophic for Ukraine. I estimate that there is a BARE MINIMUM of 500 soldiers effectively cut off in and around Myrnohrad, however some…",
      "timestamp": "2025-10-31T09:50:00.220869Z"
    },
    {
      "original": "Situational update from the Pokrovsk Direction as of 31/10/25 06:00 (Kyiv Time) - Part 2:\nIn northern Myrnohrad, after clearing the forested areas and dachas, Russian forces established a foothold in the first couple rows of high-rise buildings and are now attempting to consolidate in the local school and surrounding residential areas. \nOverall, the situation here remains catastrophic for Ukrainian forces. They are finally beginning the withdrawal from these two major cities, but many troops are still stuck, and many more will be killed attempting to escape the pocket. The fact that positions still exist in Lysivka and Sukhyi Yar - over 14 km deep into the pocket - show the current priorities of the Ukrainian command when it comes to their PR cities such as these ones. \nPokrovsk and Myrnohrad ARE strategically important, and anyone telling you otherwise either doesn't know what they are talking about or is outright lying. The Ukrainian command has once again betrayed their troops, and those online lying about the true situation unfolding have done so too. \nOnly time will tell what will happen after the fall of these cities, but it is known that Russia will soon gain a major logistical hub in the Donbas which will undoubtably help significantly in their future operations in this direction. Remember - all the fronts feed into each other, and developments elsewhere (especially in adjacent sectors) could be crucial to how this direction develops in the future.\n(Link to part 1)",
      "timestamp": "2025-10-31T09:50:00.220877Z"
    },
    {
      "original": "Situational update from the Pokrovsk Direction as of 31/10/25 06:00 (Kyiv Time) - Part 2:  In northern Myrnohrad, after clearing the forested areas and dachas, Russian forces established a foothold in the first couple rows of high-rise buildings and are now…",
      "timestamp": "2025-10-31T09:50:00.220881Z"
    },
    {
      "original": "Meanwhile on Pro-Ukrainian YouTube...\nIn all seriousness, the pure scum like this who openly lie to their audience, downplaying the suffering of the Ukrainian Armed Forces, have done more harm to Ukraine than any ordinary Pro-Russian online.",
      "timestamp": "2025-10-31T09:50:00.220885Z"
    },
    {
      "original": "Russian soldiers rescued a mini turtle tank",
      "timestamp": "2025-10-31T09:50:00.220888Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Zatyshok, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~62.\nTotal land area: ~1.00 km².",
      "timestamp": "2025-10-31T09:50:00.220893Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Sukhetske, Dobropillya direction, Donetsk Oblast.\nPre-war population: ~39.\nTotal land area: ~0.35 km².",
      "timestamp": "2025-10-31T09:50:00.220897Z"
    },
    {
      "original": "In the Stepnohirsk direction, Russian forces continued their assault operations and have made significant progress along the eastern bank of the former Kakhovka Reservoir.\nFollowing the Ukrainian counterattacks that largely drove the Russians behind the river, Russian forces began a new series of attacks aimed at re-establishing themselves in Prymorske. They were able to cross over to the Prymorske Railway Station, re-establishing control over it and beginning the advance further north.\nAssault groups were quickly able to capture large parts of the village, pushing along Pokrovska Street and the parallel roads further north. DRGs have advanced even further, reaching areas 3.5 km northwest of the railway station.\n+ ~1.67 km² in favour of Russia.",
      "timestamp": "2025-10-31T09:50:00.220903Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance westwards from the Yanchur River, and have reached the next chain of settlements.\nRussian forces continued to advance along the treelines on the tactical heights towards Vesele, with forward units now on the outskirts of the village. To the north, the Russians have established a solid foothold on the tactical heights, and reached the next gulley, south of Novouspenivske. \n+ ~6.69 km² in favour of Russia.",
      "timestamp": "2025-10-31T09:50:00.220919Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued to advance and have fully established themselves along most of the eastern bank of the Yanchur River.\nAfter capturing Zlahoda and reaching the Yanchur River further southeast, Russian forces began to squeeze the remaining Ukrainian soldiers out of the salient east of the river. They advanced downhill from their newly established positions on the tactical heights west of Novohryhorivka, entered Pryvilne from two directions, and quickly established full control over the village.\nFollowing this, the Russians advanced downhill from the tactical heights east of Krasnohirske and southeast along the eastern bank of the Yanchur, entering and capturing Krasnohirske. \n+ ~9.12 km² in favour of Russia.",
      "timestamp": "2025-10-31T09:50:00.220925Z"
    },
    {
      "original": "Results are in: They updated the map to show old Russian advances, and increased the grey zone.",
      "timestamp": "2025-10-31T09:50:00.220928Z"
    },
    {
      "original": "Russian forces have captured the village of Novopavlivka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~464.\nTotal land area: ~1.22 km².",
      "timestamp": "2025-10-31T09:50:00.220933Z"
    },
    {
      "original": "Russian forces have captured the village of Hnativka, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~146.\nTotal land area: ~0.50 km².",
      "timestamp": "2025-10-31T09:50:00.220937Z"
    },
    {
      "original": "Russian forces have captured the village of Rih, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~95.\nTotal land area: ~0.35 km².",
      "timestamp": "2025-10-31T09:50:00.220941Z"
    },
    {
      "original": "In the Pokrovske direction, Russian forces continued to advance towards the Vovcha River from the southeast and have captured new positions on both banks of the Yanchur River.\nAfter crossing the Yanchur river from Pryvillya and establishing a foothold in Yehorivka, Russian forces continued to push through the latter village. They were able to capture most of it, along with the forested area to the north, with the western houses remaining in the grey zone. \nTo the northeast, Russian forces advanced further into Vyshneve from the east, breaking through to the centre of the village. Simultaneously, assault groups from the southeast consolidated in the different agricultural complexes and linked up with the other forces in the centre, who then reached the western outskirts of the village.\nAdditionally, the Russians made further progress north of the tributary of the Yanchur River. They widened their spearhead to Novooleksandrivka, and crossed the tributary at a second point from Vyshneve. From here, they advanced up the road, while DRGs infiltrated the central part of the village of Hai. Fighting continues for parts of Novooleksandrivka. \n+ ~7.06 km² in favour of Russia.",
      "timestamp": "2025-10-31T09:50:00.220947Z"
    },
    {
      "original": "2 Russian MiG-31Ks are redeploying from Savasleika Airbase, Nizhny Novgorod Oblast, to Akhtubinsk Airbase, Astrakhan Oblast. They will each be equipped with a Kinzhal aeroballistic missile. \nAdditionally, yesterday, 6 Tu-95MS strategic bombers redeployed from Engels-2 Airbase, Saratov Oblast, to Ukrainka Airbase, Amur Oblast, to be equipped with Kh-101 cruise missiles in preparation for the next large-scale, combined missile attack on Ukraine.\n4 Tu-160s are currently airborne from Engels-2 Airbase too, but the purpose of the flight is currently unknown.",
      "timestamp": "2025-10-31T09:50:00.220952Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces continued their counterattacks and have made additional progress in the Russian bridgehead on the western bank of the Kazenyi Torets Rive.\nLast week, Ukrainian forces advanced from positions south of Bilytske, and infiltrated Sukhetske from the west. Since then, they have consolidated control over the whole village, and advanced further east into the dachas of Zatyshok. Additionally, after entering Zatyshok from the north, Ukrainian forces were able to advance to the western outskirts of the village, establishing full control over it and forcing the Russians to withdraw from nearby areas to avoid being encircled. \nTo the north, Ukrainian forces advanced from their positions northeast of Bilytske and once again re-established control over the village of Dorozhnje and the freight train station of the same name.\n+ ~18.01 km² in favour of Ukraine.",
      "timestamp": "2025-10-31T09:50:00.220957Z"
    },
    {
      "original": "The remaining Ukrainian soldiers still in northern Pokrovsk have begun a withdrawal from the city. They are attempting to cross the fields, but are being hit by Russian drones.\nThe same cannot be said for those still stuck in and around Myrnohrad...",
      "timestamp": "2025-10-31T09:50:00.220965Z"
    },
    {
      "original": "A Neptune cruise missile was launched from southern Odesa Oblast, flying towards Sevastopol, Crimea. \n~90 km from the coast.",
      "timestamp": "2025-10-31T09:50:00.220969Z"
    },
    {
      "original": "A Neptune cruise missile was launched from southern Odesa Oblast, flying towards Sevastopol, Crimea.   ~90 km from the coast.",
      "timestamp": "2025-10-31T09:50:00.220972Z"
    },
    {
      "original": "The missile was shot down on approach to Crimea.",
      "timestamp": "2025-10-31T09:50:00.220975Z"
    },
    {
      "original": "When the Hunter Becomes the Prey: \"Might Makes Right\" in Ukraine's Conscription\nTensions are rising within Ukrainian society. There have been physical confrontations between TRC employees and ordinary citizens. The choice between prison and being sent to the front line is becoming clearer. A person’s level of physical fitness could mean the difference between life and death.\nThe regular violation of civil rights and freedoms by TRC employees could not fail to affect Ukrainian society. The use of physical violence, bribery, and frequent deaths in unclear circumstances among ‘conscripted’ men have created a very negative image of military recruiters among Ukrainians.\nThe Ukrainian media published a photograph of a deceased man who had been forcibly taken to the Rivne TRC. According to official statements, the conscript died of heart failure. The autopsy revealed no signs of violent death.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046066Z"
    },
    {
      "original": "When the Hunter Becomes the Prey: \"Might Makes Right\" in Ukraine's Conscription\nTensions are rising within Ukrainian society. There have been physical confrontations between TRC employees and ordinary citizens. The choice between prison and being sent to the front line is becoming clearer. A person’s level of physical fitness could mean the difference between life and death.\nThe regular violation of civil rights and freedoms by TRC employees could not fail to affect Ukrainian society. The use of physical violence, bribery, and frequent deaths in unclear circumstances among ‘conscripted’ men have created a very negative image of military recruiters among Ukrainians.\nThe Ukrainian media published a photograph of a deceased man who had been forcibly taken to the Rivne TRC. According to official statements, the conscript died of heart failure. The autopsy revealed no signs of violent death.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046081Z"
    },
    {
      "original": "Iran Is Making More Missiles Despite UN Sanctions\nIran has likely ramped up efforts to rebuild its missile program despite the recent reimposition of sanctions by the United Nations, CNN reported on October 29, citing European intelligence sources.\nAccording to the report, several shipments of sodium perchlorate, a key chemical used in producing solid rocket fuel, arrived from China at the Iranian port of Bandar Abbas in late September.\nThe UN sanctions were reimposed earlier on the same month under the “snapback” mechanism of the 2015 nuclear deal. The sanctions prevent Iran from developing or testing ballistic missiles capable of carrying nuclear weapons. Both China and Russia opposed the reinstatement.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046090Z"
    },
    {
      "original": "Winter is Coming. Ukraine's Energy System Under Powerful Russian Strike\nOn the night of October 29-30, 2025, Russia launched one of the largest combined attacks on Ukraine's energy infrastructure since the beginning of the conflict. The primary targets were major thermal power plants in the western and central energy hubs: \nthe Ladyzhynska, Dobrotvirska, and Burshtynska Thermal Power Plants (TPPs),\n which facilitate power transmission to western regions. According to the Ukrainian Air Force, a total of \n653\n attack UAVs of various types and \n52\n missiles were launched. \nAccording to a Bild report citing Ukrainian sources, the upcoming winter could be the most difficult for Ukraine. Since the conflict began, DTEK facilities alone have been targeted in 210 missile and drone attacks, with 54 attacks directed at a single power plant. The report states that 55-60% of Ukraine's gas infrastructure is already seriously damaged, threatening a collapse of the country's energy system.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046101Z"
    },
    {
      "original": "Winter is Coming. Ukraine's Energy System Under Powerful Russian Strike\nOn the night of October 29-30, 2025, Russia launched one of the largest combined attacks on Ukraine's energy infrastructure since the beginning of the conflict. The primary targets were major thermal power plants in the western and central energy hubs: \nthe Ladyzhynska, Dobrotvirska, and Burshtynska Thermal Power Plants (TPPs),\n which facilitate power transmission to western regions. According to the Ukrainian Air Force, a total of \n653\n attack UAVs of various types and \n52\n missiles were launched. \nAccording to a Bild report citing Ukrainian sources, the upcoming winter could be the most difficult for Ukraine. Since the conflict began, DTEK facilities alone have been targeted in 210 missile and drone attacks, with 54 attacks directed at a single power plant. The report states that 55-60% of Ukraine's gas infrastructure is already seriously damaged, threatening a collapse of the country's energy system.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046112Z"
    },
    {
      "original": "ISRAELI STRIKES THREATEN CEASEFIRES ON TWO FRONTS",
      "timestamp": "2025-10-31T09:50:01.046116Z"
    },
    {
      "original": "Breakthrough In Hai And Battles For Novopavlivka: Russia Increases Pressure On Ukraine\nIn the Dnipropetrovsk sector, Russian forces are encircling Novopavlivka. The forces have also broken through to the eastern outskirts of Lyman. \nAccording to a Chinese publication, over half of the Ukrainian Armed Forces servicemen who have died are foreign mercenaries.\nRead more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046123Z"
    },
    {
      "original": "Breakthrough In Hai And Battles For Novopavlivka: Russia Increases Pressure On Ukraine\nIn the Dnipropetrovsk sector, Russian forces are encircling Novopavlivka. The forces have also broken through to the eastern outskirts of Lyman. \nAccording to a Chinese publication, over half of the Ukrainian Armed Forces servicemen who have died are foreign mercenaries.\nRead more \nHERE",
      "timestamp": "2025-10-31T09:50:01.046130Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From October 30, 2025\nOn October 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-31T09:50:01.046137Z"
    },
    {
      "original": "Bridge Hit: Summary Of Russian Combat Footage From October 30, 2025\nOn October 30, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-31T09:50:01.046143Z"
    }
  ],
  "script_run_time": "2025-10-31T09:50:01.046996Z"
}