{
  "messages": [
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-06T21:33:21.930591Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-06T21:33:21.930607Z"
    },
    {
      "original": "🛸\n \n🛸\nНа північному сході від Чугуєва (Харківщина), на південному сході від Кривого Рогу та на півдні від м.Запоріжжя - БпЛА противника, ймовірно, розвідувальні. Можлива робота ППО. У разі оголошення тривоги - прямуйте в укриття!",
      "timestamp": "2025-08-06T21:33:21.930615Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-06T21:33:21.930620Z"
    },
    {
      "original": "⚠\n Увага!   Ворожий ударний БпЛА у Харківській області! Під час тривоги перебувайте у безпечних місцях.",
      "timestamp": "2025-08-06T21:33:21.930624Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-06T21:33:21.930629Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину з півночі.",
      "timestamp": "2025-08-06T21:33:21.930637Z"
    },
    {
      "original": "🛵\n Сумська область - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-06T21:33:21.930642Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку ! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-06T21:33:21.930649Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-06T21:33:21.930654Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-06T21:33:21.930658Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на схід Харківщини.",
      "timestamp": "2025-08-06T21:33:21.930662Z"
    },
    {
      "original": "⚠️\n⚠️\nСпостерігається активність  розвідувальних БпЛА в Запорізькій, Дніпропетровській, Харківській та Сумській областях, можлива робота ППО.",
      "timestamp": "2025-08-06T21:33:21.930668Z"
    },
    {
      "original": "⚠\n Увага!\nХарківська, Дніпропетровська(Синельниківський р-н), Запорізька області повітряна тривога! \nСлідкуйте за нашими повідомленнями!\nПід час повітряної тривоги – перебувайте в укриттях!",
      "timestamp": "2025-08-06T21:33:21.930674Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку ! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-06T21:33:21.930682Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією у Запорізькій області.",
      "timestamp": "2025-08-06T21:33:21.930686Z"
    },
    {
      "original": "🛵\n Сумщина  - ударні БпЛА в південному напрямку, на Харківщину та Полтавщину.",
      "timestamp": "2025-08-06T21:33:21.930691Z"
    },
    {
      "original": "🛵\n Харківська та Полтавська області - загроза застосування ворогом ударних БпЛА.\n🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-06T21:33:21.930701Z"
    },
    {
      "original": "🚨\nОновлення щодо \"шахедів\":\n🛵\n  БпЛА на півночі Харківщини \n➡️\n курсом на південь.\n🛵\n  БпЛА на Полтавщині \n➡️\n курсом на південно-західний напрямок.\n🛵\n БпЛА на півночі Херсонщини \n➡️\n курсом на Дніпропетровщину.",
      "timestamp": "2025-08-06T21:33:21.930713Z"
    },
    {
      "original": "🛵\n Дніпропетровщина(Криворізький та Нікопольський райони) - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-06T21:33:21.930718Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on the city of Lozova, Kharkiv Oblast.  The target was the city's train station, with approximately 20 drones attacking in two main waves, flying in and impacting one after another. They…",
      "timestamp": "2025-08-06T21:33:22.453093Z"
    },
    {
      "original": "Some additional photos of damage at the scene. The main train station building sustained significant damage.",
      "timestamp": "2025-08-06T21:33:22.453105Z"
    },
    {
      "original": "Some additional photos of damage at the scene. The main train station building sustained significant damage.",
      "timestamp": "2025-08-06T21:33:22.453109Z"
    },
    {
      "original": "Currently there are 5 Kalibr carriers in the waters of the Black Sea - 3 Buyan-M class corvettes and 2 submarines of the \"Varshavyanka\" project. \nThe total possible salvo is 36 Kalibr cruise missiles. \nThese ships will likely be used in the missile attack tomorrow.",
      "timestamp": "2025-08-06T21:33:22.453114Z"
    },
    {
      "original": "Regarding the next combined missile attack on Ukraine, which will probably take place in the very early hours of tomorrow morning (Kyiv time).   According to available information, 5-6 Tu-95MS and 2 Tu-160 strategic bombers have been equipped with Kh-101 cruise…",
      "timestamp": "2025-08-06T21:33:22.453118Z"
    },
    {
      "original": "So far Geran-2 drone launches have been recorded from the following areas: \nKhalino Airbase, Kursk Oblast.\nHvardiiske Training Ground, Crimea.\nCape Chauda, Crimea.\nPrimorsko-Akhtarsk, Krasnodar Krai.\nThe first Gerans have been recorded flying west/northwest in Russian-controlled Kherson Oblast near the Kinburn Spit. Additionally, 2 Geran-3 jet drones attacked a target in the area of Dubov'yazivka, Sumy Oblast a short time ago. \nPreparations for launches of Gerans were also recorded from the following areas:\nMillerovo Airbase, Rostov Oblast.\nNavlya Test Site, Bryansk Oblast.\nTsumbulova Test Site, Oryol Oblast.",
      "timestamp": "2025-08-06T21:33:22.453127Z"
    },
    {
      "original": "So far Geran-2 drone launches have been recorded from the following areas:   Khalino Airbase, Kursk Oblast. Hvardiiske Training Ground, Crimea. Cape Chauda, Crimea. Primorsko-Akhtarsk, Krasnodar Krai.  The first Gerans have been recorded flying west/northwest…",
      "timestamp": "2025-08-06T21:33:22.453130Z"
    },
    {
      "original": "Ukrainian channels report that Russia has likely \"postponed\" the combined missile attack that was supposed to take place on Ukraine tonight. The number of drone launches reflects that.",
      "timestamp": "2025-08-06T21:33:22.453133Z"
    },
    {
      "original": "I've added my personal definitions for each direction to the Ukraine Map, all the way from Mykolaiv Oblast to the border with Belarus.\nYou can view this by ticking the bottom layer of the map (\nhttps://www.google.com/maps/d/u/0/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll=49.52120120158947%2C32.587373795927505&z=7\n).",
      "timestamp": "2025-08-06T21:33:22.453138Z"
    },
    {
      "original": "Iskander on Krovelets, Sumy Oblast",
      "timestamp": "2025-08-06T21:33:22.453142Z"
    },
    {
      "original": "Iskander on Krovelets, Sumy Oblast",
      "timestamp": "2025-08-06T21:33:22.453145Z"
    },
    {
      "original": "Disappeared northeast of Baturyn, Chernihiv Oblast.",
      "timestamp": "2025-08-06T21:33:22.453148Z"
    },
    {
      "original": "An explosion was heard from Konotop, Sumy Oblast.",
      "timestamp": "2025-08-06T21:33:22.453151Z"
    },
    {
      "original": "An explosion was heard from Konotop, Sumy Oblast.",
      "timestamp": "2025-08-06T21:33:22.453154Z"
    },
    {
      "original": "According to clarified information, the explosion was not heard from Konotop, but rather somewhere further north. It appears this was an S-300 air defence missile, although no Ukrainian aircraft were detected in the region at the time.",
      "timestamp": "2025-08-06T21:33:22.453160Z"
    },
    {
      "original": "There is a threat of Onyx cruise missile launches from western Crimea in the coming hours. A K-300P Bastion-P system has been placed on combat alert. The most likely targets would be Odesa and Mykolaiv Oblasts.",
      "timestamp": "2025-08-06T21:33:22.453163Z"
    },
    {
      "original": "The villages of Orlivka and Novosil's'ke, and the surrounding area near the Romanian border in southern Odesa Oblast are currently under a massive Geran-2 drone attack. \nApproximately 26 drones are involved.",
      "timestamp": "2025-08-06T21:33:22.453167Z"
    },
    {
      "original": "The villages of Orlivka and Novosil's'ke, and the surrounding area near the Romanian border in southern Odesa Oblast are currently under a massive Geran-2 drone attack.   Approximately 26 drones are involved.",
      "timestamp": "2025-08-06T21:33:22.453170Z"
    },
    {
      "original": "Scenes from southern Odesa Oblast, where 26 Geran-2 drones attacked targets in the villages of Orlivka and Novosilske. \nOne of the targets was a Gas compression station at 45.304197, 28.542373 (media 4), as seen in the second video. The first video was recorded from the Romanian side of the border. \nGeolocation credit: \nx.com/kimhvik2/status/1952858221615694097",
      "timestamp": "2025-08-06T21:33:22.453176Z"
    },
    {
      "original": "Scenes from southern Odesa Oblast, where 26 Geran-2 drones attacked targets in the villages of Orlivka and Novosilske. \nOne of the targets was a Gas compression station at 45.304197, 28.542373 (media 4), as seen in the second video. The first video was recorded from the Romanian side of the border. \nGeolocation credit: \nx.com/kimhvik2/status/1952858221615694097",
      "timestamp": "2025-08-06T21:33:22.453181Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continue to advance east of the Nitrius River and have entered the outskirts of Shandryholove. \nRussian forces advanced in two areas. In the southeast, they continued to push southwest down the forest plantations in the low-lying ground, seizing new positions there and in the forested areas. Using the cover provided, they were able to enter the outskirts of Shandryholove and captured some of the agricultural buildings there. Battles are ongoing for the other buildings, with Ukrainian forces holding their main presence in the residential part of the village.\nRussian forces also advanced to the east, capturing the rest of the gulley from Zelena Dolnya, before advancing to and clearing positions on the adjacent tactical heights.\nIn the northwest, Russian forces made additional progress down the eastern bank of the Nitrius River, advancing south to the next two forests, capturing them and two nearby treelines. \n+ ~9.13km² in favour of Russia.",
      "timestamp": "2025-08-06T21:33:22.453190Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance in and around Torske, capturing key positions in multiple areas.\nIn the south, they continued to push through the northwestern part of the Serebryanskyi Forest, and managed to break into the southern part of Torske. They captured the agricultural buildings on the outskirts, and positions in the houses on and around Tsentralna and Radhospna Streets. \nIn the north, Russian forces continued to advance through the northern residential area, capturing additional positions on and around Pivnichna Street. \nThe main Ukrainian presences in Torske are in the central section and the fish-farm in the far north. The grey zone is large, with both sides regularly operating in small groups of 2-3s there with no solid line of contact. \n+ ~4.95km² in favour of Russia.",
      "timestamp": "2025-08-06T21:33:22.453197Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and completed the capture of Toretsk City. \nRussian forces advanced in two areas. In the southwest, they continued their operations to clear the village of Shcherbynivka. After they captured the southern and main part of the village, they entered the northern part and began clearing the area of the railway line. Russian forces captured most of the rest of the village, including the local school. They were also able to clear the rest of the positions in the pocket west of Shcherbynivka due to the progress inside the settlement. \nFurther east, Russian forces cleared the remaining positions in western Toretsk after the last Ukrainian soldiers withdrew from the city and captured the rest of the adjacent Toretsk Forest. \nIn the northeast, Russian forces resumed their assault operations northwest of Dyliivka, and established control over positions on four different treelines on the tactical heights.\nAdditionally, in the west, Russian soldiers managed to enter the western part of Katerynivka, although it is unclear if any positions were established. \n+ ~8.27km² in favour of Russia.",
      "timestamp": "2025-08-06T21:33:22.453204Z"
    }
  ],
  "script_run_time": "2025-08-06T21:33:22.945514Z"
}