{
  "messages": [
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночного сходу.",
      "timestamp": "2025-11-06T14:53:57.396945Z"
    },
    {
      "original": "⚠\nУВАГА \n🚨\n Вся Україна - ракетна небезпека! \n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-11-06T14:53:57.396964Z"
    },
    {
      "original": "📢\n Відбій загрози",
      "timestamp": "2025-11-06T14:53:57.396970Z"
    },
    {
      "original": "🚀\nКАБи на Запоріжжі!",
      "timestamp": "2025-11-06T14:53:57.396974Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини \n➡️\n курсом на захід.",
      "timestamp": "2025-11-06T14:53:57.396980Z"
    },
    {
      "original": "🛵\n БпЛА на Київщині \n➡️\n в напрямку н.п. Бишів",
      "timestamp": "2025-11-06T14:53:57.396988Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-11-06T14:53:57.396993Z"
    },
    {
      "original": "🛵\n🛸\n БпЛА в напрямку Чернігова зі сходу.",
      "timestamp": "2025-11-06T14:53:57.396998Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з північного сходу.",
      "timestamp": "2025-11-06T14:53:57.397005Z"
    },
    {
      "original": "🚀\nКАБ на Сумщину!",
      "timestamp": "2025-11-06T14:53:57.397010Z"
    },
    {
      "original": "🛬\n Активність ворожої тактичної авіації на східному напрямку!",
      "timestamp": "2025-11-06T14:53:57.397015Z"
    },
    {
      "original": "🚀\nКАБ на північ Харківщини!",
      "timestamp": "2025-11-06T14:53:57.397021Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на сході Харківщини.",
      "timestamp": "2025-11-06T14:53:57.397026Z"
    },
    {
      "original": "🛵\n БпЛА на північному заході та заході Харківщини, курс - південний/західний/південно-східний;\n🛵\n БпЛА на сході та північному сході Полтавщини, курс - південно-західний;",
      "timestamp": "2025-11-06T14:53:57.397034Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину!",
      "timestamp": "2025-11-06T14:53:57.397038Z"
    },
    {
      "original": "🛵\n БпЛА  в напрямку Полтави з північного сходу.",
      "timestamp": "2025-11-06T14:53:57.397043Z"
    },
    {
      "original": "🛵\n Група БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T14:53:57.397048Z"
    },
    {
      "original": "🛵\n Група БпЛА з Харківщини курсом на Дніпропетровщину.",
      "timestamp": "2025-11-06T14:53:57.397053Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Дніпропетровщини в напрямку Павлограду.",
      "timestamp": "2025-11-06T14:53:57.397057Z"
    },
    {
      "original": "🛵\n БпЛА курсом на/повз Полтаву з півночі.",
      "timestamp": "2025-11-06T14:53:57.397061Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині курсом на/повз Тростянець.",
      "timestamp": "2025-11-06T14:53:57.397065Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-11-06T14:53:57.397072Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T14:53:57.999113Z"
    },
    {
      "original": "🇲🇱\n🇧🇫\n🇳🇪\n - The unprecedented collapse of the security situation in the Sahelian nations - Mali, Burkina Faso and Niger.\nAl-Qaeda affiliate JNIM is on the brink of establishing an empire, the group controls more territory in the Sahel than the Malian and Burkina militaries combined. \nFollowing the catastrophic failures of the Malian and Burkinabe militaries, backed by the Russian Africa Corps (formerly Wagner Group), Bamako and Ouagadougou are now on the verge of an incredible collapse to JNIM.\nMali has yet to regain border access to Algeria, all operations failed horribly, leaving scores of dead Russian operatives. Bamako is now on the brink of losing its Mauritania border too. The most startling situation is Mali and Burkina Faso have just ONE remaining access point to Niger – via Kantchari, Burkina Faso, to Niamey, Niger. \nMeanwhile, the situation in neighboring Niger deteriorates rapidly too. JNIM have expanded into the north and southwest of Niger, with Islamic State affiliate Lakurawa increasing control in the south of the country, operating out of northern Nigeria. For the first time the Tuareg separatists, Azawad Liberation Front, AFL, have begun active operations in Niger. Meanwhile in the southeast of Niger, Boko Haram's second largest zone of operation has become Niger, overtaking Chad.\nRerum Novarum's maps show the current situation in the Sahel \ncompared to July of 2024, just 16 months ago\n.\nNote:\n- The maps do not show JNIM's area of operations in Mauritania.\n- The maps do not show Boko Haram's area of operations in Nigeria and Chad.\n- The full extent of Islamic State and affiliated groups in Nigeria are not shown.\n- The full extent of JNIM's operation in other neighbouring countries are not shown.\n- Toubou Tribal Army positions in the northeast Niger are not shown.",
      "timestamp": "2025-11-06T14:53:57.999136Z"
    },
    {
      "original": "🇲🇱\n - Current situation in Bamako, the capital of Mali:\nJNIM have begun an active blockade of the city, while their attacks on fuel supplies have become popular, the group have also struck convoys of almost all goods and supplies going heading to the capital. \nSeveral countries have advised their citizens to leave the country immediately, including the United States.\nRerum Novarum's map shows the 8 different routes into Bamako:\n- Four routes are (partially) under JNIM control, RN5, RN7, RN27 and RN3. \n- Three routes are contested, RN24, RR6 and RN6.\n- Mali has a single reliable supply route, the RN26 highway.",
      "timestamp": "2025-11-06T14:53:57.999145Z"
    },
    {
      "original": "One thing I've found interesting about Pokrovsk and Myrnohrad is how intact the city infrastructure is. You'd think that for such an intense and long battle, both cities would be destroyed at a Bakhmut level, or even Vovchansk or Marinka levels.  Interestingly…",
      "timestamp": "2025-11-06T14:53:57.999149Z"
    },
    {
      "original": "Also another thing to consider with this is that there are less Ukrainian soldiers to target nowadays, so that would contribute to less damaged buildings.",
      "timestamp": "2025-11-06T14:53:57.999152Z"
    },
    {
      "original": "The Ukrainian SSO claims that it struck a transport-loading vehicle for Iskander-M ballistic missiles near the village of Ovsyannikovo, Kursk Oblast, likely with UAVs, on October 4.\nI can confirm that transportation and loading of Iskander-M and Iskander-K missiles were taking place in this area of Kursk Oblast at around this date. The claims remain unconfirmed, but they line up with what was happening. \nAdditionally, they reported that they hit and destroyed a 1L122 \"Garmon\" radar station on duty near the village of Nizhniy Reutets, Kursk Oblast.",
      "timestamp": "2025-11-06T14:53:57.999157Z"
    },
    {
      "original": "Yesterday, at least 1 Tu-95MS strategic bomber redeployed from Ukrainka Airbase, Amur Oblast, back to Engels-2 Airbase, Saratov Oblast, after it was equipped with Kh-101 cruise missiles. The true number of Tu-95MS that redeployed is unknown, but we should find out in the next 1-3 days.\nAdditionally, 1 Tu-95MS carried out a training mission from Engels-2 Airbase yesterday afternoon, where it carried out simulated launches of missiles with electronic warfare from the old launch lines, which are no longer used, over Guryanovo Training Ground, Saratov Oblast (the new launch lines are slightly further southwest near the village of Uzmore).\nInterestingly, this Tu-95MS from Engels-2 has not been known to conduct simulated launches of missiles over the past few months, and has only carried out ordinary, scheduled training missions, often for younger pilots. This could signal an imminent return to combat duty, alongside the other strategic bombers currently at Ukrainka Airbase.",
      "timestamp": "2025-11-06T14:53:57.999162Z"
    },
    {
      "original": "Vovchansk looks like it's finally being cleaned up. \nRussia controls nearly two thirds of the city and has advanced past most of the flattened areas which are much harder to hold. Also, Ukraine has lost most of their strongholds in the city and is currently in constant retreat.",
      "timestamp": "2025-11-06T14:53:57.999166Z"
    },
    {
      "original": "Some more about Stepnohirsk.\nRussian forces report that Ukrainian UAV numbers have increased, which severely complicates their advancements in the area.\nAccording to some of their estimates, we're talking of about 120 crews, with some belonging to the National Guard and GUR. They provide recon, strikes on Russian forward groups and logistics control.\nGUR operators specifically have \"RAM-2X\" drones, and other UAV battalions have \"Rubak\" and \"Shark\" recon drones.\nAs reported some time ago, these drones are being used en masse at distances of over 60km, easily reaching Vasylivka, primary Russian supply hub in the area.",
      "timestamp": "2025-11-06T14:53:57.999171Z"
    },
    {
      "original": "Update on the Pokrovsk direction:\nActive fighting continues within Pokrovsk's city limits. The northern part of the city remains a grey zone, with some more consolidation from the southeast. Small Russian and Ukrainian assault groups continue to clear each other out of positions in what has become a very fluid and dynamic area, with no defined line of contact.\nIn northeastern Pokrovsk, Ukrainian units in the high-rise part of the Dinas District have begun attempts at withdrawing to Rivne and appear to have been somewhat successful. However, they are withdrawing into a larger, cut-off pocket, so most/all of them won't escape the area. Russian building-by-building clearing operations continue in the Dinas District, where the Ukrainians are still putting up resistance. It's likely that the soldiers there are not fully aware of the situation in the bottleneck of the larger Myrnohrad pocket. Active clearing operations also continue in the shrinking grey zone in the low-rise residential areas of eastern Pokrovsk. \nAs for the bottleneck, Russian DRGs were able to infiltrate into the small, two-street residential area. If assault groups consolidate here, a physical encirclement of Myrnohrad will be made. But that would not make much difference, as any movement in and out of the city is practically impossible right now. Additionally, Russian DRGs infiltrated further to the next pig farm along the road to the rear of Pokrovsk and reached positions beyond it. No consolidation has occurred here yet.",
      "timestamp": "2025-11-06T14:53:57.999177Z"
    },
    {
      "original": "Ukrainian UAVs attacked Volgograd last night. At least three impacts were recorded.\nAt least two drones impacted the Volgograd Oil Refinery (48.48916, 44.62722), where a large fire can be seen burning.\nOne drone impacted a high-rise residential building, however it's unclear if it was affected by Russian electronic warfare.",
      "timestamp": "2025-11-06T14:53:57.999182Z"
    },
    {
      "original": "Ukrainian UAVs attacked Volgograd last night. At least three impacts were recorded.\nAt least two drones impacted the Volgograd Oil Refinery (48.48916, 44.62722), where a large fire can be seen burning.\nOne drone impacted a high-rise residential building, however it's unclear if it was affected by Russian electronic warfare.",
      "timestamp": "2025-11-06T14:53:57.999187Z"
    },
    {
      "original": "Last night, multiple Ukrainian HIMARS GMLRS struck a large Russian ammunition depot near Donetsk City. As a result, a massive explosion occurred due to secondary detonations. A large fire broke out afterwards.",
      "timestamp": "2025-11-06T14:53:57.999190Z"
    },
    {
      "original": "Last night, multiple Ukrainian HIMARS GMLRS struck a large Russian ammunition depot near Donetsk City. As a result, a massive explosion occurred due to secondary detonations. A large fire broke out afterwards.",
      "timestamp": "2025-11-06T14:53:57.999193Z"
    },
    {
      "original": "At least three Ukrainian UAVs struck the Kostroma GRES Thermal Power Plant in the city of Volgorechensk, Kostroma Oblast. A fire is now burning there. \nCoordinates: 57.45806, 41.17486",
      "timestamp": "2025-11-06T14:53:57.999197Z"
    },
    {
      "original": "At least three Ukrainian UAVs struck the Kostroma GRES Thermal Power Plant in the city of Volgorechensk, Kostroma Oblast. A fire is now burning there. \nCoordinates: 57.45806, 41.17486",
      "timestamp": "2025-11-06T14:53:57.999207Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on Dnipropetrovsk Oblast. Three main settlements were hit: Vasylkivka, Petropavlivka, and Kamianske. \nAt least 20 drones impacted the city of Kamianske, targeting the thermal power plant and railway substation. Large fires were seen burning at both of these places. [Media 2 & 3]\nAt least 7 drones targeted the town of Petropavlivka. The target is unknown, and there are no major substations there.  \nAt least 4 drones targeted the town of Vasylkivka. The target there was something in the town, and therefore not the nearby 150 kV substation. [Media 1]",
      "timestamp": "2025-11-06T14:53:57.999213Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on Dnipropetrovsk Oblast. Three main settlements were hit: Vasylkivka, Petropavlivka, and Kamianske. \nAt least 20 drones impacted the city of Kamianske, targeting the thermal power plant and railway substation. Large fires were seen burning at both of these places. [Media 2 & 3]\nAt least 7 drones targeted the town of Petropavlivka. The target is unknown, and there are no major substations there.  \nAt least 4 drones targeted the town of Vasylkivka. The target there was something in the town, and therefore not the nearby 150 kV substation. [Media 1]",
      "timestamp": "2025-11-06T14:53:57.999218Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586270Z"
    },
    {
      "original": "Israel, Greek Air Forces Held Joint Drills In Possible Message To Turkey (Video)\nThe Israeli Air Force (IAF) and Hellenic Air Force (HAF) wrapped up a joint aerial refueling drill, the Israeli Defense Forces (IDF) announced on November 5.\nDuring the drill, which took place on November 3, the IAF’s 120th Squadron practiced aerial refueling of dozens of HAF fighter jets.\nThe IAF and HAF conduct joint exercises on a regular basis, but the latest drills highlight the growing military cooperation between Israel and Greece.\nWhile this cooperation is nothing new, in recent months it has begun to take the shape of a military alliance against Turkey.\nRead more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586291Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586302Z"
    },
    {
      "original": "Without Light, Heat, or Trains: How Russian Strikes Are Deepening Ukraine's Crisis\nOn November 4-5, Russia and Ukraine continued exchanging strikes. According to the Russian Ministry of Defense, Russian air defense forces destroyed 40 Ukrainian UAVs. The Ukrainian Air Force reported that Russia launched approximately 80 attack UAVs.\nFollowing recent massive Russian strikes on Ukraine’s energy and gas infrastructure, the challenges of the heating season have reached a critical point. Alexander Kharchenko, director of the Energy Research Center, stated:\n“If combined heat and power plants (CHPPs) in Kyiv are disabled and there is no prospect of restoration within three days at temperatures of -10°C or lower, Kyiv must announce: a) draining water from residential buildings, and b) evacuation. If the boilers at CHPP-5 or CHPP-6 are destroyed with no prospect of resuming operation within a maximum of three days at -10°C, this constitutes a scenario of a man-made catastrophe.”\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586311Z"
    },
    {
      "original": "AS POKROVSK FALLS, RUSSIAN OFFENSIVE INTENSIFIES ON NORTHERN FRONTS",
      "timestamp": "2025-11-06T14:53:58.586315Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586322Z"
    },
    {
      "original": "No Way Out: 12 Breakout Attempts By Ukraine’s Forces Thwarted In Pokrovsk\nRussian units have raised the national flag in the southern part of Vovchansk. Twelve attempts to break out from the Pokrovsk area have been repelled over the past day. The Russian Armed Forces have gained control of several supply routes in the Krasny Liman sector.\nRead more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586329Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 5, 2025\nOn November 5, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-06T14:53:58.586336Z"
    },
    {
      "original": "FAB-3000 Strike: Summary Of Russian Combat Footage From November 5, 2025\nOn November 5, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-11-06T14:53:58.586343Z"
    },
    {
      "original": "Israel Declares Border With Egypt ‘Closed Military Zone’ Over Growing Drone Threat\nDefense Minister Israel Katz said on November 6 that he had instructed the Israeli Defense Forces (IDF) to declare the Israel-Egypt border area a “closed military zone” over growing drone threat.\nA day earlier, Katz held a meeting a day earlier with senior officials from the IDF, police, and the Shin Bet security agency on the matter.\nAttempts to smuggle weapons and drugs over the Egyptian border using drones have increased since last year, despite the IDF expanding its control there after taking over the area of Rafah in the southern Gaza Strip.\nA large multirotor drone carrying eight handguns was shot down by the IDF over the border late on November 1. This was the fifth such attempt to be reported by Hebrew media in recent weeks, specifically since the start of October, with three of the previous four attempts also involving weapons, namely assault rifles.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586352Z"
    },
    {
      "original": "Ukrainian Neo-Nazi Leader Wants To ‘Defeat Russia And China’\nRadical nationalist groups in Ukraine continue with their war plans against Russia and Russia’s allies. Even with Ukraine devastated by the impact of the conflict with Moscow, local fascist militants do not give up their extremist ideas and continue to endorse a policy of permanent war. This shows how serious the neo-Nazi ideological problem in Ukraine is and how urgently it needs to be solved.\nRecently, Dmitry Korchinsky, an infamous Ukrainian neo-Nazi public figure, stated that his country should create an “army of God” to confront its enemies. He said that this army should be strong enough to militarily defeat and territorially conquer Russia and China – countries considered geopolitical rivals by the Collective West, and consequently hated by the NATO proxy regime in Kiev.\n“An army of God will be able to cross the Ural Mountains and conquer Siberia and then China,” he said.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586361Z"
    },
    {
      "original": "Military Situation In Northern Palestine On November 6, 2025 (Map Update)",
      "timestamp": "2025-11-06T14:53:58.586365Z"
    },
    {
      "original": "The Japanese Thatcher\nNot!\nMuch has been made of the ascension of \nSanae Takaichi\n \nas PM and head of the LDP, which has ruled Japan for most of its postwar history. Her approval rating when she took office was around 59%. After Busan, it was above 65%.\nThat was approval in Japan – but the the MSM are impressed too—mostly for the wrong reasons – the main one being she is a woman in a male-dominant society that has never seen a female PM.\nThen again, who was the last female President of the United States of America….LOL?\nAnother key to her popularity is her claim to be channeling Margaret Thatcher. Most people have seen the movie, the Iron Lady, with Merryl Streep playing Thatcher. It was entertaining. But, few people understand Thatcher’s political career or policies or what she did to set the UK on its course to nowhere, with a greater social inequality, the decimation of industrial communities, and a shift towards an individualistic, materialistic society.\n👉\n Read more \nHERE",
      "timestamp": "2025-11-06T14:53:58.586376Z"
    }
  ],
  "script_run_time": "2025-11-06T14:53:58.587192Z"
}