{
  "messages": [
    {
      "original": "🛵\n Миколаївська область - загроза застосування ворогом ударних БпЛА з акваторії Чорного моря.",
      "timestamp": "2025-08-01T05:48:47.980768Z"
    },
    {
      "original": "⚠\n Увага! Миргород, Гадяч, Комишня (Полтавщина)!\n🛵\n Ворожі БпЛА у вашому напрямку!",
      "timestamp": "2025-08-01T05:48:47.980786Z"
    },
    {
      "original": "🛵\n Оновлення інформації щодо руху ворожих ударних БпЛА:\n1. БпЛА на межі Харківщини і Дніпропетровщини, курс - північний/північно-західний;\n2. БпЛА на північному сході та в центрі Полтавщини, курс - південно-західний;\n3. БпЛА на півдні Миколаївщини, курс - північний;\n4. Нові групи БпЛА на сході Харківщини, курс - південно-західний;\n5. Нові групи БпЛА на півночі Донеччини, курс - західний.",
      "timestamp": "2025-08-01T05:48:47.980795Z"
    },
    {
      "original": "🛵\n Кіровоградська, Черкаська, Одеська області - загроза застосування ворогом ударних БпЛА!",
      "timestamp": "2025-08-01T05:48:47.980800Z"
    },
    {
      "original": "🚀\nПовторні пуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-01T05:48:47.980805Z"
    },
    {
      "original": "🛵\n Нові групи ворожих БпЛА на південному сході Дніпропетровщини, курс - північно-західний.",
      "timestamp": "2025-08-01T05:48:47.980809Z"
    },
    {
      "original": "⚠\n Увага! Черкаси!\n🛵\n Ворожі БпЛА у вашому напрямку! Перебувайте в укриттях!",
      "timestamp": "2025-08-01T05:48:47.980815Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на Черкащині, курс - західний/північно-західний.",
      "timestamp": "2025-08-01T05:48:47.980820Z"
    },
    {
      "original": "🛵\n Нові групи ворожих БпЛА на північному заході і сході Харківщини, курс - південний.",
      "timestamp": "2025-08-01T05:48:47.980824Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на межі Черкащини і Київщини, курс - західний/північно-західний.",
      "timestamp": "2025-08-01T05:48:47.980829Z"
    },
    {
      "original": "⚠\n Увага! Біла Церква! (Київщина)!\nПеребувайте в укритті!\n🛵\n Ворожі БпЛА у вашому напрямку!",
      "timestamp": "2025-08-01T05:48:47.980835Z"
    },
    {
      "original": "🛵\n Оновлення інформації щодо руху ворожих ударних БпЛА:\n1. БпЛА на півдні Київщини, курс - північний/північно-західний;\n2.  БпЛА на північному сході Харківщини, курс - південний;\n3. БпЛА на заході від м.Харкова, курс - південний.",
      "timestamp": "2025-08-01T05:48:47.980842Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-01T05:48:47.980848Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Харківщини та  Донеччини.",
      "timestamp": "2025-08-01T05:48:47.980852Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!\n🚀\nПовторні пуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-08-01T05:48:47.980860Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-01T05:48:47.980864Z"
    },
    {
      "original": "Швидкісна ціль на м.Харків зі сходу",
      "timestamp": "2025-08-01T05:48:47.980867Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-01T05:48:47.980873Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на північний схід Харківщини.",
      "timestamp": "2025-08-01T05:48:47.980878Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Донецької, Дніпропетровської та Запорізької областей",
      "timestamp": "2025-08-01T05:48:47.980888Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-08-01T05:48:48.526951Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-08-01T05:48:48.526963Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-08-01T05:48:48.526967Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-08-01T05:48:48.526971Z"
    },
    {
      "original": "NASA FIRMS data shows that a fire is burning at Makariv Airfield in Kyiv Oblast after as many as 6 Russian Geran-2 drones impacted it. This airfield was civilian as of 2022, but is now probably used to house helicopters for shooting down drones.",
      "timestamp": "2025-08-01T05:48:48.526974Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-08-01T05:48:48.526977Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-08-01T05:48:48.526980Z"
    },
    {
      "original": "Approaching the launch lines.",
      "timestamp": "2025-08-01T05:48:48.526984Z"
    },
    {
      "original": "Probably training",
      "timestamp": "2025-08-01T05:48:48.526987Z"
    },
    {
      "original": "Report on Russian air activity from 9am 30/7/25 - 9am 31/7/25 (Kyiv Time):\nOverview:\nThe following was used by Russia:\n13 Iskander-K cruise missiles.\n5+ Long-range reconnaissance UAVs.\n250+ Geran-2/Geran-3/Gerbera drones.\nTargeted settlements:\nKyiv City, Kyiv Oblast (13x Iskander-K + 10+ waves of Geran-2 drones).\nMakariv, Kyiv Oblast (1 wave of Geran-2 drones). \nBila Tserkva, Kyiv Oblast (1 wave of Geran-2 drones).\nBrovary, Kyiv Oblast (1+ waves of Geran-2 drones).\nBoryspil, Kyiv Oblast (1+ waves of Geran-2 drones).\nDesna, Chernihiv Oblast (1 wave of Geran-2 drones). \nYuriivka, Dnipropetrovsk Oblast (3 waves of Geran-2/Geran-3 drones).\nOther targeted areas:\nN/A\nStrategic Aviation Activity:\n1 Tu-160 redeployed from Engels-2 Airbase, Saratov Oblast to Borisoglebskoye Airbase, Republic of Tatarstan.\nMiG-31K activity:\nTraining of 1 MiG-31K from Savasleika Airbase, Nizhny Novgorod Oblast.\nMilitary Transport and Tanker aircraft activity:\n3x IL-76MD flights to Rostov-on-Don Airbase, Rostov Oblast.\n1x An-26 flights to Kacha Airbase, Crimea.\nThe cargo consists of Geran-2 and Gerbera drones and likely includes Iskander-M ballistic missiles. \nLong-range reconnaissance drone activity:\nLong-range recon drones were recorded in the following regions:\nDonetsk Oblast.\nKharkiv Oblast.\nChernihiv Oblast.\nSumy Oblast. \nKAB/FAB Glide-bomb targets (cities only):\nPokrovsk, Donetsk Oblast.\nLyman, Donetsk Oblast.\nSlovyansk, Donetsk Oblast.\nIskander-M activity:\nN/A\nGeran-2/Geran-3/Gerbera drone launch locations:\n5x from Shatalovo Airbase, Smolensk Oblast.\n5x from Tsumbolova Test Site, Oryol Oblast.\n3x Navlya Testing Ground, Bryansk Oblast.\n3x from Millerovo Airbase, Rostov Oblast.\n3x from Cape Chauda, Crimea.\n2x from Khalino Airbase, Kursk Oblast.\n2x from Primorsko-Akhtarsk Airbase, Krasnodar Krai. \n2x from Hvardiivske Training Ground, Crimea\n1x from Melitopol Airbase, Zaporizhzhia Oblast.\n1x from Donetsk City Training Ground, Donetsk Oblast.\nBlack Sea Fleet Activity:\nN/A\nNote: The map and information provided is not 100% accurate and is based mostly on OSINT reports and analyses. There is a margin of error, so it should not be viewed as perfect. Additionally, some data on the map is generalised, as stated in the legend. It also does not include less significant weapons such as MLRS, short-range UAVs, and KAB glide-bombs (unless they hit major population centres). \nYou can find the full resolution map here: \nhttps://ibb.co/yF7LZm6f",
      "timestamp": "2025-08-01T05:48:48.527022Z"
    },
    {
      "original": "Russian forces have recaptured the village of Oleksandro-Kalynove, Kostyantynivka direction, Donetsk Oblast.\nPre-war population: ~115\nTotal land area: ~0.42km²",
      "timestamp": "2025-08-01T05:48:48.527026Z"
    },
    {
      "original": "In the Stepnohirsk Direction, Russian forces continued to make steady progress and have entered the town of Stepnohirsk.\nAfter completing the capture of Kamyanske and making advances nearby, Russian forces continued to push north on a wide front, moving uphill to the tactical heights, and capturing numerous treeline positions. They then began storming the block of high-rise buildings in the south of the town and established a foothold in its southern end. \nTo the west, Russian forces continued to advance in the village of Plavni, and completed the capture of the settlement. They also expanded their zone of control along the adjacent highway. \n+ ~9.56km² in favour of Russia.",
      "timestamp": "2025-08-01T05:48:48.527032Z"
    },
    {
      "original": "In the Prosyana Direction, Russian forces continued to advance and have crossed the border into Zaporizhzhia Oblast.\nRussian forces advanced in two areas. Most progress was made in the north, where they advanced on a wide front. The Russians continued to advance west of Zelene Pole and entered southern Temyrivka. The rest of the village fell quite quickly, with the Ukrainian withdrawing to the surrounding areas. \nTo the east, Russian forces made new progress down the treelines in the direction of Novoheorhiivka and Komyshuvakha, capturing positions in 6 different treelines. \nIn the south, Russian forces advanced from the village of Novodarivka, along the Zaporizhzhia-Donetsk Regional Border, and captured new positions in the low-lying ground. \n+ ~13.38km² in favour of Russia.",
      "timestamp": "2025-08-01T05:48:48.527043Z"
    },
    {
      "original": "Following the fall of Chasiv Yar, the remaining city administrative and military officials in Kramatorsk have begun to relocate to Dnipro. Evacuations of civilians is also being ramped up. \nIt's now clear why the Donetsk OVA Head announced the mandatory evacuation of families with children so suddenly last week - they knew Chasiv Yar was about to fall.",
      "timestamp": "2025-08-01T05:48:48.527047Z"
    },
    {
      "original": "New images from Chasiv Yar's city centre showing the extent of the damage suffered over the 16-month-long battle for the city.",
      "timestamp": "2025-08-01T05:48:48.527050Z"
    },
    {
      "original": "New images from Chasiv Yar's city centre showing the extent of the damage suffered over the 16-month-long battle for the city.",
      "timestamp": "2025-08-01T05:48:48.527053Z"
    },
    {
      "original": "Russian forces have captured the village of Zatyshok, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~62.\nTotal land area: ~0.39km².",
      "timestamp": "2025-08-01T05:48:48.527057Z"
    },
    {
      "original": "I should've mentioned this earlier, but the chat connected to this channel will now have stricter moderation. Temporary mutes will be handed out to people using slurs, or insulting others excessively, and permanent mutes or occasionally bans will be given for more serious infractions such as posting uncensored gore, nudity, etc. Just use common sense and don't be a jerk, and you will be fine. \nThere will still be free-speech and people are welcome to voice their opinions whether you are Pro-Russian, Pro-Ukraine, Neutral, or anything else, but it must be done in a respectful manner. You are allowed to criticize admins, but within obvious limits. \nWhen you have a channel with many conflicting perspectives, you need stricter moderation, or otherwise it falls apart. I aim for the chat to become more productive, but also not formal. Appeals will be in DMs.",
      "timestamp": "2025-08-01T05:48:48.527062Z"
    },
    {
      "original": "Another Houthi Drone Reaches Israel In Second Attack In 24 Hours\nThe Houthis (Ansar Allah) announced on July 30 that they had launched five suicide drones at multiple targets in Israel in response to the war on the Gaza Strip.\n“The first operation targeted a sensitive target in the occupied Jaffa area with two drones. The second operation targeted a military target in the occupied Ashkelon area with two drones. The third operation targeted a military target in the occupied Negev with one drone,” Houthi military spokesman Brig. Gen. Yahya Saree said in a statement, claiming that the operations were all “successful.”\n“Yemen, its leadership, people, and army, call on all members of the Arab and Islamic nation to fulfill their religious, moral, and humanitarian duties toward the oppressed Palestinian people, and to take to the streets in the coming days in support of justice and in rejection of the ongoing genocide against our brothers in the Gaza Strip,” he added.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029467Z"
    },
    {
      "original": "ISIS Is Playing Dirty In Northeastern Syria\nISIS stepped up its attacks in areas controlled by the Kurdish-led Syrian Democratic Forces (SDF) in northern and eastern Syria over the past month, the Syrian Observatory for Human Rights (SOHR) reported on July 31.\nThe London-based monitoring group documented 22 attacks by cells linked to the terrorist group in SDF-controlled areas in the past 31 days.\nThe vast majority of the attacks, precisely 19, took place in the governorate of Deir Ezzor, where six people, including a civilian, were killed and 13 others were wounded. Two more attacks took place in the governorate of Raqqa with two SDF fighters getting killed.\nThe deadliest attack by the group was, however, in the governorate of al-Hasakah, where five fighters of the SDF were killed.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029487Z"
    },
    {
      "original": "Military Situation In Palestine On July 31, 2025 (Map Update)",
      "timestamp": "2025-08-01T05:48:49.029492Z"
    },
    {
      "original": "Hezbollah Rejects Disarmament, Israel Responds With Strikes On Precision Missile Sites\nThe Israeli Defense Forces (IDF) launched on July 31 a series of strikes against “strategic weapons” manufacturing and storage infrastructure belonging to Hezbollah in southern Lebanon and in the eastern Beqaa Valley.\nThe targets included a facility used to manufacture explosives and an underground site where Hezbollah built and stored precision-guided missiles, the military said in a statement, claiming that the strikes were carried out after it had identified efforts by Hezbollah to restore the sites.\nThe facility in the Beqaa Valley, which is alleged to be Hezbollah’s largest weapons production plant, has been targeted several times by the IDF, including since the November ceasefire.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029502Z"
    },
    {
      "original": "Hezbollah Rejects Disarmament, Israel Responds With Strikes On Precision Missile Sites\nThe Israeli Defense Forces (IDF) launched on July 31 a series of strikes against “strategic weapons” manufacturing and storage infrastructure belonging to Hezbollah in southern Lebanon and in the eastern Beqaa Valley.\nThe targets included a facility used to manufacture explosives and an underground site where Hezbollah built and stored precision-guided missiles, the military said in a statement, claiming that the strikes were carried out after it had identified efforts by Hezbollah to restore the sites.\nThe facility in the Beqaa Valley, which is alleged to be Hezbollah’s largest weapons production plant, has been targeted several times by the IDF, including since the November ceasefire.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029513Z"
    },
    {
      "original": "Syrian Defense Minister Held First Talks In Moscow\nThe defense minister in the interim government of Syria, Murhaf Abu Qasra, discussed a number of common military issues with his Russian counterpart Andrey Belousov, the Syrian Defense Ministry announced.\nAbu Qasra arrived in Moscow on July 31 as part of a delegation led by Foreign Minister Asaad al-Shaibani. This is the first official visit by representatives of the new Syrian government to Russia.\nIn a statement, the Syrian Ministry of Defense said that Abu Qasra was accompanied at the meeting by Shaibani and the head of the General Intelligence Directorate Hussein Salama.\nRead more: \nHERE",
      "timestamp": "2025-08-01T05:48:49.029520Z"
    },
    {
      "original": "Military Situation In Ukraine On July 31, 2025 (Maps Update)",
      "timestamp": "2025-08-01T05:48:49.029524Z"
    },
    {
      "original": "Military Situation In Ukraine On July 31, 2025 (Maps Update)",
      "timestamp": "2025-08-01T05:48:49.029529Z"
    },
    {
      "original": "ISRAEL IS ABOUT TO ANNEX GAZA",
      "timestamp": "2025-08-01T05:48:49.029536Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T05:48:49.029543Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 31, 2025\nOn July 31, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-08-01T05:48:49.029549Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029563Z"
    },
    {
      "original": "Russia Accuses NATO Of Planning Provocations In The Arctic And Baltic\nNikolai Patrushev, Chairman of the Russian Maritime Board, stated that Western states, faced with the ineffectiveness of sanctions pressure against Russia, have begun to carry out planned provocations step by step in various sections of the Transarctic Transport Corridor: in the Arctic, the Barents and Baltic Seas, as well as in the Pacific Ocean.\nHe emphasized that direct attacks on Russian vessels, maritime infrastructure facilities, and even foreign ships – with subsequent blame shifted onto Moscow – cannot be ruled out.\nKey points of his address:\n▪️\n The Baltic Sea is turning into an area of military-political instability due to NATO’s actions. \n▪️\n Poland is demanding a revision of international shipping norms in the Baltic Sea, declaring it has become “NATO’s internal sea.”\n▪️\n Western countries are challenging Russia’s jurisdiction over the Northern Sea Route...\n👉\nRead More\n \nHERE",
      "timestamp": "2025-08-01T05:48:49.029576Z"
    }
  ],
  "script_run_time": "2025-08-01T05:48:49.030456Z"
}