{
  "messages": [
    {
      "original": "🚀\n КАБи на  Запоріжжі!",
      "timestamp": "2025-07-31T11:41:49.138284Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-07-31T11:41:49.138305Z"
    },
    {
      "original": "🛸\n В районі Сум - ворожий розвідувальний БпЛА! Можлива робота ППО.",
      "timestamp": "2025-07-31T11:41:49.138312Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на  північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-31T11:41:49.138321Z"
    },
    {
      "original": "🚀\n КАБи на  Донеччину!",
      "timestamp": "2025-07-31T11:41:49.138326Z"
    },
    {
      "original": "🚀\n КАБи на  Сумщину!",
      "timestamp": "2025-07-31T11:41:49.138332Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 291 ЦІЛЬ ПРОТИВНИКА    \n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 31 липня (із 18.00 30 липня) противник атакував 317-ма засобами повітряного нападу (309 БпЛА, 8 крилатих ракет):\n- 309 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Брянськ, Міллєрово, Шаталово, Приморсько-Ахтарськ – рф;\n- 8 крилатими ракетами Іскандер-К із Курської обл., рф.\n❗️\nОсновний напрямок удару – столиця України, м.Київ!\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00 протиповітряною обороною збито/подавлено РЕБ 291 засіб повітряного нападу противника:\n- 288 ударних БпЛА;\n- 3 крилаті ракети Іскандер-К.\nЗафіксовано прямі влучання 5 ракет (одна із них у житловий будинок в м.Київ) та 21 ударного БпЛА у 12 локаціях, а також падіння збитих (уламки) на 19 локаціях, майже всі у столиці. На жаль, є загиблі і постраждалі, співчуття рідним...",
      "timestamp": "2025-07-31T11:41:49.138357Z"
    },
    {
      "original": "🚀\n КАБи на  Сумщину!",
      "timestamp": "2025-07-31T11:41:49.138362Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T11:41:49.138367Z"
    },
    {
      "original": "🛸\n На Сумщині в районі між н.п.Липова Долина та Недригайлів ворожий БпЛА, ймовірно, розвідувальний. Залучено засоби для його збиття.",
      "timestamp": "2025-07-31T11:41:49.138373Z"
    },
    {
      "original": "🚀\n \n🚀\nДніпропетровська область (Синельниківський р-н) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-07-31T11:41:49.138381Z"
    },
    {
      "original": "🛸\n На Сумщині в районі між н.п.Липова Долина та Недригайлів ворожий БпЛА, ймовірно, розвідувальний. Залучено засоби для його збиття.",
      "timestamp": "2025-07-31T11:41:49.138386Z"
    },
    {
      "original": "🛸\n🛵\n Ворожий БпЛА між н.п.Терни і н.п.Миколаївка (Сумщина) в північному напрямку.",
      "timestamp": "2025-07-31T11:41:49.138393Z"
    },
    {
      "original": "🛸\n Ворожий БпЛА на півночі від м.Суми. Можлива робота ППО.",
      "timestamp": "2025-07-31T11:41:49.138398Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації  на  південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-31T11:41:49.138405Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на межі Донецької, Дніпропетровської та Запорізької областей.",
      "timestamp": "2025-07-31T11:41:49.138410Z"
    },
    {
      "original": "🛸\n🛸\n Ворожі БпЛА на півночі та сході Харківщини. Залучено засоби для збиття.Перебувайте у безпечних місцях.",
      "timestamp": "2025-07-31T11:41:49.138420Z"
    },
    {
      "original": "🚀\n Повторні пуски КАБ на Донеччину!",
      "timestamp": "2025-07-31T11:41:49.138424Z"
    },
    {
      "original": "🛸\n🛸\n На півночі та північному заході Харківщини - активність ворожих БпЛА. Можлива робота ППО.",
      "timestamp": "2025-07-31T11:41:49.138429Z"
    },
    {
      "original": "⚠\nУВАГА\n🚨\n Вся Україна - ракетна небезпека!\n🛫\n Зафіксовано зліт МіГ-31К.",
      "timestamp": "2025-07-31T11:41:49.138437Z"
    },
    {
      "original": "📢\nВідбій загрози!",
      "timestamp": "2025-07-31T11:41:49.138441Z"
    },
    {
      "original": "2 Iskanders on Chernihiv Oblast.",
      "timestamp": "2025-07-31T11:41:49.895922Z"
    },
    {
      "original": "Flying to Kyiv Oblast.",
      "timestamp": "2025-07-31T11:41:49.895933Z"
    },
    {
      "original": "Disappeared around a minute ago. Probably electronic warfare.",
      "timestamp": "2025-07-31T11:41:49.895937Z"
    },
    {
      "original": "There is significant damage to civilian infrastructure in Kyiv, although its unclear if any missiles or drones directly impacted residential buildings. The main target of the attack remains unknown, but I will make a more in-depth report on this and other targeted regions later.",
      "timestamp": "2025-07-31T11:41:49.895940Z"
    },
    {
      "original": "There is significant damage to civilian infrastructure in Kyiv, although its unclear if any missiles or drones directly impacted residential buildings. The main target of the attack remains unknown, but I will make a more in-depth report on this and other…",
      "timestamp": "2025-07-31T11:41:49.895944Z"
    },
    {
      "original": "Ukrainian air defence also hardly operated. Very little Anti-air fire, and a couple of SAMs lightly operated. No missiles were intercepted.",
      "timestamp": "2025-07-31T11:41:49.895947Z"
    },
    {
      "original": "Russian forces have captured the city of Chasiv Yar, Kostyantynivka direction, Donetsk Oblast. \nThe battle lasted for 483 days, making it the third longest battle of the war, after Marinka (616 days), and Pervomaiske (545 days). \nPre-war population: ~14,400.\nTotal land area: ~13.0km².\nFlags have gone up across the city, including in areas that have been under Russian control for some time.",
      "timestamp": "2025-07-31T11:41:49.895954Z"
    },
    {
      "original": "Russian forces have captured the city of Chasiv Yar, Kostyantynivka direction, Donetsk Oblast.   The battle lasted for 483 days, making it the third longest battle of the war, after Marinka (616 days), and Pervomaiske (545 days).   Pre-war population: ~14…",
      "timestamp": "2025-07-31T11:41:49.895957Z"
    },
    {
      "original": "To put it in perspective, this is how much the frontline in Donetsk Oblast has changed since the battle of Chasiv Yar began on April 4, 2024.",
      "timestamp": "2025-07-31T11:41:49.895961Z"
    },
    {
      "original": "Here is a map showing the status of the 52 different settlements in Donetsk Oblast with city status.\n18 (34.6%) were under full Russian control before 2022.\n18 (34.6%) have been fully captured by Russia since 2022.\n2 (3.8%) remain contested.\n13 (25%) are under full Ukrainian control.\nWith the fall of Chasiv Yar, the total number of cities under Russian control in Donetsk Oblast has now doubled since the beginning of the war. \nNote: Horlivka and Donetsk City are included in the orange category as their outskirts were not fully under Russian control on February 24, 2022.",
      "timestamp": "2025-07-31T11:41:49.895968Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-07-31T11:41:49.895972Z"
    },
    {
      "original": "Large fires are burning in the western suburbs of Kyiv, after dozens of Geran-2 drones and 13 Iskander-K cruise missiles impacted targets there.\nAmong the targets is Zhulyany Airport, and several warehouses and enterprises in the Shevchenkivskyi and Solomianskyi. NASA FIRMS has not provided any data on these fires.",
      "timestamp": "2025-07-31T11:41:49.895977Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-07-31T11:41:49.895980Z"
    },
    {
      "original": "Additional footage showing the missile and drone impacts in the city.",
      "timestamp": "2025-07-31T11:41:49.895984Z"
    },
    {
      "original": "NASA FIRMS data shows that a fire is burning at Makariv Airfield in Kyiv Oblast after as many as 6 Russian Geran-2 drones impacted it. This airfield was civilian as of 2022, but is now probably used to house helicopters for shooting down drones.",
      "timestamp": "2025-07-31T11:41:49.895987Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-07-31T11:41:49.895989Z"
    },
    {
      "original": "MiG-31K airborne. Flight characteristics are combat.",
      "timestamp": "2025-07-31T11:41:49.895993Z"
    },
    {
      "original": "Approaching the launch lines.",
      "timestamp": "2025-07-31T11:41:49.895996Z"
    },
    {
      "original": "Probably training",
      "timestamp": "2025-07-31T11:41:49.895999Z"
    },
    {
      "original": "Report on Russian air activity from 9am 30/7/25 - 9am 31/7/25 (Kyiv Time):\nOverview:\nThe following was used by Russia:\n13 Iskander-K cruise missiles.\n5+ Long-range reconnaissance UAVs.\n250+ Geran-2/Geran-3/Gerbera drones.\nTargeted settlements:\nKyiv City, Kyiv Oblast (13x Iskander-K + 10+ waves of Geran-2 drones).\nMakariv, Kyiv Oblast (1 wave of Geran-2 drones). \nBila Tserkva, Kyiv Oblast (1 wave of Geran-2 drones).\nBrovary, Kyiv Oblast (1+ waves of Geran-2 drones).\nBoryspil, Kyiv Oblast (1+ waves of Geran-2 drones).\nDesna, Chernihiv Oblast (1 wave of Geran-2 drones). \nYuriivka, Dnipropetrovsk Oblast (3 waves of Geran-2/Geran-3 drones).\nOther targeted areas:\nN/A\nStrategic Aviation Activity:\n1 Tu-160 redeployed from Engels-2 Airbase, Saratov Oblast to Borisoglebskoye Airbase, Republic of Tatarstan.\nMiG-31K activity:\nTraining of 1 MiG-31K from Savasleika Airbase, Nizhny Novgorod Oblast.\nMilitary Transport and Tanker aircraft activity:\n3x IL-76MD flights to Rostov-on-Don Airbase, Rostov Oblast.\n1x An-26 flights to Kacha Airbase, Crimea.\nThe cargo consists of Geran-2 and Gerbera drones and likely includes Iskander-M ballistic missiles. \nLong-range reconnaissance drone activity:\nLong-range recon drones were recorded in the following regions:\nDonetsk Oblast.\nKharkiv Oblast.\nChernihiv Oblast.\nSumy Oblast. \nKAB/FAB Glide-bomb targets (cities only):\nPokrovsk, Donetsk Oblast.\nLyman, Donetsk Oblast.\nSlovyansk, Donetsk Oblast.\nIskander-M activity:\nN/A\nGeran-2/Geran-3/Gerbera drone launch locations:\n5x from Shatalovo Airbase, Smolensk Oblast.\n5x from Tsumbolova Test Site, Oryol Oblast.\n3x Navlya Testing Ground, Bryansk Oblast.\n3x from Millerovo Airbase, Rostov Oblast.\n3x from Cape Chauda, Crimea.\n2x from Khalino Airbase, Kursk Oblast.\n2x from Primorsko-Akhtarsk Airbase, Krasnodar Krai. \n2x from Hvardiivske Training Ground, Crimea\n1x from Melitopol Airbase, Zaporizhzhia Oblast.\n1x from Donetsk City Training Ground, Donetsk Oblast.\nBlack Sea Fleet Activity:\nN/A\nNote: The map and information provided is not 100% accurate and is based mostly on OSINT reports and analyses. There is a margin of error, so it should not be viewed as perfect. Additionally, some data on the map is generalised, as stated in the legend. It also does not include less significant weapons such as MLRS, short-range UAVs, and KAB glide-bombs (unless they hit major population centres). \nYou can find the full resolution map here: \nhttps://ibb.co/yF7LZm6f",
      "timestamp": "2025-07-31T11:41:49.896040Z"
    },
    {
      "original": "UK Is Too Concerned About Russia Building Aircraft Shelters (Photos)\nRussia is building hardened aircraft shelters at air bases located closest to Ukraine, the United Kingdom Ministry of Defense revealed on July 29.\nAccording to British intelligence, in response to Ukrainian drone attacks, Russia has launched a program to protect vulnerable aircraft at several air bases near the Russian-Ukrainian border. These air bases include Millerovo, Kursk Vostochny, and Gvardeyskoye.\nThe UK’s interest in what Russia is doing with its own air bases is not surprising considering that British intelligence are suspected of directly aiding Ukrainian drone attacks.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663272Z"
    },
    {
      "original": "UK Is Too Concerned About Russia Building Aircraft Shelters (Photos)\nRussia is building hardened aircraft shelters at air bases located closest to Ukraine, the United Kingdom Ministry of Defense revealed on July 29.\nAccording to British intelligence, in response to Ukrainian drone attacks, Russia has launched a program to protect vulnerable aircraft at several air bases near the Russian-Ukrainian border. These air bases include Millerovo, Kursk Vostochny, and Gvardeyskoye.\nThe UK’s interest in what Russia is doing with its own air bases is not surprising considering that British intelligence are suspected of directly aiding Ukrainian drone attacks.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663289Z"
    },
    {
      "original": "The Graphite Controversy: Inside Israel’s Global Spyware Empire \nIn 2024, WhatsApp exposed a cyberattack targeting 90 journalists and activists using zero-click spyware from Israeli firm Paragon Solutions, co-founded by former Prime Minister Ehud Barak. \nThe spyware, named Graphite, granted full access to victims’ phones without any user interaction. While Paragon claims to work only with democratic governments, the identity behind the attack remains unknown. \nThe breach has sparked concerns about messaging app vulnerabilities and calls for stronger cyber defenses and scrutiny of past political assassinations potentially linked to digital surveillance.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663298Z"
    },
    {
      "original": "Russian Troops Push into Kupyansk as Northern Encirclement Tightens\nFollowing intense fighting on the northern frontlines, Russian forces have reached the northern outskirts of Kupyansk, marking a significant breakthrough in the Kharkiv region. \nPreliminary field reports confirmed Russian units have established positions along Michurina Street after breaching Ukrainian defenses. \nUrban combat now rages as Ukrainian troops desperately attempt to repel the advance, with reports indicating some Ukrainian counterattacks have faltered disastrously, including incidents of Ukrainian soldiers reportedly detonating on their own mines near the Oskol River due to disorientation and poor coordination.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663305Z"
    },
    {
      "original": "Russian Troops Push into Kupyansk as Northern Encirclement Tightens\nFollowing intense fighting on the northern frontlines, Russian forces have reached the northern outskirts of Kupyansk, marking a significant breakthrough in the Kharkiv region. \nPreliminary field reports confirmed Russian units have established positions along Michurina Street after breaching Ukrainian defenses. \nUrban combat now rages as Ukrainian troops desperately attempt to repel the advance, with reports indicating some Ukrainian counterattacks have faltered disastrously, including incidents of Ukrainian soldiers reportedly detonating on their own mines near the Oskol River due to disorientation and poor coordination.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663313Z"
    },
    {
      "original": "Iranian Intelligence Shares Footage Of Anti-Mossad Operations During War With Israel \nThe Iranian Ministry of Intelligence released on July 28 video footage documenting some of the operations it conducted against the Mossad spy agency during the 12-day war with Israel last month.\nIsrael started the war on June 13, stating that its goal was to cripple Iran’s nuclear program. The war ended when a ceasefire was suddenly announced on June 24, just two days after the United States joined the war by attacking three key nuclear sites in Iran.\nSome 700 people suspected of working for Mossad were arrested by Iranian security forces during the war. At least few have already been convicted and executed.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663320Z"
    },
    {
      "original": "Russian Tornado-S Target Ukrainian Drone Post With Precision-Guided Rockets (Video)\nThe Russian military’s Sever [North] Group of Forces struck several targets of Kiev forces in the Kharkiv direction with Tornado-S multiple rocket launchers, the Ministry of Defense announced on July 29.\nIn a brief statement, the ministry said that the targets included combat vehicles, an ammunition depot, a drone command post, and a gathering of troops.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663327Z"
    },
    {
      "original": "Israel Assesses Hezbollah Took Heavy Losses, Could Agree To Disarm \nThe Israel Defense Forces (IDF) assesses that its attacks against Hezbollah since a November ceasefire could potentially force the group to disarm, The Times of Israel reported on July 29, citing military officials.\nThe ceasefire between Israel and Lebanon was brokered by the United States. The IDF didn’t only continue to target Hezbollah amid the ceasefire, but also kept troops at five strategic posts in southern Lebanon, the heartland of the group, in defiance of the agreement.\nSince the start of the ceasefire on November 27, the IDF said that it has carried out over 500 strikes against Hezbollah targets in Lebanon, killing at least 230 operatives and destroying over 90 rocket launchers and thousands of rockets, 20 command centers, 40 weapon depots, and five arms production sites, alongside other infrastructure.\nRead more: \nHERE",
      "timestamp": "2025-07-31T11:41:50.663335Z"
    },
    {
      "original": "Military Situation In Ukraine On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T11:41:50.663342Z"
    },
    {
      "original": "Military Situation In Ukraine On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T11:41:50.663346Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 30, 2025\nOn July 30, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-31T11:41:50.663352Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 30, 2025\nOn July 30, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-31T11:41:50.663358Z"
    },
    {
      "original": "Military Situation In Gaza Strip On July 30, 2025 (Map Update)",
      "timestamp": "2025-07-31T11:41:50.663361Z"
    },
    {
      "original": "STANDOFF IN SUMY: FIRST UKRAINIAN GAINS AMID CONSTANT DEFEATS",
      "timestamp": "2025-07-31T11:41:50.663364Z"
    },
    {
      "original": "The Mirage Of Overthrow: An Analysis Of U.S. Regime-Change Projects Against Iran\n▪️\n Donald Trump’s recent decision to suspend foreign aid programs has sparked a wave of anger among anti-Iranian groups in the West. This move has significantly disrupted a multi-billion-dollar regime change mechanism led by the United States Agency for International Development (USAID) and the National Endowment for Democracy (NED)—two organizations notorious for funding groups aimed at weakening and destabilizing foreign governments to advance U.S. interests.\n▪️\n USAID alone manages tens of billions of dollars annually and, in coordination with the CIA, is involved in designing and executing “regime change” operations around the world. However, the overall management of these regime change organizations lies with the U.S. Department of State. Here, we take a look at the budgets and programs defined and implemented by these organizations.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-31T11:41:50.663375Z"
    }
  ],
  "script_run_time": "2025-07-31T11:41:50.664272Z"
}