{
  "messages": [
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА поблизу Харкова! Залучено засоби для їх збиття. Дані безпілотники можуть бути навідниками ворожих засобів ураження!",
      "timestamp": "2025-10-16T11:29:01.981685Z"
    },
    {
      "original": "🛵\n  Ворожі ударні БпЛА у напрямку Чернігова з півночі.",
      "timestamp": "2025-10-16T11:29:01.981702Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 288 ЦІЛЕЙ ПРОТИВНИКА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 16 жовтня (з 20:00 15 жовтня) противник завдав комбінованого удару по об'єктах енергетичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного та наземного базування. Загалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 357 засобів повітряного нападу – 37 ракет (28 із них – \"балістика\") та 320 БпЛА різних типів:\n- 320 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Міллерово, Шаталово, Орел, Приморсько-Ахтарськ – рф, близько 200 із них – «шахеди»;\n- 2 аеробалістичних ракет Х-47М2 «Кинджал» із повітряного простору Рязанської обл. - рф;\n- 26 балістичних ракет Іскандер-М/KN-23 (райони пусків: ТОТ АР Крим; Курська, Воронезька обл. – рф);\n- 2 крилатих ракет Іскандер-К (райони пусків: ТОТ АР Крим; Ростовська. – рф);\n- 7 керованих авіаційних ракет Х-59.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\n За попередніми даними, станом на 10.00, протиповітряною обороною збито/подавлено 288 повітряних цілей:\n- 283 ворожих БпЛА типу Shahed, Гербера (безпілотники інших типів);\n- 5 керованих авіаційних ракет Х-59.\n*Крім того (станом на 10.00), 18 ворожих ракет локаційно втрачені, інформація уточнюється.\nНаразі зафіксовано прямі влучання 14 ракет та 37 ударних БпЛА на 14 локаціях та падіння збитих (уламки) на 2 локаціях.\n❗️\nОсновний напрямок удару – Полтавщина та Харківщина.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-10-16T11:29:01.981730Z"
    },
    {
      "original": "⚠\n Увага! м.Харків!\n🛵\n БпЛА у вашому напрямку з півночі.",
      "timestamp": "2025-10-16T11:29:01.981736Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-16T11:29:01.981741Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-16T11:29:01.981745Z"
    },
    {
      "original": "🚀\n \n🚀\nОдеська область - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-16T11:29:01.981751Z"
    },
    {
      "original": "🚀\nПуски КАБ в напрямку Чорноморського біосферного заповідника( на захід від Лазурного).",
      "timestamp": "2025-10-16T11:29:01.981757Z"
    },
    {
      "original": "🚀\nЗагроза застосування авіаційних засобів ураження для Криворізького району на Дніпропетровщині.",
      "timestamp": "2025-10-16T11:29:01.981761Z"
    },
    {
      "original": "🚀\nПуски КАБ в напрямку Чорноморського біосферного заповідника( на захід від Лазурного).",
      "timestamp": "2025-10-16T11:29:01.981767Z"
    },
    {
      "original": "🚀\n КАБ курсом на Станіслав на Миколаївщині.",
      "timestamp": "2025-10-16T11:29:01.981772Z"
    },
    {
      "original": "🚀\n КАБ курсом на Миколаїв.",
      "timestamp": "2025-10-16T11:29:01.981776Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-10-16T11:29:01.981781Z"
    },
    {
      "original": "🚀\nПуски КАБ на північно-східний напрямок Харківщини.",
      "timestamp": "2025-10-16T11:29:01.981785Z"
    },
    {
      "original": "⚠\n Увага!\nПовітряна тривога на Херсонщині по роботі розвідувального БпЛА.",
      "timestamp": "2025-10-16T11:29:01.981790Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-16T11:29:01.981794Z"
    },
    {
      "original": "🛸\nНа північ від Сум - ворожий розвідувальний БпЛА! Даний безпілотник може бути навідником ворожих засобів ураження.",
      "timestamp": "2025-10-16T11:29:01.981799Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Суми з півночі.",
      "timestamp": "2025-10-16T11:29:01.981804Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запорізьку область.",
      "timestamp": "2025-10-16T11:29:01.981808Z"
    },
    {
      "original": "❗️\n Інформуємо стосовно повітряної цілі на Миколаївщині\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nБлизько 12.00 16 жовтня було зафіксовано пуск із літака Су-34 з акваторії Чорного моря.\nЗасіб повітряного нападу було спрямовано у бік міста Миколаїв.\nМісце падіння встановлено, попередньо без постраждалих. На місці працюють відповідні служби, які встановлюють тип авіаційного засобу ураження.\nДотримуйтесь заходів безпеки під час сигналів повітряної тривоги.",
      "timestamp": "2025-10-16T11:29:01.981834Z"
    },
    {
      "original": "💥\n📹\nНа відео бойова робота у зоні відповідальності \nПовітряне командування \"Схід\"\n.\n🇺🇦\n Продовжуємо нашу боротьбу!",
      "timestamp": "2025-10-16T11:29:01.981841Z"
    },
    {
      "original": "A pair of strategic bombers USAF B-52H are conducting mock missile launches over the Caribbean Sea 500 km from the coast of Venezuela.",
      "timestamp": "2025-10-16T11:29:02.704788Z"
    },
    {
      "original": "In the Pokrovsk direction, both Russian and Ukrainian forces have advanced, each securing different parts of the city.\nOver the last couple of weeks, Ukrainian forces were able to push the Russians out of the western part of the Durniak District, securing positions as far south as Tsentralna Street. Russian forces maintain control of the residential areas immediately north of the E-50 Highway. \nAdditionally, Ukrainian forces advanced in the Pervomaika District of Pokrovsk, pushing southwest from the city centre and the northeastern part of the district, clearing the local school and several surrounding residential blocks which the Russians previously infiltrated.\nOn the otherhand, Russian forces continued their operations in the eastern part of Durniak District. They captured most of the industrial zone west of the E-50 highway, as well as some positions in the adjacent residential streets which they are now using to infiltrate the western part of Pervomaika District. \nFurther east, Russian forces recaptured some positions in the Market District. They advanced along the E-50 highway and the parallel streets, securing positions in the residential areas. \n+ ~0.59 km² in favour of Ukraine.\n+ ~0.23 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704804Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continued to advance towards Myrnohrad, and have entered the first houses of the city.\nAfter securing the forests northeastern of Balahan, Russian forces began advancing through the treelines towards Kozatske, before entering and establishing control over the northern part of the village. They then crossed the Sinna River, entering and securing the first houses of Myrnohrad on Stritenska and Syedova Streets. Ukrainian forces responded by withdrawing for a few hundred metres, and striking each individual house not under their control with multiple FPV drones, attempting to kill all the Russian soldiers who entered the village. \nAdditionally, Russian forces were able to capture new positions in the treelines and forest plantations west and northwest of Hrodivka after Ukrainian forces withdrew to the village of Promin. \n+ ~9.24 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704811Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance in the Shakhove salient and have made additional progress towards the village of Shakhove.\nRussian forces were able to consolidate in the western-most point of the forest plantations north of the Novyy Reservoir after their earlier mechanised assaults, threatening Ukrainian logistics into Volodymyrivka. They were also able to make further progress to the north, capturing two treelines, and gaining a foothold in the forest plantations on the southeastern approaches to Shakhove.\nMeanwhile, despite widespread reports, Volodymyrivka is not under Russian control. The Russians control the southern part of the village, and have not properly consolidated in the centre due to constant Ukrainian drone strikes. After the Russians broke into Volodymyrivka, Ukraine resorted to covering almost the entire village with FPV drones and artillery, striking anything that moves, which resulted in much of the initial Russian assault groups being killed or wounded. Additional reinforcements have managed to enter the village, and new attacks are now underway towards the northern streets. Ukrainian forces currently control a single street in the north of the village, which is constantly being hit by Russian FPV drones. Ukrainian movement to and from these positions is incredibly difficult. \nAdditionally, Russian forces are continuing their assault operations towards the Ukrainian strongpoints in the forested gulley east of Sofiivka, but are still having no success due to constant Ukrainian drone and artillery strikes. \n+ ~3.16 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704829Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance towards the city from the southeast and have secured new positions on the tactical heights.\nFollowing repeated attempts at infiltrating and establishing themselves here, Russian forces were able to consolidate in positions further along the railway line, and in the treelines to the southwest. All of these positions are on the tactical heights, allowing for the Russians to increase their presence above Ivanopillya from the east. \nAdditionally, due to repeated Ukrainian FPV drone and mortar strikes, and a lack of stable supply, Russian forces withdrew from most of the dachas southeast of Kostyantynivka. They do, however, maintain control over a small section of them in the east. The rest are currently situated in the grey zone, while Russia continuously and heavily bombards eastern Kostyantynivka with FAB glide-bombs, artillery, MLRS, mortars, and FPV drones.  \n+ ~4.93 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704835Z"
    },
    {
      "original": "Due to the constant Russian missile and drone strikes on Ukrainian energy infrastructure, the Ukrainian Ministry of Energy has announced emergency power outages for all regions of Ukraine, except for in Chernihiv and Donetsk Oblasts where it will only be partial.",
      "timestamp": "2025-10-16T11:29:02.704839Z"
    },
    {
      "original": "How time flies...",
      "timestamp": "2025-10-16T11:29:02.704843Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance towards the Siverskyi Donets River from the northeast and have made significant progress in five different areas.\nIn the east, Russian forces continued to clear positions west of Stavky, and have advanced from the newly captured strongpoints in the forested gulley, down two parallel treelines on the tactical heights towards the Drobysheve - Zarichne Road. \nTo the west, the Russians began their attacks into Drobysheve. They made further progress in the forest northwest of the town, before Russian soldiers on motorbikes advanced down the road from Shandryholove, and entered the town. Positions were captured in the outermost buildings, and fighting is ongoing in the grey-zone further south. Additionally, Russian forces continued attacking from the Derylove area, where they were able to capture positions in three separate treelines on the tactical heights overlooking Drobysheve. Fighting is now underway for the agricultural buildings on the outskirts of the town. \nFurther west, Russian forces were able to cross the Nitrius River from the Drobysheve Fish Farm into Novoselivka. They established a foothold in the houses on Tsentralna Street and Ukrayinska Street, before pushing northwest towards the western part of the village. Other forces advanced north towards the centre of the village where they are attempting to squeeze the Ukrainians out from multiple directions. Heavy fighting continues here.\nTo the north, Russian forces managed to break through Ukrainian positions in the forests northwest of Novoselivka under heavy FAB, artillery, and drone cover, establishing control over additional positions there. They then went on to advance south, cutting the  Novoselivka - Oleksandrivka road at the graveyard, while capturing further forested positions down the road to the northwest. Additionally, Russian FPV drone strikes on Ukrainian logistics and bridges has increased in intensity in this sector, complicating supply to critical parts of the frontline like Novoselivka.\nIn the north, Russian forces advance from their positions west of Shandryholove, into the forested gulley to the west, establishing full control over it. Additional positions were captured in the treeline to the northwest. \n+ ~5.46 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704851Z"
    },
    {
      "original": "In the Borova direction, Russian forces continued to advance towards Borivska Andriivka and have entered the village.\nAfter securing the trench fortification on the tactical heights northeast of the village, Russian forces continued to improve their positions in the area. They secured another trench fortification, this time in the low-lying ground directly east of Boriivska Andriivka. From there they attacked the village from the north and northeast, establishing control over the eastern and central parts of it.\n+ ~1.31 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704856Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces continued their assault operations east of the Oskil River and have made new progress along the tactical heights towards the village of Pishchane. \nFollowing the Ukrainian infiltration attempts into Stepova Novosilka and its surroundings last month, Russian forces began attempting to regain lost territory in this direction. Recently, they were able to recapture the trench strongpoints in the area of the destroyed railway overpass. From there the Russians advanced further west down the railway windbreaks, seizing further trench positions there and along the highway to the north.  \n+ ~2.78 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704861Z"
    },
    {
      "original": "In the Kupyansk direction, both Russian and Ukrainian forces have advanced, with Ukrainian forces beginning attempts to cut off the Russians in Kupyansk City from the north.\nUkrainian forces advanced from their positions along the railway line, down a perpendicular treeline, and into two forested areas where they established control over new positions. Russian soldiers holding these areas hadn't properly consolidated, which made clearing them easier for the AFU. With this, Russian supply into Kupyansk is now constricted into a 2.4 km wide corridor.\nMeanwhile, in Kupyansk itself, the Russians continued to advance. Following the withdrawal of most Ukrainian units in the north and centre of the city, Russian forces began advancing east on a wide front, clearing new residential areas, and entering the small industrial zone next to the railway line. \nAdditionally, Russian forces advanced in the southwestern suburbs of the city. They cleared additional parts of the low-rise residential areas, and entered the Yuvileynyi Microdistrict from the north, capturing at least six 5-story buildings. Other forces began attacking the western buidings of the microdistrict, increasing the grey zone slightly. \n+ ~2.21 km² in favour of Ukraine. \n+ ~0.67 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704868Z"
    },
    {
      "original": "In the Vovchansk direction, over the past week, Russian forces continued to advance in and around Vovchansk City, and have made significant progress in its western suburbs.\nRussian forces were able to clear the rest of the Vovchansk Oil Extraction Plant and consolidated their positions in the residential areas along the railway line. Further west, they pushed deeper into the western suburbs of the city, advancing southwest as far as T. Bulby Street. \nAdditionally, Russian forces continued to expand their zone of control in the Synelnykove Forest, advancing for more than 500 metres south towards the village of Synelnykove.\n+ ~3.84 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704873Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are advancing, each taking new positions in and around the village of Oleksiivka.\nAfter a series of assault operations were carried out, Ukrainian forces were able to enter the southern houses of Oleksiivka, and consolidate in the treeline to the southwest. Due to the earlier threat from the Ukrainian positions in the agricultural buildings on the western outskirts of the village, the Russians withdrew from the south and part of the centre of the settlement, allowing for the Ukrainians to advance further north and consolidate in new positions. \nSince then, the Russians have continued their advance to the northwest, taking control over new positions in the gulley directly west of Oleksiivka. These advances forced the Ukrainians to withdraw from the agricultural buildings, back into the village of Andriivka. \n+ ~1.79 km² in favour of Ukraine.\n+ ~0.93 km² in favour of Russia.",
      "timestamp": "2025-10-16T11:29:02.704879Z"
    },
    {
      "original": "Earlier this evening, as many as 6 Russian Geran-2 drones struck the Nova Poshta (postal) building in the city of Nizhyn, Chernihiv Oblast. A fire is now burning at the impact site.",
      "timestamp": "2025-10-16T11:29:02.704883Z"
    },
    {
      "original": "Earlier this evening, as many as 6 Russian Geran-2 drones struck the Nova Poshta (postal) building in the city of Nizhyn, Chernihiv Oblast. A fire is now burning at the impact site.",
      "timestamp": "2025-10-16T11:29:02.704886Z"
    },
    {
      "original": "Iskander launch from Kursk",
      "timestamp": "2025-10-16T11:29:02.704889Z"
    },
    {
      "original": "No missiles have been detected in Ukrainian airspace yet",
      "timestamp": "2025-10-16T11:29:02.704892Z"
    },
    {
      "original": "No Iskander threat. It was mixed up with Russian S-300/400 air defence activity.",
      "timestamp": "2025-10-16T11:29:02.704904Z"
    },
    {
      "original": "German Defense Minister Boris Postorius has announced a new military aid package for Ukraine worth approximately 500 million euros, as a part of 2 additional billion euros previously allocated in June 2025.\nIt will include the following:\nRadar systems\nArtillery systems\nPrecision-guided artillery ammunition\n2 IRIS-T air defence systems with a large number of guided missiles\nOther air defence systems\nPatriot interceptors\nPortable anti-aircraft systems\nAnti-tank weapons\nModern communications equipment\nLight weapons\nGermany will also begin a project aimed at modernising already delivered weapons to extend their service life and adapt to changing war conditions. A memorandum of cooperation will also be signed between the defence industries of Germany and Ukraine.",
      "timestamp": "2025-10-16T11:29:02.704915Z"
    },
    {
      "original": "Strikes on Energy Infrastructure: Russia Launches New Attack Following Kyiv Blackout\nOn October 14-15, 2025, the intense exchange of strikes between Russia and Ukraine continued. According to Russian reports, the primary focus of the operation was the destruction of command posts, ammunition depots, energy infrastructure, and logistical hubs supporting the Ukrainian Armed Forces.\nFollowing a major blackout in Kyiv the previous day, Russian forces launched repeated strikes against the TEC-6 heat and power plant in the capital, as well as against electrical substations in the Kharkiv, Dnipropetrovsk, and other regions. By the evening, emergency power outage schedules had been implemented across all regions of Ukraine, except for parts of Chernihiv Region.\nAttacks on Ukraine's energy facilities have been ongoing since the start of the special military operation. However, until recently, the Ukrainian side had managed to minimize the scale of blackouts...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422915Z"
    },
    {
      "original": "Strikes on Energy Infrastructure: Russia Launches New Attack Following Kyiv Blackout\nOn October 14-15, 2025, the intense exchange of strikes between Russia and Ukraine continued. According to Russian reports, the primary focus of the operation was the destruction of command posts, ammunition depots, energy infrastructure, and logistical hubs supporting the Ukrainian Armed Forces.\nFollowing a major blackout in Kyiv the previous day, Russian forces launched repeated strikes against the TEC-6 heat and power plant in the capital, as well as against electrical substations in the Kharkiv, Dnipropetrovsk, and other regions. By the evening, emergency power outage schedules had been implemented across all regions of Ukraine, except for parts of Chernihiv Region.\nAttacks on Ukraine's energy facilities have been ongoing since the start of the special military operation. However, until recently, the Ukrainian side had managed to minimize the scale of blackouts...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422930Z"
    },
    {
      "original": "U.S. B-52 Bombers Flew Near Venezuela Following Fifth Strike On ‘Drug Boat’ (Video)\nUnited States bombers flew close to Venezuela on October 15, just a day after United States President Donald Trump announced another strike on a boat alleged to be trafficking drugs off the coast of the country.\nTrump said that the boat was “affiliated with a Designated Terrorist Organization,” without providing any evidence backing his claims.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422938Z"
    },
    {
      "original": "U.S. B-52 Bombers Flew Near Venezuela Following Fifth Strike On ‘Drug Boat’ (Video)\nUnited States bombers flew close to Venezuela on October 15, just a day after United States President Donald Trump announced another strike on a boat alleged to be trafficking drugs off the coast of the country.\nTrump said that the boat was “affiliated with a Designated Terrorist Organization,” without providing any evidence backing his claims.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422946Z"
    },
    {
      "original": "With Thousands Of Troops Dead, Ukraine Is Losing Battles In Pokrovsk And Dnepropetrovsk (Videos)\nDespite sacrificing thousands of troops to defend Pokrovsk in the Donetsk direction, Kiev forces continue to lose one position after another in the key city and nearby. A similar slow collapse is also taking place in the direction of Dnepropetrovsk.\nOn October 15, the Russian Ministry of Defense announced that the Tsentr [Center] Group of Forces had taken over Novopavlovka, located right to the south of Porkovsk.\nKiev forces took another blow in Dnepropetrovsk, with the Russian MoD announcing the capture of Alekseyevka by the Vostok [East] Group of Forces.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422954Z"
    },
    {
      "original": "With Thousands Of Troops Dead, Ukraine Is Losing Battles In Pokrovsk And Dnepropetrovsk (Videos)\nDespite sacrificing thousands of troops to defend Pokrovsk in the Donetsk direction, Kiev forces continue to lose one position after another in the key city and nearby. A similar slow collapse is also taking place in the direction of Dnepropetrovsk.\nOn October 15, the Russian Ministry of Defense announced that the Tsentr [Center] Group of Forces had taken over Novopavlovka, located right to the south of Porkovsk.\nKiev forces took another blow in Dnepropetrovsk, with the Russian MoD announcing the capture of Alekseyevka by the Vostok [East] Group of Forces.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422963Z"
    },
    {
      "original": "WINTER IS COMING: KYIV BLACKOUTS LOOM AS RUSSIA TIGHTENS THE GRIP ON THE FRONTLINES",
      "timestamp": "2025-10-16T11:29:03.422967Z"
    },
    {
      "original": "The Break Is Over: Russian Troops Back On The Offensive In Kramatorsk\nRussian forces have taken control of the Novopavlovka settlement on the Pokrovsk axis. The 36th Separate Guards Motorised Rifle Brigade has captured Alekseevka. Russian units have resumed offensive operations in the Kramatorsk area.\nSlovak Prime Minister Robert Fico has demanded that the European Union shift its focus from Ukraine to the EU's internal economic problems.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422974Z"
    },
    {
      "original": "The Break Is Over: Russian Troops Back On The Offensive In Kramatorsk\nRussian forces have taken control of the Novopavlovka settlement on the Pokrovsk axis. The 36th Separate Guards Motorised Rifle Brigade has captured Alekseevka. Russian units have resumed offensive operations in the Kramatorsk area.\nSlovak Prime Minister Robert Fico has demanded that the European Union shift its focus from Ukraine to the EU's internal economic problems.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.422981Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From October 15, 2025\nOn October 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-16T11:29:03.422988Z"
    },
    {
      "original": "Heavy Airstrikes: Summary Of Russian Combat Footage From October 15, 2025\nOn October 15, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-16T11:29:03.422995Z"
    },
    {
      "original": "Deals On Bases, Arms & Infrastructure Reported After Syria’s Sharaa First Visit To Russia\nMoscow has always been guided by the Syrian people’s interests in its relations with Damascus, Russian President Vladimir Putin said while meeting with Syria's Interim President Ahmed al-Sharaa for the first time on October 15.\nThe meeting came close to a year after rebels led by Sharaa overthrew former Syrian President Bashar al-Assad. It came amid reports suggesting that the two sides may be close to a deal on the fate of Russian bases in Syria and other important matters.\nRead more \nHERE",
      "timestamp": "2025-10-16T11:29:03.423003Z"
    },
    {
      "original": "Is NATO Really '25 Times Bigger And Infinitely Superior To The Russian Military'?\nOn October 13, NATO Secretary General Mark Rutte visited Ljubljana, Slovenia, for the 71st Annual Session of the NATO Parliamentary Assembly. Among many of his statements was one that has long been part of the political West's propaganda discourse. Namely, he talked about the Russian economy and its military, claiming that NATO member states are supposedly \"25 times bigger than the Russian economy\" and \"infinitely superior\" in terms of military power. \nInterestingly, he used the example of Russian MiG-31 interceptors as the alleged \"proof\" of the mythical Western \"superiority\", insisting that these jets \"cannot even stand in our shadow\", supposedly due to \"their not well-trained fighter pilots\".\n\"We are 25 times bigger than the Russian economy. Our military is infinitely superior to the military, to the Russian military, when it comes to our air force... \"\n👉\n Read more \nHERE",
      "timestamp": "2025-10-16T11:29:03.423012Z"
    }
  ],
  "script_run_time": "2025-10-16T11:29:03.423770Z"
}