{
  "messages": [
    {
      "original": "🚀\nПуски КАБ на Херсонщину.",
      "timestamp": "2025-09-29T07:29:04.892204Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Харківський  район), курс західний.",
      "timestamp": "2025-09-29T07:29:04.892222Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині, курс на Кіровоградщину ( Олександрійський район)",
      "timestamp": "2025-09-29T07:29:04.892228Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини, курс південно-західний.",
      "timestamp": "2025-09-29T07:29:04.892234Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Кам'янський  район), курс західний.",
      "timestamp": "2025-09-29T07:29:04.892238Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Синельниківський  район), курс північно-західний.",
      "timestamp": "2025-09-29T07:29:04.892243Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-09-29T07:29:04.892249Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку!",
      "timestamp": "2025-09-29T07:29:04.892256Z"
    },
    {
      "original": "🛵\n БпЛА на  Чернігівщині (Новгород-Сіверський,Корюківський,Ніжинський р-ни), курс південно-західний.",
      "timestamp": "2025-09-29T07:29:04.892261Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-09-29T07:29:04.892265Z"
    },
    {
      "original": "🛵\n БпЛА на  Чернігівщині, курс на Сумщину (Конотопський район)",
      "timestamp": "2025-09-29T07:29:04.892270Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Павлоградський район), курс північно-західний.",
      "timestamp": "2025-09-29T07:29:04.892275Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині (Ізюмський  район), курс південно-західний.",
      "timestamp": "2025-09-29T07:29:04.892279Z"
    },
    {
      "original": "🛵\n Сумщина: БпЛА  в районі Конотопу, курс на південь.",
      "timestamp": "2025-09-29T07:29:04.892283Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Синельниківський  район), курс південний.",
      "timestamp": "2025-09-29T07:29:04.892288Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 23 ВОРОЖІ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 29 вересня (із 20.00 28 вересня) противник атакував 32-ма ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків: Брянськ, Орел, Приморсько-Ахтарськ – рф., близько 20 із них – шахеди.\nПовітряний напад відбивали авіація, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 23 ворожі БпЛА типу Shahed, Гербера і дрони інших типів на півночі та сході країни.\nЗафіксовано влучання 9 ударних БпЛА на 8 локаціях.\nАтака триває – на півночі та сході нові групи ударних БпЛА. Дотримуйтесь заходів безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-09-29T07:29:04.892320Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку!",
      "timestamp": "2025-09-29T07:29:04.892331Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину та Дніпропетровщину.",
      "timestamp": "2025-09-29T07:29:04.892339Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному напрямку!",
      "timestamp": "2025-09-29T07:29:04.892352Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-09-29T07:29:04.892359Z"
    },
    {
      "original": "At least 6 Ukrainian HIMARS rockets impacted the main power plant in Belgorod. Power outages were reported across Belgorod city and the surrounding areas. Media 1 shows the HIMARS rockets being launched from within Kharkiv City.",
      "timestamp": "2025-09-29T07:29:05.483726Z"
    },
    {
      "original": "At least 6 Ukrainian HIMARS rockets impacted the main power plant in Belgorod. Power outages were reported across Belgorod city and the surrounding areas. Media 1 shows the HIMARS rockets being launched from within Kharkiv City.",
      "timestamp": "2025-09-29T07:29:05.483740Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment. \nThe fires pictured are in the plant's workshops. \nCoordinates: 53.127038, 35.008618",
      "timestamp": "2025-09-29T07:29:05.483746Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment. \nThe fires pictured are in the plant's workshops. \nCoordinates: 53.127038, 35.008618",
      "timestamp": "2025-09-29T07:29:05.483752Z"
    },
    {
      "original": "Last night, Ukrainian ATACMS ballistic missiles struck the Karachevsky plant in the city of Karachev, Bryansk Oblast. It specialises in production of electrical connectors, cable products, electro-technical components, and electronic warfare equipment.   The…",
      "timestamp": "2025-09-29T07:29:05.483756Z"
    },
    {
      "original": "Following the Ukrainian ATACMS ballistic missile strikes on Bryansk Oblast, U.S. Special Envoy to Ukraine Keith Kellogg confirmed that Trump has authorised Ukraine to carry out long-range strikes into Russia. \nLast year, after winning the election, Trump called Biden's decision to allow long-range strikes using western weaponry \"stupid\" and a \"mistake\".",
      "timestamp": "2025-09-29T07:29:05.483760Z"
    },
    {
      "original": "HIMARS launches from western Kharkiv Oblast into Belgorod.",
      "timestamp": "2025-09-29T07:29:05.483764Z"
    },
    {
      "original": "Threat of Storm Shadow cruise missile launches for Zaporizhzhia, Voronezh, Donetsk, Luhansk, Kherson, Rostov, eastern Crimea, and Krasnodar Krai. The Kerch Bridge has been temporarily closed. Ukrainian tactical aircraft are flying near their launch lines.",
      "timestamp": "2025-09-29T07:29:05.483772Z"
    },
    {
      "original": "They may have received a new batch of HIMARS GMLRS and ATACMS missiles",
      "timestamp": "2025-09-29T07:29:05.483776Z"
    },
    {
      "original": "They may have received a new batch of HIMARS GMLRS and ATACMS missiles",
      "timestamp": "2025-09-29T07:29:05.483779Z"
    },
    {
      "original": "Absolutely",
      "timestamp": "2025-09-29T07:29:05.483783Z"
    },
    {
      "original": "They likely waited for the next big Russian missile attack to launch them after in \"retaliation\".",
      "timestamp": "2025-09-29T07:29:05.483786Z"
    },
    {
      "original": "Reflections:\nA year ago, Israel assassinated Hezbollah leader Sayyed Hassan Nasrallah (along with several civilians), dealing a brutal blow to the organisation after several setbacks in military and intelligence operations.\nThe Syrian resistance commemorated the anniversary of his martyrdom, emphasising Hezbollah's work in its fight against the Zionist entity over the years, highlighting Israel's defeat in southern Lebanon at the beginning of the 20th century.\nNasrallah's death marked a turning point in the power of Hezbollah and Iran in Lebanon. A few months later, the fall of the previous Syrian political regime made this setback even more visible. Hezbollah is currently undergoing a process of reconstruction, facing external and internal pressures to the point of displaying a passive attitude towards the Syrian terrorist authorities, something that would have been unthinkable ten years ago.\nThe Syrian resistance is now seeking to take over from Hezbollah as the main opposition to the state of Israel in the Levant, emphasising solidarity with the Palestinian cause and normalisation with Jolani, who has been Syria's main enemy in recent decades.\nHowever, I believe that this position is neither correct nor favourable for a successful movement in Syria. The regional situation has changed completely. December 2024 marked the end of any Arab nationalist project and the Arab League's complete passivity towards Israel prevailed, leaving Iran as the as the only state opposing Tel Aviv. The tragic events we have witnessed in Syria in recent months have completely fractured Syrian society along identity lines, leading to the proliferation of self-determination movements on the coast & Suwayda (concretely here when under the previous political regime the Druze sought only more autonomy) with the aim of freeing themselves from the yoke of those who seek to eradicate them on sectarian grounds.\nThe only solution that could solve the problem (if there is a solution) is the creation of a Syrian (not Arab) civic nationalist movement capable of uniting the different confessions under a single identity. The priority of the Syrian resistance should be to continue liberating the country from terrorist groups and not to embark on external ventures such as Palestine, whose future unfortunately seems doomed.\nIn other words, the Syrian resistance should take as its model the liberation of southern Lebanon in 2000 & the liberation of Mount Hermon in 1973 & not the liberation of al-Quds nor the creation of a new Sunni of Shia axis. Nothing beyond Lake Tiberias should be a priority.",
      "timestamp": "2025-09-29T07:29:05.483794Z"
    },
    {
      "original": "Threat of Storm Shadow cruise missile launches for Zaporizhzhia, Voronezh, Donetsk, Luhansk, Kherson, Rostov, eastern Crimea, and Krasnodar Krai. The Kerch Bridge has been temporarily closed. Ukrainian tactical aircraft are flying near their launch lines.",
      "timestamp": "2025-09-29T07:29:05.483797Z"
    },
    {
      "original": "The Ukrainian aircraft flew away from the launch zones without launching anything.",
      "timestamp": "2025-09-29T07:29:05.483801Z"
    },
    {
      "original": "One of the only people I know of who is truly committed to free-speech, not just free speech from people on the same side as you (which is what most people from the left and right do).",
      "timestamp": "2025-09-29T07:29:05.483804Z"
    },
    {
      "original": "Deepstate confirms Russian control over parts of Pokrovsk for the first time ever. \nAs of now, my map shows that around 11.3% of Pokrovsk is under Russian control, however their presence goes further than that.",
      "timestamp": "2025-09-29T07:29:05.483808Z"
    },
    {
      "original": "Deepstate confirms Russian control over parts of Pokrovsk for the first time ever.   As of now, my map shows that around 11.3% of Pokrovsk is under Russian control, however their presence goes further than that.",
      "timestamp": "2025-09-29T07:29:05.483811Z"
    },
    {
      "original": "I present to you: Deepstate's spiky front. \nA true work of art.",
      "timestamp": "2025-09-29T07:29:05.483817Z"
    },
    {
      "original": "Russian forces have captured the village of Serebryanka, northern flank of Siversk, Donetsk Oblast.\nPre-war population: ~1,110.\nTotal land area: ~3.57 km²",
      "timestamp": "2025-09-29T07:29:05.483822Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-29T07:29:05.483826Z"
    },
    {
      "original": "Debris from a downed Ukrainian-produced Hrim-2 \"Sapsan\" ballistic missile was discovered for the first time ever in Russian-controlled Kherson Oblast.",
      "timestamp": "2025-09-29T07:29:05.483829Z"
    }
  ],
  "script_run_time": "2025-09-29T07:29:05.886237Z"
}