{
  "messages": [
    {
      "original": "🛵\n🛸\n Ворожий БпЛА з півночі курсом на Чернігів.",
      "timestamp": "2025-10-27T23:29:49.769465Z"
    },
    {
      "original": "🛵\nГрупа БпЛА на півночі Харківщини, курсом на Богодухів.",
      "timestamp": "2025-10-27T23:29:49.769480Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині курсом на Диканьку.",
      "timestamp": "2025-10-27T23:29:49.769486Z"
    },
    {
      "original": "🛵\n Полтава - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-27T23:29:49.769491Z"
    },
    {
      "original": "🛵\n БпЛА на Харківщині курсом на Златопіль.",
      "timestamp": "2025-10-27T23:29:49.769495Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Чернігів.\n🛵\n БпЛА на Харківщині курсом на Дніпропетровщину (Павлоградський район).\n🛵\n БпЛА на Сумщині курсом на Лебедин.",
      "timestamp": "2025-10-27T23:29:49.769504Z"
    },
    {
      "original": "Ракетна небезпека по всій території України! \nЗліт МіГ-31К.",
      "timestamp": "2025-10-27T23:29:49.769508Z"
    },
    {
      "original": "Ракетна небезпека по всій території України!  Зліт МіГ-31К.",
      "timestamp": "2025-10-27T23:29:49.769511Z"
    },
    {
      "original": "📢\n Відбій загрози по МіГ-31К.",
      "timestamp": "2025-10-27T23:29:49.769516Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Дніпропетровщини курсом на Донеччину.",
      "timestamp": "2025-10-27T23:29:49.769520Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини у південно-західному напрямку.",
      "timestamp": "2025-10-27T23:29:49.769525Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА у напрямку міста!",
      "timestamp": "2025-10-27T23:29:49.769529Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-27T23:29:49.769533Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-27T23:29:49.769538Z"
    },
    {
      "original": "🛵\nБпЛА курсом на Чернігів.",
      "timestamp": "2025-10-27T23:29:49.769542Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-27T23:29:49.769546Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині курсом на Новгород-Сіверський.",
      "timestamp": "2025-10-27T23:29:49.769550Z"
    },
    {
      "original": "🛵\nЧернігів - БпЛА зі сходу у напрямку міста!",
      "timestamp": "2025-10-27T23:29:49.769554Z"
    },
    {
      "original": "🚀\nДніпропетровська, Запорізька області - ракетна небезпека!",
      "timestamp": "2025-10-27T23:29:49.769559Z"
    },
    {
      "original": "🚀\nДніпропетровська, Запорізька області - ракетна небезпека!",
      "timestamp": "2025-10-27T23:29:49.769562Z"
    },
    {
      "original": "📢\n Відбій загрози.",
      "timestamp": "2025-10-27T23:29:49.769567Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Чернігів.",
      "timestamp": "2025-10-27T23:29:49.769571Z"
    },
    {
      "original": "Russia has now added thunderstorms to their arsenal of weapons, and is using lightning to strike Ukrainian energy infrastructure in Kryvyi Rih.",
      "timestamp": "2025-10-27T23:29:50.340286Z"
    },
    {
      "original": "For those wondering, there are no standard signs of a missile attack tonight. Gerans will just do their usual thing.",
      "timestamp": "2025-10-27T23:29:50.340301Z"
    },
    {
      "original": "It seems the Russians have once again changed tactics when preparing their attacks - at least for now. This, plus the possible usage of Tu-22m3s in the next attack makes predicting it a bit more complicated.\nAlso, it's worth noting, on November 1 Russia will switch to their winter frequencies for combat operations involving Tu-95MS and Tu-160 strategic bombers, although hopefully this shouldn't impact the ability to track movements too much.",
      "timestamp": "2025-10-27T23:29:50.340307Z"
    },
    {
      "original": "Mobile fire crews have been deployed to the Kremlin due to the threat of UAVs for Moscow.",
      "timestamp": "2025-10-27T23:29:50.340310Z"
    },
    {
      "original": "All airports in Moscow have been temporarily closed due to the threat of UAVs. Su-34, Su-35, MiG-29, Tu-160, and Tu-95MS aircraft have been evacuated and are currently airborne, waiting for the threat to be over.",
      "timestamp": "2025-10-27T23:29:50.340313Z"
    },
    {
      "original": "Tu-95MS and Tu-160s are now being evacuated from Engels-2 Airbase, Saratov Oblast, due to the threat of UAVs for the region.",
      "timestamp": "2025-10-27T23:29:50.340317Z"
    },
    {
      "original": "After Ukrainian HIMARS rockets and Darts drones struck the Belgorod Reservoir Dam, the spillway has begun letting water out of the reservoir, leading to a significant reduction in the water level.",
      "timestamp": "2025-10-27T23:29:50.340320Z"
    },
    {
      "original": "Water continues to rush from the Belgorod Reservoir Dam following the Ukrainian strikes, and is flooding the surrounding areas.",
      "timestamp": "2025-10-27T23:29:50.340323Z"
    },
    {
      "original": "Large numbers of Ukrainian UAVs continue to be shot down across western Russia, including in Moscow Oblast. It seems Russia was ready for this attack due to yesterday's attempts to strike the capital. \nThere are still no confirmed impacts. The fire seen burning in Moscow is from a forest fire caused by downed drone debris and the small fire at the oil depot is unrelated to the attack. The explosions heard over Moscow have been from air defence operations.",
      "timestamp": "2025-10-27T23:29:50.340327Z"
    },
    {
      "original": "Information from the ground.\nRussian forces are operating in the Freight terminals in Lyman\nEdit* 'This has effectively cut off the loop around the town'",
      "timestamp": "2025-10-27T23:29:50.340334Z"
    },
    {
      "original": "Large numbers of Ukrainian UAVs continue to be shot down across western Russia, including in Moscow Oblast. It seems Russia was ready for this attack due to yesterday's attempts to strike the capital.   There are still no confirmed impacts. The fire seen burning…",
      "timestamp": "2025-10-27T23:29:50.340339Z"
    },
    {
      "original": "These are the approximate flight routes of the hundreds of Ukrainian UAVs that have attacked/are attacking Russia tonight. \nUAVs were launched from Dnipropetrovsk, Poltava, Donetsk, Sumy, Kharkiv, Chernihiv, and Kyiv Oblasts. There are still no confirmed impacts, despite the massive numbers of drones used.",
      "timestamp": "2025-10-27T23:29:50.340344Z"
    },
    {
      "original": "These are the approximate flight routes of the hundreds of Ukrainian UAVs that have attacked/are attacking Russia tonight.   UAVs were launched from Dnipropetrovsk, Poltava, Donetsk, Sumy, Kharkiv, Chernihiv, and Kyiv Oblasts. There are still no confirmed…",
      "timestamp": "2025-10-27T23:29:50.340347Z"
    },
    {
      "original": "There are also unconfirmed reports of Ukrainian Flamingo cruise missiles being shot down over Oryol Oblast, but take that with a grain of salt for now.",
      "timestamp": "2025-10-27T23:29:50.340351Z"
    },
    {
      "original": "Around 98% of Ukrainian long-range UAVs get shot down by Russian air defence / EW. Ukraine often launches hundreds at a time just for a couple to get through.   The drones that do get through (usually only 1 or 2 each day), and that hit refineries do minor…",
      "timestamp": "2025-10-27T23:29:50.340354Z"
    },
    {
      "original": "Yesterday, Ukraine launched more than 150 UAVs at Moscow and other Russian regions. Every single drone was intercepted by Russian air defence or electronic warfare.\nThis is what I mean when I talk about a \"98% interception rate\".",
      "timestamp": "2025-10-27T23:29:50.340358Z"
    },
    {
      "original": "Russian VKS-affiliated channel Fighterbomber reports the loss of a Russian Ka-52 attack helicopter and its two crew members. The details of the crash are currently unknown.",
      "timestamp": "2025-10-27T23:29:50.340361Z"
    },
    {
      "original": "The Ukrainian SOF published footage showing FP-2 drone strikes on a fuel depot used by the Russian Armed Forces in Starobilsk, Luhansk Oblast, as well as an oil base in Luhansk City. \nFuel depot \ncoordinates\n: 49.290321, 38.926589\nOil base \ncoordinates\n: 48.5121694, 39.3129035",
      "timestamp": "2025-10-27T23:29:50.340368Z"
    },
    {
      "original": "Russia has attempted a fourth large-scale mechanised assault on the Shakhove salient in the Dobropillya direction.\n6 groups of 4-5 vehicles advanced down separate routes, attempting to complicate Ukrainian attempts at repelling it with drones and artillery. This proved more successful than previous tactics, as only around half of the equipment was damaged or destroyed this time. Additionally, poorer weather conditions provided some level of cover for them.  \nRussian infantry was able to dismount in several areas, and the Ukrainians are attempting to clear them with drones and small assault groups. The levels of success from this attack will become clearer in the coming days.",
      "timestamp": "2025-10-27T23:29:50.340373Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Moscow Oblast for the third night in a row. Airports have once again begun to close, with strategic bombers and tactical aircraft being evacuated.",
      "timestamp": "2025-10-27T23:29:50.340376Z"
    },
    {
      "original": "Ukrainian UAVs are flying to Moscow Oblast for the third night in a row. Airports have once again begun to close, with strategic bombers and tactical aircraft being evacuated.",
      "timestamp": "2025-10-27T23:29:50.340379Z"
    },
    {
      "original": "By the way, I think I should mention that when Russia carries out its next large-scale, combined missile attack on Ukraine this week, it is not in response to Ukraine's drone attacks on Moscow.\nRussian preparations for this attack were delayed due to their scheduled nuclear exercises. But the attack date is largely set in stone and was planned well in advance of Ukraine beginning their attacks. Russia doesn't really do \"retaliatory strikes\". \nThe individual Iskander-M strikes are usually opportunistic, targeting something which has just been discovered, while the larger, more coordinated attacks are planned beforehand, targeting static targets such as Ukraine's energy infrastructure, their military-industrial complex, and airfields.",
      "timestamp": "2025-10-27T23:29:50.340383Z"
    },
    {
      "original": "🇸🇩\n❌\n🇸🇩\n — NEW: \nThe Sudanese Armed Forces have declared a nationwide general mobilization of all men after the fall of El Fasher, announcing training and arming camps to defend the country against the Rapid Support Forces.\n@TabZLIVE",
      "timestamp": "2025-10-27T23:29:50.340393Z"
    },
    {
      "original": "🇸🇩\n❌\n🇸🇩\n — NEW: The Sudanese Armed Forces have declared a nationwide general mobilization of all men after the fall of El Fasher, announcing training and arming camps to defend the country against the Rapid Support Forces.  @TabZLIVE",
      "timestamp": "2025-10-27T23:29:50.340399Z"
    },
    {
      "original": "Take notes Ukraine",
      "timestamp": "2025-10-27T23:29:50.340402Z"
    },
    {
      "original": "Ukrainian channel on Ukraine's recent counterattacks in the Dobropillya direction.",
      "timestamp": "2025-10-27T23:29:50.340405Z"
    },
    {
      "original": "Military Situation In Ukraine On October 27, 2025 (Maps Update)",
      "timestamp": "2025-10-27T23:29:50.926320Z"
    },
    {
      "original": "Military Situation In Ukraine On October 27, 2025 (Maps Update)",
      "timestamp": "2025-10-27T23:29:50.926335Z"
    },
    {
      "original": "There's More Than Meets The Eye: The TRC-Criminal Nexus - A Dual Threat To Ukrainian Civilians\nCriminal elements have infiltrated the Ukrainian mobilisation system. Representatives of the untouchable caste are blackmailing, extorting, beating and murdering peaceful Ukrainian citizens. The risk of ending up on the front line and dying has increased, creating new challenges.\nFor the first time, the Ukrainian Parliament has begun to acknowledge the scale and nature of the problem. Yuriy Kamelchuk, a Member of Parliament, stated outright that no video recording is made in 99% of cases of aggressive actions by TRC representatives against citizens.\nThe situation is exacerbated by rampant crime committed under the guise of official structures. The Member of Parliament notes individuals posing as TRC employees.\nThese organised criminals, he says, stuff people into minibuses and extort ransoms, taking advantage of the general chaos of mobilisation.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926348Z"
    },
    {
      "original": "There's More Than Meets The Eye: The TRC-Criminal Nexus - A Dual Threat To Ukrainian Civilians\nCriminal elements have infiltrated the Ukrainian mobilisation system. Representatives of the untouchable caste are blackmailing, extorting, beating and murdering peaceful Ukrainian citizens. The risk of ending up on the front line and dying has increased, creating new challenges.\nFor the first time, the Ukrainian Parliament has begun to acknowledge the scale and nature of the problem. Yuriy Kamelchuk, a Member of Parliament, stated outright that no video recording is made in 99% of cases of aggressive actions by TRC representatives against citizens.\nThe situation is exacerbated by rampant crime committed under the guise of official structures. The Member of Parliament notes individuals posing as TRC employees.\nThese organised criminals, he says, stuff people into minibuses and extort ransoms, taking advantage of the general chaos of mobilisation.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926358Z"
    },
    {
      "original": "Al-Suwayda Druze Leader Demands ‘Independence’ From Syria, Laying Ground For Israeli Invasion\nThe spiritual leader of the Druze community in Syria, Hikmat al-Hajri, said on October 27 that self-determination for the people of al-Suwayda is “an absolute right that cannot be revoked”, stressing that his vision is based on the “complete independence” of the governorate.\nDruze armed factions backed the Islamist rebel offensive that overthrew the regime of former President Bashar al-Assad last December, but later refused to allow the forces of the country’s new Islamist-led Interim Government to enter al-Suwayda, maintaining a form of autonomy over the governorate.\nIn July a battle broke out in al-Suwayda, when an intervention by government forces to end a local conflict involving bedouins quickly escalated into an all-out, sectarian-fueled attack on the Druze. Israel, which vowed to protect the community after the fall of the Assad regime, eventually intervened...\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926367Z"
    },
    {
      "original": "In Video: New Russian Automated Gun Takes Down Ukrainian Drones\nThe Russian military began fielding a deeply modernized drone hunter version of the ZU-23-2 23 mm twin-barreled autocannon, which was developed by the Soviet Union in the 1950s.\nOn October 27, video footage of one such autocannon engaging several Ukrainian long-range, fixed-wing drones surfaced online. It is unclear when or where exactly the footage was taken, but it clearly shows the autocannon taking down at least four drones.\nThe autocannon is likely based on the same system shown to Dmitry Medvedev, Deputy Chairman of the Security Council of Russia, during his recent visit to the Kapustin Yar test site.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926377Z"
    },
    {
      "original": "INTENSITY PEAKS ON KEY FRONTS AS KHARKIV CRISIS THREAT GROWS",
      "timestamp": "2025-10-27T23:29:50.926380Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine’s Energy And Transport Sectors, While The EU Faces Challenges In Supporting Kyiv\nIn recent days, Russia and Ukraine have continued exchanging strikes, targeting each other's key infrastructure. The Russian armed forces have concentrated their primary efforts on Ukraine's energy facilities, including wind farms, as well as transport infrastructure—specifically, railway trains used for transporting military equipment and weapons to the front lines. In turn, Ukraine once again targeted a dam in the Belgorod region and carried out a drone raid on Moscow.\nThe use of new types of glide bombs with record-breaking range for this class of munition by Russian aviation has sharply increased the destructive force of massive air raids on rear-area targets and placed an additional burden on Ukraine's already depleted forces. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926388Z"
    },
    {
      "original": "Russia Continues Strikes On Ukraine’s Energy And Transport Sectors, While The EU Faces Challenges In Supporting Kyiv\nIn recent days, Russia and Ukraine have continued exchanging strikes, targeting each other's key infrastructure. The Russian armed forces have concentrated their primary efforts on Ukraine's energy facilities, including wind farms, as well as transport infrastructure—specifically, railway trains used for transporting military equipment and weapons to the front lines. In turn, Ukraine once again targeted a dam in the Belgorod region and carried out a drone raid on Moscow.\nThe use of new types of glide bombs with record-breaking range for this class of munition by Russian aviation has sharply increased the destructive force of massive air raids on rear-area targets and placed an additional burden on Ukraine's already depleted forces. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926397Z"
    },
    {
      "original": "Ukraine Faces Failure In Zaporizhzhia: Clearing Operations Along Yangchur River Near Completion\nUkrainian special operations units have been urgently redeployed to Pokrovsk. They are now approximately 3 kilometers from reaching the key Pokrovsk-Huliaipole highway. Control of the Privolnoye and Novonikolayevka settlements in the Zaporizhzhia sector has been established. \nMeanwhile, Polish President Karol Nawrocki has declined an invitation to visit Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926404Z"
    },
    {
      "original": "Ukraine Faces Failure In Zaporizhzhia: Clearing Operations Along Yangchur River Near Completion\nUkrainian special operations units have been urgently redeployed to Pokrovsk. They are now approximately 3 kilometers from reaching the key Pokrovsk-Huliaipole highway. Control of the Privolnoye and Novonikolayevka settlements in the Zaporizhzhia sector has been established. \nMeanwhile, Polish President Karol Nawrocki has declined an invitation to visit Ukraine.\nRead more \nHERE",
      "timestamp": "2025-10-27T23:29:50.926411Z"
    }
  ],
  "script_run_time": "2025-10-27T23:29:50.927248Z"
}