{
  "messages": [
    {
      "original": "🛵\n Суми - БпЛА на околицях міста в південному напрямку.",
      "timestamp": "2025-12-13T13:04:24.547907Z"
    },
    {
      "original": "🛵\n Дніпропетровщина - група БпЛА курсом на Синельникове, Славгород з півночі.",
      "timestamp": "2025-12-13T13:04:24.547926Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з південно-східного напрямку.",
      "timestamp": "2025-12-13T13:04:24.547933Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-13T13:04:24.547938Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на сході.",
      "timestamp": "2025-12-13T13:04:24.547944Z"
    },
    {
      "original": "🛵\n БпЛА на Сумщині в західному напрямку.\n🛵\n БпЛА на півночі Чернігівщини - курсом на південь.",
      "timestamp": "2025-12-13T13:04:24.547952Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-12-13T13:04:24.547957Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Миколаївщині, східніше обласного центру",
      "timestamp": "2025-12-13T13:04:24.547963Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Дніпропетровщині \n➡️\n курсом на Запоріжжя через н.п. Письменне.",
      "timestamp": "2025-12-13T13:04:24.547970Z"
    },
    {
      "original": "🛵\n Група БпЛА на Сумщині \n➡️\n курсом на Полтавщину.\n🛵\n Група БпЛА на Чернігівщині  \n➡️\n в південному напрямку.",
      "timestamp": "2025-12-13T13:04:24.547981Z"
    },
    {
      "original": "🛵\n Група БпЛА на півночі Чернігівщини  \n➡️\n в південному напрямку.\n🛵\n Група БпЛА на півдні Чернігівщині  \n➡️\n на Полтавщину.",
      "timestamp": "2025-12-13T13:04:24.547991Z"
    },
    {
      "original": "🛫\n Активність ворожої тактичної авіації на сході.",
      "timestamp": "2025-12-13T13:04:24.547996Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі.",
      "timestamp": "2025-12-13T13:04:24.548004Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-12-13T13:04:24.548009Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 430 ЦІЛЕЙ ПРОТИВНИКА\n \nУ ніч на 13 грудня (з 18:00 12 грудня) противник завдав чергового комбінованого удару по об'єктах критичної інфраструктури України із застосуванням ударних БпЛА, ракет повітряного, морського та наземного базування.\n❗️\nОсновний напрямок удару – Одещина.\nЗагалом радіотехнічними військами Повітряних Сил виявлено та здійснено супровід 495-ти засобів повітряного нападу – 30 ракет різних типів та 465 БпЛА різних типів. Серед них:\n- 465 ударних БпЛА типу Shahed, Гербера (безпілотники інших типів) із напрямків Курськ, Орел, Міллерово, Шаталово, Приморсько-Ахтарськ – рф, Чауда, Гвардійське – ТОТ АР Крим (близько 270 із них – «шахеди»);\n- 4 аеробалістичні ракети Х-47М2 «Кинджал» (райони пусків - Тульська, Тамбовська обл. – рф);\n- 5 балістичних ракет Іскандер-М/KN-23 (район пусків - ТОТ АР Крим);\n- 5 крилатих ракет Іскандер-К (район пуску – Курська область, рф);\n- 16 крилатих ракет Калібр (райони пусків – акваторії Чорного та Каспійського морів).\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n \n💥\nЗа попередніми даними, станом на 12.00, протиповітряною обороною збито/подавлено 430 повітряних цілей:\n- 417 ворожих БпЛА типу Shahed, Гербера (безпілотників інших типів);\n- 4 крилаті ракети Іскандер-К;\n- 9 крилатих ракет Калібр.\nЗафіксовано влучання 8 ракет та 33 ударних БпЛА на 18-ти локаціях, падіння збитих (уламки) – на 3 локаціях. Крім того, шість ракет не досягли цілей (місця падіння уточнюються).\n \n✊\n Тримаймо небо!\n \n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-12-13T13:04:24.548032Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Харків з півночі.",
      "timestamp": "2025-12-13T13:04:24.548036Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-12-13T13:04:24.548040Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Миколаївщину з Херсонщини.",
      "timestamp": "2025-12-13T13:04:24.548045Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА на Чернігівщині курсом на н.п. Прилуки.",
      "timestamp": "2025-12-13T13:04:24.548049Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщину з Сумщини.",
      "timestamp": "2025-12-13T13:04:24.548053Z"
    },
    {
      "original": "Clear footage showing the moment of a Russian Geran-2 drone strike on a cargo ship stationed at Odesa Port this evening.",
      "timestamp": "2025-12-13T13:04:25.380057Z"
    },
    {
      "original": "Clear footage showing the moment of a Russian Geran-2 drone strike on a cargo ship stationed at Odesa Port this evening.",
      "timestamp": "2025-12-13T13:04:25.380068Z"
    },
    {
      "original": "Aftermath of this strike",
      "timestamp": "2025-12-13T13:04:25.380073Z"
    },
    {
      "original": "Aftermath of this strike",
      "timestamp": "2025-12-13T13:04:25.380077Z"
    },
    {
      "original": "As a result of the combined strike on Odesa, Mykolaiv, and Kirovohrad Oblasts, emergency power outages have been introduced on top of the rolling blackouts. \nMany important power facilities have been switched to backup generators while work is underway to repair the damage. Power has returned to most of Odesa City for the time being.",
      "timestamp": "2025-12-13T13:04:25.380082Z"
    },
    {
      "original": "Scenes from Mykolaiv City, which was targeted by Russian Iskander-K cruise missiles and Geran-2 drones. \nA fire can be seen burning at an unknown facility - possibly the combined heat and power plant.",
      "timestamp": "2025-12-13T13:04:25.380087Z"
    },
    {
      "original": "Scenes from Mykolaiv City, which was targeted by Russian Iskander-K cruise missiles and Geran-2 drones. \nA fire can be seen burning at an unknown facility - possibly the combined heat and power plant.",
      "timestamp": "2025-12-13T13:04:25.380102Z"
    },
    {
      "original": "Russian forces have captured the city of Siversk, Siversk direction, Donetsk Oblast.\nPre-war population: ~12,400.\nTotal land area: ~9.64 km².\nThe most recent fighting for Siversk lasted approximately 25 days, with the main part of the battle lasting just ~8 days.",
      "timestamp": "2025-12-13T13:04:25.380109Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Pryluky, Chernihiv Oblast. Widespread power outages were reported in the area.\nCoordinates: 50.57656, 32.35493",
      "timestamp": "2025-12-13T13:04:25.380114Z"
    },
    {
      "original": "Consequences of Russian Geran-2 drone strikes on the 110 kV electrical substation in the city of Pryluky, Chernihiv Oblast. Widespread power outages were reported in the area.\nCoordinates: 50.57656, 32.35493",
      "timestamp": "2025-12-13T13:04:25.380118Z"
    },
    {
      "original": "Russian forces have captured the city of Siversk, Siversk direction, Donetsk Oblast.  Pre-war population: ~12,400. Total land area: ~9.64 km².  The most recent fighting for Siversk lasted approximately 25 days, with the main part of the battle lasting just…",
      "timestamp": "2025-12-13T13:04:25.380122Z"
    },
    {
      "original": "Siversk direction \n➡️\n Rai-Oleksandrivka direction",
      "timestamp": "2025-12-13T13:04:25.380128Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Radkivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~39.\nTotal land area: ~0.15 km².\nThe fighting for Radkivka lasted approximately 6 months, 15 days.",
      "timestamp": "2025-12-13T13:04:25.380133Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Kindrashivka, Kupyansk direction, Kharkiv Oblast.\nPre-war population: ~836.\nTotal land area: ~2.44 km².\nThe fighting for Kindrashivka lasted approximately 6 months, 20 days.",
      "timestamp": "2025-12-13T13:04:25.380139Z"
    },
    {
      "original": "In the Hulyaipole direction, Russian forces continued their assault operations and have broken through the main Ukrainian defences in Hulyaipole.\nAs a result of over a week of intense fighting, Russian forces managed to grind down the Ukrainian defences in the northeastern streets of the city, capturing the main fortified points there and reaching the Haichur River. They expanded to the streets to the northwest and southeast, and managed to cross the river via the destroyed road bridge, establishing a foothold in the city centre in the court buildings, auto repair shop, and towards the city hospital complex. \nIn the eastern part of Hulyaipole, Russian forces finally managed to consolidate in the easternmost streets and in the animal farms, and crossed the Haichur River from Krasna Street, linking up with assault groups from the east. From there, they pushed west along Velyka Street and Vrozhaina Street, reaching the local university. \nTo the northwest, Russian forces advanced down the treelines to the wastewater treatment plant and landfill, before pushing west and entering the northernmost streets of Hulyaipole. They were able to consolidate there and push the Ukrainians across the Haichur River. A number of Ukrainian formations are still present north of the river in the area of Naberezhna Street, however, but are surrounded on 3 sides.\nTo the north, Russian forces continued to incrementally advance towards Varvarivka and captured additional treeline positions on the western face of the tactical heights. \n+ ~19.58 km² in favour of Russia.",
      "timestamp": "2025-12-13T13:04:25.380147Z"
    },
    {
      "original": "Last night and this morning, another large-scale, combined Russian missile and drone attack was carried out on Ukraine.  Missiles launched:  ~8 Kalibr cruise missiles launched from 1 \"Buyan-M\" corvette in Novorossiysk Bay, Krasnodar Krai.   ~6 Iskander-M ballistic…",
      "timestamp": "2025-12-13T13:04:25.380150Z"
    },
    {
      "original": "Well, the numbers detected in this attack were indeed lower than reality.\n16 Kalibrs were used, not 8, and 5-6 Iskander-Ks were used, not 4.",
      "timestamp": "2025-12-13T13:04:25.380154Z"
    },
    {
      "original": "A Su-35 just launched a Kh-59 cruise missile at Zatoka, Oddesa Oblast.",
      "timestamp": "2025-12-13T13:04:25.380158Z"
    },
    {
      "original": "A Russian recon drone is operating just off the coast of Odesa Oblast.",
      "timestamp": "2025-12-13T13:04:25.380164Z"
    },
    {
      "original": "Where are the sirens in Odesa????",
      "timestamp": "2025-12-13T13:04:25.380167Z"
    },
    {
      "original": "It was a Kh-31P anti-radar missile. It disappeared on approach to Zatoka/Serhiivka.",
      "timestamp": "2025-12-13T13:04:25.380171Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to clear the besieged city of Myrnohrad, breaking through the last major Ukrainian defences there.\nIn the central part of Myrnohrad, Russian forces built on their success north of the Zapadny District and entered the high-rise buildings of the 40th District, quickly establishing full control over them, and beginning the battles for the 3-story-buildings. They also bypassed the 40th District from the west via the low-rise residential areas and are attempting to link up with assault groups in the northwestern streets of Myrnohrad.\nIn the northeastern part of Myrnohrad, Russian forces broke through to the terykon, captured the garage cooperatives, and linked up with assault groups in District 5-23, who cleared additional high-rise buildings and the fire station. As a result, a few dozen Ukrainian soldiers have been cut off from the main encirclement and are trapped in several apartment buildings in the Svetlyy District. Additionally, the Russians entered the city centre from the south and are clearing the first 3-story-buildings there. They also consolidated in the treeline and the terykon in the fields east of Myrnohrad\nIn the northern part of Myrnohrad, Russian forces continued to advance from the 8th District and captured a large residential area just east of the city centre, where they reached the paintball field. They also secured the low-rise residential area just west/northwest of the Svetlyy District.\nNorthwest of Myrnohrad, Russian forces consolidated in forests on either side of the railway line and entered the former Novator Mine from the west, which remains in the grey-zone.\nSouthwest of Myrnohrad, Russian forces continued to clear out isolated pockets of Ukrainian soldiers in the fields and consolidated in additional treeline positions there.\n+ ~9.83 km² in favour of Russia.",
      "timestamp": "2025-12-13T13:04:25.380179Z"
    },
    {
      "original": "Update from the Kupyansk direction: \nBoth Russian and Ukrainian forces are continuing their assault operations, each advancing on a different side of the Oskil River.\nIn the southwestern part of Kupyansk, Ukrainian forces continued their clearing operations and recaptured additional positions on Levadna and Dmytriyivska Streets and in the garage cooperative. They also recaptured the rest of the houses west of the Yuvileynyi high-rise micro-district and entered its southern apartment buildings as well as the boarding school. Other forces are now trying to bypass it from the north and enter another garage cooperative, in an attempt to encircle the remaining Russian soldiers in the northern high-rise buildings. \nIn the western part of Kupyansk, the Ukrainians continued to clear the residential blocks west of the railway line and reached the highway. Some assault groups are pushing further east towards the city centre, reaching the gymnasium and the furniture factory. They also managed to advance north from the grain elevators, entering the City Central Hospital and capturing additional positions in the blocks to the west, forcing the remaining Russian formations stations to the northwestern streets to withdraw to the city centre.\nIn the northwestern part of Kupyansk, following the Russian withdrawal, Ukrainian forces quickly established control over large parts of the residential areas there and are now attempting to clear the area of the bread factory and a number of nearby enterprises. Fighting is also ongoing for the \"Comb\" stronghold, which contains 19 high-rise buildings and several other smaller buildings. \nIn the northern part of Kupyansk, Ukrainian forces continued their assault operations and finally managed to consolidate on Michurina and Mechnikova Streets, thereby physically cutting all Russian ground supply into the western part of the city. Additionally, they were able to consolidate in new residential areas in and around Lenina Street and entered the city centre from the north where they are trying to clear the Spartak Stadium, School No. 6, and a number of surrounding apartment buildings.\nNorth of Kupyansk, Ukrainian forces captured the rest of the enterprises on the northern outskirts of the city and entered the nearby forests. Additionally, at some point recently, they re-established full control over the village of Radkivka.\nFurther north, Ukrainian forces consolidated in the western streets of Kindrashivka, which were already in the grey-zone. They then consolidated in the treelines north of Kindrashivka and entered the eastern part of the village, forcing the Russian formations stationed there to withdraw east and allowing for the settlement to be brought back under full Ukrainian control. From there, the Ukrainians began a push to the north, recapturing two large forests on either side of the R-79 Highway. \nEast of Kupyansk, over the last week, Russian forces have been carrying out a series of assault operations aimed at eliminating the Ukrainian presence northeast of Kupyansk. They were able to capture the remaining industrial buildings on the eastern edge of the city and began pushing through Ukrainian positions in the forests further east. As a result, the Russians entered the southwestern houses of Kucherivka and captured a large part of the settlement. \nThis forced the remaining Ukrainian formations to withdraw from Synkivka and the nearby areas, officially ending a nearly 2.5-year-long battle for this village, and allowing for the Russians to nearly fully secure the area north of the Hnylytsya River. Additionally, Russian forces managed to consolidate the remaining parts of northern Petropavlivka, while clearing operations continue in the northwestern houses where Ukrainian forces have withdrawn through from Synkivka. \n+ ~13.23 km² in favour of Ukraine.\n+ ~9.97 km² in favour of Russia.",
      "timestamp": "2025-12-13T13:04:25.380191Z"
    },
    {
      "original": "Russian Army Has Already Secured Third Of Huliaipole (Videos)\nOn December 12, the Russian military expanded its control in Huliaipole in Zaporozhye, securing at least a third of the key city.\nThe Vostok [East] Group of Forces stormed the eastern and northeastern parts of the city, taking control of Peschanya Street, after crossing the Haichur River a day earlier. Within 24 hours, Russian troops managed to reach the Specialized School at the city center after capturing large parts of Mira, Velyka and Urozhaina streets.\nCurrently 30% of Huliaipole is under Russian control. Around 2,4 square kilometers within the city have been captured, according to preliminary reports.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229918Z"
    },
    {
      "original": "Russian Army Has Already Secured Third Of Huliaipole (Videos)\nOn December 12, the Russian military expanded its control in Huliaipole in Zaporozhye, securing at least a third of the key city.\nThe Vostok [East] Group of Forces stormed the eastern and northeastern parts of the city, taking control of Peschanya Street, after crossing the Haichur River a day earlier. Within 24 hours, Russian troops managed to reach the Specialized School at the city center after capturing large parts of Mira, Velyka and Urozhaina streets.\nCurrently 30% of Huliaipole is under Russian control. Around 2,4 square kilometers within the city have been captured, according to preliminary reports.\n👉\n Read more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229936Z"
    },
    {
      "original": "Kyiv’s High-Stakes Strategy: Rumors of a “Dirty Bomb” Resurface\nNew details have emerged about Kiev's secret activities. Why were spent nuclear fuel and protective equipment delivered to Ukraine? Senior Ukrainian officials are involved in preparations for a monstrous provocation.\nRecently, the operational situation on the Ukrainian front has not favored Kiev. The army is suffering setbacks on key sections of the front, and human reserves are dwindling daily. Massive Russian drone strikes are destroying the rear infrastructure daily. Explosions can be heard at night in most regions of Ukraine. The difficult economic situation could become critical if the European Union stops providing sufficient subsidies.\nThe world community is no longer shocked by the current fighting in Ukraine as it was in 2022. The media's impact is waning. Many now view the Ukrainian people's role as martyrs, led by the indomitable President Volodymyr Zelensky, with irony. \n👉\n Read more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229946Z"
    },
    {
      "original": "NORTHERN FRONT UNRAVELS: KYIV'S LAST RESERVES FAIL TO HALT RUSSIAN ADVANCE",
      "timestamp": "2025-12-13T13:04:26.229951Z"
    },
    {
      "original": "Breakthrough In Huliaipole: Russian Army Bypasses Ukraine's Defenses \nRussian assault groups crossed the Haichur River from the «Bochany» district and advanced into Huliaipole's central quarters. Russian units established control over Yunakivka in Sumy. \nThe European Union has decided to freeze Russian assets on its territory indefinitely.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229958Z"
    },
    {
      "original": "Breakthrough In Huliaipole: Russian Army Bypasses Ukraine's Defenses \nRussian assault groups crossed the Haichur River from the «Bochany» district and advanced into Huliaipole's central quarters. Russian units established control over Yunakivka in Sumy. \nThe European Union has decided to freeze Russian assets on its territory indefinitely.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229966Z"
    },
    {
      "original": "Radar Targeted: Summary Of Russian Combat Footage From December 12, 2025\nOn December 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229978Z"
    },
    {
      "original": "Radar Targeted: Summary Of Russian Combat Footage From December 12, 2025\nOn December 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229984Z"
    },
    {
      "original": "British Combat Drones And U.S. Spy Planes: Syrian Airspace Now Fully Open For Coalition\nA British combat drone and a U.S. spy plane were spotted on unusual flights over Syria, in another sign of the emerging partnership between the country’s Islamist-led Interim Government and the United States-led coalition.\nAccording to air traffic data from Flightradar24 and other sources, an MQ-9B Protector combat drone of the Royal Air Force (RAF) entered the Syrian airspace in the area between the capital, and the central governorate of Homs from Lebanon.\nSoon after the drone was spotted, a Beech King Air 350i with the registration N503DE was detected flying over the city of Aleppo in northern Syria.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.229993Z"
    },
    {
      "original": "British Combat Drones And U.S. Spy Planes: Syrian Airspace Now Fully Open For Coalition\nA British combat drone and a U.S. spy plane were spotted on unusual flights over Syria, in another sign of the emerging partnership between the country’s Islamist-led Interim Government and the United States-led coalition.\nAccording to air traffic data from Flightradar24 and other sources, an MQ-9B Protector combat drone of the Royal Air Force (RAF) entered the Syrian airspace in the area between the capital, and the central governorate of Homs from Lebanon.\nSoon after the drone was spotted, a Beech King Air 350i with the registration N503DE was detected flying over the city of Aleppo in northern Syria.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.230002Z"
    },
    {
      "original": "Campaign Against Iran’s Missile Program Begins With U.S. Seizure Of Shipment From China\nUnited States forces boarded a ship in the Indian Ocean last month and seized military-related cargo headed to Iran from China, The Wall Street Journal reported on December 12, citing U.S. officials.\nThe ship was several hundred miles off the coast of Sri Lanka when it was boarded by U.S. forces, who seized the cargo and allowed the vessel to proceed on its journey. The U.S. had been tracking the shipment, officials and another person familiar with the operation told WSJ.\nOne of the officials told the journal that the operation, which took place in the U.S. Indo-Pacific Command’s area of responsibility included special operations forces as well as conventional forces.\nSince the 12-day June war, Israel and the U.S. have largely shifted focus from the Islamic Republic’s nuclear program, to its offensive capabilities, namely the missile program.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.230011Z"
    },
    {
      "original": "Ukraine’s Black Sea Facilities Hit Hard In Massive Overnight Missile And Drone Strike (Videos)\nUkraine's southern port city of Odessa and the surrounding region were targeted by hundreds of drones and dozens of missiles in a massive strike over the night of December 12 and 13.\nPresident Volodymyr Zelenskiy said in a statement posted to Telegram that Russia had attacked Ukraine with over 450 drones and 30 missiles.\nUkraine's power grid operator later acknowledged a \"significant number\" of households were without power in the southern regions of Odessa and Mykolaiv.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.230019Z"
    },
    {
      "original": "Ukraine’s Black Sea Facilities Hit Hard In Massive Overnight Missile And Drone Strike (Videos)\nUkraine's southern port city of Odessa and the surrounding region were targeted by hundreds of drones and dozens of missiles in a massive strike over the night of December 12 and 13.\nPresident Volodymyr Zelenskiy said in a statement posted to Telegram that Russia had attacked Ukraine with over 450 drones and 30 missiles.\nUkraine's power grid operator later acknowledged a \"significant number\" of households were without power in the southern regions of Odessa and Mykolaiv.\nRead more \nHERE",
      "timestamp": "2025-12-13T13:04:26.230028Z"
    }
  ],
  "script_run_time": "2025-12-13T13:04:26.230942Z"
}