{
  "messages": [
    {
      "original": "🛵\n БпЛА на заході Харківщини, курсом на Харків.",
      "timestamp": "2025-10-12T17:07:41.093838Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Запоріжжя з півдня.",
      "timestamp": "2025-10-12T17:07:41.093857Z"
    },
    {
      "original": "🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T17:07:41.093863Z"
    },
    {
      "original": "🛵\n Ударний БпЛА на південь від Павлограду, на північно-західний напрямок.",
      "timestamp": "2025-10-12T17:07:41.093868Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-12T17:07:41.093872Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T17:07:41.093878Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-12T17:07:41.093882Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщину.",
      "timestamp": "2025-10-12T17:07:41.093886Z"
    },
    {
      "original": "Курсом на Харків.",
      "timestamp": "2025-10-12T17:07:41.093890Z"
    },
    {
      "original": "🛵\n БпЛА в центрі Чернігівщини, курсом на південь та на схід.",
      "timestamp": "2025-10-12T17:07:41.093895Z"
    },
    {
      "original": "🚀\nПуски КАБ на Донеччину.",
      "timestamp": "2025-10-12T17:07:41.093899Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T17:07:41.093905Z"
    },
    {
      "original": "🚀\nПуски КАБ на схід Харківщини.",
      "timestamp": "2025-10-12T17:07:41.093909Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-10-12T17:07:41.093913Z"
    },
    {
      "original": "🚀\nПуски КАБ у Запорізькій області.",
      "timestamp": "2025-10-12T17:07:41.093917Z"
    },
    {
      "original": "Курсом на Запоріжжя.",
      "timestamp": "2025-10-12T17:07:41.093921Z"
    },
    {
      "original": "🛸\n Розвідувальний БпЛА в акваторії Чорного моря поблизу Одеси.",
      "timestamp": "2025-10-12T17:07:41.093925Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T17:07:41.093930Z"
    },
    {
      "original": "🛸\n🛵\n БпЛА на Харків з півночі.",
      "timestamp": "2025-10-12T17:07:41.093935Z"
    },
    {
      "original": "Перебувайте в укриттях! Група БпЛА над містом.",
      "timestamp": "2025-10-12T17:07:41.093941Z"
    },
    {
      "original": "🛵\n БпЛА в центрі та на сході Харківщини, на південно-східний напрямок.",
      "timestamp": "2025-10-12T17:07:41.093959Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півночі.",
      "timestamp": "2025-10-12T17:07:41.093964Z"
    },
    {
      "original": "🛵\n БпЛА  на сході від Запоріжжя, курсом на місто.",
      "timestamp": "2025-10-12T17:07:41.093968Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued their offensive towards the city and have made progress in four different areas.\nIn the southeast, under heavy artillery and FPV drone cover, Russian forces continued to advance west through the forested gulley and have captured new trenches. They also established control over new positions in the forests to the north and are approaching the rear of the main Ukrainian strongpoint in the agricultural complex. Ukrainian forces are counterattacking in the forested gulley, slowing down the Russian advance. The Ukrainians are also continuing their attempts at recapturing the agricultural complex within the village limits of Zarichne, but have so far been unsuccessful. \nFurther north, Russian forces continued their assault operations south of Kolodyazi, and have completed the capture of two parallel treelines. From there, they entered the adjacent gulley, and secured positions in the forest plantations, further isolating the Ukrainian pocket in and around the village of Myrne. Additionally, the Russians were able to clear the trench strongpoint at the intersection of two treelines, which Ukrainian forces infiltrated earlier. \nTo the west, Russian forces advanced down two treelines towards the road northeast of Stavky. Additional forces have also managed to complete the capture of the Ukrainian strongpoints in the forested gulley northeast of Drobysheve, while other assault groups cleared the two treelines on the tactical heights to the northwest. From there, the Russians pushed southwest down a treeline and a nearby gulley and established control over positions on the Drobysheve - Zarichne Road. \n+ ~8.18 km² in favour of Russia.",
      "timestamp": "2025-10-12T17:07:41.658143Z"
    },
    {
      "original": "Pakistan confirms that 23 of its soldiers have been killed in the cross-border clashes between them and Afghan Taliban. They also claimed that 200 from the Afghan side (likely including militants from TTP) were killed. \nPakistan is currently confirmed to be in control of 6 Afghan Taliban border posts but claim control over 21. Fighting, including artillery shelling, is still ongoing.",
      "timestamp": "2025-10-12T17:07:41.658155Z"
    },
    {
      "original": "Pakistani soldiers captured an American-made Humvee vehicle used by Afghan Taliban forces after it was left behind at one of their border posts captured by Pakistan.",
      "timestamp": "2025-10-12T17:07:41.658159Z"
    },
    {
      "original": "More Afghan Taliban reinforcements, including Humvees, were seen moving through the Spin Boldak District, Kandahar Provinnce, towards the border with Pakistan.\nApproximate coordinates: 31.31666, 65.96416 (around 58 km from the international border).",
      "timestamp": "2025-10-12T17:07:41.658163Z"
    },
    {
      "original": "The Israeli Prime Minister's Office, along with Al-Arabi, and Israeli Channel 12 report that all Israeli hostages - dead and alive - will be released early tomorrow morning, in exchange for the release of 2,000 Palestinian prisoners.\nThe exact time is reportedly going to be 6am local time, which is just under 14 hours from now.",
      "timestamp": "2025-10-12T17:07:41.658167Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T17:07:41.658171Z"
    },
    {
      "original": "Pakistani forces can be seen operating in positions on the Afghan side of the border near the city of Spin Boldak, Kandahar Province, which they have been launching airstrikes on (as seen in media 2).",
      "timestamp": "2025-10-12T17:07:41.658175Z"
    },
    {
      "original": "Explosions were just heard in the area of Boryspil, Kyiv Oblast, after 2 Russian Geran-3 jet drones attacked the region.",
      "timestamp": "2025-10-12T17:07:41.658178Z"
    },
    {
      "original": "In the Borova direction, Russian forces resumed their assault operations along the eastern bank of the Oskil river, and have made progress in the village of Zahryzove.\nRussian forces advanced south from their positions in the northernmost part of Zahryzove, crossing a tributary of the Oskil River, and establishing control over new positions towards the centre of the village. They then went on to push further south through the residential areas, capturing the centre of the village, and reaching the southern streets, where fighting is now ongoing. \nOther forces advanced south from the forests southwest of Kruhlyakivka, crossing over the railway bridge, and establishing control over the forests to the south in the area of the railway tracks. These attacks largely aligned the front with the assault groups in central Zahryzove, although consolidation is ongoing. \n+ ~3.29 km² in favour of Russia.",
      "timestamp": "2025-10-12T17:07:41.658184Z"
    },
    {
      "original": "In the Kupyansk direction, Russian forces resumed their assault operations northwest of Stepova Novosilka, and have captured new trench positions. \nFollowing the capture of a substantial amount of ground west and northwest of Stepova Novosilka last month, Russian forces have now begun attacking towards the southeastern edge of Petropavlivka. They advanced west from their newly established positions in the treelines, capturing a forested area. From there they entered the treeline to the west, securing trench positions. \nTo the south, the Russians advanced from the treeline positions just north of the highway, and established control over a new trench line, thereby securing the southern flank of the captured positions to the north. \n+ ~0.98 km² in favour of Russia.",
      "timestamp": "2025-10-12T17:07:41.658190Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.\nEarlier, clashes were reported in multiple parts of Gaza City between Hamas' internal security forces and Gazan clans as a part of Hamas' large-scale, coordinated effort to regain full authority over Gaza Governorate, in preparation for the next state of the peace plan.",
      "timestamp": "2025-10-12T17:07:41.658194Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.\nEarlier, clashes were reported in multiple parts of Gaza City between Hamas' internal security forces and Gazan clans as a part of Hamas' large-scale, coordinated effort to regain full authority over Gaza Governorate, in preparation for the next state of the peace plan.",
      "timestamp": "2025-10-12T17:07:41.658198Z"
    },
    {
      "original": "In the Khotin direction, both Russian and Ukrainian forces are carrying out assault operations, with Russian forces making progress towards the village of Varachyne. \nOnce the situation in and around Novomykolaivka had stabilised, Russian forces began launching a series of counterattacks. They were able to advance southwest down a treeline along the tactical heights, resecuring the road into Oleksiivka, allowing for limited ground supply into the village to return for the Russian garrison stuck there. \nRussian forces were also able to consolidate in the southeastern houses of Novomykolaivka, and began advancing along the tactical heights towards Varachyne from the northwest. They entered the treelines on its northwestern approaches, which were used to infiltrate the village, which is now in the grey zone. The Russians were also able to capture the treelines northeast of Varachyne. \nMeanwhile, Ukrainian forces continued their assault operations towards Oleksiivka, and have managed to consolidate in the agricultural buildings on its western outskirts. Attempts are now underway to enter the residential part of the village from the west. These attacks are being carried out under heavy FPV drone and artillery cover, which is resulting in heavy casualties for the Russian garrison in Oleksiivka, but due to the road being open for limited ground movement again, rotations can now be carried out to some extent. Ukrainian casualties in these attacks are also high, as the vast majority of them are being repelled. \n+ ~7.91 km² in favour of Russia.\n+ ~0.16 km² in favour of Ukraine.",
      "timestamp": "2025-10-12T17:07:41.658205Z"
    },
    {
      "original": "Several local Palestinian channels are reporting that Hamas' Sahm unit has carried out a massacre against families affiliated with anti-Hamas armed clans in the Al-Sabra Neighbourhood of Gaza City. As many as 25 people were reportedly executed.  Earlier, clashes…",
      "timestamp": "2025-10-12T17:07:41.658208Z"
    },
    {
      "original": "New rule for the Channel's group chat: All fascists will be perm muted, no exceptions. Fascism is not welcome here, unlike many other chats. \nIf you don't like that, you're the problem.",
      "timestamp": "2025-10-12T17:07:41.658212Z"
    },
    {
      "original": "New rule for the Channel's group chat: All fascists will be perm muted, no exceptions. Fascism is not welcome here, unlike many other chats.   If you don't like that, you're the problem.",
      "timestamp": "2025-10-12T17:07:41.658215Z"
    },
    {
      "original": "It's genuinely scary how quickly so many ordinary people have been radicalised by egotistical idiots like Nick Fuentes, and sigma edits on Tik Tok, and how normalised its become in online spaces.\nI'm generally very acceptive of almost all political opinions, but some things need to have strong measures put against.",
      "timestamp": "2025-10-12T17:07:41.658219Z"
    },
    {
      "original": "Russian Su-34s from over Belgorod Oblast carried out 2 KAB glide-bomb strikes on southeastern Kharkiv City, a short time ago.\nThe strikes targeted the Slobidskyi District, and the Nemyshlianskyi District, injuring at least one civilian. The exact targets are unknown at this moment, but it should become clearer later on. Currently it is known that no residential buildings suffered any significant damage.",
      "timestamp": "2025-10-12T17:07:41.658223Z"
    },
    {
      "original": "Russian Su-34s from over Belgorod Oblast carried out 2 KAB glide-bomb strikes on southeastern Kharkiv City, a short time ago.\nThe strikes targeted the Slobidskyi District, and the Nemyshlianskyi District, injuring at least one civilian. The exact targets are unknown at this moment, but it should become clearer later on. Currently it is known that no residential buildings suffered any significant damage.",
      "timestamp": "2025-10-12T17:07:41.658230Z"
    },
    {
      "original": "Russian Su-34s from over Belgorod Oblast carried out 2 KAB glide-bomb strikes on southeastern Kharkiv City, a short time ago.  The strikes targeted the Slobidskyi District, and the Nemyshlianskyi District, injuring at least one civilian. The exact targets…",
      "timestamp": "2025-10-12T17:07:41.658234Z"
    },
    {
      "original": "Reports suggest that a Ukrainian Patriot missile was fired at the Russian Su-34 that bombed Kharkiv City. \nThe missile was launched towards the jet's path in Voroenzh Oblast, but it managed to dodge it, flying supersonic speeds over the northern outskirts of Voronezh City. This resulted in a sonic boom being heard from across the city.",
      "timestamp": "2025-10-12T17:07:41.658238Z"
    },
    {
      "original": "Russian aviation continues to heavily strike the eastern suburbs of Kostyantynivka in preparation for Russian assault units to enter the city. \nThis video shows a FAB-3000 glide-bomb strike on a reported Ukrainian temporary deployment point.",
      "timestamp": "2025-10-12T17:07:41.658241Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160008Z"
    },
    {
      "original": "Deadly Border Clashes Bring Afghanistan And Pakistan Closer To War, U.S. Stands To Benefit (Videos)\nAfghanistan said on October 12 that its forces killed over 50 Pakistani soldiers in overnight border operations, in response to what it called repeated violations of its territory and airspace.\nTwo days earlier, the country accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nPakistan and the Taliban have fallen out since the United States withdrawal from Afghanistan in 2020, with Islamabad accusing Kabul of backing the TTP more than once.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160025Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160035Z"
    },
    {
      "original": "Venezuela Braces For Invasion With Bunkers & Obstacles As U.S. Moves Special Aircraft\nTensions continue to mount between Venezuela and the U.S., with both sides preparing for a possible military confrontation.\nThe crisis began in August when the administration of President Donlad Trump doubled the reward for the arrest of Venezuelan President Nicolas Maduro to $50 million on drug trafficking charges then deployed a large naval force with thousands of marines close to the country’s shores on a so-called “counter narco-terror operation”.\nSince then, the U.S. military has struck four boats allegedly carrying drugs in the Caribbean Sea near Venezuela, killing at least 21 people.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160054Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160063Z"
    },
    {
      "original": "Russia Showcases New Combat-Proven Loitering Munition For First Time \nRussian drone manufacturer Roboavia has unveiled the Klin, a combat-proven loitering munition that was designed for tactical missions.\nPhotos showing the new loitering munition with a placard listing its core specifications and mission profile at an exhibition somewhere in Russia surfaced online on October 11.\nThe Klin has a takeoff weight of 13.5 kilograms, with a 1920 mm wingspan and 1600 mm length, according to the Robaoavia, which also states that the loitering munition has an endurance of up to 80 minutes, communication range of 120 kilometers, a maximum altitude of 2,000 meters and a speed of speeds of 108 to 300 kilometers per hour.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160071Z"
    },
    {
      "original": "Military Situation In Ukraine On October 12, 2025 (Maps Update)",
      "timestamp": "2025-10-12T17:07:42.160076Z"
    },
    {
      "original": "Military Situation In Ukraine On October 12, 2025 (Maps Update)",
      "timestamp": "2025-10-12T17:07:42.160080Z"
    },
    {
      "original": "Reforming The Ukrainian Armed Forces: Why Is It Necessary, And Will It Lead To Victory?\nIn early 2025, the Ukrainian Army began reforming to adopt a corps structure. What has happened in the eight months since?\nFollowing the collapse of the USSR, the Ukrainian authorities considered the most effective strategy to be the demonstrative eradication of the Soviet legacy in order to conceal the global plundering of national wealth.\nSince 2014, this has applied to all aspects of life that remind people of their shared history with Russia. At the same time, all of this was done primarily to impress the West and secure their financial support.\nThe nation's military was not an exception to this. Large territorial units of troops, known in the Soviet Union as 'military districts', were renamed 'operational commands' and given names based on the four main directions: 'North' (Chernihiv), 'West' (Rivne), 'South' (Odesa) and 'East' (Dnipro). \n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160090Z"
    },
    {
      "original": "Reforming The Ukrainian Armed Forces: Why Is It Necessary, And Will It Lead To Victory?\nIn early 2025, the Ukrainian Army began reforming to adopt a corps structure. What has happened in the eight months since?\nFollowing the collapse of the USSR, the Ukrainian authorities considered the most effective strategy to be the demonstrative eradication of the Soviet legacy in order to conceal the global plundering of national wealth.\nSince 2014, this has applied to all aspects of life that remind people of their shared history with Russia. At the same time, all of this was done primarily to impress the West and secure their financial support.\nThe nation's military was not an exception to this. Large territorial units of troops, known in the Soviet Union as 'military districts', were renamed 'operational commands' and given names based on the four main directions: 'North' (Chernihiv), 'West' (Rivne), 'South' (Odesa) and 'East' (Dnipro). \n👉\n Read more \nHERE",
      "timestamp": "2025-10-12T17:07:42.160099Z"
    }
  ],
  "script_run_time": "2025-10-12T17:07:42.160895Z"
}