{
  "messages": [
    {
      "original": "🛵\n Київська область (Вишгородський р-н) - загроза застосування ударних ворожих БпЛА!",
      "timestamp": "2025-07-30T07:36:09.431642Z"
    },
    {
      "original": "🛵\n Харків - БпЛА у напрямку міста зі сходу.",
      "timestamp": "2025-07-30T07:36:09.431657Z"
    },
    {
      "original": "🛵\n БпЛА на сході Дніпропетровської області, курс - північно-західний. \nПавлоград/район - перебувайте в укриттях!",
      "timestamp": "2025-07-30T07:36:09.431663Z"
    },
    {
      "original": "Швидкісна на Очаків!",
      "timestamp": "2025-07-30T07:36:09.431667Z"
    },
    {
      "original": "🚀\n Херсонська, Миколаївська області - ракетна небезпека.",
      "timestamp": "2025-07-30T07:36:09.431671Z"
    },
    {
      "original": "🛵\n БпЛА на Павлоград зі сходу та заходу!",
      "timestamp": "2025-07-30T07:36:09.431675Z"
    },
    {
      "original": "Швидкісна ціль на Очаків!",
      "timestamp": "2025-07-30T07:36:09.431679Z"
    },
    {
      "original": "Павлоград - перебувайте в укриттях!",
      "timestamp": "2025-07-30T07:36:09.431682Z"
    },
    {
      "original": "м. Харків- БпЛА над містом.",
      "timestamp": "2025-07-30T07:36:09.431685Z"
    },
    {
      "original": "🛵\n Харків - БпЛА на місто з півночі!",
      "timestamp": "2025-07-30T07:36:09.431690Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Сумщину.",
      "timestamp": "2025-07-30T07:36:09.431695Z"
    },
    {
      "original": "⚠\n Увага!\n🛬\n Активність ворожої тактичної авіації на сході!\n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-30T07:36:09.431703Z"
    },
    {
      "original": "🛸\n Активність розвідувальних БпЛА на Херсонщині. Залучено засоби для їх збиття. Під час тривоги перебувайте в укритті!",
      "timestamp": "2025-07-30T07:36:09.431707Z"
    },
    {
      "original": "🛸\n Активність розвідувальних БпЛА на Миколаївщині. Залучено засоби для їх збиття. Під час тривоги перебувайте в укритті!",
      "timestamp": "2025-07-30T07:36:09.431712Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 51 ВОРОЖИЙ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 30 липня (із 22.30 29 липня) противник атакував 78-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Орел, Курськ, Гвардійське - ТОТ Криму.\n❗️\nОсобливість нічної атаки – застосування ворогом до 8-ми реактивних БпЛА на північному напрямку.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 51 ворожий БпЛА на півночі та сході країни.\nЗафіксовано влучання 27 БпЛА у 7 локаціях, падіння збитих (уламки) на 2 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-07-30T07:36:09.431731Z"
    },
    {
      "original": "⚠\n Увага!\n🛬\n Активність ворожої тактичної авіації на східному та північно-східному напрямках!\n🚀\n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-07-30T07:36:09.431739Z"
    },
    {
      "original": "🚀\n Пуски керованих авіаційних бомб ворожою тактичною авіацією на Харківщину",
      "timestamp": "2025-07-30T07:36:09.431743Z"
    },
    {
      "original": "🚀\n КАБи на північ Донеччини!",
      "timestamp": "2025-07-30T07:36:09.431747Z"
    },
    {
      "original": "🚀\n Пуски керованих авіаційних бомб ворожою тактичною авіацією на Сумщину",
      "timestamp": "2025-07-30T07:36:09.431751Z"
    },
    {
      "original": "⚠\n Увага!\n☄️\n Загроза застосування балістичного озброєння!",
      "timestamp": "2025-07-30T07:36:09.431757Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast",
      "timestamp": "2025-07-30T07:36:09.889817Z"
    },
    {
      "original": "Iskander on Kharkiv Oblast",
      "timestamp": "2025-07-30T07:36:09.889830Z"
    },
    {
      "original": "Flying to Chuhuiv, Kharkiv Oblast.",
      "timestamp": "2025-07-30T07:36:09.889834Z"
    },
    {
      "original": "Flying to Chuhuiv, Kharkiv Oblast.",
      "timestamp": "2025-07-30T07:36:09.889837Z"
    },
    {
      "original": "Still flying, approaching the city/airbase",
      "timestamp": "2025-07-30T07:36:09.889840Z"
    },
    {
      "original": "Still flying, approaching the city/airbase",
      "timestamp": "2025-07-30T07:36:09.889843Z"
    },
    {
      "original": "Disappeared in the area of Chuhuiv.",
      "timestamp": "2025-07-30T07:36:09.889846Z"
    },
    {
      "original": "Iskander on Pryluky, Chernihiv Oblast.",
      "timestamp": "2025-07-30T07:36:09.889850Z"
    },
    {
      "original": "Iskander on Pryluky, Chernihiv Oblast.",
      "timestamp": "2025-07-30T07:36:09.889853Z"
    },
    {
      "original": "Explosion in Pryluky.",
      "timestamp": "2025-07-30T07:36:09.889856Z"
    },
    {
      "original": "Explosion in Pryluky.",
      "timestamp": "2025-07-30T07:36:09.889859Z"
    },
    {
      "original": "A Russian reconnaissance drone was filming the strike.",
      "timestamp": "2025-07-30T07:36:09.889862Z"
    },
    {
      "original": "Iskander on Pryluky, Chernihiv Oblast.",
      "timestamp": "2025-07-30T07:36:09.889865Z"
    },
    {
      "original": "Reports suggest that a Ukrainian GUR UH-60 Black Hawk Helicopter at Pryluky Airbase, Chernihiv Oblast, was destroyed by the Iskander strike. An information blackout has reportedly been imposed on the area, the strike zone and access routes closed off, with electronic warfare units operating at full capacity.\nEdit: This is most likely an Mi-8 helicopter",
      "timestamp": "2025-07-30T07:36:09.889869Z"
    },
    {
      "original": "Russian forces have captured the village of Plavni, Stepnohirsk Direction, Zaporizhzhia Oblast.\nPre-war population: ~329.\nTotal land area: ~2.68km².",
      "timestamp": "2025-07-30T07:36:09.889874Z"
    },
    {
      "original": "Report on Russian air activity from 9am 28/7/25 - 9am 29/7/25 (Kyiv Time):\nOverview:\nThe following was used by Russia:\n4 Iskander-M ballistic missiles.\n9+ Long-range reconnaissance UAVs.\n40+ Geran-2/Gerbera drones.\nTargeted settlements:\nPryluky, Chernihiv Oblast (1x Iskander-M + 3 waves of Gerans).\nKamyanske, Dnipropetrovsk Oblast (2x Iskander-Ms).\nBuryn, Sumy Oblast (1 wave of Gerans).\nSlovyansk, Donetsk Oblast (1 wave of Gerans).\nLyman, Donetsk Oblast (1 wave of Gerans).\nKostyantynivka, Mykolaiv Oblast (1 wave of Gerans).\nOther targeted areas:\nChuhuiv area, Kharkiv Oblast (1x Iskander-M)\nStrategic Aviation Activity:\nNo activity recorded.\nMiG-31K activity:\nNo activity recorded.\nMilitary Transport and Tanker aircraft activity\n:\n2x IL-76MD flights to Rostov-on-Don Airbase, Rostov Oblast.\n1x IL-76MD flight to Primorsko-Akhtarsk Airbase, Krasnodar Krai.\n1x An-26 flight to Khalino Airbase, Kursk Oblast.\n1x An-26 flight to Seshcha Airbase, Bryansk Oblast.\n1x An-26 flight to Shatalovo Airbase, Smolensk Oblast.\nThe cargo consists of Geran-2 drones and Gerbera drones, and likely includes Iskander-M ballistic missiles. \nLong-range reconnaissance drone activity:\nLong-range recon drones were recorded in the following regions:\nKherson Oblast.\nMykolaiv Oblast.\nZaporizhzhia Oblast.\nDnipropetrovsk Oblast.\nKharkiv Oblast.\nSumy Oblast.\nChernihiv Oblast.\nKyiv Oblast (flew over Belarus).\nKAB/FAB Glide-bomb targets (cities only):\nKharkiv City, Kharkiv Oblast.\nPokrovsk, Donetsk Oblast.\nLyman, Donetsk Oblast.\nIskander-M activity:\nLaunches from OTRK installations were recorded from:\n1x from Kurchakov, Kursk Oblast.\n1x from Kursk City, Kursk Oblast.\n2x from Rozdolne, Crimea.\nGeran-2/Gerbera drone launch locations:\n3x from Khalino Airbase, Kursk Oblast.\n1x from Hvardiiske Training Ground, Crimea. \n1x from Millerovo Airbase, Rostov Oblast. \nNote: The map and information provided is not 100% accurate and is based mostly on OSINT reports and analyses. There is a margin of error, so it should not be viewed as perfect. Additionally, some data on the map is generalised, as stated in the legend. It also does not include less significant weapons such as MLRS, short-range UAVs, and KAB glide-bombs (unless they hit major population centres). \nI'm trying out a new form of daily summaries that are more concise, but also more informative. Let me know what you think and if you have any suggestions/critiques. \nYou can find the full resolution map here: \nhttps://ibb.co/jkb9m4WN",
      "timestamp": "2025-07-30T07:36:09.889909Z"
    },
    {
      "original": "Ukrainian forces have recaptured the village of Razine, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~130\nTotal land area: ~0.35km²",
      "timestamp": "2025-07-30T07:36:09.889918Z"
    },
    {
      "original": "Briefly on Pokrovsk-Myrnohrad-Rodynske:\nThe situation has not worsened for the AFU over the past 48 hours, although it has not stabilised either. In Pokrovsk itself, fighting continues and activity of Russian sabotage and reconnaissance groups in the southern suburbs remains high. A lack of manpower and less experienced units in Pokrovsk complicates the identification and destruction of Russian DRGs and assault units, which resulted in the break down of the solid line of contact that we’ve witnessed. \nThe situation in Myrnohrad is better for the AFU, with more experienced units and less of a manpower problem resulting in less Russian success, and as such, Russian assault units are yet to enter the city, with entries currently limited to DRGs. Most of the pressure on Myrnohrad is being exerted from the direction of Novoeconomichne, which has largely come under Russian control, with a solidified Russian presence forming west of the Kazenyi Torets River. \nA lack of Russian consolidation east of Rodynske, and Ukrainian counterattacks which resulted in them breaking through to and recapturing Razine, resulted in a decrease in the intensity of Russian attacks from Novoeconomichne, and a focus on complicating their positions in the surrounding areas. Although, new reports suggest that Ukrainian successes at Razine are already being reversed. Despite this, steady Russian advances continue to be made in the vicinity of Fedorivka and Nykanorivka further north, continuing the expansion of the wedge towards the rest of Shakhove.",
      "timestamp": "2025-07-30T07:36:09.889927Z"
    },
    {
      "original": "Footage showing yesterday's Russian Iskander-M ballistic missile strikes on the Ukrainian 169th Training Centre near Honcharivs'ke, Chernihiv Oblast. 2 Iskanders were used one after another, the first of which was equipped with a cluster warhead.\nThe Ukrainian Ground Forces released a statement, saying that three soldiers were killed and 18 others wounded, despite security measures being taken. A commission led by the Chief of the Military Law Enforcement Service of the Armed Forces of Ukraine has been opened to \"clarify all circumstances and causes of the personnel losses\".",
      "timestamp": "2025-07-30T07:36:09.889931Z"
    },
    {
      "original": "Scenes from inside Yelizovo Airport in Kamchatka Krai as a magnitude 8.7 earthquake hit. It is the 7th largest recorded earthquake in history.\nTu-160 strategic bombers are probably stationed there right now, although it's unlikely they have sustained any damage and redeployments due to the earthquake and tsunami are unlikely. The first Tsunami waves have already hit Kamchatka Peninsula.",
      "timestamp": "2025-07-30T07:36:09.889935Z"
    },
    {
      "original": "Russian forces have recaptured the village of Razine, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~130\nTotal land area: ~0.35km²",
      "timestamp": "2025-07-30T07:36:09.889939Z"
    },
    {
      "original": "Russian forces captured the village of Temyrivka, Prosyana direction, Zaporizhzhia Oblast. \nPre-war population: ~618.\nTotal land area: ~2.41km².",
      "timestamp": "2025-07-30T07:36:09.889943Z"
    },
    {
      "original": "Just got a tsunami alert lol",
      "timestamp": "2025-07-30T07:36:09.889948Z"
    },
    {
      "original": "Just got a tsunami alert lol",
      "timestamp": "2025-07-30T07:36:09.889952Z"
    },
    {
      "original": "Nothing important. I could've done live Tsunami reporting from the ground \n😞",
      "timestamp": "2025-07-30T07:36:09.889956Z"
    },
    {
      "original": "On the northeastern flank of Pokrovsk, Russian forces continued to advance and have made significant progress in multiple directions. \nRussian forces advanced in 6 areas. In the southwest, they resecured the village of Razine after a brief Ukrainian operation, and resumed their assaults towards Rodynske, re-entering positions on the approaches to Chervonyi Lyman, and west of Razine.\nTo the north, Russian forces improved their positions southeast of Zatyshok, capturing additional parts of the forest plantations there. Other forces pushed outwards from the Boikivka area, solidifying their presence in the northern part of the bridgehead west of the Kazenyi Torets River, and captured most of the positions in the salient that formed between Fedorivka and Nykanorivka, \nTo the north, Russian forces improved their positions east of Nykanorivka, reaching the eastern outskirts of the village and capturing positions in the forests. \nTo the east, Russian forces advanced over time on a wide front from Volodymyrivka to Poltavka, seizing positions in the treelines on the tactical heights, and the forest plantations lining the tributaries of the Kazenyi Torets River. They were also able to establish full control over the Dobropolsky and Biryuch chalk quarries, and spearheaded outwards to the forest north of Poltavka. \nIn the east, Russian forces completed the capture of the forest plantations on the approaches to eastern Poltavka, and entered the southeastern houses, taking up previously lost positions there. \n+ ~32.16km² in favour of Russia.",
      "timestamp": "2025-07-30T07:36:09.889963Z"
    },
    {
      "original": "Report on Russian air activity from 9am 29/7/25 - 9am 30/7/25 (Kyiv Time):\nOverview:\nThe following was used by Russia:\n2 Iskander-M ballistic missiles.\n2 Kh-31P anti-radar missiles.\n8+ Long-range reconnaissance UAVs.\n55+ Geran-2/Geran-3/Gerbera drones.\nTargeted settlements:\nHoncharivs'ke, Chernihiv Oblast (2x Iskander-M + 3 waves of Geran-2/Geran-3 drones).\nKharkiv City, Kharkiv Oblast (1 wave of Geran-2 drones). \nOchakiv, Mykolaiv Oblast (2x Kh-31P). \nPavlohrad, Dnipropetrovsk Oblast (4 wave of Geran-2/Geran-3 drones).\nSlovyansk, Donetsk Oblast (1 wave of Geran-2 drones).\nOther targeted areas:\nN/A\nStrategic Aviation Activity:\n1 Tu-160 redeployed from Borisoglebskoye Airbase, Republic of Tatarstan to Engels-2 Airbase, Saratov Oblast.\n1 Tu-95MS redeployed from Olenya Airbase, Murmansk Oblast to Engels-2 Airbase, Saratov Oblast.\n1 Tu-95MS redeployed from Olenya Airbase, Murmansk Oblast to Ukrainka Airbase, Amur Oblast.\nMiG-31K activity:\nN/A\nMilitary Transport and Tanker aircraft activity:\n2x IL-76MD flights to Rostov-on-Don Airbase, Rostov Oblast.\n1x IL-76MD flight to Seshcha Airbase, Bryansk Oblast.\n2x An-26 flights to Seshcha Airbase, Bryansk Oblast.\nThe cargo consists of Geran-2, Geran-3 and Gerbera drones, and likely includes Iskander-M ballistic missiles. \nLong-range reconnaissance drone activity:\nLong-range recon drones were recorded in the following regions:\nZaporizhzhia Oblast.\nDnipropetrovsk Oblast.\nDonetsk Oblast.\nChernihiv Oblast.\nKAB/FAB Glide-bomb targets (cities only):\nVovchansk, Kharkiv Oblast.\nKupyansk, Kharkiv Oblast.\nPokrovsk, Donetsk Oblast.\nLyman, Donetsk Oblast.\nSiversk, Donetsk Oblast.\nKostyantynivka, Donetsk Oblast.\nHulyaipole, Zaporizhzhia Oblast.\nIskander-M activity:\nLaunches from OTRK installations were recorded from:\n2x from Kliintsy, Bryansk Oblast.\nGeran-2/Geran-3/Gerbera drone launch locations:\n2x from Khalino Airbase, Kursk Oblast.\n2x Navlya Testing Ground, Bryansk Oblast.\n1x from Primorsko-Akhtarsk Airbase, Krasnodar Krai. \n1x from Cape Chauda, Crimea. \n1x from Shatalovo Airbase, Smolensk Oblast. \nBlack Sea Fleet Activity:\nN/A\nNote: The map and information provided is not 100% accurate and is based mostly on OSINT reports and analyses. There is a margin of error, so it should not be viewed as perfect. Additionally, some data on the map is generalised, as stated in the legend. It also does not include less significant weapons such as MLRS, short-range UAVs, and KAB glide-bombs (unless they hit major population centres). \nYou can find the full resolution map here: \nhttps://ibb.co/HDbhsMTN",
      "timestamp": "2025-07-30T07:36:09.889996Z"
    },
    {
      "original": "Military Situation In Ukraine On July 28, 2025 (Map Update)",
      "timestamp": "2025-07-30T07:36:10.431493Z"
    },
    {
      "original": "Military Situation In Ukraine On July 28, 2025 (Map Update)",
      "timestamp": "2025-07-30T07:36:10.431505Z"
    },
    {
      "original": "Iran Vows To Respond More Decisively To Any Attack By U.S. And Israel\nIranian Foreign Minister Abbas Araghchi warned on July 28 that the Islamic Republic would respond to any new attack by the United States and Israel in a “more decisive manner.”\nIsrael launched a surprise attack against Iran on June 13, stating that its goal was to cripple Iran’s nuclear program. A ceasefire was suddenly announced on June 24, just two days after the U.S. joined the war by attacking three key nuclear sites...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431514Z"
    },
    {
      "original": "Locations Of US Carrier Strike Groups – July 29, 2025",
      "timestamp": "2025-07-30T07:36:10.431518Z"
    },
    {
      "original": "Putin Discussed Syria, Iran In Phone Call With Netanyahu\nRussian President Vladimir Putin spoke by phone with Israeli Prime Minister Benjamin Netanyahu on July 28 to discuss various developments in the Middle East, including recent sectarian violence in Syria and Iran’s nuclear program.\nDuring the call, Putin “emphasized the importance of supporting the unity, sovereignty and territorial integrity” of Syria, said a Kremlin statement...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431525Z"
    },
    {
      "original": "Belarus Downs Ukrainian Drone Over Minsk in Apparent Provocation\nLate Monday night, Belarusian air defense forces intercepted and downed an unidentified drone over Minsk in what appears to be yet another attempted provocation by Ukraine aimed at escalating the conflict. According to the Belarusian Defense Ministry, the unmanned aerial vehicle (UAV) was detected by air defense units around 2:00 AM local time before being disabled by electronic warfare systems. The drone subsequently crashed near residential building No. 72 on Matusevich Street at approximately 2:33 AM. Fortunately, no casualties or damage were reported...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431532Z"
    },
    {
      "original": "Military Overview: Russian Forces Press Ahead on Multiple Fronts\nThe Russian military has intensified offensive operations across several key sectors of the Ukrainian front, achieving tactical breakthroughs that threaten to unravel Kyiv’s defensive lines. From Kharkiv to Donetsk and Zaporizhzhia, Moscow’s forces are exploiting weakened Ukrainian positions through coordinated assaults, flanking maneuvers, and relentless pressure on critical supply routes...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431538Z"
    },
    {
      "original": "Military Overview: Russian Forces Press Ahead on Multiple Fronts\nThe Russian military has intensified offensive operations across several key sectors of the Ukrainian front, achieving tactical breakthroughs that threaten to unravel Kyiv’s defensive lines. From Kharkiv to Donetsk and Zaporizhzhia, Moscow’s forces are exploiting weakened Ukrainian positions through coordinated assaults, flanking maneuvers, and relentless pressure on critical supply routes...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431545Z"
    },
    {
      "original": "Military Situation In Gaza Strip On July 29, 2025 (Map Update)",
      "timestamp": "2025-07-30T07:36:10.431558Z"
    },
    {
      "original": "West Plots Zelensky’s Exit: Secret Alpine Meeting Backs Zaluzhny as Ukraine’s New Leader\nHigh-ranking Ukrainian officials held a clandestine meeting with U.S. and British representatives in the Alps to discuss replacing President Volodymyr Zelensky, according to a statement from Russia’s Foreign Intelligence Service (SVR). The talks reportedly centered on former Ukrainian Commander-in-Chief Valeriy Zaluzhny as a potential successor, signaling a possible political upheaval in Kyiv amid waning Western confidence in Zelensky’s leadership...\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431565Z"
    },
    {
      "original": "Military Situation In Ukraine On July 29, 2025 (Map Update)",
      "timestamp": "2025-07-30T07:36:10.431569Z"
    },
    {
      "original": "Military Situation In Ukraine On July 29, 2025 (Map Update)",
      "timestamp": "2025-07-30T07:36:10.431573Z"
    },
    {
      "original": "DEFEATED ON THE BATTLEFIELD KYIV RESPONDS WITH TERROR",
      "timestamp": "2025-07-30T07:36:10.431577Z"
    },
    {
      "original": "200 Casualties Reported After Russian Missile Strike On Ukrainian Training Center (Video)\nA Russian missile strike hit a training center of Kiev forces in the Ukraine’s Chernihiv region on July 29, causing mass casualties.\nThe 169th Training Centre of the Ukrainian Ground Forces was reported the target of the attack. Two Iskander-M tactical ballistic missiles hit the center, deployed near the settlement of Goncharovskoye, as troops were gathered for training, according to video footage released by Russian media.\nRead more: \nHERE",
      "timestamp": "2025-07-30T07:36:10.431583Z"
    }
  ],
  "script_run_time": "2025-07-30T07:36:10.432325Z"
}