{
  "messages": [
    {
      "original": "🛵\n БпЛА на Полтавщині (Лубенський район), курс південно-західний.",
      "timestamp": "2025-10-11T13:28:17.992269Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-10-11T13:28:17.992289Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжя.",
      "timestamp": "2025-10-11T13:28:17.992294Z"
    },
    {
      "original": "🛵\n Павлоград - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-11T13:28:17.992300Z"
    },
    {
      "original": "🛵\n БпЛА на Полтавщині, курс на Черкащину.",
      "timestamp": "2025-10-11T13:28:17.992305Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-11T13:28:17.992321Z"
    },
    {
      "original": "🛵\n БпЛА  на сході Сумщини, курс на південь.",
      "timestamp": "2025-10-11T13:28:17.992325Z"
    },
    {
      "original": "🛵\n БпЛА на Чернігівщині (Чернігівський район), курс західний.",
      "timestamp": "2025-10-11T13:28:17.992330Z"
    },
    {
      "original": "🛵\n БпЛА на півночі Харківщини, курс на Харків.",
      "timestamp": "2025-10-11T13:28:17.992334Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-11T13:28:17.992339Z"
    },
    {
      "original": "🚀\nПуски КАБ на Сумщину.",
      "timestamp": "2025-10-11T13:28:17.992343Z"
    },
    {
      "original": "🛵\n Харків - БпЛА у напрямку міста!",
      "timestamp": "2025-10-11T13:28:17.992347Z"
    },
    {
      "original": "🛵\n \n🛸\n БпЛА на заході Донеччини, курс - західний.",
      "timestamp": "2025-10-11T13:28:17.992353Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині,курс північно-західний.",
      "timestamp": "2025-10-11T13:28:17.992361Z"
    },
    {
      "original": "🛵\n Кіровоградська  область, загроза застосування БпЛА",
      "timestamp": "2025-10-11T13:28:17.992366Z"
    },
    {
      "original": "🚀\n Миколаївська область, ракетна небезпека.",
      "timestamp": "2025-10-11T13:28:17.992370Z"
    },
    {
      "original": "🛵\n БпЛА на Дніпропетровщині (Павлоградський район), курс північно-східний.",
      "timestamp": "2025-10-11T13:28:17.992375Z"
    },
    {
      "original": "🚀\n Миколаївська область, ракетна небезпека.",
      "timestamp": "2025-10-11T13:28:17.992381Z"
    },
    {
      "original": "📢\n Відбій загрози",
      "timestamp": "2025-10-11T13:28:17.992385Z"
    },
    {
      "original": "🛵\n Павлоград - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-11T13:28:17.992390Z"
    },
    {
      "original": "🛵\n \n🛸\nБпЛА на Чернігівщині (Новгород-Сіверський район),курс південо-західний.",
      "timestamp": "2025-10-11T13:28:17.992397Z"
    },
    {
      "original": "At least 3 Russian Tu-95MS strategic bombers are redeploying from Ukrainka Airbase in Amur Oblast, to Engels-2/Olenya Airbase in Saratov/Murmansk Oblast. \nThe final preparations for the next large-scale missile attack (involving bombers) on Ukraine have almost been completed, with the attack likely to take place in the next 36 hours.",
      "timestamp": "2025-10-11T13:28:18.685864Z"
    },
    {
      "original": "Russian VKS-affiliated source Fighterbomber confirms earlier claims that a Russian MiG-31 crashed. They stated that the crash occurred due to a landing failure, and that the crew ejected and survived. \nUkrainian sources reported that it was a MiG-31K - a carrier of the Kinzhal missile - however Fighterbomber did not specify if the aircraft was of the K variant.",
      "timestamp": "2025-10-11T13:28:18.685877Z"
    },
    {
      "original": "Footage showing some of the Russian Geran-2 drone strikes on the CHP-5 Power Plant in Kyiv.",
      "timestamp": "2025-10-11T13:28:18.685881Z"
    },
    {
      "original": "Footage showing some of the Russian Geran-2 drone strikes on the CHP-5 Power Plant in Kyiv.",
      "timestamp": "2025-10-11T13:28:18.685884Z"
    },
    {
      "original": "New SAR satellite images from October 10 show that Russia is continuing to expand the Navlya Training Ground in Bryansk Oblast, which is used to launch Geran-2 and Geran-3 drones. \nPreviously, launches of drones only took place from vehicles, with the drones being stored in three underground bunkers (each bunker can store approximately 200 drones). However, now ground-based static launchers have been constructed to the west of the main launchers, which take less time and resources for launching drones. \nWhile it doesn't appear that this expansion is fully complete yet, we will likely see an increase in the number of drones launched from here in the near future. Additionally, Navlya is the only launch site north/northeast of Ukraine where Geran-3 jet drones can be launched.\nImage credit:\nStrategicaviationT on Telegram\nUkrainian_Intelligence on Telegram",
      "timestamp": "2025-10-11T13:28:18.685892Z"
    },
    {
      "original": "At least 10 Israeli airstrikes targeted the town of Baisariyeh in southern Lebanon. The IDF claims that it was targeting Hezbollah facilities storing engineering equipment used to restore their military infrastructure.",
      "timestamp": "2025-10-11T13:28:18.685899Z"
    },
    {
      "original": "Following the implementation of the ceasefire and the withdrawal of the IDF to the \"yellow line\", Hamas' internal security forces began deploying from the central and southern Gaza Strip to parts of Gaza City, Khan Younis, and Jabalia. \nHere, they have begun attempts at re-establishing civil authority over non-occupied areas in preparation for the next steps of the peace plan. Clashes were reported in Jabalia al-Balad in Northern Gaza between Hamas and a Palestinian clan that was allowed to stay in place by Israel during their operations in Gaza City, and has subsequently been left over after the IDF withdrew. Arrests of other armed militants by Hamas has also taken place.",
      "timestamp": "2025-10-11T13:28:18.685903Z"
    },
    {
      "original": "Kherson City is under heavy fire from Tornado-S MLRS, other types of MLRS, and artillery. \nUnusual levels of attacks for this city.",
      "timestamp": "2025-10-11T13:28:18.685907Z"
    },
    {
      "original": "Last time there was a ceasefire in Gaza, Israel launched Operation Iron Walls in the West Bank, where they began dismantling Palestinian militant infrastructure in several different towns and cities. \nI'm wondering if we will see some other escalation elsewhere involving units pulled from Gaza.",
      "timestamp": "2025-10-11T13:28:18.685912Z"
    },
    {
      "original": "Last night, approximately 20 Russian Geran-2 drones attacked Odesa City. The main target appears to have been a railway substation, which was hit several times resulting in widespread power outages across Odesa.",
      "timestamp": "2025-10-11T13:28:18.685917Z"
    },
    {
      "original": "Last night, approximately 20 Russian Geran-2 drones attacked Odesa City. The main target appears to have been a railway substation, which was hit several times resulting in widespread power outages across Odesa.",
      "timestamp": "2025-10-11T13:28:18.685920Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on the city of Chuhuiv, Kharkiv Oblast.\nAt least 15 impacts were recorded, likely targeting the railway station. The first video shows a close-up of one of the hits.",
      "timestamp": "2025-10-11T13:28:18.685925Z"
    },
    {
      "original": "Last night, a large-scale Russian Geran-2 drone attack was carried out on the city of Chuhuiv, Kharkiv Oblast.\nAt least 15 impacts were recorded, likely targeting the railway station. The first video shows a close-up of one of the hits.",
      "timestamp": "2025-10-11T13:28:18.685928Z"
    },
    {
      "original": "The city of Kramatorsk, Donetsk Oblast, came under attack from Geran-2 drones last night. \nAt least 5 drones attacked the city, targeting something in the vicinity of Secondary school no. 12 (48.745198, 37.595043)",
      "timestamp": "2025-10-11T13:28:18.685933Z"
    },
    {
      "original": "The city of Kramatorsk, Donetsk Oblast, came under attack from Geran-2 drones last night. \nAt least 5 drones attacked the city, targeting something in the vicinity of Secondary school no. 12 (48.745198, 37.595043)",
      "timestamp": "2025-10-11T13:28:18.685936Z"
    },
    {
      "original": "Novhorod-Siverskyi in Chernihiv Oblast came under attack from Geran-2 drones last night. At least 5 impacts were recorded, although the target(s) are unknown. \nSo far, this image is the only visual evidence of the strikes.",
      "timestamp": "2025-10-11T13:28:18.685940Z"
    },
    {
      "original": "Russian VKS-affiliated channel Fighterbomber reports that a Russian Ka-52 helicopter was lost. It's unclear if it was shot down or crashed. There is currently no other information available about it.",
      "timestamp": "2025-10-11T13:28:18.685945Z"
    },
    {
      "original": "At least 3 Russian Tu-95MS strategic bombers are redeploying from Ukrainka Airbase in Amur Oblast, to Engels-2/Olenya Airbase in Saratov/Murmansk Oblast.   The final preparations for the next large-scale missile attack (involving bombers) on Ukraine have almost…",
      "timestamp": "2025-10-11T13:28:18.685948Z"
    },
    {
      "original": "The 5 Tu-95MS strategic bombers that took off from Ukrainka Airbase yesterday did not redeploy to western Russia, and instead carried out large-scale training.\nHowever, an An-124-100 \"Ruslan\" cargo plane landed at Engels-2 Airbase, which can carry up to 70 Kh-101 cruise missiles. We will likely see these 5 Tu-95MS redeploy from Ukrainka to Engels-2 in the coming days, in preparation for the next missile attack on Ukraine.",
      "timestamp": "2025-10-11T13:28:18.685952Z"
    },
    {
      "original": "Kiev Forces Are Getting Grinded In Pokrovsk (Video)\nKiev forces are taking heavy losses while attempting to hold onto their positions in the Dobropillia salient and the nearby city of Pokrovsk in the Donetsk direction, and despite that reports from October 10 indicate that the Russian military is still advancing.\nIn the Dobropillia salient, the Tsentr [Center] Group of Forces pushed Ukrainian troops out of Vladimirovka. This further secured Russian supply lines leading to Kucheriv Yar at the peak of the salient. It also put more pressure on the Ukrainian pocket splitting the salient from Shakhove to Toret’ske.\nTo the south of the salient, battles continue in Pokrovsk with clear advantage to the Tsentr Group of Forces. Still, Ukraine seems determined to fight in the indefensible city to the last soldier.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400682Z"
    },
    {
      "original": "Russian Army Is About To Choke Seversk, Reach Kostiantynivka (Videos)\nThe Russian military is about to make a serious breakthrough between Seversk and Liman in Donetsk, according to reports from October 10, which also revealed a desperate Ukrainian attempt to slow down the attack on Kostiantynivka nearby.\nThe Yug [South] Group of Forces made serious gains in Yampil, imposing control over a large part of the settlement’s north part after securing most of the eastern part.\nMoving to the west in Donetsk, the Yug Group of Forces attack on Kostiantynivka appears to be gaining momentum once again.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400698Z"
    },
    {
      "original": "Russian Army Is About To Choke Seversk, Reach Kostiantynivka (Videos)\nThe Russian military is about to make a serious breakthrough between Seversk and Liman in Donetsk, according to reports from October 10, which also revealed a desperate Ukrainian attempt to slow down the attack on Kostiantynivka nearby.\nThe Yug [South] Group of Forces made serious gains in Yampil, imposing control over a large part of the settlement’s north part after securing most of the eastern part.\nMoving to the west in Donetsk, the Yug Group of Forces attack on Kostiantynivka appears to be gaining momentum once again.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400707Z"
    },
    {
      "original": "Pakistan Kills Senior TTP Members In Unprecedented Strikes On Afghanistan’s Kabul (Videos)\nPakistan launched unprecedented strikes on the Afghan capital, Kabul, late on October 9, targeting two senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban.\nThe strikes targeted the Abdul Haq Square area of Kabul, close to several ministries and the national intelligence agency.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400715Z"
    },
    {
      "original": "Pakistan Kills Senior TTP Members In Unprecedented Strikes On Afghanistan’s Kabul (Videos)\nPakistan launched unprecedented strikes on the Afghan capital, Kabul, late on October 9, targeting two senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban.\nThe strikes targeted the Abdul Haq Square area of Kabul, close to several ministries and the national intelligence agency.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400722Z"
    },
    {
      "original": "AHEAD OF THE STORM: MAJOR RUSSIAN REDEPLOYMENT FROM POKROVSK POINTS TO FORTHCOMING OFFENSIVE",
      "timestamp": "2025-10-11T13:28:19.400726Z"
    },
    {
      "original": "Frontline Situation: Heavy Fighting In Vovchansk And Lull In Tetkino \nThe Russian 70th Regiment is consolidating its position in Mala Tokmachka. Russian units are expanding their zone of control and conducting clearance operations on the right bank of the Yanchur River. The Ukrainian military leadership is seeking reserves to replenish its assault groups.\nA parade featuring units of the Korean People's Army (KPA) who had returned from the Kursk Oblast was held in Pyongyang.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400733Z"
    },
    {
      "original": "Frontline Situation: Heavy Fighting In Vovchansk And Lull In Tetkino \nThe Russian 70th Regiment is consolidating its position in Mala Tokmachka. Russian units are expanding their zone of control and conducting clearance operations on the right bank of the Yanchur River. The Ukrainian military leadership is seeking reserves to replenish its assault groups.\nA parade featuring units of the Korean People's Army (KPA) who had returned from the Kursk Oblast was held in Pyongyang.\nRead more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400741Z"
    },
    {
      "original": "Geran Attacks: Summary Of Russian Combat Footage From October 10, 2025\nOn October 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-11T13:28:19.400747Z"
    },
    {
      "original": "Geran Attacks: Summary Of Russian Combat Footage From October 10, 2025\nOn October 10, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-11T13:28:19.400754Z"
    },
    {
      "original": "Europe’s Nord Stream Headache: Poland, Germany, And Ukraine Turn On Each Other Over Arrest\nThe arrest of a Ukrainian national accused of helping blow up the Nord Stream pipelines is deepening mistrust within the EU. As Kyiv allegedly pressures Warsaw, Berlin struggles to assert control. The affair revives uncomfortable questions about who really benefits from Europe’s energy dependence.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400761Z"
    },
    {
      "original": "Israel Unveils Assassination Loitering Missile\nIsrael’s Rafael Advanced Defense Systems unveiled on October 9 the Rafael Advanced Defense Systems, a loitering munition from the Spike family of anti-tank guided missiles with special capabilities that suggest it was developed with targeted killings in mind.\nIn a press release, the company describes the munition as “a missile designed with loitering built in — not a UAS (Unmanned Aerial System) retrofitted with a warhead”\nThe munition is powered by a jet propulsion system that delivers mission flexibility. In higher-speed dash profiles L-SPIKE 4X can reach the 40 kilometer engagement envelope in five minutes. Meanwhile in loitering profiles the missile provides on-station persistence of up to 25 minutes.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400770Z"
    },
    {
      "original": "Israel Unveils Assassination Loitering Missile\nIsrael’s Rafael Advanced Defense Systems unveiled on October 9 the Rafael Advanced Defense Systems, a loitering munition from the Spike family of anti-tank guided missiles with special capabilities that suggest it was developed with targeted killings in mind.\nIn a press release, the company describes the munition as “a missile designed with loitering built in — not a UAS (Unmanned Aerial System) retrofitted with a warhead”\nThe munition is powered by a jet propulsion system that delivers mission flexibility. In higher-speed dash profiles L-SPIKE 4X can reach the 40 kilometer engagement envelope in five minutes. Meanwhile in loitering profiles the missile provides on-station persistence of up to 25 minutes.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-11T13:28:19.400778Z"
    }
  ],
  "script_run_time": "2025-10-11T13:28:19.401662Z"
}