{
  "messages": [
    {
      "original": "🚀\nКАБи на Сумщину та Донеччину!",
      "timestamp": "2025-07-26T13:32:09.560634Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО 200 ЦІЛЕЙ ПРОТИВНИКА    \n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 26 липня (із 20.00 25 липня) противник атакував 235-ма засобами повітряного нападу (208 БпЛА та 27 ракет різних типів):\n- 208 ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Брянськ, Курськ, Орел, Міллєрово, Шаталово, Приморсько-Ахтарськ, рф, Гвардійське - ТОТ Криму;\n- 12 балістичними ракетами Іскандер-М/KN-23 (із Воронезької, Курської, Ростовської обл. - рф., Єйська та ТОТ Криму;\n- 8 крилатими ракетами Іскандер-К (із Єйська, Воронезької, Ростовської обл.);\n- 7 керованими авіаційними ракетами Х-59/69 (із повітряного простору Бєлгородської обл., рф та ТОТ Запорізької обл.).\n❗️\nОсновний напрямок удару – Дніпропетровщина!\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.30, протиповітряною обороною збито/подавлено РЕБ 200 засобів повітряного нападу противника:\n- 183 ударних БпЛА;\n- 17 ракет різних типів.\nЗафіксовано влучання 10 ракет і 25 ударних БпЛА у 9 локаціях, а також падіння збитих (уламки) – на 8 локаціях.\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-07-26T13:32:09.560670Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА в районі Кривого Рогу, на сході Сумщини та півночі Донеччини!Залучено засоби для їх збиття.",
      "timestamp": "2025-07-26T13:32:09.560676Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-07-26T13:32:09.560681Z"
    },
    {
      "original": "⚠\n Увага!\n🚀\n Швидкісна ціль на Чернігівщині!",
      "timestamp": "2025-07-26T13:32:09.560687Z"
    },
    {
      "original": "🚀\nКАБи на Донецьку,  Дніпропетровську та Запорізьку області!",
      "timestamp": "2025-07-26T13:32:09.560691Z"
    },
    {
      "original": "⚠\n Увага! \n🚀\n Швидкісна ціль на Чернігівщині!",
      "timestamp": "2025-07-26T13:32:09.560696Z"
    },
    {
      "original": "🚀\nРакета \n➡️\n на Київщину!",
      "timestamp": "2025-07-26T13:32:09.560702Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному та південно-східному напрямках зберігається! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-07-26T13:32:09.560709Z"
    },
    {
      "original": "🛸\n Ворожі розвідувальні БпЛА в районі Запоріжжя, на сході Дніпропетровщини та півдні Сумщини!\nЗалучено засоби для їх збиття.",
      "timestamp": "2025-07-26T13:32:09.560714Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину та Дніпропетровщину!",
      "timestamp": "2025-07-26T13:32:09.560719Z"
    },
    {
      "original": "⚠\n Увага!\nВорожий БпЛА \n➡️\n у напрямку Сум!",
      "timestamp": "2025-07-26T13:32:09.560725Z"
    },
    {
      "original": "⚠\n Увага!\nВорожий БпЛА на Дніпропетровщині \n➡️\n у напрямку Запоріжжя!",
      "timestamp": "2025-07-26T13:32:09.560731Z"
    },
    {
      "original": "⚠\n Увага!\nВорожий БпЛА \n➡️\n у напрямку Кривого Рогу!",
      "timestamp": "2025-07-26T13:32:09.560737Z"
    },
    {
      "original": "⚠\n Увага!\nВорожий БпЛА \n➡️\n у напрямку Сум!",
      "timestamp": "2025-07-26T13:32:09.560743Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному та південно-східному напрямках зберігається! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.\n🚀\nКАБи на Сумщину!",
      "timestamp": "2025-07-26T13:32:09.560752Z"
    },
    {
      "original": "🛸\n Ворожий розвідувальний БпЛА на півночі Сумщини!\nЗалучено засоби для збиття.",
      "timestamp": "2025-07-26T13:32:09.560757Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на південно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-07-26T13:32:09.560764Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-07-26T13:32:09.560769Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації на північно-східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей.",
      "timestamp": "2025-07-26T13:32:09.560783Z"
    },
    {
      "original": "🚀\nКАБи на Харківщину та Донеччину!",
      "timestamp": "2025-07-26T13:32:09.560787Z"
    },
    {
      "original": "Russian forces have captured the village of Chunyshyne, Pokrovsk direction, Donetsk Oblast.\nPre-war population: ~114.\nTotal land area: ~0.38km².",
      "timestamp": "2025-07-26T13:32:09.987461Z"
    },
    {
      "original": "We are so back!",
      "timestamp": "2025-07-26T13:32:09.987473Z"
    },
    {
      "original": "We are so back!",
      "timestamp": "2025-07-26T13:32:09.987476Z"
    },
    {
      "original": "I went through the pain of actually watching this video fully for you guys.\nHis main points boiled down are pretty much that Crimea doesn't have the same importance to Russia anymore because of Ukraine's abilities to strike it, and that once Russia's economy and military collapses and Ukraine retakes all its territory, Ukraine will lay siege to Crimea and Russian soldiers won't want to fight for Russia anymore. \nOh, and then he gives a lecture about how we should be \"thinking critically about every aspect of this war\" and not accept \"forced narratives that seem to make sense at face value\".",
      "timestamp": "2025-07-26T13:32:09.987482Z"
    },
    {
      "original": "Sirens in Kissufim, east of Gaza. There is a threat of rocket launches from Gaza.",
      "timestamp": "2025-07-26T13:32:09.987485Z"
    },
    {
      "original": "Sirens in Kissufim, east of Gaza. There is a threat of rocket launches from Gaza.",
      "timestamp": "2025-07-26T13:32:09.987488Z"
    },
    {
      "original": "Sirens continue to sound. No reports of explosions yet.",
      "timestamp": "2025-07-26T13:32:09.987491Z"
    },
    {
      "original": "The Head of the Donetsk Military-Civilian Administration announced mandatory evacuation orders for all families with children from the city of Dobropillya and nearby settlements, as shown on the map above.    These settlements include:  Dobropillya (city)…",
      "timestamp": "2025-07-26T13:32:09.987495Z"
    },
    {
      "original": "Yesterday, mandatory evacuation orders were announced for all families with children in the city of Kramatorsk, Donetsk Oblast. The Donetsk OVA head stated that around 53,000 civilians remain in the city.",
      "timestamp": "2025-07-26T13:32:09.987498Z"
    },
    {
      "original": "Sirens continue to sound. No reports of explosions yet.",
      "timestamp": "2025-07-26T13:32:09.987501Z"
    },
    {
      "original": "One rocket was launched from the Khan Younis area of southern Gaza. The IDF stated that it impacted an open area. No casualties are reported.",
      "timestamp": "2025-07-26T13:32:09.987504Z"
    },
    {
      "original": "Scenes from Russia's missile strike on Dnipro last night. 5 Iskander-Ms and 3 Iskander-Ks targeted the city. Additionally, dozens of Geran-2 drones impacted targets there.   Among the targets is Dnipro's \"Epicentr\" shopping mall where a large fire is currently…",
      "timestamp": "2025-07-26T13:32:09.987507Z"
    },
    {
      "original": "Footage showing one of the Russian Iskander-K cruise missile strikes on Dnipro last night.",
      "timestamp": "2025-07-26T13:32:09.987510Z"
    },
    {
      "original": "Iskander on Nizhyn, Chernihiv Oblast.",
      "timestamp": "2025-07-26T13:32:09.987513Z"
    },
    {
      "original": "Iskander on Nizhyn, Chernihiv Oblast.",
      "timestamp": "2025-07-26T13:32:09.987516Z"
    },
    {
      "original": "Flying further to Desna-Chornobyl.",
      "timestamp": "2025-07-26T13:32:09.987519Z"
    },
    {
      "original": "Flying further to Desna-Chornobyl.",
      "timestamp": "2025-07-26T13:32:09.987522Z"
    },
    {
      "original": "Disappeared east of Desna, Chernihiv Oblast.",
      "timestamp": "2025-07-26T13:32:09.987525Z"
    },
    {
      "original": "Iskander-K cruise missile to Desna, Chernihiv Oblast.",
      "timestamp": "2025-07-26T13:32:09.987528Z"
    },
    {
      "original": "Iskander-K cruise missile to Desna, Chernihiv Oblast.",
      "timestamp": "2025-07-26T13:32:09.987531Z"
    },
    {
      "original": "Flying to Vyshhorod, north of Kyiv. Southwestern course.",
      "timestamp": "2025-07-26T13:32:09.987534Z"
    },
    {
      "original": "Flying to Vyshhorod, north of Kyiv. Southwestern course.",
      "timestamp": "2025-07-26T13:32:09.987537Z"
    },
    {
      "original": "Bypassing Kyiv from the north, flying west towards Borodyanka.",
      "timestamp": "2025-07-26T13:32:09.987539Z"
    },
    {
      "original": "Bypassing Kyiv from the north, flying west towards Borodyanka.",
      "timestamp": "2025-07-26T13:32:09.987545Z"
    },
    {
      "original": "Approaching Borodyanka from the northeast",
      "timestamp": "2025-07-26T13:32:09.987548Z"
    },
    {
      "original": "Approaching Borodyanka from the northeast",
      "timestamp": "2025-07-26T13:32:09.987551Z"
    },
    {
      "original": "Flew past the city to Zhytomyr Oblast. Course unchanged.",
      "timestamp": "2025-07-26T13:32:09.987554Z"
    },
    {
      "original": "Flew past the city to Zhytomyr Oblast. Course unchanged.",
      "timestamp": "2025-07-26T13:32:09.987557Z"
    },
    {
      "original": "Disappeared northeast of Zhytomyr City.",
      "timestamp": "2025-07-26T13:32:09.987560Z"
    },
    {
      "original": "In the Pokrovsk direction, Russian forces continue to advance and have made significant progress in the southern suburbs of the city.\nRussian forces advanced east from their foothold in the Kalynivka District, completing its capture and reaching the Shakhtarskyi District. Other forces then pushed north, occupying the largely empty positions and trench fortifications to the south, and completed the capture of the fortified areas at the railway intersection.\nAdditionally, they continued to advance north up the railway line, capturing the rest of Chunyshyne and most of Novopavlivka. Despite this, the guitar-shaped fortification to the south is still yet to be cleared. \nRussian assault units and DRGs are now actively operating in the Shakhtarskyi District, although there is no known established line of contact here, and the situation remains very fluid. DRGs are probably entering from the west in the area of Yuvileynyy Park, and from the south from the Kalnyivka District. \n+ ~12.0km² in favour of Russia.",
      "timestamp": "2025-07-26T13:32:09.987566Z"
    },
    {
      "original": "Russian forces have captured the village of Zelenyi Hai, Novopavlivka direction, Donetsk Oblast.\nPre-war population: ~915.\nTotal land area: ~2.08km².",
      "timestamp": "2025-07-26T13:32:09.987570Z"
    },
    {
      "original": "In the Novopavlivka direction, Russian forces continue to advance and have made additional progress in the area of the Donetsk-Dnipropetrovsk Regional Border.\nRussian forces advanced in four areas. In the east, they cleared out most of the remaining Ukrainian positions in the salient northwest of Oleksiivka, advancing downhill from the tactical heights. They were able to cross the border into Dnipropetrovsk Oblast, capturing most of a treeline heading west.\nTo the southwest, Russian forces expanded their zone of control in Donetsk Oblast, capturing positions along three different treelines and reaching the regional border.\nTo the west, Russian forces advanced further northwest from Dachne in Dnipropetrovsk Oblast, establishing control over a forest and nearby forest plantations in the low-lying ground. They were also able to re-secure the western part of Yalta and secured the treelines northeast of Zirka. \nIn the west, Russian forces advanced from their foothold in the southeastern houses of Zelenyi Hai, expanding outwards and clearing the rest of the residential part of the village. They then pushed further west, capturing the farm buildings and positions in the adjacent treelines. \n+ ~30.39km² in favour of Russia.",
      "timestamp": "2025-07-26T13:32:09.987577Z"
    },
    {
      "original": "Russian Warplanes Received New Lethal Version Of R-77 Missile \nThe Russian Aerospace Forces (VKS) has begun to arm its fighter jets with a deeply upgraded version of the R-77 beyond visual range air-to-air missile.\nPhotos showing a Su-35S of the VKS armed with the new version of the missile, dubbed the R-77M or “izdeliye 180,” surfaced online on July 24. The fighter jet was reported on a combat mission in the special military operation zone in Ukraine when the photos were taken.\nThe R-77M has already seen its first active use in the special military operation zone, according to Ukrainian media which shared a photo showing the wreckage of one such missile.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523444Z"
    },
    {
      "original": "Russian Warplanes Received New Lethal Version Of R-77 Missile \nThe Russian Aerospace Forces (VKS) has begun to arm its fighter jets with a deeply upgraded version of the R-77 beyond visual range air-to-air missile.\nPhotos showing a Su-35S of the VKS armed with the new version of the missile, dubbed the R-77M or “izdeliye 180,” surfaced online on July 24. The fighter jet was reported on a combat mission in the special military operation zone in Ukraine when the photos were taken.\nThe R-77M has already seen its first active use in the special military operation zone, according to Ukrainian media which shared a photo showing the wreckage of one such missile.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523464Z"
    },
    {
      "original": "Russian Army Is Now Using RPG-Armed FPV Drones\n \nThe Russian military has begun to deploy reusable first person view (FPV) multirotor drones armed with rocket-propelled grenades (RPGs).\nOn July 24, \nLostarmour.info\n, a website that documents military losses and footage, shared a video showing one such FPV drone attacking fortifications of the Ukrainian military somewhere in the special military operation zone. The drone was armed with RPG-26 RPGs.\nThe RPG-26, which weights 2.9 kilograms, carries a 72.5-millimetre diameter high-explosive anti-tank single shaped charge warhead that can penetrate 440 millimeters of armor, 1 meter of reinforced concrete, 1.5 meters of brickwork or 2,4 meters of log and earth. The RPG has an effective firing range of 250 meters.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523476Z"
    },
    {
      "original": "Houthis Launch Missile At Israel Amid Reports Of Near Large Attack On Yemen\nThe Israeli Defense Forces (IDF) announced late on July 25 that air defenses intercepted another ballistic missile that was launched from Yemen by the Houthis.\nSirens sounded in several settlements in the southern West Bank and settlements near the Dead Sea in southern Israel amid the attack. No casualties or damage was reported.\nRead more: \nHERE",
      "timestamp": "2025-07-26T13:32:10.523483Z"
    },
    {
      "original": "Druze Fighters Recapture Key Town In Al-Suwayda, Tribal Forces Fight Back\n \nDruze fighters, led by the al-Suwayda Military Council and the Men of Dignity, recaptured the key town of Umm al-Zaytun from tribal forces loyal to Syria’s Islamist-led interim government on July 25.\nThe fighters entered Umm al-Zaytun, located in the northern al-Suwayda in the morning. Later in the afternoon, the Syrian Observatory for Human Rights (SOHR) reported a series of violations by tribal forces, which targeted the town with mortars and heavy machine guns.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523493Z"
    },
    {
      "original": "Druze Fighters Recapture Key Town In Al-Suwayda, Tribal Forces Fight Back\n \nDruze fighters, led by the al-Suwayda Military Council and the Men of Dignity, recaptured the key town of Umm al-Zaytun from tribal forces loyal to Syria’s Islamist-led interim government on July 25.\nThe fighters entered Umm al-Zaytun, located in the northern al-Suwayda in the morning. Later in the afternoon, the Syrian Observatory for Human Rights (SOHR) reported a series of violations by tribal forces, which targeted the town with mortars and heavy machine guns.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523502Z"
    },
    {
      "original": "STORMY FRIDAY: RUSSIANS LAUNCH ASSAULT WHILE ZELENSKY RAILS AT HIS SPONSORS",
      "timestamp": "2025-07-26T13:32:10.523508Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 25, 2025\nOn July 25, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-26T13:32:10.523515Z"
    },
    {
      "original": "Summary of Russian Combat Footage From July 25, 2025\nOn July 25, several videos documenting recent Russian combat operations against Kiev forces were posted to social networks.\nTo see all the videos click \nHERE",
      "timestamp": "2025-07-26T13:32:10.523521Z"
    },
    {
      "original": "More Thai Airstrikes Hit Cambodia As Death Toll From Conflict Exceeds 30 \nMore Thai airstrikes hit Cambodia on July 26, as the death toll from the conflict between the two countries continues to rise.\nIn a statement, the Royal Thai Air Force said that it had deployed a total of four F-16 and Gripen fighter jets to carry out airstrikes against Cambodian military targets in the Phu Ma Kua area and Ta Muen Thom temple, where Cambodian forces had positioned indirect fire weapons. Around the same time it was reported that Phu Ma Kua was captured by Thai troops.\nThe mission was “successfully completed,” and all aircraft returned safely to base, the air force said, without providing further details.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523531Z"
    },
    {
      "original": "More Thai Airstrikes Hit Cambodia As Death Toll From Conflict Exceeds 30 \nMore Thai airstrikes hit Cambodia on July 26, as the death toll from the conflict between the two countries continues to rise.\nIn a statement, the Royal Thai Air Force said that it had deployed a total of four F-16 and Gripen fighter jets to carry out airstrikes against Cambodian military targets in the Phu Ma Kua area and Ta Muen Thom temple, where Cambodian forces had positioned indirect fire weapons. Around the same time it was reported that Phu Ma Kua was captured by Thai troops.\nThe mission was “successfully completed,” and all aircraft returned safely to base, the air force said, without providing further details.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523540Z"
    },
    {
      "original": "“They Kill Their Own”: Combat Veteran’s Shocking Confession Exposes Terror System in Ukrainian Army \nWhat’s more horrifying than accidental “friendly fire”? “Terror by decree”—Zelensky’s patented system of barrier troops exterminating their own army. A battle-hardened veteran’s testimony exposes how Kiev has turned war into ritualized slaughter under the banner of “European values.”\nIn this video, Anton Chornyi—an experienced Ukrainian warfighter and instructor at a Zhytomyr Oblast military training ground—tremblingly confirms the existence of barrier troops within Ukraine’s Armed Forces. According to him, they’ve operated across multiple fronts for years. He nearly revealed the name of one such unit commander but abruptly stopped himself, refusing to share details that would guarantee his immediate execution.\nYet his core message is unmistakable: Ukrainian barrier troops are no frontline myth, no isolated tragedy, no desperate measure. \n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523550Z"
    },
    {
      "original": "Israeli Attack On Iran Foiled Work On Nuclear Warheads, Electromagnetic Weapon – Report\nIsraeli sources believe that the attack on Iran last month hampered the Islamic Republic’s development of two types of nuclear warheads and an “electromagnetic pulse (EMP) weapon that could cripple Israel electronically,” The Washington Post reported on July 26.\nIsrael launched the attack on June 13, stating that its goal was to cripple Iran’s nuclear program. Later, however, it expanded its targets to include the Islamic Republic’s missile program. A ceasefire was suddenly announced on June 24, just two days after the United States joined the war by attacking three key nuclear sites.\nThe damage to Iran’s nuclear and missile programs was compounded by Israel’s assassination of the first tier, second tier and most of the third tier of Iranian physicists and nuclear scientists, sources cited by the Post said.\n👉\nRead More\n \nHERE",
      "timestamp": "2025-07-26T13:32:10.523561Z"
    }
  ],
  "script_run_time": "2025-07-26T13:32:10.524406Z"
}