{
  "messages": [
    {
      "original": "🛵\n БпЛА на півдні Дніпропетровщини \n➡️\n курсом на північ.",
      "timestamp": "2025-08-07T08:18:22.973331Z"
    },
    {
      "original": "🛵\n Кривий Ріг - загроза застосування ворогом ударних БпЛА.",
      "timestamp": "2025-08-07T08:18:22.973346Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-07T08:18:22.973351Z"
    },
    {
      "original": "🚀\nПуски керованих авіаційних бомб ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-08-07T08:18:22.973356Z"
    },
    {
      "original": "📢\n Відбій загрози застосування балістичного озброєння.",
      "timestamp": "2025-08-07T08:18:22.973360Z"
    },
    {
      "original": "⚠\n Увага! \nПовітряна тривога Одеська, Миколаївська та Херсонська області.\n👀\n Слідкуйте за нашими повідомленнями та не ігноруйте сигнали повітряної тривоги.",
      "timestamp": "2025-08-07T08:18:22.973367Z"
    },
    {
      "original": "🚀\n \n🚀\nСумщина- загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-08-07T08:18:22.973373Z"
    },
    {
      "original": "☄️\n Загроза застосування балістичного озброєння з півдня!",
      "timestamp": "2025-08-07T08:18:22.973378Z"
    },
    {
      "original": "⚡️\nЗБИТО/ПОДАВЛЕНО 89 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 7 серпня (із 22.30 6 серпня)  противник атакував 112-ма ударними БпЛА типу Shahed і безпілотниками-імітаторами різних типів із напрямків: Курськ, Приморсько-Ахтарськ – рф., Чауда, Гвардійське – ТОТ Криму.\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 09.00, протиповітряною обороною збито/подавлено 89 ворожих БпЛА типу Shahed і дронів-імітаторів різних типів на півночі, сході та в центрі країни.\nЗафіксовано влучання 23 БпЛА на 11 локаціях, а також падіння збитих (уламки) на 3 локаціях. \n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2025-08-07T08:18:22.973396Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на північно-східному та південно-східному напрямках! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2025-08-07T08:18:22.973404Z"
    },
    {
      "original": "🚀\nКАБи на Сумщину!",
      "timestamp": "2025-08-07T08:18:22.973408Z"
    },
    {
      "original": "🛸\n На півдні Миколаївщини, поблизу південного узбережжя Одещини, на півночі Запорізької та Донецької областей -  активність ворожих розвідувальних БпЛА, які можуть бути навідниками  ворожих засобів ураження! Залучено засоби для збиття.",
      "timestamp": "2025-08-07T08:18:22.973413Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі ударні БпЛА з Донеччини \n➡️\n на Дніпропетровщину!",
      "timestamp": "2025-08-07T08:18:22.973420Z"
    },
    {
      "original": "🚀\nКАБи на північ Харківщини!",
      "timestamp": "2025-08-07T08:18:22.973424Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі БпЛА з Курської обл., рф\n➡️\n на Сумщину!",
      "timestamp": "2025-08-07T08:18:22.973431Z"
    },
    {
      "original": "⚠\n Увага! \n🛵\n Ворожі ударні БпЛА з Донеччини \n➡️\n на Дніпропетровщину!",
      "timestamp": "2025-08-07T08:18:22.973438Z"
    },
    {
      "original": "🛵\n Група \"шахедів\" на південному сході Дніпропетровщини \n➡️\n курсом на Синельникове, Дніпро!",
      "timestamp": "2025-08-07T08:18:22.973444Z"
    },
    {
      "original": "⚠\n Увага! \n🛵\n Ворожі БпЛА з Курської обл., рф\n➡️\n на Сумщину!",
      "timestamp": "2025-08-07T08:18:22.973453Z"
    },
    {
      "original": "🛵\n Група \"шахедів\" на північному сході Сумщини \n➡️\n курсом на захід!",
      "timestamp": "2025-08-07T08:18:22.973459Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Ворожі БпЛА з Бєлгородської обл., рф\n➡️\n на Харківщину!",
      "timestamp": "2025-08-07T08:18:22.973466Z"
    },
    {
      "original": "🚀\nКАБи на Донеччину!",
      "timestamp": "2025-08-07T08:18:22.973470Z"
    },
    {
      "original": "⚠\n Увага!\n🛵\n Нова група \"шахедів\" з Курської обл., рф \n➡️\n на Сумщину!",
      "timestamp": "2025-08-07T08:18:22.973478Z"
    },
    {
      "original": "The villages of Orlivka and Novosil's'ke, and the surrounding area near the Romanian border in southern Odesa Oblast are currently under a massive Geran-2 drone attack.   Approximately 26 drones are involved.",
      "timestamp": "2025-08-07T08:18:23.776637Z"
    },
    {
      "original": "Scenes from southern Odesa Oblast, where 26 Geran-2 drones attacked targets in the villages of Orlivka and Novosilske. \nOne of the targets was a Gas compression station at 45.304197, 28.542373 (media 4), as seen in the second video. The first video was recorded from the Romanian side of the border. \nGeolocation credit: \nx.com/kimhvik2/status/1952858221615694097",
      "timestamp": "2025-08-07T08:18:23.776651Z"
    },
    {
      "original": "Scenes from southern Odesa Oblast, where 26 Geran-2 drones attacked targets in the villages of Orlivka and Novosilske. \nOne of the targets was a Gas compression station at 45.304197, 28.542373 (media 4), as seen in the second video. The first video was recorded from the Romanian side of the border. \nGeolocation credit: \nx.com/kimhvik2/status/1952858221615694097",
      "timestamp": "2025-08-07T08:18:23.776658Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continue to advance east of the Nitrius River and have entered the outskirts of Shandryholove. \nRussian forces advanced in two areas. In the southeast, they continued to push southwest down the forest plantations in the low-lying ground, seizing new positions there and in the forested areas. Using the cover provided, they were able to enter the outskirts of Shandryholove and captured some of the agricultural buildings there. Battles are ongoing for the other buildings, with Ukrainian forces holding their main presence in the residential part of the village.\nRussian forces also advanced to the east, capturing the rest of the gulley from Zelena Dolnya, before advancing to and clearing positions on the adjacent tactical heights.\nIn the northwest, Russian forces made additional progress down the eastern bank of the Nitrius River, advancing south to the next two forests, capturing them and two nearby treelines. \n+ ~9.13km² in favour of Russia.",
      "timestamp": "2025-08-07T08:18:23.776665Z"
    },
    {
      "original": "In the Lyman direction, Russian forces continued to advance in and around Torske, capturing key positions in multiple areas.\nIn the south, they continued to push through the northwestern part of the Serebryanskyi Forest, and managed to break into the southern part of Torske. They captured the agricultural buildings on the outskirts, and positions in the houses on and around Tsentralna and Radhospna Streets. \nIn the north, Russian forces continued to advance through the northern residential area, capturing additional positions on and around Pivnichna Street. \nThe main Ukrainian presences in Torske are in the central section and the fish-farm in the far north. The grey zone is large, with both sides regularly operating in small groups of 2-3s there with no solid line of contact. \n+ ~4.95km² in favour of Russia.",
      "timestamp": "2025-08-07T08:18:23.776671Z"
    },
    {
      "original": "In the Kostyantynivka direction, Russian forces continued to advance and completed the capture of Toretsk City. \nRussian forces advanced in two areas. In the southwest, they continued their operations to clear the village of Shcherbynivka. After they captured the southern and main part of the village, they entered the northern part and began clearing the area of the railway line. Russian forces captured most of the rest of the village, including the local school. They were also able to clear the rest of the positions in the pocket west of Shcherbynivka due to the progress inside the settlement. \nFurther east, Russian forces cleared the remaining positions in western Toretsk after the last Ukrainian soldiers withdrew from the city and captured the rest of the adjacent Toretsk Forest. \nIn the northeast, Russian forces resumed their assault operations northwest of Dyliivka, and established control over positions on four different treelines on the tactical heights.\nAdditionally, in the west, Russian soldiers managed to enter the western part of Katerynivka, although it is unclear if any positions were established. \n+ ~8.27km² in favour of Russia.",
      "timestamp": "2025-08-07T08:18:23.776678Z"
    },
    {
      "original": "Regarding the situation in the Kostyantynivka direction:\nRussian forces were able to break through from the heavily fortified terykon at the St. Matrona Mine, cut the railway line to Shcherbynivka, and come within 800 metres of cutting off all Ukrainian soldiers in the area to the south of the Kleban-Bykske reservoir. \nAll Ukrainian reinforcements to the villages of Shcherbynivka, Katerynivka and Kleban Byk are running down one road along the dam on the eastern edge of the reservoir, which the Russians are constantly targeting. This road is covered by a large trench strongpoint, which is also being constantly targeted by FPV drones and artillery. \nRussian forces are also pressuring the edges of the salient, where they have infiltrated Katerynivka, almost captured Shcherbynivka, and pushed the Ukrainians away from the northern outskirts of Toretsk. \nIf this road is cut, large numbers of Ukrainian soldiers will be encircled against the reservoir.",
      "timestamp": "2025-08-07T08:18:23.776684Z"
    },
    {
      "original": "If people haven't followed me on twitter, you should do that. I'm only 28 followers from 40k over there. \nhttps://x.com/AMK_Mapping_",
      "timestamp": "2025-08-07T08:18:23.776689Z"
    },
    {
      "original": "If people haven't followed me on twitter, you should do that. I'm only 28 followers from 40k over there.   https://x.com/AMK_Mapping_",
      "timestamp": "2025-08-07T08:18:23.776692Z"
    },
    {
      "original": "Thank you!",
      "timestamp": "2025-08-07T08:18:23.776699Z"
    },
    {
      "original": "Ukrainian channels report that Russia has likely \"postponed\" the combined missile attack that was supposed to take place on Ukraine tonight. The number of drone launches reflects that.",
      "timestamp": "2025-08-07T08:18:23.776702Z"
    },
    {
      "original": "As Steve Witkoff has arrived back in Washington from his visit to Moscow, there is an increased chance of a large-scale combined Russian missile attack on Ukraine early tomorrow morning.",
      "timestamp": "2025-08-07T08:18:23.776705Z"
    },
    {
      "original": "The video posted by Creamy Caprice is of a DRG. Even if it was a normal soldier, it wouldn't necessarily mean control over the area. Russian forces do not control Sobolivka or Moskovka, fighting is ongoing for the latter. \nThis soldier got this far because Ukraine doesn't have enough manpower here (and in many other sectors) to hold a cohesive defence, so they rely on drones - and drones miss things... constantly. \nEven if an assault detachment slipped through Ukrainian lines and gained a foothold, Russia would really struggle in bringing in supplies and reinforcements to exploit it. It's why we (mostly) don't see deep penetrations with only a few soldiers, but rather prolonged, incremental and shallow attritional movements with overall larger groups of soldiers.\nBut hey, remember, according to those \"super reliable\" Russian channels who are now proudly displaying the \"liberation\" of new areas and the beginning of the encirclement of Kupyansk, Sobolivka should have been under Russian control on July 6! \nIt's almost as if many Russian channels, including the Russian Ministry of defence (which also reported this) are propaganda outlets not trying to show the true situation on the frontline! A lot of these channels are either catering to an audience, or on a payroll. The same goes for Ukrainian propaganda outlets, except they mostly use different tactics.",
      "timestamp": "2025-08-07T08:18:23.776712Z"
    },
    {
      "original": "Here's approximately what the situation looks like:\nAround 60% of Moskovka is under Russian control. Daily incremental progress is being made. \nSobolivka is behind Moskovka, and the highway to Kupyansk and Ukraine's Oskil bridgehead is further south. I think the location of the highway is one of the reasons why Russian channels are talking about Sobolivka so much.\nAs you know, DRGs are operating in Sobolivka. This is nothing new and has been ongoing for over a month. Ukraine doesn't hold much of a presence in the village and is likely mainly in the surrounding forests or in Kupyansk. \nAs for Kupyansk itself, don't be surprised if the Russians fail to consolidate on the edge of the city centre, and the Ukrainians take back certain areas. Ukraine still controls almost all of the high-rise buildings, making Russian movement difficult. The low-rise residential areas are the easiest to clear in a city like this - you will know why if you see what the interior of these soviet-era apartment blocks look like. \nIt will be interesting to see if Russia focuses more on cutting the highway south of Sobolivka, or in the city centre of Kupyansk.",
      "timestamp": "2025-08-07T08:18:23.776718Z"
    },
    {
      "original": "Last night a massive Russian Geran-2 drone attack was carried out on Dnipro City. Approximately 36 drones attacked the city, around 30 of which impacted various targets, resulting in large fires breaking out and burning through to the morning. The drones attackedin two waves, with around 18 in each. \nAmong the targets was the Kam'yanka Aerodrome, which was likely used for long-range UAV launches. Another target was the Nizhnyodniprovsk Freight Train Yard. Both have fires visible on NASA FIRMS.",
      "timestamp": "2025-08-07T08:18:23.776722Z"
    },
    {
      "original": "Last night a massive Russian Geran-2 drone attack was carried out on Dnipro City. Approximately 36 drones attacked the city, around 30 of which impacted various targets, resulting in large fires breaking out and burning through to the morning. The drones attackedin two waves, with around 18 in each. \nAmong the targets was the Kam'yanka Aerodrome, which was likely used for long-range UAV launches. Another target was the Nizhnyodniprovsk Freight Train Yard. Both have fires visible on NASA FIRMS.",
      "timestamp": "2025-08-07T08:18:23.776726Z"
    },
    {
      "original": "Possible Storm Shadow cruise missile launches to the Kerch Bridge. UAVs and USVs attacked the bridge last night.",
      "timestamp": "2025-08-07T08:18:23.776729Z"
    },
    {
      "original": "Possible Storm Shadow cruise missile launches to the Kerch Bridge. UAVs and USVs attacked the bridge last night.",
      "timestamp": "2025-08-07T08:18:23.776733Z"
    },
    {
      "original": "Ukraine carried out a large-scale combined missile and drone attack on Crimea. As many as 12 Storm Shadow cruise missiles and at least 6 jet drones were launched. \nTwo impacts have been confirmed so far, one of which was from a storm shadow. The other may have been a jet drone. Official reports claim that \"over 9\" storm shadows were shot down over Crimea. Traffic on the Kerch Bridge was halted but is now open again.",
      "timestamp": "2025-08-07T08:18:23.776737Z"
    },
    {
      "original": "Ukraine carried out a large-scale combined missile and drone attack on Crimea. As many as 12 Storm Shadow cruise missiles and at least 6 jet drones were launched. \nTwo impacts have been confirmed so far, one of which was from a storm shadow. The other may have been a jet drone. Official reports claim that \"over 9\" storm shadows were shot down over Crimea. Traffic on the Kerch Bridge was halted but is now open again.",
      "timestamp": "2025-08-07T08:18:23.776740Z"
    }
  ],
  "script_run_time": "2025-08-07T08:18:24.431917Z"
}