{
  "messages": [
    {
      "original": "🛵\n БпЛА на сході Дніпропетровщини повз Шахтарське курсом на захід.",
      "timestamp": "2026-01-14T10:57:53.801304Z"
    },
    {
      "original": "🛵\n БпЛА курсом на Павлоград.",
      "timestamp": "2026-01-14T10:57:53.801323Z"
    },
    {
      "original": "🛵\n Група БпЛА з Чернігівщини на північ Київщини (Вишгородський район).",
      "timestamp": "2026-01-14T10:57:53.801329Z"
    },
    {
      "original": "🛵\n БпЛА з півночі курсом на Київ.",
      "timestamp": "2026-01-14T10:57:53.801333Z"
    },
    {
      "original": "🛵\n Київ - перебувайте в укриттях!",
      "timestamp": "2026-01-14T10:57:53.801338Z"
    },
    {
      "original": "⚡️\n ЗБИТО/ПОДАВЛЕНО БАЛІСТИЧНУ РАКЕТУ ТА 89 ВОРОЖИХ БПЛА\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\n➖\nУ ніч на 14 січня (з 18:30 13 січня) противник атакував 3 балістичними ракетами Іскандер-М із Ростовської та Воронезької обл. - рф та 113 ударними БпЛА типу Shahed, Гербера і безпілотниками інших типів із напрямків:  Курськ, Орел, Міллєрово, Приморсько-Ахтарськ – рф., Чауда, Гвардійське – ТОТ АР Крим, близько 70 із них – \"шахеди\".\nПовітряний напад відбивали авіація, зенітні ракетні війська, підрозділи РЕБ та безпілотних систем, мобільні вогневі групи Сил оборони України.\n💥\n За попередніми даними, станом на 08:00, протиповітряною обороною збито/подавлено одну балістичну ракету та 89 ворожих БпЛА типу Shahed, Гербера і дронів інших типів на сході та півночі країни.\nЗафіксовано влучання двох балістичних ракет та 24 ударних БпЛА на 13 локаціях, а також падіння збитих (уламки) БпЛА на трьох локаціях.\nАтака триває, в повітряному просторі декілька ворожих БпЛА. Дотримуйтесь правил безпеки!\n✊\n Тримаймо небо!\n🇺🇦\n Разом – до перемоги!",
      "timestamp": "2026-01-14T10:57:53.801358Z"
    },
    {
      "original": "🛵\n БпЛА на північному сході Житомирщини, курс - північний;\n🛵\n Чернігівщина:\n- БпЛА на північному сході в напрямку на Корюківку;\n- БпЛА з Чернігівщини курсом на північ Київщини.",
      "timestamp": "2026-01-14T10:57:53.801365Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Вишгорода з північного напрямку!",
      "timestamp": "2026-01-14T10:57:53.801370Z"
    },
    {
      "original": "🛵\n БпЛА в напрямку Вишгорода з північного напрямку!",
      "timestamp": "2026-01-14T10:57:53.801377Z"
    },
    {
      "original": "🛵\n БпЛА над Києвом! Перебувайте в укриттях!",
      "timestamp": "2026-01-14T10:57:53.801382Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА на північному сході Чернігівщини, курс південно-західний (Київщина)",
      "timestamp": "2026-01-14T10:57:53.801386Z"
    },
    {
      "original": "⚠\n Увага!\n🛫\n Активність ворожої тактичної авіації  на східному напрямку! \n🚀\nЗагроза застосування авіаційних засобів ураження для прифронтових областей!",
      "timestamp": "2026-01-14T10:57:53.801394Z"
    },
    {
      "original": "🚀\nПуски КАБ на Запоріжжі та Донеччині",
      "timestamp": "2026-01-14T10:57:53.801398Z"
    },
    {
      "original": "🛵\n Ворожий БпЛА у Нікопольському р-ні. Дніпропетровщини у напрямку Кривого Рогу",
      "timestamp": "2026-01-14T10:57:53.801403Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Кривого Рогу зі сходу.",
      "timestamp": "2026-01-14T10:57:53.801407Z"
    },
    {
      "original": "🚀\nПуски КАБ на Харківщині",
      "timestamp": "2026-01-14T10:57:53.801412Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Павлограду з півдня.",
      "timestamp": "2026-01-14T10:57:53.801416Z"
    },
    {
      "original": "🛵\n БпЛА з Чорного моря у напрямку Миколаєва.",
      "timestamp": "2026-01-14T10:57:53.801420Z"
    },
    {
      "original": "🛵\n БпЛА наближається до Кривого Рогу зі сходу.",
      "timestamp": "2026-01-14T10:57:53.801426Z"
    },
    {
      "original": "🚀\nРакетна небезпека для Запорізької області  (у т.ч. м. Запоріжжя).",
      "timestamp": "2026-01-14T10:57:53.801431Z"
    },
    {
      "original": "🛵\n БпЛА в р-ні. Сум з півночі, рухається південним курсом у напрямку Полтавщини.",
      "timestamp": "2026-01-14T10:57:53.801435Z"
    },
    {
      "original": "🛸\nРозвідувальні БпЛА в р-ні. Харкова.\n⚡\n Залучено засоби для їх збиття.",
      "timestamp": "2026-01-14T10:57:53.801441Z"
    },
    {
      "original": "In the Dobropillya direction, Ukrainian forces resumed their counterattacks in the direction of Udachne, making new progress.\nFollowing their earlier failed attempts at entering the town from the northwest, Ukrainian forces launched a new series of attacks from the west. They first advanced south down the Donetsk-Dnipropetrovsk Regional Border to the poorly consolidated Russian positions in northern Molodetske, which subsequently shifted into the grey-zone. \nThen, without consolidating, the Ukrainians infiltrated further east along the railway line and are trying to accumulate just west of Udachne. Russian FPV drone operators are attempting to cover the infiltration routes in order to limit the number of soldiers reaching the western approaches to the town. \nIn the east, Ukrainian forces counterattacked in the direction of the railway line between Kotlyne and Udachne, recapturing positions along three parallel treelines. \nMeanwhile, Russian forces continued their attacks both east and west of the Pokrovsk Coal Mine's waste dumps, while DRGs began infiltrating further northwest through the forest plantations in the direction of Serhiivka. \n+ ~1.44 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T10:57:54.394991Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.\nLaunched from a Su-57",
      "timestamp": "2026-01-14T10:57:54.395004Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, Russian forces continued their assault operations on a wide front, making new progress in four different areas.\nIn the south, following several attempts, Russian infantry managed to gain a foothold in the railway windbreaks north of Rodynske and began accumulating infantry for additional attacks through the windbreaks further west. Other forces in central Rodynske managed to infiltrate the former \"Zaporozhskaya\" Mine west of the city. Fighting also continues for central Zatyshok, where the Russians are trying to dislodge the remaining Ukrainian soldiers.\nTo the north, Russian forces managed to consolidate in two more clay mines, along with additional forested areas and treelines. Attacks are now being carried out further north, where assault groups have reached the southern outskirts of Kucheriv Yar once again. Renewed fighting is also ongoing for Ivanivka, and Russian soldiers are continuing their attacks in western Nove Shakhove.\nTo the northeast, Russian forces continued advancing north from Shakhove and captured new positions southwest of Toretske. Fighting is ongoing for a large trench fortification there. Additionally, Russian forces managed to further improve their positions in the treelines northeast of Sofiivka. \n+ ~7.55 km² in favour of Russia.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T10:57:54.395012Z"
    },
    {
      "original": "Kh-59/69 missile to Boromyla, Sumy Oblast.  Launched from a Su-57",
      "timestamp": "2026-01-14T10:57:54.395016Z"
    },
    {
      "original": "The Kh-59/69 cruise missile was shot down as it approached the Sumy-Poltava border. \nAn explosion was heard in Sumy, likely from the launch of a patriot missile which intercepted the Russian missile. \nA Russian Su-57 continues to fly in Kursk Oblast, covered by a Su-35.",
      "timestamp": "2026-01-14T10:57:54.395024Z"
    },
    {
      "original": "In addition to the strikes on the Kryvyi Rih TPP, eastern Dnipropetrovsk Oblast also came under attack.  - 2 Iskander-M ballistic missiles launched from Millerovo Airbase, Rostov Oblast, impacted an unknown target in the town of Petropavlivka [Media 2].  …",
      "timestamp": "2026-01-14T10:57:54.395028Z"
    },
    {
      "original": "Footage has been released showing last night's Russian Iskander-M ballistic missile strike on eastern Dnipropetrovsk Oblast.\n1 missile (not 2) targeted a concentration of Ukrainian manpower and vehicles near the village of Troitske, just east of Petropavlivka.",
      "timestamp": "2026-01-14T10:57:54.395032Z"
    },
    {
      "original": "For some reason, after months of constant updates, all of the so-called Pro-Ukrainian sources aren't reporting on the Dobropillya direction anymore... \n🤔\nAs I've said before, your silence and selective reporting is a betrayal to Ukraine - the country you claim to support so much.",
      "timestamp": "2026-01-14T10:57:54.395037Z"
    },
    {
      "original": "New footage shows FP-2 drones of the Ukrainian \"Kairos\" battalion of the 414th Special Operations Brigade striking rear Russian targets in Donetsk Oblast. \nThe following was hit:\n- \"Myrna\" 330 kV electrical substation in the city of Mariupol (47.185541, 37.561191) by 2 drones. 2 of the substation's transformers were damaged.\n- \"Azovska\" 220 kV electrical substation in the city of Mariupol (47.164252,37.513224) by 1 drone. 1 of the substations transformers was damaged.\n- Warehouses containing rockets and artillery shells of the Russian 51st Guards Combined Arms Army in Donetsk City (48.065319,37.851658) by 2 drones. A fire broke out, followed by secondary detonations. \nAdditionally, it is claimed that drones also struck an oil depot in the city of Makiivka.",
      "timestamp": "2026-01-14T10:57:54.395045Z"
    },
    {
      "original": "In the Kostyanytnivka direction, both sides have advanced, with Russian forces continuing to collapse Ukrainian defences southwest of Kostyantynivka.\nIn the west, Russian forces continued their attacks in the direction of Stepanivka and managed to capture the remaining positions in the forest plantations west of the village, before entering its first houses (without consolidating yet). Russian attacks also continued from the treelines to the south. \nTo the southeast, Russian forces continued advancing east along the highway, capturing new positions in the treelines there and operationally encircling Ukrainian formations in their strongpoints to the south. Other assault groups are now clearing out the pocket, capturing strongpoints in the forests.\nMeanwhile, Russian forces continued infiltrating in small groups through the forests and into the village of Illinivka. Ukrainian drone operators continue attempts at fully eliminating the Russian groupings there, however the total number of Russian soldiers recorded in the village is growing. \nTo the east, Russian forces consolidated in additional positions in the forests on the northern bank of the Kleban-Byksky reservoir, and managed to enter the agricultural buildings on the southern outskirts of Beretok. On the other hand, the Ukrainians are continuing their incremental withdrawal from their last positions in the forests north of the reservoir due to the risk of encirclement.\nTo the northeast, Russian forces continued to advance in Kostyantynivka, and began bypassing the railway station from the north, capturing positions in the residential streets across the highway. However, more recently, they have begun struggling with supplies due to increased Ukrainian FPV drone strikes on the area between the city and Oleksandro-Shultyne. \nMeanwhile, at some point recently, Ukrainian forces managed to clear the Hora District of northeastern Kostyantynivka from Russian DRGs, as well as the adjacent forests, where they are now trying to accumulate. Additionally, the Ukrainians infiltrated across the fields south of the highway and recaptured the western and central parts of Predtechyne again. They also improved their positions in the forests just north of the highway.\nRussian forces are now trying to counterattack in Predtechyne, and continue their attempts at consolidating in the eastern part of the forests north of the highway. DRGs are also infiltrating further west through the treelines, where they were able to reach the village of Novodmytrivka. This has resulted in some of the Ukrainian formations in the salient west of Chasiv Yar withdrawing further west. \n+ ~5.24 km² in favour of Russia.\n+ ~3.97 km² in favour of Ukraine.\nInteractive map link: \nhttps://www.google.com/maps/d/u/1/edit?hl=en&mid=1thW9kqnDOaS2lAepLhLdzSX8Ur9Sc4k&ll",
      "timestamp": "2026-01-14T10:57:54.395056Z"
    },
    {
      "original": "Russian forces have captured the village of Bondarne, Rai-Oleksandrivka direction, Donetsk Oblast.\nPre-war population: ~43.\nTotal land area: ~0.89 km².\nThe fighting for Bondarne lasted approximately 20 days.",
      "timestamp": "2026-01-14T10:57:54.395062Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]:\nAfter the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA (& TSK support) to the Tishrin and Deir Hafer fronts, as well as to Raqqa, on the Ma'dan-Ghanem Ali axis. Consequently, the SDF has also sent reinforcements to these fronts in anticipation of a large-scale confrontation that will end any attempt at diplomacy in Syria and mark the beginning of a new violent phase of the civil war.",
      "timestamp": "2026-01-14T10:57:54.395066Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]:\nAfter the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA (& TSK support) to the Tishrin and Deir Hafer fronts, as well as to Raqqa, on the Ma'dan-Ghanem Ali axis. Consequently, the SDF has also sent reinforcements to these fronts in anticipation of a large-scale confrontation that will end any attempt at diplomacy in Syria and mark the beginning of a new violent phase of the civil war.",
      "timestamp": "2026-01-14T10:57:54.395070Z"
    },
    {
      "original": "Situation on Aleppo [13/1/2026]: After the victory in Aleppo, the STG took advantage of the momentum gained with Turkish-American diplomatic support to prepare for an offensive in the east of Aleppo governorate, sending reinforcements together with the SNA…",
      "timestamp": "2026-01-14T10:57:54.395074Z"
    },
    {
      "original": "Any integration of the SDF into the STG seems extremely unlikely anymore, although I doubt Turkey would've allowed it anyway.",
      "timestamp": "2026-01-14T10:57:54.395077Z"
    },
    {
      "original": "Happy new year everyone!  Best of luck to you all for 2026.",
      "timestamp": "2026-01-14T10:57:54.395080Z"
    },
    {
      "original": "Well, the first two weeks of 2026 have been very eventful.\n- The U.S. bombs Venezuela and kidnaps Maduro.\n- The Southern Transitional Council in Yemen capitulates after a lightning offensive by the PLC.\n- Russia strikes Lviv with an Oreshnik IRBM.\n- Aleppo finally falls to the new Syrian government.\n- Mass protests in Iran.\n- Trump expressing his wish to annex Greenland again.\nIt's gonna be a busy year...",
      "timestamp": "2026-01-14T10:57:54.395088Z"
    },
    {
      "original": "Russian Geran-3 jet-drones are currently attacking the Kyiv Hydroelectric Power Plant. Explosions are heard.",
      "timestamp": "2026-01-14T10:57:54.395091Z"
    },
    {
      "original": "Another Geran-3 is approaching the CHP-5 power plant in Kyiv.",
      "timestamp": "2026-01-14T10:57:54.395096Z"
    },
    {
      "original": "Another Geran-3 is approaching the CHP-5 power plant in Kyiv.",
      "timestamp": "2026-01-14T10:57:54.395099Z"
    },
    {
      "original": "It flew further east, away from the power plant in the direction of Boryspil.",
      "timestamp": "2026-01-14T10:57:54.395102Z"
    },
    {
      "original": "The drone turned back to Kyiv and was subsequently shot down over the southern outskirts of the city. \nMultiple more Geran-3 jet-powered drones seem to be flying to Kyiv from Chernihiv Oblast.",
      "timestamp": "2026-01-14T10:57:54.395106Z"
    },
    {
      "original": "Military Situation In Ukraine On January 13, 2026 (Maps Update)",
      "timestamp": "2026-01-14T10:57:55.063084Z"
    },
    {
      "original": "Military Situation In Ukraine On January 13, 2026 (Maps Update)",
      "timestamp": "2026-01-14T10:57:55.063094Z"
    },
    {
      "original": "Trump Inflames Violence In Iran With Call For Protestors To ‘Take Over’ Government Institutions \nUnited States President Donald Trump on January 13 told protesters in Iran that “help is on its way” and urged them to keep protesting, as violence in the Islamic Republic reaches a new peak with reports of thousands of casualties.\n“Iranian Patriots, KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!! Save the names of the killers and abusers. They will pay a big price,” Trump wrote on his Truth Social platform, in what amounts to a call on the protesters to oust the government.\nIn its latest report, the U.S. -based Human Rights Activists News Agency said that at least 1,850 people have been killed and at least 16,784 have been arrested so far. However, an Iranian official told Reuters earlier in the day that around 2,000 people were killed.\nAn even higher estimate was attributed to the Israeli Mossad agency, which reportedly informed the U.S. that 5,000 people have been killed.\nRead more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063106Z"
    },
    {
      "original": "Trump Inflames Violence In Iran With Call For Protestors To ‘Take Over’ Government Institutions \nUnited States President Donald Trump on January 13 told protesters in Iran that “help is on its way” and urged them to keep protesting, as violence in the Islamic Republic reaches a new peak with reports of thousands of casualties.\n“Iranian Patriots, KEEP PROTESTING – TAKE OVER YOUR INSTITUTIONS!!! Save the names of the killers and abusers. They will pay a big price,” Trump wrote on his Truth Social platform, in what amounts to a call on the protesters to oust the government.\nIn its latest report, the U.S. -based Human Rights Activists News Agency said that at least 1,850 people have been killed and at least 16,784 have been arrested so far. However, an Iranian official told Reuters earlier in the day that around 2,000 people were killed.\nAn even higher estimate was attributed to the Israeli Mossad agency, which reportedly informed the U.S. that 5,000 people have been killed.\nRead more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063115Z"
    },
    {
      "original": "PARALYZING THE GRID: RUSSIA'S SUSTAINED ASSAULT ON UKRAINE'S ENERGY SYSTEM",
      "timestamp": "2026-01-14T10:57:55.063119Z"
    },
    {
      "original": "Sumy Front: Russian Army Advances Towards Khoten As Ukraine Fortifies Nearby Areas \nIn the Sumy sector, units are advancing tactically on the Kondrativka–Yunkivka section. They are consolidating their positions in tree lines and creating conditions for potential movement towards Khoten and Pisarivka. In the Kharkiv sector, near Staritsa, there has been an expansion of control in forested areas and an advance towards the Hrafskyi and Symonivka settlements.\nMeanwhile, fierce clashes continue in the Volchanskie Khutora area. In the Zaporizhzhia sector, the offensive is advancing on the Orikhiv and Huliaipole fronts. Bilohiria and part of Mala Tokmachka are now under control, and fighting continues on the approaches to Prymorske and Veselianka.\nIn the Druzhkivka sector, assault groups are advancing towards Novopavlivka and Raiske. Simultaneously, battles are occurring for the southern part of Toretske and the surrounding hills.\nRead more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063127Z"
    },
    {
      "original": "Sumy Front: Russian Army Advances Towards Khoten As Ukraine Fortifies Nearby Areas \nIn the Sumy sector, units are advancing tactically on the Kondrativka–Yunkivka section. They are consolidating their positions in tree lines and creating conditions for potential movement towards Khoten and Pisarivka. In the Kharkiv sector, near Staritsa, there has been an expansion of control in forested areas and an advance towards the Hrafskyi and Symonivka settlements.\nMeanwhile, fierce clashes continue in the Volchanskie Khutora area. In the Zaporizhzhia sector, the offensive is advancing on the Orikhiv and Huliaipole fronts. Bilohiria and part of Mala Tokmachka are now under control, and fighting continues on the approaches to Prymorske and Veselianka.\nIn the Druzhkivka sector, assault groups are advancing towards Novopavlivka and Raiske. Simultaneously, battles are occurring for the southern part of Toretske and the surrounding hills.\nRead more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063136Z"
    },
    {
      "original": "Night of Escalation: Massive Russian Strike on Ukraine's Power Grid and Attacks on Tankers in the Black Sea\nOn the night of January 13, 2026, the Russian armed forces launched a large-scale, integrated strike against Ukraine's energy, logistics, and transportation infrastructure. This attack, the first of its kind in 17 days, marked a return to intense strikes after a pause comparable to the lull in August 2025. According to data from the Ukrainian Air Force, the attack employed 293 attack unmanned aerial vehicles, 18 ballistic missiles, and 7 cruise missiles from Iskander operational-tactical systems.\nThe strikes targeted power generation, ultra-high voltage main substations, railway infrastructure, and dual-use logistics hubs, affecting key regions and undermining the stability of rear-area systems and supply chains for the Armed Forces of Ukraine (AFU).\nIn the Kyiv region, the Trypilska Thermal Power Plant—a crucial energy source for the capital and central region...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063145Z"
    },
    {
      "original": "Night of Escalation: Massive Russian Strike on Ukraine's Power Grid and Attacks on Tankers in the Black Sea\nOn the night of January 13, 2026, the Russian armed forces launched a large-scale, integrated strike against Ukraine's energy, logistics, and transportation infrastructure. This attack, the first of its kind in 17 days, marked a return to intense strikes after a pause comparable to the lull in August 2025. According to data from the Ukrainian Air Force, the attack employed 293 attack unmanned aerial vehicles, 18 ballistic missiles, and 7 cruise missiles from Iskander operational-tactical systems.\nThe strikes targeted power generation, ultra-high voltage main substations, railway infrastructure, and dual-use logistics hubs, affecting key regions and undermining the stability of rear-area systems and supply chains for the Armed Forces of Ukraine (AFU).\nIn the Kyiv region, the Trypilska Thermal Power Plant—a crucial energy source for the capital and central region...\n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063154Z"
    },
    {
      "original": "Iskander Strike: Ships And Radars Hit: Summary Of Russian Combat Footage From January 13, 2026 \nOn January 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-14T10:57:55.063161Z"
    },
    {
      "original": "Iskander Strike: Ships And Radars Hit: Summary Of Russian Combat Footage From January 13, 2026 \nOn January 13, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2026-01-14T10:57:55.063168Z"
    },
    {
      "original": "Former Dutch Mercenary In Ukraine Reveals Kiev's Crimes\nWhile the Western media strives to prevent the crimes committed by the Ukrainian troops from becoming known to public opinion, the mercenaries themselves who join Kiev in the war are shocked by the reality they find on the front lines. Recently, a European veteran of the Ukrainian army told journalists what he saw in the ranks of Kiev, revealing details about the behavior of the regime's soldiers.\nA former Dutch mercenary who fought for Kiev told journalists during a recent interview that Ukrainian troops are full of all types of criminals, including neo-Nazi militants and drug traffickers - including members of foreign cartels. He said that the use of illicit substances and practices of corruption and theft are common activities among soldiers, as there are no ethical or moral guidelines regulating the behavior of troops. The Dutch soldier used the pseudonym Hendrik, omitting his true identity for security reasons.  \n👉\n Read more \nHERE",
      "timestamp": "2026-01-14T10:57:55.063176Z"
    }
  ],
  "script_run_time": "2026-01-14T10:57:55.063740Z"
}