{
  "messages": [
    {
      "original": "🛵\n БпЛА з Донеччини на Дніпропетровщину.",
      "timestamp": "2025-10-13T16:24:28.321433Z"
    },
    {
      "original": "Швидкісна ціль на Харківщину з півночі!",
      "timestamp": "2025-10-13T16:24:28.321445Z"
    },
    {
      "original": "🚀\n \n🚀\nХарківська область (схід) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-13T16:24:28.321452Z"
    },
    {
      "original": "🛵\n Група ударних БпЛА на кордоні Донецької та Дніпропетровської областей.",
      "timestamp": "2025-10-13T16:24:28.321457Z"
    },
    {
      "original": "🚀\n \n🚀\nХарківська область (схід) - загроза застосування авіаційних засобів ураження!",
      "timestamp": "2025-10-13T16:24:28.321466Z"
    },
    {
      "original": "Пуски КАБів",
      "timestamp": "2025-10-13T16:24:28.321469Z"
    },
    {
      "original": "🛵\n Чернігівщина (Крюківський р-н) - загроза застосування ударних БпЛА",
      "timestamp": "2025-10-13T16:24:28.321473Z"
    },
    {
      "original": "🚀\n \n🚀\n Фіксується активність ворожої тактичної авіації на східному напрямку (Донеччина). Імовірне застосування авіаційних засобів ураження",
      "timestamp": "2025-10-13T16:24:28.321479Z"
    },
    {
      "original": "🚀\n \n🚀\n Фіксується активність ворожої тактичної авіації на східному напрямку (Донеччина). Імовірне застосування авіаційних засобів ураження",
      "timestamp": "2025-10-13T16:24:28.321485Z"
    },
    {
      "original": "Пуски КАБів",
      "timestamp": "2025-10-13T16:24:28.321488Z"
    },
    {
      "original": "🛵\n Декілька ворожих БпЛА західніше Чернігова",
      "timestamp": "2025-10-13T16:24:28.321492Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА у Лозівському районі Харківщини",
      "timestamp": "2025-10-13T16:24:28.321498Z"
    },
    {
      "original": "Пуски КАБів по Донеччині",
      "timestamp": "2025-10-13T16:24:28.321501Z"
    },
    {
      "original": "🚀\n Пуски КАБів у напрямку Сумщини",
      "timestamp": "2025-10-13T16:24:28.321508Z"
    },
    {
      "original": "🚀\n🛵\n Повторні пуски КАБів на Сумщину. Імовірні пуски шахедів з району Курська.",
      "timestamp": "2025-10-13T16:24:28.321513Z"
    },
    {
      "original": "🛵\n Ворожі БпЛА в районі Павлограда на Дніпропетровщині",
      "timestamp": "2025-10-13T16:24:28.321517Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Донеччину.",
      "timestamp": "2025-10-13T16:24:28.321521Z"
    },
    {
      "original": "🛵\n Група БпЛА на Чернігівщині в районі Ніжина.\n🛵\n БпЛА з Сумщини на Полтавщину.\n🛸\n Розвідувальний БпЛА на півночі Харківщини курсом на Харків.",
      "timestamp": "2025-10-13T16:24:28.321529Z"
    },
    {
      "original": "🛵\n Полтава - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T16:24:28.321533Z"
    },
    {
      "original": "🛵\n Харків - БпЛА з півночі у напрямку міста!",
      "timestamp": "2025-10-13T16:24:28.321537Z"
    },
    {
      "original": "🚀\nПуски КАБ ворожою тактичною авіацією на Запорізьку область.",
      "timestamp": "2025-10-13T16:24:28.321541Z"
    },
    {
      "original": "🛵\n Група БпЛА на сході Дніпропетровщини курсом на Павлоград.",
      "timestamp": "2025-10-13T16:24:28.321545Z"
    },
    {
      "original": "⚡️\n🇵🇸\n Hamas told Reuters that they killed 32 \"gang\" members and arrested 24 in Gaza City after the ceasefire, with six Hamas personnel also killed. \nTrump approved limited Hamas internal security measures.\n@wfwitness",
      "timestamp": "2025-10-13T16:24:28.924664Z"
    },
    {
      "original": "General overview and analysis of the Pokrovsk direction:\nI have numbered the different sub-sectors on the map to correspond with this post. The green lines represent the usable supply routes into Pokrovsk. \n1. Russian forces continue consolidating in the agricultural buildings on the northern outskirts of Udachne after it moved out of the grey zone. They are also attempting to consolidate and expand their zone of control in the eastern buildings of the Pokrovsk Coal Mine, however Ukrainian FPV drone strikes are impeding any progress. \n2. Russian forces continue to slowly advance in Kotlyne, and have managed to complete the capture of the village after securing the rest of the houses in the grey zone, as well as the small farm to the north. The overall goal in this sector is to capture the Pokrovsk Mine, secure the surroundings of Kotlyne, and begin attacks towards the Serhiivka area in order to bring the E-50 highway to Pokrovsk under fire control.\n3. Russian forces continue infiltration attempts in the Durniak and Pervomaika Districts in western Pokrovsk, with the grey zone now extending for more than 800 metres. Both sides are actively using FPV drones against each other to prevent infantry from accumulating. \n4. Russian soldiers continue to enter the Lazurnyi District of southern Pokrovsk and accumulate in the basements of high-rise buildings. From there, they move further north into the neighbouring Pivdennyi, Shakhtarskyi, and Soniachnyi Districts, but have been unsuccessful in gaining a foothold. Small Ukrainian assault groups constantly move in and clear out Russian soldiers from the basements of high-rise buildings, while the Russians do the same to the Ukrainians, resulting in a large grey zone forming with no coherent line of contact. However, the Russians were able to secure the northern part of the Lazurnyi District, where consolidation is now ongoing. \n5. After capturing Chunyshyne, Russian forces continued advancing north through the windbreaks on either side of the railway tracks, but are being caught in a kill-zone controlled by the air from Ukrainian FPV drones. Nevertheless, some Russian soldiers have managed to reach the western edge of Novopavlivka, although no consolidation has occurred yet. \n6. Russian forces continue attempts at infiltrating the village of Balahan from the forests to the east after the first attacks were repelled. So far, no advances have been confirmed, as some of the more effective Ukrainian units are stationed in Myrnohrad and the surrounding areas, compared to in much of Pokrovsk where there is no cohesive defence on the ground. However, Russia is accumulating large amounts of infantry in the Mykolaivka area in preparation for future attacks towards and into eastern Myrnohrad.\n7. Russian forces advanced into the treelines and fortifications directly north of Myrnohrad, however no consolidation has occurred yet, likely due to the lack of control over the mine area and the difficult situation further west. Russia is also accumulating large forces in the Novoekonomichne area in preparation for attempts to clear the grey zone and break into northeastern Myrnohrad. \n8. Following the end of the fierce battles for the pig farms and surrounding positions south of Rodynske, over the past 5 days Ukrainian forces have launched a series of counterattacks on the Russian flanks. They advanced from the city of Rodynske, back into western Chervonyi Lyman, where they were able to secure the western houses of the village. Fighting is ongoing for the central part. Other forces are attempting to clear the treelines south of the settlement, where a grey zone has now formed. Meanwhile, further north, Ukrainian forces are continuing their attempts at re-entering Sukhetske, but have been unsuccessful so far. \nOverall, the situation remains very difficult and complicated for the Ukrainians. A severe lack of manpower and important positions being lost west of Pokrovsk points towards a worsening situation down the line, which could involve one of the last remaining roads into the city being bro",
      "timestamp": "2025-10-13T16:24:28.924681Z"
    },
    {
      "original": "The President of Madagascar, Andry Rajoelina, has reportedly fled the country after boarding a French military aircraft. \nEarlier, much of the country's military - including the CAPSAT unit - defected in support of ongoing protests sparked by poor access to electricity and water. CAPSAT has since stated that they will assume control over all branches of the military.",
      "timestamp": "2025-10-13T16:24:28.924686Z"
    },
    {
      "original": "The President of Madagascar, Andry Rajoelina, has reportedly fled the country after boarding a French military aircraft. \nEarlier, much of the country's military - including the CAPSAT unit - defected in support of ongoing protests sparked by poor access to electricity and water. CAPSAT has since stated that they will assume control over all branches of the military.",
      "timestamp": "2025-10-13T16:24:28.924690Z"
    },
    {
      "original": "Footage showing a Russian Iskander-M ballistic missile strike on a Ukrainian HIMARS system. \nA reconnaissance drone tracked its movement back to its storage location, which then sent the coordinates to an OTRK installation to launch the Isknander.",
      "timestamp": "2025-10-13T16:24:28.924695Z"
    },
    {
      "original": "Dobropillya Front according to each mapper: Mine, Suriyak, Radov, AMK, Playfra, Hudson, Kalibrated, DeepState, LostArmour, Divgen",
      "timestamp": "2025-10-13T16:24:28.924699Z"
    },
    {
      "original": "Dobropillya Front according to each mapper: Mine, Suriyak, Radov, AMK, Playfra, Hudson, Kalibrated, DeepState, LostArmour, Divgen",
      "timestamp": "2025-10-13T16:24:28.924702Z"
    },
    {
      "original": "Some of these maps are a little outdated, but its interesting nonetheless.",
      "timestamp": "2025-10-13T16:24:28.924705Z"
    },
    {
      "original": "In the Stepnohirsk direction, Ukrainian forces have launched a series of counterattacks aimed at reversing the Russian progress over the past few months.\nIn the west, Ukrainian forces pushed through the grey zone in Prymorske, recapturing positions in the southern dachas towards the dried-up inlet. Other forces cleared isolated pockets of Russian soldiers in the dachas around Pokrovska Street, moving southeast through the streets near the railway line, and capturing the Prymorske railway station.\nTo the east, Ukrainian forces cleared the remaining Russian positions on the western outskirts of Stepnohirsk, in the dachas, and in nearby the forested areas, reaching the northern bank of the small river. Other forces were able to cross the river over the E-150 Highway, and capture positions on the southern bank around the overpass. \nMeanwhile, Russian forces continued their attempts at infiltrating southern Stepnohirsk from the 3rd Microdistrict, however Ukrainian drone coverage is preventing them from consolidating. The grey zone remains. \n+ ~1.67 km² in favour of Ukraine.",
      "timestamp": "2025-10-13T16:24:28.924712Z"
    },
    {
      "original": "In the Stepnohirsk direction, Ukrainian forces have launched a series of counterattacks aimed at reversing the Russian progress over the past few months.  In the west, Ukrainian forces pushed through the grey zone in Prymorske, recapturing positions in the…",
      "timestamp": "2025-10-13T16:24:28.924716Z"
    },
    {
      "original": "Regarding Zelensky's claim of \"counteroffensive\" actions in western Zaporizhzhia Oblast.\nIn the post above, I talked about confirmed Ukrainian advances in Stepnohirsk and Prymorske, however the claims of Ukrainian advances extend to Stepove, Mali Shcherbaky, and Shcherbaky. \nUkrainian forces were able to enter Mali Shcherbaky and raise a flag in the western part of the village, however no consolidation has taken place, and Russian forces are attempting to clear them out of this grey zone. \nAs for Stepove and Shcherbaky, there is no evidence of Ukrainian advances being made. Neither of these two villages were under full Russian control, so advances would theoretically be easier.",
      "timestamp": "2025-10-13T16:24:28.924721Z"
    },
    {
      "original": "In the Dobropillya direction, Russian forces continued to advance and have once again recaptured the village of Dorozhnje.\nFollowing the failed Ukrainian Bradely AFV attack on Russian positions east of Doroznje, Russian forces counterattacked from the forests west of Nykanorivka, crossing over the fields into the Doroznje Freight Train Station. The village was once again brought under full Russian control, with Russian forces consolidating in the treeline to the north, and railway windbreaks to the south. \nMeanwhile, the frontline was corrected in favour of Ukraine to the south, with Ukrainian forces retaining control over the treeline south of Dorozhnje. The grey zone extends as far as the southwestern outskirts of Nykanorivka. \nRussia is also accumulating new groups of soldiers in the Hektova Balka Gulley north of Nykanorivka in preparation for assault operations on the village of Ivanivka. \n+ ~1.57 km² in favour of Russia.",
      "timestamp": "2025-10-13T16:24:28.924727Z"
    },
    {
      "original": "In the Dobropillya and Druzhkivka directions, both Russian and Ukrainian forces have advanced, each reversing the other's progress in different areas.\nIn the west, Russian forces consolidated in the northern part of Kucheriv Yar, and begun attacks outside the village. They were able to advance into the forested areas to the north, and the treelines to the northwest, taking up new positions there. DRGs also began infiltrating north up the road and have reached the southern outskirts of Zolotyi Kolodyaz. Other forces began advancing up the gulley in the direction of Hruzke, while the Ukrainians attempt to gain a foothold in the positions to the rear. \nTo the south, Russian forces advanced downhill from the tactical heights into the forested areas, improving their positions in the direction of Shakhove. Other forces continued their attacks towards the western outskirts of Shakhove, but continue to be repelled by the Ukrainian garrison. \nAdditionally, to the west, the frontline was corrected, with Vilne now being in the grey zone. Last week, some Russian soldiers were able to enter part of the village but were unable to consolidate. The village was not brought under control, unlike what I previously stated. However, Russian forces are attempting to advance from the treelines to the southwest in the direction of Vilne, but it is unclear if they have had any successes. \nOn the other hand, Ukrainian forces continued their counterattacks in the Druzhkivka direction and have eliminated the Russian spearhead to Sofiivka. They were able to clear the northern and northeastern outskirts of the village, and began advancing west down a treeline, while other forces pushed south down the treelines to the north. Once these positions were recaptured, the Ukrainians began attacking towards the groves to the southeast, infiltrating towards the Russian positions along the western bank of the reservoir. Russian FAB/KAB glide-bombs are targeting these areas, but the majority of them miss the positions (by up to 250 metres) and fall in the fields. \nTo the south, Russian forces are also continuing their attacks under artillery and FPV drone cover through the gulley towards the Ukrainian strongpoints, but their advance is being impeded by Ukrainian FPV drone strikes. They have been unable to make any progress here for some time now. \n+ ~5.15 km² in favour of Ukraine.\n+ ~5.12 km² in favour of Russia.",
      "timestamp": "2025-10-13T16:24:28.924735Z"
    },
    {
      "original": "Artillery Strikes: Summary Of Russian Combat Footage From October 12, 2025\nOn October 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-13T16:24:29.533739Z"
    },
    {
      "original": "Artillery Strikes: Summary Of Russian Combat Footage From October 12, 2025\nOn October 12, several videos documenting some of the Russian military’s recent operations against Kiev forces surfaced online.\nTo see all the videos click \nHERE",
      "timestamp": "2025-10-13T16:24:29.533750Z"
    },
    {
      "original": "Tactical Encirclement: Ukrainian Units Isolated Near Myroliubivka As Russian Pressure Mounts\nRussian forces have captured the settlements of Balagan and Moskovske on the Pokrovsk axis. Russian units are advancing towards the center of Poltavka in the Zaporizhzhia region.\nA former UK prime minister has been implicated in receiving payments from a defense industry representative.\nRead more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533758Z"
    },
    {
      "original": "Tactical Encirclement: Ukrainian Units Isolated Near Myroliubivka As Russian Pressure Mounts\nRussian forces have captured the settlements of Balagan and Moskovske on the Pokrovsk axis. Russian units are advancing towards the center of Poltavka in the Zaporizhzhia region.\nA former UK prime minister has been implicated in receiving payments from a defense industry representative.\nRead more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533766Z"
    },
    {
      "original": "Trump Pledges To Solve Pakistani-Afghan Crisis After Deadly Border Clashes \nDozens of Pakistani and Afghan troops were killed in border clashes that took place on October 11 and 12, bringing the two countries close to war.\nThe escalation began on October 9, when Afghanistan accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nIslamabad had before demanded the Taliban to take action against the TTP who have stepped up attacks in Pakistan, saying they operate from havens in Afghanistan. Kabul, from its side, denied that the group is active on its soil.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533775Z"
    },
    {
      "original": "Trump Pledges To Solve Pakistani-Afghan Crisis After Deadly Border Clashes \nDozens of Pakistani and Afghan troops were killed in border clashes that took place on October 11 and 12, bringing the two countries close to war.\nThe escalation began on October 9, when Afghanistan accused Pakistan of launching strikes against the capital, Kabul, and a market in the province of Paktika. The strikes reportedly targeted senior members of the Tehrik-e-Taliban Pakistan (TTP), which is more commonly known as the Pakistani Taliban, including the group’s leader Noor Wali Mehsud.\nIslamabad had before demanded the Taliban to take action against the TTP who have stepped up attacks in Pakistan, saying they operate from havens in Afghanistan. Kabul, from its side, denied that the group is active on its soil.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533783Z"
    },
    {
      "original": "North Korean Troops Who Fought In Russia’s Kursk Marched In Pyongyang Parade \nNorth Korean troops who participated in the battle against Kiev forces in Russia’s Kursk marched on October 10 at Kim Il-sung Square in Pyongyang in a large parade meant to mark the 80th-anniversary of the founding of the Workers’ Party of Korea.\nThe battle of Kursk broke out in August of last year, when Kiev forces, backed by foreign mercenaries, infiltrated the region.\nWith the support of thousands of North Korean troops, the Russian military liberated Kursk in a major counterattack last March.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533792Z"
    },
    {
      "original": "North Korean Troops Who Fought In Russia’s Kursk Marched In Pyongyang Parade \nNorth Korean troops who participated in the battle against Kiev forces in Russia’s Kursk marched on October 10 at Kim Il-sung Square in Pyongyang in a large parade meant to mark the 80th-anniversary of the founding of the Workers’ Party of Korea.\nThe battle of Kursk broke out in August of last year, when Kiev forces, backed by foreign mercenaries, infiltrated the region.\nWith the support of thousands of North Korean troops, the Russian military liberated Kursk in a major counterattack last March.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533800Z"
    },
    {
      "original": "Russian Army Took Out Ukraine’s Latest ‘VAMPIRE’ Air Defense System With Lancet Drone\nRussia’s Rubikon advanced unmanned technology center published on October 13 video footage showing, for the first time, the destruction of an American-made Vehicle-Agnostic Modular Palletized ISR Rocket Equipment (VAMPIRE) short-range air defense system of Kiev forces.\nThe system was targeted with a Lancet loitering munition, according to the center, which said that the strike took part some 47 kilometers behind the frontline in the Sumy direction, without elaborating.\nThe VAMPIRE was developed by L3Harris Technologies mainly to counter drones. The system consists of an electro-optical targeting system, typically a Canadian-made WESCAM MX-10D, and a four-barreled Advanced Precision Kill Weapon System (APKWS) rocket launcher that can be mounted on trucks.\n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533819Z"
    },
    {
      "original": "Military Situation In Israel-Palestine On October 13, 2025 (Map Update)",
      "timestamp": "2025-10-13T16:24:29.533823Z"
    },
    {
      "original": "Ukraine's Cyber Front: Can Digital Defense Halt a Conventional Advance?\nThis is a new, advanced branch of the Ukrainian army. Kyiv intends to launch an offensive against Russian infrastructure. What are Zelensky's realistic chances of implementing his plans?\nWar has long been waged on land, at sea and in the air. Now, invisible battles are being fought on the fields of the World Wide Web. The concept adhered to by the world's leading powers is simple: it is pointless to bomb a target factory for months on end, wasting energy, time and, most importantly, expensive ammunition. It is possible to paralyse the desired target with the help of hackers via the internet, completely depriving it of its ability to function.\nIn recent months, there have been large-scale disruptions at major European airports, such as Heathrow in the UK, Berlin-Brandenburg in Germany, and Zaventem in Belgium. These flight delays and cancellations have cost the European Union millions of dollars. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533832Z"
    },
    {
      "original": "Ukraine's Cyber Front: Can Digital Defense Halt a Conventional Advance?\nThis is a new, advanced branch of the Ukrainian army. Kyiv intends to launch an offensive against Russian infrastructure. What are Zelensky's realistic chances of implementing his plans?\nWar has long been waged on land, at sea and in the air. Now, invisible battles are being fought on the fields of the World Wide Web. The concept adhered to by the world's leading powers is simple: it is pointless to bomb a target factory for months on end, wasting energy, time and, most importantly, expensive ammunition. It is possible to paralyse the desired target with the help of hackers via the internet, completely depriving it of its ability to function.\nIn recent months, there have been large-scale disruptions at major European airports, such as Heathrow in the UK, Berlin-Brandenburg in Germany, and Zaventem in Belgium. These flight delays and cancellations have cost the European Union millions of dollars. \n👉\n Read more \nHERE",
      "timestamp": "2025-10-13T16:24:29.533841Z"
    }
  ],
  "script_run_time": "2025-10-13T16:24:29.534303Z"
}